{"by":"Robin_Message","id":12046004,"parent":12016568,"text":"Firefly Learning | Front and backend developers and a Manager | London UK | ONSITE, freelance developers considered<p>Firefly Learning is an award-winning EdTech company that works to bring teachers, parents and students together, enabling greater collaboration, intuitive workflows and rich resource creation, while saving teachers time. We’re used by hundreds of leading schools globally, including 8 of the top 10 UK Independents.<p>In developers, we&#x27;re looking for four main strengths:<p>◦ skill: your colleagues would say you get things done to a high standard.<p>◦ desire to learn: despite (or perhaps because of) you being good at what you do, you want to get better.<p>◦ understanding: our product team is great but not infallible. You’ll be happy to challenge and clarify product decisions with our users’ best interests at heart.<p>◦ clear communication: We have a lightweight process, so most days, other than a morning standup meeting to share what’s going on and what’s planned, you’ll be responsible for your time.<p>In a manager, we&#x27;re looking for someone with experience of the above, as well as:<p>◦ experience and skill in training, developing and strengthening a team.<p>◦ hiring expertise: you know how identify what skills the team needs, and how to find and close candidates with those skills.<p>◦ balancing conflicting priorities: for example, we want a product that is well engineered but not over-engineered.<p>In terms of experience, we need you to be comfortable with a web platform. Our server-side code is written in C# and our web front end has some Javascript, so you’ll need to know these or be able to pick them up.<p>We work as generalists, so experience of any of the following would be a positive: React, iOS, shell scripting, infrastructure automation, building API integrations, and databases (particularly SQL Server).<p>We offer competitive salaries dependent on experience. We’re committed to everyone’s professional development, so we offer a flexible training budget for you to spend on attending training courses or other events, as well as brown bag talks and Kaizen weeks for self-improvement and experimentation. In addition to this we offer 25 days holiday (plus bank holidays and 3 days over Christmas and New Year), 3% employer pension contributions and discounted gym membership.<p>So, if you’ve got an interest in education and a desire to learn your craft alongside others making the same journey, we want to hear from you. Drop me an e-mail (robin at fireflylearning.com) or apply on our website – <a href=\"http:&#x2F;&#x2F;fireflylearning.com&#x2F;join-our-team&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;fireflylearning.com&#x2F;join-our-team&#x2F;jobs</a>","time":1467840430,"type":"comment"}