{"by":"workerthread","id":12092525,"parent":12016568,"text":"Z-Wave Senior Z&#x2F;IP Software Engineer | Copenhagen, Denmark | Full-time, ONSITE<p>(<a href=\"http:&#x2F;&#x2F;www.z-wave.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.z-wave.com</a>, <a href=\"http:&#x2F;&#x2F;www.sigmadesigns.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sigmadesigns.com</a>)<p>Sigma Designs is expanding the Z-Wave R&amp;D software organization in the Copenhagen office. We are looking for a knowledgeable and analytical professional. You will have the opportunity to shape the networking technology and protocols for the worlds leading wireless Smart Home IoT brand . We are passionate about reliability and security and strive for the highest technical excellence while maintaining a strong focus on pragmatic solutions that work in the field. We are a multi-cultural and international workplace with offices on three continents. Join us in making wireless mesh networks as reliable and ubiquitous as electricity and running water in the home.<p>Job Description<p>As a Senior Z&#x2F;IP Software Engineer you will be a part of a strong team of Software engineers designing and implementing Sigma Designs &#x27;Z-Wave for IP strategy&#x27; Z&#x2F;IP – Enabling Z-Wave products for the Internet of Things. The team is working on a wide range of Linux platforms. Your primary work tasks will be a) Design and implementation of new generations of Z&#x2F;IP Gateways and Z&#x2F;IP clients and b) Participation in the continuous development of test systems<p>We expect that you have&#x2F;are:<p>*\tStrong analytical background with experience in design, implementation, test and documentation<p>*\tPassionate about development in constrained and Linux environments<p>*\tExtensive experience with IP Protocol stacks<p>*\tExtensive experience with wireless networks and communication protocols<p>*\tInterest in iOS and Android application development is a plus<p>* Extensive experience programming in C&#x2F;C++<p>*\tRelevant technical background such as M.Sc.E.E or equivalent<p>Our interview process consists of resume&#x2F;cover letter screening, a couple of 1-hour interviews and a reference check. We don&#x27;t use puzzle questions to assess candidate.<p>For additional information, please contact:<p>Jonas Roum-Møller (Z&#x2F;IP Project Manager) Tel. +45-3913 0051<p>Jakob Buron (Staff Engineer) jakob_buron@sigmadesigns.com<p>Please forward your application marked &#x27;Sr. Z&#x2F;IP Software Engineer HN&#x27; to: Jobs-DK@sigmadesigns.com","time":1468487750,"type":"comment"}