{"by":"0xa","id":4992857,"kids":[4994308,4993969,5024596],"parent":4992617,"text":"Tumblr, New York, NY (NYC, Manhattan): FULL TIME Software Engineers (Scala, Java), PHP Developers and a Site Reliability Engineering Lead (Linux, Nginx, HBase, HAProxy, Memcached, and OpenTSDB)<p>TL;DR: Tumblr is actively hiring engineers at every layer of our technology stack.  <a href=\"http://tumblr.com/jobs\" rel=\"nofollow\">http://tumblr.com/jobs</a><p>We have interesting projects for people with a knack for software design, a nose for efficiency, and a passion for massive scale and visibility.  I'll highlight a few positions here, but you can see an awesome photo of Tommy the Pomeranian with Mayor Bloomberg, our great benefits, and the complete listing of open positions at <a href=\"http://tumblr.com/jobs\" rel=\"nofollow\">http://tumblr.com/jobs</a>.<p>Happy New Year,<p>Matt, Director of Engineering<p>* Software Engineer--Distributed Services (<a href=\"http://bit.ly/QWZC0p\" rel=\"nofollow\">http://bit.ly/QWZC0p</a>): Writing generic, reusable services in Scala, you will design, create and grow a blazingly fast platform for our PHP application.  Being a productive coder with architecture common sense is a must, but expertise in Java or JVM tuning is a plus.<p>* Search Engineer (<a href=\"http://bit.ly/TcOdt8\" rel=\"nofollow\">http://bit.ly/TcOdt8</a>): Real-time search and architecture are your forte.  Using your large-scale experience with building and innovating search backends, you will help take our search infrastructure to the next level.<p>* Front End/PHP Engineer (<a href=\"http://bit.ly/ToF7Ya\" rel=\"nofollow\">http://bit.ly/ToF7Ya</a>): You are a versed engineer and perfectionist with good taste, ready to take ownership of entire features of our PHP application.<p>* Site Reliability Engineering Lead (<a href=\"http://bit.ly/Uyy04u\" rel=\"nofollow\">http://bit.ly/Uyy04u</a>): As the team lead, you are an inspiring software developer with a passion for the highly performant, fault-tolerant, massively distributed systems that make Tumblr fast, reliable and available for hundreds of millions of visitors and tens of millions of users.<p>About Tumblr (<a href=\"http://www.tumblr.com/about\" rel=\"nofollow\">http://www.tumblr.com/about</a>)<p>Founded by David Karp in New York City in 2007, Tumblr empowers millions of users to create and explore content. Tumblr now hosts more than 87 million blogs and 39 billion posts. We work in an open, friendly and positive environment that encourages intellectual curiosity and a love for open source.  As engineers, we are focused on building technologies that advance massively scaled websites.  We are also excited to deliver a range of new products that will enable users to share their own creative content, discover content, and connect to one another in new ways.","time":1357056104,"type":"comment"}