{"by":"gduffy","id":4992758,"parent":4992617,"text":"Dropcam, San Francisco, CA. Full-time and intern (onsite only). <a href=\"https://www.dropcam.com/jobs\" rel=\"nofollow\">https://www.dropcam.com/jobs</a><p>Dropcam's cloud service accepts more incoming video per minute than YouTube. We make a Wi-Fi camera and cloud service that allows users to monitor their home or small business from anywhere in the world using apps for iOS, Android, PC, and Mac.<p>We have some of the most challenging software engineering problems in the world, e.g.:<p><pre><code>  * streaming low-latency, live video over consumer wifi networks\n  * storing up to 30 days of video per camera\n  * analyzing video for significant events (computer vision)\n  * refining a user experience that \"just works\" whether you are sharing babies'\n    first steps or catching a burglar (or monitoring your pets, keeping an eye on\n    your small business, providing in home medical care...)\n</code></pre>\nHere's just a couple of the articles written about us this year:<p><a href=\"http://allthingsd.com/20121227/the-story-of-dropcam-a-little-hardware-start-up-with-its-head-in-the-cloud/\" rel=\"nofollow\">http://allthingsd.com/20121227/the-story-of-dropcam-a-little...</a><p><a href=\"http://www.nytimes.com/2012/08/11/nyregion/an-improvised-trap-for-a-burglar-who-made-himself-at-home.html?_r=0\" rel=\"nofollow\">http://www.nytimes.com/2012/08/11/nyregion/an-improvised-tra...</a><p>We are hiring software engineers and product managers (both software and hardware). Dropcam is an amazing place to work. Why? Here are just a few reasons:<p><pre><code>  * Spend more time working on the product vs being in meetings.\n  * Every employee can access our sales dashboard so you know how the company is \n    doing/growing. (5x annual revenue growth in 2012)\n  * We bring in catered lunch every day but not dinner, so you don't feel bad going \n    home to recharge.\n  * Like big data? We measure it in Petabytes, not Terabytes (unlike your average\n    \"web scale\" startup :)\n  * I personally fly employees on helicopter tours of the San Francisco Bay (you \n    can even bring friends). It's a lot of fun!\n</code></pre>\nWhat more would you like to know? Drop me an email at my first name @ dropcam.com or apply at  <a href=\"https://www.dropcam.com/jobs\" rel=\"nofollow\">https://www.dropcam.com/jobs</a>","time":1357054214,"type":"comment"}