{"by":"dogas","id":4992829,"parent":4992617,"text":"PipelineDeals - Seattle/Greater Philadelphia Area (Wayne, PA)/Remote<p>Join the team of happy hackers at PipelineDeals! We’re looking for talented Rails developers in the Seattle or Greater Philadelphia area (remote work ok, for the right type of individual)<p>Perks:<p>* Join a progressive, 6 year-old company that is fun to work at, bootstrapped, profitable and proud.  The stuff you will work on will be used daily by tens of thousands of users across the globe!<p>* We encourage and promote learning on the job.   We have Video/Prezo Fridays, where we all hang out and watch a presentation from a conference, or present ourselves, about various subjects like TDD, architecture, SOLID principles, Ember.js, etc etc.<p>* There are quite a few large projects in our future that will be quite interesting to work on.<p>* Reimbursement for conferences or meetups you would like to attend, books you want to buy, screencasts you want to watch.  In addition, you will be invited to attend our yearly Summit meeting, where the entire company gets together in a wild location.<p>* Great benefits package:  401k, full health coverage, dental, vision.<p>* Very competitive salary, and lots of room for growth. Our goal is to ensure you are comfortable so you will be productive.<p>Requirements:<p>* Must have at 2 years of experience working directly with ruby, either with a company, or via open source. Past contributions to open source projects, or maintaining your own, are looked very highly upon.<p>* At least a year’s experience working with Rails, either on your own or at a previous company.<p>* Experience with jQuery, Backbone.js or Ember.js, Coffeescript<p>* Solid familiarity with git or other distributed version control system.<p>* Enough SQL to understand what rails is doing in the backend.<p>* Willingness to learn every day, and present what you learn to the team.  We love learning here.<p>* A good sense of humor is a strict requirement. Company culture is very important to us, and we are absolutely NOT a bunch of straight-laced, profit-driven, cubicle-sitting curmudgeons.<p>* Remote work OK, but it is highly preferable if you are located around the Philadelphia or Seattle area. You will be expected to be at the office sometimes. We do get lonely.<p>Interested? Email a link to your Github account (or resume) to careers@pipelinedeals.com. We look forward to hearing from you!","time":1357055601,"type":"comment"}