{"by":"bartonfink","id":4992915,"kids":[4999212],"parent":4992617,"text":"Mapquest.com<p>Primarily in Denver, CO and Lancaster, PA, but we're a relatively distributed company so go ahead and ask if you live somewhere else. As an AOL subsidiary, we've got employees who work out of AOL offices around the world so it wouldn't be unheard of to work from e.g. Seattle or New York if you decide Denver's just got too much sunshine. I've also been told we will sponsor an H1B.<p>Over the past year, MapQuest has brought on an almost entirely new management team to shake things up and change the direction of the company from answering the ? \"How do I get there?\" to answering the more interesting ? \"Where do I want to go?\" We've released two new products in the last year (Discover and Local, formerly known as Vibe) and are aggressively working on creating an engineering-driven culture that actually builds things people might want to use instead of polishing products that were cool in 2004. We've had a banner year, and are looking to hire engineers as well as product managers to continue this upward trend.<p>Among the technical roles we're looking to fill are several Ruby developers at varying levels of expertise to help develop new products as well as one Java developer to work with our data team and revamp various backend services (i.e. search, geocoding and a data ingestion service that populates our location databases). Ever since Valve leaked their company handbook, the phrase \"T shaped\" has been been thrown around a lot by upper management, so you'll need to be able to do full-stack development. We do a lot of pair programming right now, so if you've got experience doing that, it'd be a big plus. We're particularly interested in someone who's got very deep Rails experience to serve as a sort of tech lead, but we have many positions open for Rails people so if you'd be interested at all drop a line.<p>Product is looking to bring on people with some combination of travel industry knowledge and mobile applications to help get the company past maps and directions. Most of our product people have development experience, so you'll be expected to be able to \"talk shop\" with the engineers you work with, but your day- to-day responsibilities aren't going to be producing code as much as producing ideas, pitching them to the rest of the company and helping the engineers and designers see them through to completion.<p>I can definitively say that MapQuest is among the best places I've ever worked. The office space is fantastic (Downtown Denver right off the 16th Street Mall) and the new management team is very serious about doing things right as we try to pivot the company away from directions and into product development. The brand is practically a household name, the product team is happy to listen to engineers for feedback or ideas, and we've got the interesting position right now of being able to work like a startup except with a large pre-build audience (I've been told that we had 40M UV's on a brand new product on launch day, for example). You can read the company postings here (<a href=\"http://company.mapquest.com/careers/\" rel=\"nofollow\">http://company.mapquest.com/careers/</a>) but I'd really enjoy being able to answer ?'s directly. My e-mail is in my profile and please feel free to contact me personally if you have further ?'s, want to chat, or anything else. Happy 2013, and hope to hear from some of you soon!","time":1357057473,"type":"comment"}