{"by":"divshare","id":4992726,"parent":4992617,"text":"Detroit, MI (Remote OK)<p>PHP/Javascript/HTML5 Generalist to Help Lead Startup to Glory<p>A New Chapter<p>DivShare is seeking a driven developer to join the team. A guru on the frontend with chops on the backend. Specifically, HTML5/CSS3 and Javascript on the front and PHP and SQL around back. You will assist with current code troubleshooting while primarily leading development of the reiteration of the service. A great opportunity to work with a creative startup en route to disruption. This is a temp-to-perm position. 30-40 hours a week ongoing; the more the merrier. DivShare is based in the Motor City but you are based anywhere. Pay commensurable with experience. Ideal Pay/Equity split.<p>The Ideal Teammate<p>You meet our prerequisites of being a fast learner who can pick up new frameworks quickly. You are results oriented and passionate about fast, compliant, and functional code. You have an ambition to build something great. You ship fast and often.<p>Your Experience<p>- Proficient in PHP and Javascript\n- Ability to quickly diagnose and resolve PHP and MySQL bugs\n- Large user systems and media streaming\n- XFS, Lighttpd, Apache, Linux, MySQL \n- Building for the mobile web\n- Responsive web sites that gracefully degrade across devices\n- Up-to-date on HTML5 and enthusiastic about implementing the latest standards<p>Bonus Experience<p>- Java\n- PostgreSQL and/or Nginx\n- Payment systems\n- Implementing third-party APIs\n- Building highly scalable architecture<p>Let's Chart New Territory!<p>Play a major role in sailing the ship of an established startup. Advancement encouraged. Let us know what you've done and what you'd like to do.<p>Important: tell us why you would be the perfect fit and what your ideal career looks like. Are you determined to ship good code fast? What are your key strengths? Weaknesses? What's more important, pay or equity or a combination of both? Be honest!<p>Please include a link to your portfolio, github and/or any other code samples or information you find relevant.<p>Let's chat! Mail: divsharellc at gmail","time":1357053508,"type":"comment"}