{"by":"markhelo","id":4993730,"parent":4992617,"text":"Wello - San Francisco (<a href=\"https://www.sortbox.co/z/4k\" rel=\"nofollow\">https://www.sortbox.co/z/4k</a>)<p>Wello is looking to hire a software engineer with a passion for designing beautiful web applications. Using 2-way video technology, Wello enables users to workout from the comfort of their home or office with a live, professional trainer.<p>As the third engineer of a highly motivated team, you will be responsible for delivering product features that will delight customers. You will have a huge influence in shaping our product as an early member of the team. If you are someone that loves to build software and work in small teams, we’d love to tell you more about the opportunity.<p>What makes Wello special:<p>Our vision is to build a recognized health and wellness platform for learning and doing\nWe are a small and hungry team\nWe care deeply about great design\nWe are funded, generating revenue and successfully launched.\nLearn more about us at <a href=\"http://www.wello.co/about/\" rel=\"nofollow\">http://www.wello.co/about/</a><p>Responsibilities:<p>Develop new features (backend, data analysis) while working side by side with the rest of the team\nAs an early employee, be a generalist and shape the company and its culture\nPrototype experimental features quickly\nTest your own code and deploy to production quickly and often<p>Requirements:<p>A passion for building intuitive software that delight users\n3-5 years of prior experience building consumer software\nPractical knowledge of building scalable web applications\nKnowledge of design patterns\nDrive to take initiative and ownership\n(Passion for health and fitness solutions trumps any specific requirement).<p>Plus:<p>General knowledge of Django and MySQL\nKnowledge of a good A/B testing framework\nExperience building small mobile applications on the side<p>A Little about the Leadership Team:<p>Co- founder Ann Scott Plante worked at Bain &#38; Company. BA Dartmouth, MBA Stanford. Fellow co-­founder, Leslie Silverglide, previously founded and sold Mixt Greens, a quick-­service restaurant group. BA Johns Hopkins, MSc Oxford, MBA Stanford. Amol Kher, Wello’s CTO,  led teams at Netflix, Google and Microsoft. Hands-­on Technical Advisor, Marc Haverland, led MapQuest’s technical team as well as that of MXLogic (acquired by MacAfee).","time":1357070412,"type":"comment"}