{"by":"geofft","id":4993683,"kids":[4996178],"parent":4992617,"text":"MokaFive - Redwood City, CA (between San Francisco and Palo Alto), interns welcome, H1Bs probably welcome but I'm just an engineer so don't ask me.<p>MokaFive makes life easier for large corporate IT departments who have too many computers to manage, and life better for end-users who would otherwise have to deal with a corporate IT department that's enforcing ridiculously restrictive policies for their own sanity. Our primary product, MokaFive Player, delivers you a VM image of a corporate system that you can run on your own computer (Windows or Mac). You can install whatever software you want, and we automatically split new files into \"layers\", so IT can push a new base layer that takes effect as soon as you reboot, and you can press a button and wipe all locally-installed software including IE toolbars and other nonsense, but keep IT-provided software and non-application files like documents. Since it's running locally, you can get work done offline (unlike Citrix, VMware View, etc.), and not hate your life if you're not on the LAN. There's a bunch of security stuff like full disk encryption and so forth.<p>I'm specifically looking for coworkers on my team, which works on experimental / future products. One product that's been seeing lots of growth is MokaFive BareMetal, a stripped-down Ubuntu derivative that boots directly into MokaFive Player. By providing our usual management capabilities on an underlying OS you don't have to think about, you get the benefits of our product (easier updates, layering, single image, etc.) on corporate-owned hardware. We're also doing some work with MokaFive for iOS to allow you to remotely access files on your desktop from your mobile device, and doing some work with remote filesystems as an outgrowth of that.<p>We're not per se a virtualization company: we don't write the hypervisor, since other people already do a great job of that. We do write a lot of things just above and just below the hypervisor layer, and in general a lot of computer systems work. If you enjoy operating systems / virtualization, come talk to us. Our core product is in C++; there is also a fair amount of open source work to be done in various languages, and we try to be good citizens and work with upstream. (If you're interested in making 2013 the year of Linux on the desktop, helping Windows shops continue to use Windows as a desktop but use Linux for drivers is an oddly great way to help bring that about -- we regularly work to improve Linux's hardware compatibility, since we have customers wanting to use a wide range of machines.)<p>See mokafive.com for more info, or send me an email (gthomas at that domain name).","time":1357069771,"type":"comment"}