{"by":"scottyallen","id":4993887,"parent":4992617,"text":"Seeking a data-loving sales person to lead the charge (REMOTE from somewhere in the bay area)<p>AppMonsta sells data and insights to help businesses better understand the mobile app markets.  Our customers love us, we're bootstrapped and profitable, and we're growing quickly. We love hustle - we've been out hitting the streets as founders for the past year (we closed Neilsen and comScore starting with cold emails). Now it's time for us to bring a real pro - we've figured out the product and the market segments, and now we need someone who can use what we've learned to close a whole bunch of new customers.<p>When we talk to prospects, we hear things like \"We've been looking for a solution to this problem for the past three weeks.  This is EXACTLY what we were looking for\".  There are tons of leads just waiting for someone to give them a demo and close them, as well as a ton of companies that don't know they want to talk to us yet (we usually come back from conferences with handfuls of business cards to give demos to).<p>As our first dedicated sales person, there's a huge opportunity waiting for you (and responsibility to match).  You'll set the tone for our whole sales organization, and have the opportunity to grow into a very senior management role.  You'll be instrumental in helping develop a repeatable, measurable sales process.  At the same time, you should be comfortable with being the feet on the street while we ramp up.  We have had great luck with attending conferences, sending cold emails, and giving web demos to close new customers.<p>Our entire team works remotely.  We're very flexible about where and when you work, as long as you're hustling, closing deals, and keeping our existing customers happy and paying.  Being in somewhere in the bay area is a big bonus, as both founders are here, as are a lot of our customers.  We try to get together at least once a week, and meet with our customers in person when we can.  We also provide everyone with a 4G LTE wireless access point so you can work from wherever suits your fancy.<p>Send me an email at scotty@appmonsta.com and tell me what gets you fired up about selling.","time":1357072901,"type":"comment"}