{"by":"joelg87","id":4993197,"kids":[4993404,4995656],"parent":4992617,"text":"Buffer (<a href=\"http://bufferapp.com\" rel=\"nofollow\">http://bufferapp.com</a>) - Anywhere in the world (we're a distributed team)<p>I hope you are having a fantastic day. Happy new year :-)<p>I'd love for you to come join Buffer for the fun ride. We're a small team of 7, we have 450,000 users and are about to hit a $1M annual revenue run rate. There are some super interesting challenges ahead and just around the corner we're expecting even faster growth through our mobile efforts.<p>2 key areas we're looking for help with:<p><pre><code>    - JavaScript (+HTML5, CSS, Backbone.js) to lead our webapp \n      and browser extension development\n    - DevOps (we're PHP/MongoDB on AWS Elastic Beanstalk, and it's\n      been put together by a couple of full stack hackers so there\n      will be a lot that could be improved!)\n</code></pre>\nIf you're interested in coming on board, you will:<p><pre><code>    - work primarily with myself and my co-founders Leo and Tom\n    - be a happy, positive-minded and kind person who has a great\n      approach in dealing with others\n    - be a Buffer user (would be awesome, it’s cool if not)\n    - be friendly and comfortable helping our users\n    - be anywhere in the world, and if you'd like, you have help and\n      support from us to move to where you want to be\n    - have experience working with another startup before (would\n      be awesome, it’s cool if not)\n</code></pre>\nYou’ll be amongst people who are striving for success and pushing themselves forward each and every day. Everyone here seems to progress at an incredible pace, we want to do everything to make that happen for you as well. Whether you want to start speaking, blogging, learning marketing or have other areas of personal growth, you’ll have my personal support and the whole team as a resource too.<p>Great salary and equity - $85k-$140k, 0.5-1.5%.<p>If this sounds fun, let's have a chat. I'm looking forward to it! I'm Joel, drop me an email directly - joel@bufferapp.com.","time":1357062071,"type":"comment"}