{"by":"rdamico","id":4993163,"kids":[4993389],"parent":4992617,"text":"Crocodoc (YC W10) | San Francisco | Full time | <a href=\"http://crocodoc.com\" rel=\"nofollow\">http://crocodoc.com</a><p>## Opportunities ##<p>- Director of Product<p>- Director of Business Development<p>- Full-Stack Engineer<p>- Inside Sales Rep<p>Details below.<p>## About Crocodoc ##<p>Crocodoc powers HTML document viewing and collaboration for some of the world's top consumer and business web applications including Dropbox, LinkedIn, and Yammer. Our platform for Office and PDF files reaches tens of millions of users, and our company is profitable and growing fast.<p>Crocodoc was started by 4 technical founders from MIT and is well funded by Y Combinator, SV Angel, 500 Startups, and top angel investors from Silicon Valley.<p>---------------------------<p>## Director of Product ##<p>Do you love to launch products, close deals, work with developers, and do whatever it takes to thrive in a startup or small organization? Crocodoc is looking for a smart, entrepreneurial, technically-minded hustler to lead major new initiatives targeting developers and SMB customers. This is a key leadership role with enormous growth potential.<p>Many developers find Crocodoc by hunting through the source code of websites like Dropbox that use our white-labeled viewer. That’s a lot of raw demand, just waiting to be harnessed. If you have a technical background with a knack for talking to customers and building great user experiences, this is a chance to lead and 10x an entire product line at Crocodoc focused on our API and developer tools.<p>Responsibilities:<p>- Talk to prospective customers (developers and product managers)<p>- Design a great self-service experience and scalable sales process<p>- Optimize our pricing plans and product tiers<p>- Develop our user acquisition strategy<p>- Qualify leads, own our sales pipeline, and close lots of deals<p>TL;DR: you must be capable of growing our SMB product like crazy while wearing many hats in the process.<p>Qualifications:<p>- World-class ability to communicate with clients and develop customer relationships<p>- Experience with SaaS and/or B2B technology solutions<p>- Basic technical experience (you’ve written a web app) required<p>- Technical sales experience a big plus<p>- Product and marketing experience are also a plus<p>This is a tremendous opportunity to own an entire product from soup to nuts. If you think you'd be a great fit, please contact us at jobs@crocodoc.com or visit <a href=\"https://crocodoc.com/jobs/\" rel=\"nofollow\">https://crocodoc.com/jobs/</a>.<p>---------------------------<p>## Director of Business Development ##<p>Crocodoc’s next-generation HTML5 document collaboration platform reaches tens of millions of users, and our business is profitable and growing fast. Our customers include Dropbox, LinkedIn, and Yammer, and we're funded by investors including YC, SV Angel, 500 Startups, and top angels from Silicon Valley.<p>At Crocodoc, we’re fortunate to interact regularly with some of Silicon Valley’s most influential companies. We’re looking for someone with the hustle, product sense, and BD experience to help close our next wave of company-defining partnerships.<p>Responsibilities:<p>- Starting, negotiating, and closing strategic partnership deals<p>- Managing deal flow and our sales pipeline<p>- Conducting outbound prospecting and inbound lead qualification<p>- Working with the CEO to negotiate key deals<p>- Identifying and developing new business opportunities<p>- Providing feedback on the product roadmap based on existing/potential customers<p>Qualifications:<p>- Direct experience with SaaS and/or B2B technology products<p>- Strong organizational skills and the ability to manage your own agenda while working closely with others in a cross-functional role<p>- A great product sense and a knack for customer development<p>- Experience with technical products and/or a background in CS is a big plus<p>- World-class ability to communicate with clients and develop relationships<p>If you've got what it takes to lead business development and build relationships with top brands in Silicon Valley, we'd love to hear from you. Warm introductions to our CEO, Ryan Damico, are strongly preferred. Otherwise please contact jobs@crocodoc.com or visit <a href=\"https://crocodoc.com/jobs/\" rel=\"nofollow\">https://crocodoc.com/jobs/</a>.<p>---------------------------<p>## Full-Stack Engineer ##<p>We're looking for a full-stack web engineer who can contribute to all aspects of Crocodoc: front-end development, server-side improvements, ops and systems tasks, and everything in between. Does your experience mostly fall into one or two of those categories? Not a problem, as long as you're eager to get your hands dirty outside of your comfort zone.<p>Since you'll be joining a small technical team, you'll take the lead on core projects from day one and often work independently. We're nimble and push code almost every day, but because our product reaches tens of millions of users, everything must be bulletproof.<p>Skills and Qualifications:<p>- Ability to embrace the energy and drive of a close-knit start-up team.<p>- Self-starter with the creativity and initiative to brainstorm, propose, and dive into implementing solutions.<p>- Strong command of Python and up-to-date knowledge of its ecosystem. We love Python and use it throughout our back-end.<p>- Proficiency in JavaScript/HTML5/CSS3 and keen awareness of the state-of-the-art in browser technology. Our HTML-based document viewer is the face of Crocodoc, and we keep it polished.<p>- Familiarity with distributed computing. We use Celery to coordinate dozens of servers to process documents within a matter of seconds.<p>- Comfortable working in (and improving) a Linux-based development and deployment environment.<p>- Understanding of cloud-based infrastructure and all the benefits and drawbacks it provides. We're on Amazon AWS and dig its flexibility.<p>At Crocodoc, you'll be working with a savvy tech team that enjoys solving tough problems and loves to learn and leverage new technologies when it makes sense. If that sounds like your cup of tea, we'd love to hear from you. Please contact us at jobs@crocodoc.com or visit <a href=\"https://crocodoc.com/jobs/\" rel=\"nofollow\">https://crocodoc.com/jobs/</a>.<p>---------------------------<p>## Inside Sales Rep ##<p>Crocodoc is looking for a sales representative with a technical background who has the hussle and know-how to close sales with engineers and product managers. You’ll be responsible for managing our growing pipeline, qualifying opportunities, and driving deals to closure. You’ll also have a unique opportunity to improve our sales process and, down the line, grow our sales organization.<p>Skills and Qualifications:<p>- Experience selling SaaS products (API products and developer tools a big plus)<p>- Experience writing web apps<p>- Ability to work well and build rapport with engineers and product managers<p>- World-class ability to communicate with clients and develop customer relationships<p>- Ability to be a self-starter and embrace the energy and drive of a close-knit start-up team<p>To apply for this opening, please email us at jobs@crocodoc.com!","time":1357061547,"type":"comment"}