{"by":"newhouseb","id":4993323,"parent":4992617,"text":"Bubbli / Aria Glassworks - SF / Remote<p>We’re looking for an experienced developer to assist in development of our python backend and API (they’re the same thing!) for our mobile app and web presence (and maybe third parties one day). This developer will start on a contract basis, remotely with a 2-3 month term, with the possibility of becoming full-time. We use github, gchat and email to communicate asynchronously, but we'll fly you out to our offices every once in a while if you're not already local.<p>We run a very modern stack - nginx, gunicorn, puppet, celery, aws, redis &#38; postgresql. Our web API (what you'll be working on), is tiny. It uses our own micro-framework (1148 lines of python) specifically for writing APIs built on werkzeug (from the flask family), sqlalchemy, 1161 lines of “business” logic and 798 lines of tests. Much of the base functionality is complete (it’s actively serving our mobile app), which means the next stage -- your primary responsibility -- is scaling this code and optimizing it all while continuing to strive for irreducible complexity.<p>Day to day projects may include (but aren’t limited to):<p>* Implementing sharding logic in our python code<p>* Porting our code to use gevent/eventlet<p>* Profiling hot code areas and potentially rewriting them in C<p>* Investigating whether PyPy makes sense<p>In addition - you may be “on-call” to address server issues while you are actively working (read: sitting at a desk). If/when you transition to full-time these responsibilities may increase.<p>Bubbli is building the technology and products to make bubbles. Bubbles are completely seamless spherical photos that you view through the window of a portable device. We think they're the most compelling means for communicating the real world on the flat web and millions of dollars of VC funding would seem to agree with us. What we've built so far has actually become surprisingly meaningful in our own lives (in capturing moments important to us when photos aren't enough) to the point where we would be seriously sad if the world didn't have it.<p>We're about ready to launch our first iOS app imminently and we need to bulk up the team to support things when our app explodes in popularity. We're a tiny 4 person company (2 programmers, 2 designers) company based in San Francisco. We pay well, we're nice guys, and if you come on full time a few months in, you'll get full benefits, a 401k, and equity.<p>Since we haven't launched, you can google for more...<p>Shoot me an email at ben@bubb.li if interested.<p>Also - a part time CM needed too!","time":1357064159,"type":"comment"}