{"by":"joealba","id":4993150,"parent":4992617,"text":"Providence, Rhode Island (full-time)<p>Web Application Developer - Ruby on Rails\nRhode Island Interactive / NIC / RI.gov<p>Job Description<p>Rhode Island Interactive would like to add an additional Web developer and DevOps specialist to its small team in Providence, RI. A subsidiary of NIC, Inc. [Nasdaq:EGOV], we make award-winning online services for the state of Rhode Island and manage the RI.gov portal.<p>Working primarily in our office here in Providence RI, you'll be programming in the Ruby language using the Rails framework and test-driven development practices to build complex Web applications. Your applications will have an immediate impact, helping our state government serve its citizens and business efficiently.<p>Skills &#38; Requirements<p>Applicants should have 2+ years experience with Ruby on Rails, be comfortable managing code with git and writing automated tests using RSpec, MiniTest and Capybara. You'll be provided opportunities to build on your current skills, but you get some bonus points for experience with MongoDB, Oracle, Java, Perl, PHP, Puppet. Strong communications skills are also an important trait, as you will be collaborating with our team and state decision makers to map out the best way to bring an offline paper process online.<p>About Rhode Island Interactive / NIC / RI.gov<p>Benefits include a comprehensive health package for employee and spouse/dependents, matching 401k contributions, and attendance to training sessions and conferences. Additional advancement opportunities are available if you are interested in relocating to other NIC operations around the country.<p>How to apply<p>If this sounds like a career you would enjoy, please send a resume and cover letter to rijobs@egov.com. Include URLs and information about projects you have worked on, any open source contributions you have made, and your Github profile or other appropriate CV links as applicable.","time":1357061392,"type":"comment"}