{"by":"bruth","id":4994672,"parent":4992617,"text":"Work with this fabulous organization: <a href=\"https://github.com/cbmi\" rel=\"nofollow\">https://github.com/cbmi</a> and me: <a href=\"https://github.com/bruth\" rel=\"nofollow\">https://github.com/bruth</a><p>---<p>The Children's Hospital of Philadelphia - Philadelphia, PA<p>Senior Analyst/Programmer x2<p>Requirements:<p>• BS or MS degree in computer science, information science, or related field.<p>• 4+ years of programming experience with progressively more complex projects.<p>• Mastery of one or more programming language highly desired with a demonstrated ability to learn new languages (Python, JavaScript, or Scala experience is highly desirable).<p>• Mastery of unit and integration test design and programming frameworks such as PyUnit or JUnit highly desired.<p>• Working knowledge of one or more bug tracking applications such as FogBugz or Trac highly desired.<p>• Working knowledge of relational database application development highly desired, including stored procedures, SQL, data definition language, basic performance tuning and query optimization, and ETL techniques.<p>• Working knowledge of Python, JavaScript and one or more of the following preferred: Java, PHP, C/C++.<p>• Working knowledge of one or more of the following web application framework/platforms preferred: Django, Ruby on Rails, JBoss, Apache Tomcat.<p>• Previous experience in data modeling and applications of highly multidimensional data types such as that derived from clinical research, genomics, proteomics, or image analysis is preferred.<p>• Experience in healthcare and/or biomedical data management issues is preferred.<p>• Demonstrates expert knowledge of test-driven development, unit testing, and the importance and implementation of configuration management processes and technologies.<p>• Exhibits excellent oral and written communication skills.<p>• Demonstrates knowledge of system integration, configuration, and deployment.<p>• Demonstrates ability to document code and systems.<p>Description:<p>We are seeking an experienced software development professional to join our small, highly focused, entrepreneurial R&#38;D application development group within the Center for Biomedical Informatics (CBMi). As a member of our team, your technical expertise can have an immediate impact on patient care through our mission to accelerate pediatric research with novel applications and data solutions. Furthermore, your work here has the potential to impact the future of healthcare through our research into software solutions supporting genome-enabled personalized medicine. Our research mission fosters an environment where creativity and exploration of new technologies are promoted and encouraged. Likely candidates should have solid experience and working knowledge in three or more programming languages (Python, JavaScript, or Scala experience is highly desirable) and be comfortable with one or more relational database platforms. Our dynamic academic research environment demands an individual with exceptional written and oral communication skills who can rapidly translate requirements from a variety of disciplines into intuitive, high quality software solutions that support our strategic vision. Candidates with prior experience in the biomedical field, especially using highly complex genomic data and/or data from electronic health records are very desirable. Participation in one or more public open source projects is an added bonus.<p>More info: <a href=\"http://www.chop.edu/careers/\" rel=\"nofollow\">http://www.chop.edu/careers/</a> and search for 'cbmi'","time":1357086766,"type":"comment"}