{"by":"saumil07","id":4994069,"parent":4992617,"text":"LocBox, San Francisco. Frontend Engineer, Rails Developer, Data Scientist, Inside Sales Representative. Relocations Welcome, H1B Transfers Welcome.<p>More at <a href=\"http://www.getlocbox.com/careers\" rel=\"nofollow\">http://www.getlocbox.com/careers</a> and <a href=\"http://www.techcrunch.com/2012/10/31/locbox-series-a/\" rel=\"nofollow\">http://www.techcrunch.com/2012/10/31/locbox-series-a/</a>.<p>I’m CEO at LocBox (<a href=\"http://www.getlocbox.com\" rel=\"nofollow\">http://www.getlocbox.com</a>) and we are looking to work with great folks that share our mission - empowering local businesses to generate sustainable revenue from their best customers. We want to do it with Data, Algorithms and Design in a space that has traditionally lacked all three but is finally turning the corner (and fast).<p>Most local businesses resort to unsustainable daily deals or boring Email Marketing to acquire and retain customers. We reject that status quo and our hundreds of (paying) customers agree. We’ve also developed a new search/crawl/tech-centric way of acquiring our own customers and disagree with the obsolete feet-on-street Sales model. The company is very small but generating material and predictable revenue; net revenue growth has exploded in the last 2 quarters.<p>Our tech/product team is 6 at the moment and the company as a whole is 11; we're looking to at least triple the tech team size in the next 6 months. The tech stack is standard-issue Rails/HTML/CSS/JavaScript and is deployed on AWS. The product and tech team operates on 2 week sprints and there's a decent bit of Halo-playing and beer-drinking at the completion of sprint milestones.<p>We also just launched with a $5.1M Series A in the press w/ TechCrunch, AllThingsD, GigaOm and VentureBeat.\nReady to talk to us? I'm saumil at getlocbox dot com and at <a href=\"http://www.getlocbox.com/careers\" rel=\"nofollow\">http://www.getlocbox.com/careers</a>.","time":1357075722,"type":"comment"}