{"by":"dougb","id":4999235,"parent":4992617,"text":"kWantera - Pittsburgh PA (full-time)\nWe are an energy management early-stage company in Pittsburgh's Strip District. We are changing the way that businesses buy electricity in the wholesale markets. We also help companies manage their demand and power quality issues.<p>See <a href=\"http://www.kwantera.com\" rel=\"nofollow\">http://www.kwantera.com</a> for more info.<p>We are looking for full-time developers to join the team in our Pittsburgh office.  We are a small group of passionate people changing the energy procurement process. We are looking for people who take pride in their work, like to “get things done\" and want to be a part of a growing company. If you enjoy being part of a small team where everybody contributes and like to make a difference, then this opportunity might be for you.<p>•\tFrontend Developer:\nAbout Position: We are looking for someone to own the design and user experience of our web apps.  The ideal person will have experience presenting complex data in easily digestible ways. Required Skills: js, jQuery, D3, NVD3.<p>•\tBackend Developer:\nAbout Position: We are looking for someone to help us constantly improve our backend systems.  They must be familiar with various OpenSource tools to know which ones to use, and where to develop in house solutions. Must be able to evolve current system to meet future needs in a timely manner and must be good at defining interfaces between components. Must possesses superior programing skills.\nRequired Skills:  Python, Flask, Java, MongoDb, MySQL, interest in Scala.<p>•\tDevOps: \nAbout Position: This position involves building tools to manage, deploy, monitor, and scale our cloud infrastructure, working closely with our development team to plan our co-location strategy, and managing costs effectively. They will own Operations and be responsible for timely delivery of our products.\nRequired Skills: Debian Linux, AWS, Whirr, Python, MongoDb, MySQL, Shell scripting..<p>•\tLead QA Developer: \nAbout Position: We are looking for someone to build a team around. This person will be responsible for making sure our products are of the highest quality.\nRequired Skills: Python, Shell Scripting, testing frameworks.<p>Email careers@kwantera.com if interested.","time":1357160182,"type":"comment"}