{"by":"MrMike","id":5022761,"kids":[5027813],"parent":4992617,"text":"SHIFT (<a href=\"http://www.shift.com\" rel=\"nofollow\">http://www.shift.com</a>) is hiring in our Santa Monica office.<p>1) Front End Developer (<a href=\"http://jobs.shift.com/apply/BWRv4y/Front-End-Developer.html\" rel=\"nofollow\">http://jobs.shift.com/apply/BWRv4y/Front-End-Developer.html</a>)<p>We are looking for a Front-end developer that will be a pivotal member of our team. You will be working closely with our backend engineers &#38; design team to help implement a fully AJAX/HTML5 driven application using AngularJS. A great fit for this role is someone who is always intrigued by new technology and is constantly finding better ways to write beautiful, shareable and solid code.<p>2) Back End Developer (<a href=\"http://jobs.shift.com/apply/bAVkng/Back-End-Engineer-Python.html\" rel=\"nofollow\">http://jobs.shift.com/apply/bAVkng/Back-End-Engineer-Python....</a>)<p><pre><code>  - Extensive experience with Python 2.7\n  - Experience with various DBs (We use MongoDB, Cassandra, and Redis)\n  - Experience with architecting &#38; optimizing code for performance and resource management\n  - An understanding of how/when/why to use backgrounding via Celery tasks\n  - Experience with or a desire to learn TDD\n  - An understanding and love for the DRY principle.\n  - A positive attitude and enjoy working in a team environment\n  - Thorough knowledge of MVC frameworks (We use Flask; while experience with Flask is a plus, it’s not required)\n  - Thorough knowledge of various debugging methods\n  - A strong desire to keep learning (we move fast, use cutting-edge tech, and constantly have “ah-ha” moments solving complex problems)\n  - A personality that balances humor, maturity, professionalism, motivation/drive and the ability to hang shot for shot when we drink (unless you really, really don’t want to)\n\n</code></pre>\nRead about some of the awesomeness that we do here: <a href=\"http://tech.shift.com\" rel=\"nofollow\">http://tech.shift.com</a>","time":1357587745,"type":"comment"}