{"by":"ornategem","id":12846580,"parent":12846216,"text":"In-Q-Tel (IQT) | Arlington, VA | Technology Architect, Software Engineer, Network Architect | www.iqt.org<p>We’re looking to grow our team in our Arlington, Virginia office across several groups. Currently, we’re looking for folks interested in working in a role like mine (which we advertise as a “Technology Architect” on our website) where we partner closely with the United States Government to help introduce innovative technology solutions in support of mission, perform tech diligence on potential investments (and help craft how to adapt and deliver them), and generally spend our days exploring emerging tech.<p>Additionally, we have a few openings in our Cyber Reboot lab (<a href=\"http:&#x2F;&#x2F;www.cyberreboot.org&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.cyberreboot.org&#x2F;careers&#x2F;</a>) for software and network engineers. Our Cyber Reboot lab is one of our newest and the problem space is really interesting so if cyber security&#x2F;networking is your thing it’s a great place to land as you get to work with academia, many very interesting friends from one of our other labs – Lab41.<p>We are a relatively small crew and I can attest the organization feels like a startup (even inasmuch as we cater lunch on Mondays and Wednesdays and have nifty standing desks). Several of us came from venture-backed startups, some have left to start them and the problems you get to work on are definitely unique. Our lunches tend to morph into lunch-and-learns as we have folks spanning the academic&#x2F;technical gamut from microbiology, NLP, computer vision, “network security” and things that involve space.<p>The interview process is a phone screen or two, an in-person with a handful of folks and no coding challenges. We’re looking for teammates who want to work on a unique mission. Mastery of C++, familiarity with Torch or a PhD in EE are great things to have but what we want is a teammate who can learn tech or domains they’ve never worked in, cook up new ways of thinking about the application of existing technology and help support technical innovation in the government. As far as we can tell there’s no test for that, so we just talk to you and make sure you get coffee or water and whatnot.<p>Apply here: <a href=\"https:&#x2F;&#x2F;careers-iqt.icims.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;careers-iqt.icims.com&#x2F;jobs&#x2F;</a> or send an email to mjackson [at] iqt.org","time":1478014085,"type":"comment"}