{"by":"morenoh149","id":12848787,"kids":[12849544,12849273],"parent":12846216,"text":"Capsule Pharmacy | New York City, NY NYC | ONSITE INTERNS | fulltime<p><a href=\"http:&#x2F;&#x2F;capsulecares.com\" rel=\"nofollow\">http:&#x2F;&#x2F;capsulecares.com</a><p>Capsule is a healthcare technology company on a mission to elevate and simplify the consumer pharmacy experience. We believe in improving health outcomes through innovative design, mobile technology, logistics, and predictive analytics.<p>We are seeking a Software Engineer with a generalist&#x2F;fullstack orientation to join our development team in New York City.<p>At Capsule you will:<p>- Work at all levels of our stack. Key technologies: React, Swift, Django&#x2F;Python, Postgres, Go, Node<p>- Influence architecture, tooling, process, and culture at a small but growing engineering shop<p>- Contribute daily to the product dialogue<p>- Build things that meaningfully improve peoples’ wellbeing<p>You should have:<p>- Breadth in many different skill areas (Maybe you’ve written APIs and some front-ends and done some light devops and know a bit of Photoshop and have coded in a functional language … the more the merrier)<p>- Depth in one area that you can really school us on (Perhaps you’ve written a pubsub framework as a sideproject?)<p>- Experience writing code as part of a (preferably large) team<p>Bonus points if you have:<p>- Built db-backed RESTful APIs for commercial projects (Python&#x2F;Django = awesome, but also relevant if it was in Java, Scala, Ruby, Go, etc.)<p>- Working fluency in technologies like ES6&#x2F;ES2015, CoffeeScript, TypeScript, Sass, Less - Knowledge of and&#x2F;or interest in React<p>- Experience setting up a web development environment &amp; architecting a web app from scratch (e.g. first person on a web app team or led a web app team)<p>- Good grasp of TDD &amp; CI principles<p>- Contributed to the development of a native mobile app<p>- Facility with design tools like Sketch, Illustrator, or Photoshop<p>- Led an engineering team<p><a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;capsulecares\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;capsulecares</a>","time":1478024837,"type":"comment"}