{"by":"kkholleyholland","id":12847847,"parent":12846216,"text":"HUGHUB is hiring! | LONDON | ONSITE, FT | SENIOR SOFTWARE ENGINEER | £50-75K&#x2F;YR + BENEFITS<p>HUGHUB is a cutting-edge digital insurance platform. It allows brokers and insurers to offer their clients a simple, convenient place to purchase and manage all of their insurance products.<p>The platform is unique in the market and promises to become a disruptive force in the insurance industry here in the UK and as the product gains traction, it will be adapted and ported to the North American and Asia Pacific Markets so it has enormous growth potential.<p>Our developers utilize all the latest technologies and the platform contains a number of highly innovative technical features that differentiates it from anything in existence and the road map of feature&#x2F;functions will continue to build on its uniqueness. The product has a front-end written entirely in Java&#x2F;TypeScript, Angular, Node.js and a back end utilizing RESTful web services (.NET WebAPI), CQRS and MongoDB.<p>The ethos of our development team is that of high performing entrepreneurs with superior technology talent. The delivery style is that of a “consultant developer” working closely with the end client to deliver in a truly DAD style.<p>The company is young, energetic and driven and we work closely together at our office in Mayfair. We are looking for a new team member to join us who has experience with the following technologies-<p>Required Skills: •\tFull-stack development •\t5+ years’ developing .NET products •\tREST Web services •\tKnowledge of architectural design patterns •\tAngular.js, or a similar JS MVC Framework •\tGood understanding of the workings of the Task Parallel Library and its merits •\tA good understanding of SOLID<p>It is a close knit team currently comprised of 3 developers and we are expecting to grow rapidly over the next year as we take more clients on board and expand the product&#x27;s functionality so it is an exciting time to join.<p>Please get in touch directly: katherine.kaplan@hughub.co.uk<p>www.hughub.co.uk","time":1478020064,"type":"comment"}