{"by":"eriktrautman","id":12849123,"parent":12846216,"text":"Viking Education | Lead Instructor + Curriculum Architect | Onsite(SF) or Remote | <a href=\"http:&#x2F;&#x2F;www.vikingcodeschool.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.vikingcodeschool.com</a><p>Viking Code School is a 100% online development bootcamp driven by the mission of launching a million high-growth careers around the world.  Our core program is an immersive where students only pay tuition when they get a job and we&#x27;re scaling to offer more flexible programs based on strong demand.<p>We are looking for an experienced and opinionated full stack web developer who will lead instruction in the Immersive program and spearhead the ongoing development of our curriculum.  You will work with students and assistant instructors to manage the Immersive Program while architecting changes to the curriculum and supporting materials which are used by all of our programs.<p>Because we are 100% online, this is a REMOTE OK position which allows for a high degree of lifestyle flexibility while giving you a chance to potentially affect millions of lives with the lessons, demos, projects and posts you create.<p>As the leader of the Immersive Program, you will also be eligible for incentive-based compensation when the students are successful in their job search.<p>Requirements:<p>* 5+ years team-based development experience, 3+ in JavaScript and relevant frameworks (e.g. Angular, React...).  Strong CS, testing and data fundamentals.  Passion for exploring, learning and teaching new and current technologies.<p>* Significant experience with writing, sharing and educating (e.g. blogging, delivering conference talks, podcasting, teaching, or committing to OSS).  Great communication is prized over specific teaching experience.<p>* Experience building and running a team<p>* A legitimate passion for education and, preferably, also a quirky weird sense of fun.<p>Apply with your CV, a description of why you are a good fit, and any relevant links to Github, conference talks, blog posts etc. to careers@vikingcodeschool.com","time":1478027187,"type":"comment"}