{"by":"jmpz","id":12848297,"parent":12846216,"text":"Pandora | Oakland, CA | Full Time - Onsite | \nPandora has a great opportunity for seasoned engineers with several years of diverse experience, and a passion for learning and applying new technical knowledge. You should have outstanding analytical and programming skills, with a deep understanding of large-scale application development. You should have a track record of building robust, scalable, multithreaded applications.<p>As a member of our highly motivated team you should be dedicated to excellence and have a strong sense of personal responsibility. You place a high value on automated testing and have experience writing your own unit, integration, and acceptance tests.<p>At Pandora, we&#x27;re a unique collection of engineers, musicians, designers, marketers, and world-class sellers with a common goal: to enrich lives by delivering effortless personalized music enjoyment and discovery. People—the listeners, the artists, and our employees—are at the center of our mission and everything we do. Actually, employees at Pandora are a lot like the service itself: bright, eclectic, and innovative. Collaboration is the foundation of our workforce, and we’re looking for smart individuals who are self-motivated and passionate to join us. Be a part of the engine that creates the soundtrack to life. Discover your future at Pandora!<p>We have two open positions on our Ad Yield team, where we are working with Java, Hive&#x2F;Hadoop, MemSQL, and React to build an Ad Analytics platform.\nSr. Software Engineer (Fullstack - Java): <a href=\"https:&#x2F;&#x2F;pandora.com&#x2F;careers&#x2F;position?id=ooYb4fwl\" rel=\"nofollow\">https:&#x2F;&#x2F;pandora.com&#x2F;careers&#x2F;position?id=ooYb4fwl</a> \nSr. Software Engineer (Fullstack - Big Data, ETL): <a href=\"https:&#x2F;&#x2F;pandora.com&#x2F;careers&#x2F;position?id=ozOo3fwy\" rel=\"nofollow\">https:&#x2F;&#x2F;pandora.com&#x2F;careers&#x2F;position?id=ozOo3fwy</a>","time":1478022246,"type":"comment"}