{"by":"mi3law","id":12848870,"parent":12846216,"text":"Hammerhead | Bangalore, India | Hiring 4 developers &amp; 2 QA engineers | FULL-TIME | ONSITE<p>Hi! I’m a product manager at Hammerhead. We are building a sports technology company. We shipped our first product (see it on our website) to over 50 countries, and are now building our next product: Hammerhead X. Still in stealth, it is a highly capable custom Android-powered device that will be released in the spring of 2017.\n* <a href=\"http:&#x2F;&#x2F;hammerhead.io&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;hammerhead.io&#x2F;</a><p>We’re hiring 4 developers and 2 QA engineers at all levels (junior to senior, including a QA lead). We’re looking for full-stack engineers who have experience with mobile and Android in particular. More details here: <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;hh-swjobs-hn\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;hh-swjobs-hn</a><p><i>Special note on our office in Bangalore</i>-- We are Techstars-backed NYC-based company, but we are NOT hiring in India to save money or outsource serious engineering; working with us is NOT at all like Infosys or any consulting shop. Hammerhead’s SVP of SW Engineering and Co-Founder is Indian and leads the team in Bangalore, which is made up of 6 full-time employees who have equity in the company and make real decisions that determine the future of our products.<p>We regularly fly our team between offices or meet in the middle for better collaboration; right now for example, the development team is Boulder, CO, on a 3 month sprint to set the foundation for our new product.<p>We’re building the most excellent startup engineering team Bangalore has ever seen, and we have a deep appreciation for the tech scene and the potential to grow our Indian-side of the company. Join us.<p>* Any questions or concerns? Email: ali+swjobs@hammerhead.io<p>* All JDs: <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;hh-swjobs-hn\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;hh-swjobs-hn</a>","time":1478025357,"type":"comment"}