{"by":"wayfaringrob","id":12846960,"parent":12846216,"text":"Human API | Redwood City, CA | Full-time | Onsite | <a href=\"https:&#x2F;&#x2F;humanapi.co&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;humanapi.co&#x2F;</a> | jobs@humanapi.co<p>== About us ==<p>We&#x27;re a small, product-centric team focused on opening the world of health data.  We&#x27;re solving a hard but interesting problem: health data exchange. We ingest health data from thousands of sources and transform that data into an API that developers can build apps on.  This allows thousands of developers to create apps that improve peoples&#x27; lives. Our investors include a16z, Eric Schmidt, Blue Run Ventures, Max Levchin, Scott Banister, and Alex Payne.<p>== What you will build ==<p>Human API is the easiest way to integrate health data from anywhere. Users can now securely share their health data with any application or system, regardless of how that data was recorded, processed or stored. As an engineer on our team, you’ll be involved in one or more of the following areas:<p><pre><code>  - Modeling clinical data: organizing and normalizing the world of health data\n  - Developing and scaling structured APIs\n  - Scaling our ingestion platform\n  - Data engineering and building tools for data science - NLP and Classification\n  - Powering platforms and tools for customers to build health apps\n  - Building intuitive UIs to allow users to find and share their health data\n\n</code></pre>\n== Open roles ==<p>Most of our stack is on Node.js, with some Java and Python on the backend. However, we gravitate toward using the right tool for the job. Some of our open roles are:<p><pre><code>  - Full Stack Engineer (node.js, MongoDB, ElasticSearch, RabbitMQ)\n        https:&#x2F;&#x2F;jobs.lever.co&#x2F;humanapi&#x2F;7c411192-551e-4c6c-8133-99d34f17f207\n  - Frontend Engineer (node.js, React, Redis, ElasticSearch)\n        https:&#x2F;&#x2F;jobs.lever.co&#x2F;humanapi&#x2F;f31262f1-6613-455f-96a5-2135a4d6f0d6\n  - Machine Learning Engineer (node.js, Python, Kafka, Cassandra)\n        https:&#x2F;&#x2F;jobs.lever.co&#x2F;humanapi&#x2F;b698a09d-a5f4-4667-a52a-9e8939659b92\n  - DevOps Engineer (Ansible, Packer, Terraform, Docker, Mesos)\n        https:&#x2F;&#x2F;jobs.lever.co&#x2F;humanapi&#x2F;c74886f1-1e50-4323-a846-7ccac5855164\n </code></pre>\nYou can read more about all of our roles here: <a href=\"https:&#x2F;&#x2F;humanapi.co&#x2F;company&#x2F;join\" rel=\"nofollow\">https:&#x2F;&#x2F;humanapi.co&#x2F;company&#x2F;join</a><p>We&#x27;d love to hear from you even if you don&#x27;t &quot;fit&quot; one of the job specs -- we hire for people, not roles.  If you&#x27;re interested, contact jobs@humanapi.co","time":1478015877,"type":"comment"}