{"by":"gghh","id":12846344,"parent":12846216,"text":"SUSE | Nuremberg (DE), Prague (CZ) or REMOTE | Full Time<p><i>Live Patching developer</i><p>&quot;Live Patching&quot; is the Linux kernel infrastructure by which one can apply changes to a running kernel; this allows, for instance, to fix a security vulnerability with no downtime. For a more detailed introduction to live patching see the links [0][1][2] below. As a live patching developer you will extend and maintain our live patching tooling, both for kernel and userspace live patching. The main purpose of this role is working on improving the automation that helps with generation and verification of the actual live patches. In addition to that, you will implement tooling for userspace live patching and participate in developing the actual live patches as well.<p>This is a remote working position; if you want to work at a SUSE office instead, that is fine as well.<p><i>What we offer</i><p>You will take part in the development of the core parts of our enterprise and community distributions and you will be encouraged to submit your work upstream. We will sponsor travel to relevant conferences where you can present your work. Working time is flexible and we offer a bunch of the usual benefits (these differ in different countries, though).<p><i>How to apply</i><p>Preferably, submit all relevant information in a single PDF file, so that no important detail is lost in transit. Give us some time to process your application. Expect the interview to be done over phone. Form submission for this position at <a href=\"https:&#x2F;&#x2F;jobs.suse.com&#x2F;job&#x2F;nuremberg&#x2F;live-patching-developer-global-locations&#x2F;3486&#x2F;3308529\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.suse.com&#x2F;job&#x2F;nuremberg&#x2F;live-patching-developer-...</a> (apologies for the scrambled formatting of the webpage -- that will be fixed soon).<p>This is not the only job opening currently available at SUSE, see <a href=\"https:&#x2F;&#x2F;jobs.suse.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.suse.com&#x2F;</a><p>[0] &quot;Low-level Function of kGraft&quot; in the SUSE Administation guide: <a href=\"https:&#x2F;&#x2F;www.suse.com&#x2F;documentation&#x2F;sles-12&#x2F;book_sle_admin&#x2F;data&#x2F;sect1_1_chapter_book_sle_admin.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.suse.com&#x2F;documentation&#x2F;sles-12&#x2F;book_sle_admin&#x2F;da...</a><p>[1] &quot;A rough patch for live patching&quot;, summary of upstream live patching support from LWN: <a href=\"http:&#x2F;&#x2F;lwn.net&#x2F;Articles&#x2F;634649&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;lwn.net&#x2F;Articles&#x2F;634649&#x2F;</a><p>[2] Wikipedia entry: <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;KGraft\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;KGraft</a>","time":1478013209,"type":"comment"}