{"by":"JanoschF","id":12856800,"parent":12846216,"text":"Berlin, Germany, Fraugster ltd, Full time, ONSITE, We support VISA<p>Head of Engineering (f&#x2F;m), Fraugster Ltd.<p>Fraugster is a German-Israeli payment security company with the goal of eliminating fraud and increasing our customers’ profits. Over the last two years we’ve invented an artificial intelligence technology that combines human-like accuracy with machine scalability.We’re already working with some of the most well-known payment and e-commerce companies in the world. Notable clients include companies like Visa, among others. \nJob Description:<p>As Fraugster’s Head of Engineering you will take charge of the most pivotal department in the company. You’ll be responsible for all projects and deliveries in the engineering domain, including setting up the technical vision, roadmap and workflows as well as establishing collaborative interfaces with other departments in the R&amp;D Group. You’ll be reporting directly to the CTO and be part of the company’s leadership staff, closely interacting with the company’s board as well as strategic customers. In parallel you will drive the growth and scaling of the engineering team, focusing on attracting international talent as well as developing existing team members to take on greater responsibilities.<p>Skills &amp; Requirements:<p><pre><code>    -10+ years of experience in engineering roles including 4+ years of people management experience, preferably in cross-functional and international teams\n    -Demonstrable experience in scaling both teams and product architecture to comply with global operations\n    -Hands-on as well as architectural experience with big-data&#x2F;high availability products. You know not only how to build products, but also how to run and maintain them\n    -You are passionate with people management – you understand that building a world-class team is not only about getting the right people but also mentoring them and creating personal growth opportunities\n    -A related academic degree is not a must, but is definitely a big plus\n    -Thorough experience with containerized environments with Docker, CoreOS, Kubernetes is a big plus\n    -You have an extensive network both locally and internationally which you can leverage for attracting top talent\n    -You are fluent in business English and possess great verbal and written communication skills\n</code></pre>\nWhat we offer:<p><pre><code>    -Take a leadership position in a high-growth company – build your team, drive quality, shape the culture and leave your mark\n    -Take on the challenge of fighting the good fight against cyber-criminals, shoulder to shoulder with the best industry experts, using the most advanced AI technology\n    -Fun, creative and focused teams committed to learning and problem-solving through collaboration\n    -Competitive remuneration (salary + shares)\n    -A brand-new office located in the vibrant heart of Berlin\n</code></pre>\nWe are looking forward to receiving your application:\njobs@fraugster.com\nWe have at the beginning 1 intro call and then team gets involved with multiple interviews.","time":1478105554,"type":"comment"}