{"by":"malekascha","id":12850653,"parent":12846216,"text":"Goalbook | Web &amp; Print Designer | San Francisco Bay Area (San Mateo) | ONSITE<p><a href=\"https:&#x2F;&#x2F;goalbookapp.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;goalbookapp.com&#x2F;</a><p>Goalbook is an ed tech startup focused on creating instructional software for K-12 schools. I currently work here as a Software Engineer and I love it - the company culture values the employees very highly. Here is a description of the Web &amp; Print Designer job:<p>As a website and graphic designer at Goalbook, you’ll play a key role in designing our educator facing resources in Goalbook Toolkit and Pathways, and our company website. You’ll also contribute to our branding and marketing strategy through the design of flyers, print materials and publications. You’ll play a strategic role in educating district and school leaders and teachers about Goalbook’s work and our mission of empowering teachers to transform instructional practice.<p>Key Responsibilities<p>Manage the design and update of our goalbookapp.com website<p>Develop collateral and publications that communicate Goalbook’s thought leadership and the outcomes we help achieve with our district partners<p>Work closely with our product team to iterate on and design educator facing resources<p>Manage and analyze user and site analytics<p>Collaborate and participate in strategic initiatives that impact the entire organization across Partnerships, Success, Marketing, and Product<p>Required Skills &amp; Experience<p>Experience working with design tools (Adobe Photoshop, InDesign, Sketch, InVision)<p>A creative approach to problem-solving and design<p>1+ years experience developing and maintaining websites<p>Thorough knowledge of HTML, CSS and jQuery<p>Passion for tackling the most challenging issues in K-12 education<p>Entrepreneurial spirit – you’re not here to just execute; challenge us and inspire us and make this your company too<p>Desired Skills &amp; Experience<p>Experience working on enterprise websites<p>Rapid prototyping&#x2F;sketching tools (e.g. Sketch)<p>Familiar with Google Analytics – you make data-driven design decisions<p>Contact<p>Reach out to Daniel Jhin Yoo at jobs[at]goalbookapp.com and provide a cover letter and resume, LinkedIn profile, and how you heard about us. Include any links to personal projects and websites. This position is based in our San Mateo HQ and cannot be remote.","time":1478039148,"type":"comment"}