{"by":"Omie6541","id":12852619,"kids":[12853052],"parent":12846216,"text":"Efficient Bazaar | Gurgaon (Gurugram), India | Full-time | ONSITE | INR400k-INR1500k<p>We at Efficient Bazaar are building a B2B marketplace servicing the hospitality industry for their procurement needs. We are currently live in 3 cities across India and are scaling up our technology team to match our business capacity.<p>We are looking for<p>1. Senior Full Stack Developers: 2-5 years: PHP, Magento, MySQL<p>2. Senior&#x2F;Junior Full Stack Developers: 0 to 5 years: Python, Django, Postgres<p>Developer roles are not limited to these technologies. We believe in using right tool for the job. There are enough use cases on our product and technologies roadmap to make use of fancy Javascript libraries, react.js, Golang, elastic search, redis, few of aws offerrings and more. We are looking forward to a service based architecture. There will be many external service integrations in our pipeline.<p>We make use of git, trello, slack in daily workflows.<p>Our interview process is:<p>- screening call. get to know each other, discuss your past tech experience<p>- a small technical challenge to evaluate your skills* You can do this at your convenience and it won&#x27;t take more than 45-60 minutes.<p>- in depth technical interview. discuss your solution and many other technical questions. We don&#x27;t ask to solve puzzles on whiteboard. Questions will be more about problems we face day to day, OOP, platform specific topics etc. It will be face2face for local candidates and on phone for long distance candidates.<p>- talk to our HR<p>- talk to our ceo<p>Process should take less than 2 weeks (after screening) if you have time. We provide relocation support within India. We can&#x27;t offer vi$@, remo4e opportunities right now.<p>reach Rohit Gehe at his @gmail.com address &quot;gehe05&quot;. It&#x27;d help if you could put [HN] in the subject line.<p>* This can also be skipped if you have good github repositories of your own. However, note that we&#x27;d like to know how you can structure your code, think through and come up with a scalable, extendable solution. If your code doesn&#x27;t help us with this, we&#x27;ll ask you to take our test.<p>Thanks","time":1478066390,"type":"comment"}