{"by":"wehyeebarkon","id":12857947,"parent":12846216,"text":"ZealMe - NYC | Full Time | ONSITE<p>ZealMe is an early stage, consumer facing, and rapid growth startup. We are revolutionizing the way the world collaborates by helping users learn and share on their mobile devices.<p>How do we help? By creating a smart environment where technology can think and even learn along with users.<p>You will work closely with the Lead iOS Developer &amp; Founding team to build and create a robust consumer facing &amp; rapid growth product. The work you do will be crucial to our success, and so candidates should be inventive, able to think on their feet, and comfortable tackling a variety of tasks.<p>If you are excited about having a large influence and the potential for an upside that does not exist in a larger company, then we are interested in speaking with you.<p>ZealMe is hiring OPT&#x2F;CPT eligible candidates &amp; foreign nationals in addition to U.S. citizens. We are also willing to sponsor selected candidates for work authorization.<p>What we expect of you:<p>• You have at least one full year of coding experience (E.g. Swift).<p>• You have knowledge&#x2F;experience with Firebase, JSON &amp; APIs<p>• You are intelligent, a self-starter, and deal well with uncertainty.<p>• You are user focused<p>What does it look like?<p>Founding members will be responsible for the development of new features of ZealMe’s collaboration platform. Team members for this position should be very analytical but also ingeniously creative. In a perfect world, you are a seasoned engineer who has experience building multiple apps. As a founding member, you will have a large impact on the success of ZealMe on a daily basis.<p>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<p>Find out more info&#x2F;apply here: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;zealme&#x2F;jobs&#x2F;183225-ios-developer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;zealme&#x2F;jobs&#x2F;183225-ios-developer</a><p>Email(Keval@zealme.com)","time":1478112213,"type":"comment"}