{"by":"jtheory","id":12850312,"parent":12846216,"text":"Patients Know Best, REMOTE-only (no physical office). Full-time, with occasional exceptions. Core working hours: within a few hours of GMT -- current IRL span: Costa Rica to Bangalore, sometimes a bit further: I&#x27;m currently working from Kuala Lumpur for a month while visiting in-laws.<p>I post on HN sometimes about work-life balance (more than half of our dev team have small kids), building something that improves life&#x2F;health, and our culture (collaboration and good communication over competition).<p>Superb communication skills required -- we all need to be highly articulate, clear, and at ease talking through complicated concepts with each other.  Sometimes remote work tools are (nearly) flawless, but with some bad luck you might be explaining something complicated over a choppy connection with a punishing 3-second delay and a marching band in the background.<p>Skills talking with strangers: useful, but not an everyday requirement.<p>If you&#x27;re interested in PKB&#x27;s growth, funding, profitability, contracts, etc., ask -- our CEO is also active on HN. Or Google us. I&#x27;m in the CTO role.<p>We&#x27;re hiring on &amp; off in different dev roles, and I&#x27;m a bit ashamed to admit that our response rate to CVs is unimpressive; but if you&#x27;re interested and not in a rush, it&#x27;s a good idea to get a CV and intro letter into our inbox, and we scan through them periodically.  Note that of the positions currently listed, at the moment we&#x27;re probably looking more for mid-level full-stack engineers than any of the others; our stack is principally Java (8)&#x2F;JEE-based. We use Docker in production and dev environments, Prometheus for stats.<p>Bonus points (all positions) for experience in the medical world (as an intelligent patient counts!), as well as some history building things from scratch.<p>More details (and to submit an application): <a href=\"https:&#x2F;&#x2F;www.patientsknowbest.com&#x2F;careers.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.patientsknowbest.com&#x2F;careers.html</a>","time":1478036787,"type":"comment"}