{"by":"asah","id":12861649,"parent":12846216,"text":"Byte Foods &#x2F; Pantry Retail (SF and Marin, CA).  Onsite or remote.<p>60sec video: <a href=\"http:&#x2F;&#x2F;youtu.be&#x2F;pVGkFfhvhHg\" rel=\"nofollow\">http:&#x2F;&#x2F;youtu.be&#x2F;pVGkFfhvhHg</a>  bytefoods.co<p>Outside of Silicon Valley, most offices provide on-site food through traditional vending machines filled with convenience store junk, cheap snacks, candy and soda. Byte is successfully replacing these with smart refrigerators filled with fresh, healthy, local foods that use real-time inventory data to make automated decisions about replenishment to control spoilage, which directly affects prices and makes the solution practical.  At the same time, some amount of spoilage is inevitable, and we’re proudly one of the Bay Area’s largest fresh food donors.<p>Byte is growing quickly, with 100s of offices and 10,000s of employees using Byte fridges, including diverse customers like KQED radio, 2K games, Amazon silicon valley, Chevron refinery, Gilead biosciences, the SF SPCA and more.  We&#x27;re on track to grow 10x in the next year, while expanding to other metros.<p>The company’s product team is distributed with an office in downtown SF; the food and business operations are headquartered in San Rafael a few blocks from the SR bridge, 101 and 580. While the views are spectacular and we love hallway conversations, we&#x27;re already a distributed team and expect that most of us will work from home a few days a week, both to save on the commute and help focus.<p>Current openings:<p>Tech Lead - strong techlead&#x2F;manager to scale up the backend and team, design new algorithms and weave data and code into complex business processes, and run 24&#x2F;7 server operations for a growing fleet of refrigerators.  Python3&#x2F;Postgres9.5<p>Product&#x2F;Consumer Growth Manager - A hybrid Product&#x2F;Marketing role define and help create the Byte consumer experience, with an emphasis on the &quot;out of fridge&quot; experience that grows food sales through data driven, programmatic electronic marketing programs.<p>jobs+hn@bytefoods.co","time":1478148192,"type":"comment"}