{"by":"scaryclam","id":12866338,"parent":12846216,"text":"EnergyDeck | London, UK | Full Time | Onsite | Intern Data Analyst<p><a href=\"https:&#x2F;&#x2F;www.energydeck.com&#x2F;blog&#x2F;article&#x2F;data-analyst-intern-role&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.energydeck.com&#x2F;blog&#x2F;article&#x2F;data-analyst-intern-...</a><p>About the role:<p>At EnergyDeck we deal with a lot of data in all forms - from manual entries to spreadsheets and automatic meter transmissions. The focus for this role is to ensure data integrity in spreadsheets and make sure it can be transferred to our platform. Furthermore, for certain services data needs to be extracted from our platform and analysed in Excel or R to generate reports or further insights.<p>We&#x27;re looking for someone with strong experience in Excel and data management, and a drive to turn data into actionable insights for our customers. We’re looking for at least basic experience with R (or a comparable statistics package) for more advanced analysis. Ideally you’d be able to document your work and findings in a human readable manner (aka technical writing skills).<p>In return for your efforts, you can rest assured that the work you do matters not just to us and our users, but can really lead to a step change in how commercial and other buildings are operated. Which in turn drives significant reductions in costs and environmental impact. Whoever said you can&#x27;t have heaps of fun and do a ton of good at the same time?!<p>Profile summary<p><pre><code>    Very strong excel skills (ie: comfortable with advanced excel automation &amp; manipulation)\n    Beginner level ability with R (bonus points for more than that), VBA skills a plus\n    Familiarity with producing presentations for data-centric topics\n    An interest in data-visualisation and data in general\n</code></pre>\nEmail jobs@energydeck.com. Include HN + the job title in the subject line and attach a copy of your CV.<p>EDIT: Strictly no agencies please","time":1478196048,"type":"comment"}