{"by":"urlwolf","id":12871172,"parent":12846216,"text":"Codekitt | Berlin, Germany | Onsite, but remote possible<p>- Senior PHP developer<p>- Junior PHP developer<p>- Senior frontend<p>- Junior PHP developer<p>Codekitt wants to enter the &#x27;disrupting recruiting&#x27; market.<p>If you are a dev, think about your friends: Who has gotten killer training from a company they were working for? Noone? There&#x27;s a reason for it. Because we switch jobs every two years, for a company it&#x27;s very hard to justify spending money on training people. But they do want everyone to be on top of the latest and greatest in tech. And we do.<p>Because we devs like learning, we spend our evenings and weekends learning new technologies. Something the company we work for benefits from (that is, they get the knowledge on the lastest tech without having to spend money on training).<p>This is unfair. But this is how the world works.<p>Companies don&#x27;t have budgets for training (or have say 500eur&#x2F;person&#x2F;year)... this is scary because the fast-changing tech world will leave you behind unless you spend time improving yourself. If the company doesn&#x27;t spend money on training, then you have to find ways to catch up, probably over weekends and evenings. But companies do have big budgets for recruiting. Everyone assumes that you have to spend money to get good guys, and recruiters charge a good chunk of the first year salary for the hire. Companies budget for this.<p>We want to get around the fact that there&#x27;s no budget for training, by taking it from where businesses do have a budget: hiring. So it&#x27;s mostly budget relocation. But there&#x27;s a clear benefit for the company: they get training &#x27;for free.&#x27; And they get onboarding partially solved. It&#x27;s common to hire someone, and the assume that the first month is wasted, with the person getting used to the tech stack the company uses. We remove a big chunk of the problem.<p>_No time for bullshit_<p>- We pay market rate salaries<p>- We care about you being fast learner, not &#x27;10 years experience on \ntechnology X&#x27;<p>- We pass the Joel test<p>- You will work on pretty mundane stuff at first (come on, you know a lot of web deb is mundane), but sooner or later you will start integrating machine learning APIs that we build in-house<p>- If you interview, we will not waste your time<p>You can apply here:\n<a href=\"https:&#x2F;&#x2F;dsr.recruitee.com&#x2F;o&#x2F;backend-full-stack-developer\" rel=\"nofollow\">https:&#x2F;&#x2F;dsr.recruitee.com&#x2F;o&#x2F;backend-full-stack-developer</a>","time":1478249795,"type":"comment"}