{"by":"bkudria","id":2719476,"kids":[2719492],"parent":2719028,"text":"San Francisco, CA - Yammer<p>Yammer is a cool tech startup masquerading as an enterprise software vendor. We're building an enterprise social network (think Facebook, but for your company. Also, better.) and we need your help. We build our product with insight and wisdom gained from the consumer social networking space, but we charge enterprise prices (and our customers pay them!) We're fighting some big serious competitors (Salesforce/Chatter, Jive, and VMWare/Socialcast) and this space has never been more exciting. Yammer is really changing the way people get work done. We have real challenges to overcome and we're doing our best to make a kick-ass product that makes our users happy.<p>Tech we use: Ruby/Rails, Scala, and Node/JS. We have Obj-C and C# stuff too.<p>Some bullet points for you to skim:<p>• Amazing group of smart engineers to work with. Really.<p>• We hack in Ruby/Rails, Scala/Java, Javascript/JQuery/Node.js/Adobe AIR, Obj-C for iOS, and some MSFT/Sharepoint stuff.<p>• Competitive compensation. Enough said.<p>• Delicious catered lunch and dinner daily, with a 3PM snack cart. (Really.) Also a fully-stocked beer-and-beverage fridge.<p>• Fancy Apple hardware of your choice (you can have a PC if you really want one.)<p>Some links for you to read more:<p>• Our jobs page: <a href=\"https://www.yammer.com/jobs\" rel=\"nofollow\">https://www.yammer.com/jobs</a><p>• Our Engineering blog: <a href=\"http://eng.yammer.com/\" rel=\"nofollow\">http://eng.yammer.com/</a><p>• A video of a talk given by Coda Hale and Ryan Kennedy about how we use Riak at Yammer: <a href=\"http://blog.basho.com/2011/03/28/Riak-and-Scala-at-Yammer/\" rel=\"nofollow\">http://blog.basho.com/2011/03/28/Riak-and-Scala-at-Yammer/</a><p>• A blog post about why it's so awesome to work here: <a href=\"http://eng.yammer.com/blog/2011/5/31/shameless-recruiting.html\" rel=\"nofollow\">http://eng.yammer.com/blog/2011/5/31/shameless-recruiting.ht...</a><p>Feel free to get in touch: bkudria@yammer-inc.com","time":1309544060,"type":"comment"}