{"by":"teddyp","id":2719199,"kids":[2719680],"parent":2719028,"text":"NYC - Software engineer.Yodle.com (<a href=\"http://www.yodle.com\" rel=\"nofollow\">http://www.yodle.com</a>)<p>Solve one of the problems correctly and get an interview.\n<a href=\"http://www.yodle.com/careers/job-details/software-engineer-new-york-ny/\" rel=\"nofollow\">http://www.yodle.com/careers/job-details/software-engineer-n...</a><p>• Our software engineers are passionate about technology and programming, they’re smart, no-nonsense developers who move quickly and get things done. The team uses an agile development process, performs code reviews, runs automated unit tests, and has a distinct QA team. Our engineers work in an open, collaborative, team oriented environment.\n• Our engineers work on everything from user-interface, backend, content management to messaging, database systems and web services. Regardless of which components you touch, we’ll want you to be involved in design, coding, testing and running the systems.\n• Our engineers solve a variety of complex and challenging business problems with cutting edge technology.\n• We are constantly innovating! We look at ways to improve our core products, seek out products in the market that can be built better and we have an Innovation Department that addresses the future needs of our industry - our engineers are building the software to meet those needs.\n• Engineers have a high degree of flexibility in choosing which of the many ongoing projects they work on. We have shared ownership of our code base. Anyone can and is expected to work on and improve any piece of code. There are no silos!\n• We explore new technologies and find the best tools for the job. While java is our predominant language, we are using javascript, python, scala and groovy as well.<p>Qualifications\n• 0 to 4 years of experience\n• Excellent coding and design skills. Software that works, is reliable, testable and maintainable should be what you do by default.\n• You enjoy writing software and take pride in what you build.\n• Having programmed in Java will help you get going faster, but your primary languages aren’t as important as being a great programmer.\n• SQL proficiency, particularly with PostgreSQL is a plus\n• Strong communications skills, both written and verbal\n• BA/BS or above from a top Computer Science program\n• You should be able to work daily in our office in New York City<p>Benefits\n• Competitive base\n• Tuition assistance\n• Health/Dental benefits, 401 (K) plan\n• Great work environment - we have fun!\n• Accessible and open-minded leadership\n• Opportunity to work with smart people and learn a lot about one of the fastest growing industries<p>To Apply:\nclick this link and solve one of the two problems.  If you get it right you will get a call.  Good luck.<p><a href=\"http://www.yodle.com/careers/job-details/software-engineer-new-york-ny/\" rel=\"nofollow\">http://www.yodle.com/careers/job-details/software-engineer-n...</a>","time":1309540600,"type":"comment"}