{"by":"mindcrime","id":2720713,"parent":2719028,"text":"Chapel Hill / Research Triangle Park, NC<p>Fogbeam Labs<p>Seeking technical and/or non-technical co-founder(s).<p>At Fogbeam Labs, we like to think of ourselves as \"The Next Great Open Source Software Company.\"  We're building awesome information retrieval and knowledge management systems (all open-source, ALv2) using Groovy, Grails, Scala, Java, and many existing open-source tools and libraries:  Lucene, Solr, Mahout, UIMA, OpenNLP, Jena, Droids, Roller, Camel, etc.<p>If you have a passion for open-source software, and are particularly interested in information retrieval, machine-learning, AI, and want to be part of a company that's pursuing a proven business model (selling software to other businesses, for, like, actual money), and want to get in early and become an actual co-founder (with a corresponding equity stake), ping me.<p>NOTE:  Not funded yet, and the current founder (mindcrime) is still working a day job, so another co-founder would not be expected to commit any more than I am... So, basically, 20-30 hours a week (including weekends) until we reach a point where we can pay salaries.  Yeah, we're talking about being a <i>founder</i> here, not an employee.<p>2nd NOTE:  This is not just a pipe-dream or a hobby project, despite the day-job thing. I've just had an excellent customer discovery interview with a very large and well-known bank headquartered here in NC, and they were <i>very</i> responsive to what we're working on.  This and the Customer Discovery we've been doing the past few months strongly suggests that there is real demand for the kind of stuff we'll be doing; and Red Hat (if not others) have proven the open source model.  See, for reference:<p><a href=\"http://www.bloomberg.com/news/2011-06-23/red-hat-sales-to-triple-to-3-billion-in-five-years-ceo-whitehurst-says.html\" rel=\"nofollow\">http://www.bloomberg.com/news/2011-06-23/red-hat-sales-to-tr...</a><p>fogbeam (at) gmail (dot) com","time":1309567673,"type":"comment"}