{"by":"myenergy","id":3413098,"parent":3412900,"text":"MyEnergy - Boston, MA - FULL TIME: VP Eng, Data &#38; Rails Engineers<p>We're building the consumer side of the universal energy internet, and we're looking for talented engineers to bring it to life. Working atop datasets never before accessed and assembled in the same place, you'll build experiences and interactions that make a difference here at home and the world over.<p>MyEnergy, formerly Earth Aid, was recently named to Fast Company's Top 10 Most Innovative Companies in Energy. We're venture-backed, with strong strategic partners and investors committed to our vision of building the people's energy internet. We've been called \"the killer app for energy efficiency\" ( <a href=\"http://bit.ly/dZBy7q\" rel=\"nofollow\">http://bit.ly/dZBy7q</a> ) and our work has been featured in publications such as Mashable ( <a href=\"http://on.mash.to/hqyZqF\" rel=\"nofollow\">http://on.mash.to/hqyZqF</a> ), TechCrunch, The New York Times ( <a href=\"http://nyti.ms/ayzLHb\" rel=\"nofollow\">http://nyti.ms/ayzLHb</a> ), The Washington Post, and The Philadelphia Inquirer.<p>We're currently hiring for:<p>* a VP Engineering to lead us in tripling our team =&#62; <a href=\"https://www.myenergy.com/careers/vp_engineering\" rel=\"nofollow\">https://www.myenergy.com/careers/vp_engineering</a><p>* Rails Engineers to take ownership in dreaming up and building out new front and backend functionality =&#62; <a href=\"https://www.myenergy.com/careers/rails_engineer\" rel=\"nofollow\">https://www.myenergy.com/careers/rails_engineer</a><p>* Data Engineers &#38; Scientists to embark upon ambitious projects leveraging machine learning and AI =&#62; <a href=\"https://www.myenergy.com/careers/data_engineer\" rel=\"nofollow\">https://www.myenergy.com/careers/data_engineer</a><p>* and UI Designers to make the whole of the user experience astounding =&#62; <a href=\"https://www.myenergy.com/careers/ui_designer\" rel=\"nofollow\">https://www.myenergy.com/careers/ui_designer</a><p>We've just opened up our new HQ in a sunny two story loft by Faneuil Hall in Boston, and we offer very competitive salaries, excellent benefits, a fun company culture, and a small arsenal of office helicopter drones. If you might like to join us, send us an email to introduce yourself to jobs at myenergy dot com","time":1325428916,"type":"comment"}