{"by":"esilverberg2","id":3413872,"parent":3412900,"text":"New York, NY<p>SCRUFF, one of the largest and fastest-growing gay social networks, is hiring a senior engineer for its New York office.<p>SCRUFF is not a traditional software startup - we think there are a few reasons why working at SCRUFF is a one-of-a-kind experience:<p>• You will get to make consumer software that lots of people use.<p>Consumer software is by far one of the most fun businesses to be in. Consumer software is easy to explain, you can share it immediately with your friends, and you get to apply both technical and design skills. Business-to-business software is well and good, but there's a reason why we aren't writing automated trading platforms for hedge funds :) SCRUFF has been fortunate to find a market that is both growing quickly and very excited about our product. When you come on board, the code you write will affect hundreds of thousands of guys every day.<p>• Our #1 priority for you is your professional development<p>Most startups want engineers to start producing shipping code on day one. We would much rather take the time to allow you to explore our codebase, do deep dives into the technologies we use, and ultimately write great production code in weeks or months. We feel mentorship is one of the most critical aspects of enjoying your job.<p>We also strive to practice good core software engineering principles, because we believe in the long-run it will make the code you write better, bring more benefits to our members, and be most helpful for you in your career. The ideal candidate should come in with a healthy ego and a positive attitude, be open to critical feedback, and be eager to develop more in the practice of professional software development.<p>• You will touch every piece of code we have.<p>Our engineering team is small. There are no client-side/server-side functional divides. You will be responsible for the servers (we have a lot). You will be responsible for the client (iOS and Android). Your brain will be stretched in new and confounding ways. But in the process you will build a set of skills that will form the core of all software innovation of the next 10 years. What we teach you at SCRUFF about mobile development will be like learning HTML in 1995 or GUI programming in 1985.<p>• Parties are our business, and now they're yours, too.<p>No, seriously. Lots of startups will talk about their Friday night beer busts, but at SCRUFF we take it to a new level. SCRUFF partners with promoters and events all across the world. As a SCRUFF team member, you will become part of the SCRUFF brand, and will have opportunities to represent us at events both locally and across the country.<p>• New York City.<p>SCRUFF is based in Manhattan, the most amazing city in the world. Everyone you've ever met will want to come and visit. Your other friends who work at banks will complain to you about their schedules while you are busy planning SCRUFF parties into your workday(night?) Startup networking events will be blocks away, every day. You'll have access to the most restaurants, the most culture, and an endless stream of new people to meet. We love New York, and think you will love it too.<p>Read more at <a href=\"http://www.scruffapp.com/join\" rel=\"nofollow\">http://www.scruffapp.com/join</a>","time":1325452676,"type":"comment"}