{"by":"NathandWhite","id":10313036,"parent":10311580,"text":"Front End Web Developer - USA - Washington D.C. or NYC (onsite preferred)<p>About Access:<p>Access (accessnow.org) is a growing organization dedicated to defending and extending the digital rights of users at risk around the world, including on issues of privacy, security, freedom of expression, and transparency. Our policy, advocacy, and technology teams have staff presences in Europe, Latin America, the Middle East&#x2F;North Africa, North America, and Southeast Asia, to provide global support to our mission.<p>Duties and Responsibilities:<p>Working within the Digital Engagement Squad, develop websites and digital properties to further the goals of our Policy, Advocacy, and Tech arms;\nWorking closely with the Tech team, manage Access websites (including www.accessnow.org) and web properties, coordinating the development of new sites and the maintenance of existing sites;\nWork with the Visual Advocate and other members of the Advocacy team to build and deploy standalone websites and other digital and interactive projects;\nActively pursue new technologies and think creatively about how to adopt, extend and modify them for use in our projects, programs and the larger digital security and digital rights sphere;\nDevelop reusable web functionalities and tools for Access web assets;\nEngage and support other members of the Access team as it relates to the development of web properties and the use of Access web assets;\nReport to Advocacy Director on progress and challenges of responsibilities as required.\nEducation and Experience:<p>Fluency in Javascript, HTML5, CSS3, SASS JQuery, and PHP;\nA minimum of two years experience in Web development;\nWordpress experience essential; other CMS experience (Drupal, Symfony etc.) a plus;\nPrevious design experience and&#x2F;or demonstrable design skills desired;\nExperience using Github to collaboratively develop and manage websites and digital assets.<p>To Apply: Please write to jobs@accessnow.org with “Frontend Web Developer-- [Your Name]” as the subject line and submit the following, saved as one PDF or .doc document:","time":1443721825,"type":"comment"}