{"by":"davezatch","id":10312151,"parent":10311580,"text":"Uberall - <a href=\"https:&#x2F;&#x2F;uberall.com\" rel=\"nofollow\">https:&#x2F;&#x2F;uberall.com</a> - Berlin, Germany (Mitte)<p>WE ARE UBERALL – We are a tech-startup from Berlin that develops Europe&#x27;s leading Geomarketing Platform.<p>It is our mission to contribute to this evolution by bringing online everything that&#x27;s local, to provide complete and accurate information whenever and wherever needed - On our phones and on our tablets. On our PCs and in our in-car GPS systems. On websites and in apps. For known use-cases and upcoming opportunities.<p>We are looking for Frontend Engineers (m&#x2F;f) to support our tech team. You will be working closely with product development and be responsible for turning their wildest dreams into reality.<p>About you:<p>- You take ownership of your work, &amp; for you a feature is done when it makes using the product a better experience for all users\n- Passion for all things in the browser, experience with modern frontend web technologies (We use Bootstrap, Backbone, React, LESS, Babel)\n- Creativity! We&#x27;re open here, and if you&#x27;ve got a great idea, we want to know about it\n- You understand the importance of quality and testing, you value automated testing as much as we do and see it as an integral part of the process\n- You value maintainability, so clean &amp; organized code goes without saying\n- We want to see something you’ve done: on Github, Stack Overflow, at your previous company, etc\nWhat you will do at uberall:<p>- Maintain our website, our number one promotional tool. We need it to be clear, look great, load fast, and most importantly, effectively explain what we do\n- Develop our web-apps that our customers use every day to manage anywhere from 50 to 10s of thousands of business listings\n- Build a reference connection to our extensive Rest API that both our partners and our own client apps use\nJust send your application containing all relevant documentation (including past projects, GitHub &amp; stackoverflow links, etc) and we will get in touch soon.<p>To apply: <a href=\"https:&#x2F;&#x2F;uberall.com&#x2F;en&#x2F;careers#dev?postingId=mp0h4nd\" rel=\"nofollow\">https:&#x2F;&#x2F;uberall.com&#x2F;en&#x2F;careers#dev?postingId=mp0h4nd</a> or send an email to hello@uberall.com.","time":1443715536,"type":"comment"}