{"by":"PhantomPhreak","id":10315784,"parent":10311580,"text":"Symbiont - New York - <a href=\"http:&#x2F;&#x2F;symbiont.io\" rel=\"nofollow\">http:&#x2F;&#x2F;symbiont.io</a><p>We are a venture-backed, New York-based startup that is using distributed systems and blockchain technology to revolutionize financial markets.<p>We are looking for intelligent and passionate self-starters. We are attempting to set a new standard for enterprise software in finance, and so our team members must be creative and able to think for themselves, while simultaneously able to take business requirements, and implement them according to specification.<p>On the frontend, we use React and Redux, and the backend is written in Python and Tornado. We don&#x27;t expect you to be familiar with our tech stack when you join, but you must be able to pick up new programming languages and frameworks quickly.<p>We offer competitive salary, plus equity and benefits. Applicants must live in the New York area, but work schedules are flexible. Symbiont&#x27;s investors include high-profile angels, institutions and companies in finance.<p>Although we are a new company, we have already attracted significant investor interest and press coverage, and our founding team has a history of pioneering in the cryptocurrency space.<p>By joining Symbiont, you have the opportunity to become an integral team member of a project to revolutionize modern finance, as well as the ability to help to define truly cutting-edge technology.<p>Full job descriptions for all positions: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;symbiont&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;symbiont&#x2F;jobs</a><p>[1] <a href=\"http:&#x2F;&#x2F;counterparty.io\" rel=\"nofollow\">http:&#x2F;&#x2F;counterparty.io</a><p>[2] <a href=\"http:&#x2F;&#x2F;www.ft.com&#x2F;intl&#x2F;cms&#x2F;s&#x2F;0&#x2F;0823a136-0ead-11e5-9ae0-00144feabdc0.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ft.com&#x2F;intl&#x2F;cms&#x2F;s&#x2F;0&#x2F;0823a136-0ead-11e5-9ae0-00144...</a><p>[3] <a href=\"http:&#x2F;&#x2F;www.bloomberg.com&#x2F;news&#x2F;articles&#x2F;2015-08-04&#x2F;wall-street-meet-block-368396-the-possible-future-of-finance\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bloomberg.com&#x2F;news&#x2F;articles&#x2F;2015-08-04&#x2F;wall-stree...</a><p>[4] <a href=\"http:&#x2F;&#x2F;in.reuters.com&#x2F;article&#x2F;2015&#x2F;06&#x2F;09&#x2F;symbiont-blockchain-idINL1N0YV1CF20150609\" rel=\"nofollow\">http:&#x2F;&#x2F;in.reuters.com&#x2F;article&#x2F;2015&#x2F;06&#x2F;09&#x2F;symbiont-blockchain...</a>","time":1443745232,"type":"comment"}