{"by":"jnnybazookatone","id":10318682,"parent":10311580,"text":"NASA Astrophysics Data System | <a href=\"http:&#x2F;&#x2F;ads.harvard.edu&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;ads.harvard.edu&#x2F;</a> | Cambridge, USA | Onsite | Full-time<p>The NASA Astrophysics Data System (ADS) Project is looking for a highly-motivated full-stack developer interested in joining a dynamic team of talented individuals working on our digital library system.<p>The ADS is currently launching a highly scalable and feature-rich platform using a modern development stack: a custom build of the open-source search engine Solr, a highly responsive UI engineered on top of backbone.js, a scalable asynchronous data ingestion pipeline with RabbitMQ and MongoDB, and cloud-based hosting of its services with Amazon Web Services. Our primary programming languages are Python, Java, and Javascript. Your primary responsibility is the design and development of robust software applications and components to support the ADS services, in particular the ADS data processing pipeline as well as its user notification service.<p>Required skills: Solid knowledge of python and the Linux OS. Knowledge of javascript and its ecosystem (jQuery, backbone.js, D3.js). Knowledge of Java or C++. Knowledge of web standards and technologies such as HTML, CSS, JSON, XML, XSLT. Knowledge of relational and document databases such as MySQL and MongoDB. Knowledge of distributed version control and software management systems, in particular git &#x2F; github.<p>Knowledge of text or data mining principles, familiarity with machine learning and information extraction techniques, knowledge of semantic computing technologies and techniques, and knowledge of asynchronous messaging queues are desirable.<p><a href=\"http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;98845&#x2F;it-specialist-smithsonian-astrophysical\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;98845&#x2F;it-specialist-sm...</a>","time":1443795526,"type":"comment"}