{"by":"jacques_chester","id":10311637,"kids":[10313734],"parent":10311580,"text":"Pivotla Labs | ONSITE in NYC, SF and many other locations | Engineers, Designers, Product Managers, Data Scientists | Visa and relocation assistance<p>Pivotal Labs is a division of Pivotal Inc.<p>We look for aptitude over APIs. It doesn&#x27;t matter wether your resumé says PHP or PhD: if you&#x27;re smart, know some stuff and have empathy, we want to work with you.<p>Labs helps clients to become better at development. For engineering we are religiously lean and agile -- in practice that means we pair program and TDD every line of code from the outside. Our product managers are fantastic at keeping products sharply focused, our designers are masters from users to pixels. We have a growing data science practice, and some engagements include all four roles.<p>Our NYC office is growing fast to meet exploding demand for Labs, Cloud Foundry and Big Data Suite.<p>We are also hiring in all our offices, including new offices: SF, Los Angeles, Seattle, Boulder, Denver, Chicago, Boston, Washington DC, Toronto, London, Dublin, Berlin, Tokyo and Sydney.<p>We provide visa and relocation assistance. In the NYC office we have about 15 people from overseas, including Australians like me.<p>At the office we have free breakfast, weekly tech talks, good benefits and competitive pay. Ping pong is not mandatory, but it&#x27;s popular. I think west-coast ping pong is harder to beat, but east-coast style is more entertaining to watch. The beer fridge has more IPA than I prefer but I guess that&#x27;s life in paradise.<p>My time at Pivotal, in both Labs and CF, is the best job I&#x27;ve ever had -- I&#x27;ve learnt more here than anywhere else. Everyone is smart and fun to work with.<p>You can apply through our website: <a href=\"http:&#x2F;&#x2F;pivotal.io&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;pivotal.io&#x2F;careers</a>.  You can also email me at jchester@pivotal.io to answer any questions you might have and potentially help me score one of our generous referral bonuses.<p>Please note that emailing me confers no particular advantage over applying directly and I might not refer you. As a consultant I can only reply to emails during non-billable hours, I hope that&#x27;s OK.<p>I also posted an ad for Cloud Foundry: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=10311634\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=10311634</a>","time":1443712016,"type":"comment"}