{"by":"chrisballinger","id":10313909,"parent":10311580,"text":"ChatSecure | Berkeley, CA | East Bay or SF Preferred, Remote Negotiable | Contract Only (Interns OK)<p>Want to get paid to write free and open source privacy &amp; security software?<p>ChatSecure is a free and open source encrypted messenger for iOS and Android that supports XMPP, OTR, Tor, SQLCipher, TLS certificate pinning, and more. We are NOT funded by VC, and instead have been grant funded since 2012 by the following awesome organizations: The Guardian Project, OpenITP, Rights Action Lab, and the Open Technology Fund. For more information see <a href=\"https:&#x2F;&#x2F;chatsecure.org\" rel=\"nofollow\">https:&#x2F;&#x2F;chatsecure.org</a><p>In the upcoming months we will be hiring mobile, frontend, and backend developers with some or all of the following qualifications:<p>* iOS: Objective-C, Swift, C, AutoLayout, Storyboards, CocoaPods, iPad, Cocoa, Mac UI, XCTest, an app in the App Store<p>* Android: Android 4.0 SDK and higher, Android NDK, Java, C, Android Studio, Gradle, JUnit, an app in the Play Store<p>* Frontend: HTML5, CSS, JavaScript, Bootstrap, Jekyll, Angular, React, Ember, your own website<p>* Backend: Python, Django, Ubuntu, Go, Rust, Docker, your own API<p>* General Programming: data structures, flow control, POSIX, standard stuff. Experience with Test Driven Development would be nice.<p>* Security: Some basic knowledge of cryptography is a must, but don&#x27;t stress about the advanced stuff. You must have experience with modern secure &#x2F; defensive coding practices, familiar with common vulnerabilites in native code, identifying potential areas of concern, surface area analysis, etc.<p>* Open Source contributions are highly recommended: individual projects, larger projects, pull requests, bug reports, QA, documentation, modular coding practices, semantic versioning, Travis-CI, GitHub, git. Know how to find the best existing open source libraries that solve a need. Be able to quickly assess a library&#x27;s code quality and general maintenance health compared to similar projects. Know when to just rewrite it from scratch instead. Know how to properly publish your new open source library.<p>* Freelance Contrators Only: Sorry, there are currently no full time or permanent positions. If you&#x27;re looking for that steady 9-5 you really should be looking somewhere else, because this ain&#x27;t it. Fortunately Obamacare has made buying individual health insurance a lot better for us freelancers.<p>* Equal Opportunity: We do not discriminate based on race, color, sex, religion, national origin, age, disability, sexual orientation, genetic information, reprisal, socioeconomic class, radical political beliefs, tattoos, hair color, clothing style, or otherwise.<p>* Berkeley, CA: East Bay or SF preferred. Remote may be negotiable though!<p>For people who might be a good match for this position, but would prefer full time employment (and can commute to San Francisco), check out moxie&#x27;s Open Whisper Systems hiring post elsewhere in this thread. They are also hiring iOS, Android, and mobile UI designers.<p>If this seems like your jam.. awesome! Hit me up at chris@chatsecure.org with a subject like &quot;ChatSecure iOS Job from HN&quot;, a link to your GitHub profile, and a short introduction. No recruiters.","time":1443727216,"type":"comment"}