{"by":"samsolomon","id":10312320,"parent":10311580,"text":"SidePrize &#x2F; Atlanta, GA or REMOTE &#x2F; Software Engineer<p><a href=\"https:&#x2F;&#x2F;sideprize.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;sideprize.com&#x2F;</a><p>SidePrize sits between traditional fantasy and daily fantasy sports. You can think of us as a bridge between the two. We partner with fantasy sports platforms and integrate with leagues to provide additional game types, real-money contests and payments.<p>We’re looking for a seinor-level engineer to become the fourth member of our engineering team. Our application is built on Rails and JS. The challenge at hand is building a solid integrations with our partners using a combination of APIs and scraping, while creating new game types for fantasy players.<p>Required:<p>* Experience writing and maintaining web applications, specifically back-end (server-side).<p>* Experience with the Ruby programming language and&#x2F;or the Ruby on Rails web application framework.<p>* Great writing and communication skills. One or more members is often remote, being able to communicate by writing is of critical importance.<p>* Good requirement-gathering skills. Starting with a problem and working from there to understand how the problem can be solved is a valuable skill.<p>* A strong interest in sports.<p>Preferred:<p>* Experience maintaining the front-end of web applications (HTML&#x2F;SASS&#x2F;JavaScript).<p>* A strong interest in fantasy sports and sports statistics.<p>* Experience building fantasy sports or sport tracking applications.<p>We were crowned as one of the most promising startups in the fantasy sports space—winning two of two awards handed out by the Fantasy Sports Trade Association and are currently part of the Los Angeles Dodgers Accelerator.<p>Both fantasy sports and mobile payments were crowned as two of the 10 hottest industries for 2015—we operate in both. Plus, we’ve got a solid team with a proven CEO at the helm. If you’re interested in statistics, technology or sports, there isn’t a better opportunity than SidePrize.<p>Think this might be for you? Send an email to tareq@sideprize.com.","time":1443716695,"type":"comment"}