{"by":"mattdiam","id":10316077,"parent":10311580,"text":"MyDiamond (C.G. Diam Corp) | Toronto, Canada | Head of Engineering | ONSITE | Equity Compensation | Email matt@mydiamondrevolution.com<p>Hey HN, send us an email for more details or so that we can answer any questions you may have!<p>---<p>Head of Engineering\n<a href=\"https:&#x2F;&#x2F;angel.co&#x2F;mydiamond&#x2F;jobs&#x2F;88575-head-of-engineering\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;mydiamond&#x2F;jobs&#x2F;88575-head-of-engineering</a><p>JOB DESCRIPTION<p>As the Head of Engineering Co-Founder you will have the opportunity to lead the technology strategy and development of our digital product. Working with a sales focused Co-Founder wearing past experience in the diamond industry, and another product-driven Co-Founder that has 10+ years of design experience working on digital products reaching millions of users, you will be collaborating with other focused entrepreneurs.<p>We are building a better way to shop for diamonds nearby through an online platform (web and mobile app) that lists local diamonds for viewing by appointment, leading to an offline purchase experience that is lacking for our target market that is forced to buy directly online with competing services.<p>The existing market for diamond purchasing relies on online purchase in which the consumer doesn&#x27;t get to experience the diamond before buying, leading to a deal that isn&#x27;t as good as presented; or, they are forced to shop store-to-store in person with little visibility into competitive pricing - a major reason they look online in the first place. However, we come in by creating friendly competition between local retailers, with the convenience of online shopping and the engagement of social sharing, including education of the consumer along the way.<p>We&#x27;ve already started generating interest with the launch of our early-access landing page: \n<a href=\"http:&#x2F;&#x2F;www.mydiamondrevolution.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mydiamondrevolution.com</a><p>---<p>SKILLS<p>HTML, CSS, MySQL, Node.js, Web Applications, Angular.JS, Amazon Web Services (AWS)<p>COMPENSATION<p>15.0% – 20.0% Equity<p>Email: matt@mydiamondrevolution.com","time":1443749782,"type":"comment"}