{"by":"Proj_Applecart","id":10318978,"parent":10311580,"text":"Applecart | New York, NY | On-site | Full-time<p>Applecart is a political technology start-up that deploys proprietary technology to enable its clients to run smarter national and statewide political, issue-based advocacy, nonprofit, and commercial campaigns. Part high-level strategic consultant, part cutting edge data R+D lab, Applecart only offers solutions that can be proven to work through innovation, experimentation, and objective data. Our roots are in politics, where we have tested and honed our methodologies at the largest scales possible. Applecart brings the urgency, efficiency, and ingenuity of a political campaign to campaigns and large commercial and nonprofit organizations alike.<p>Applecart works with some of the nation’s most prominent political organizations and corporations to activate and communicate with key target audiences at a scale and level of efficacy previously thought to be impossible. After two years of development, Applecart debuted its groundbreaking mobilization technology in the 2014 Primary Cycle, where it ended up producing the largest recorded voter turnout increase in U.S. history. In the 2014 General Election, Applecart’s efforts returned a 100% win-rate in races where Applecart was engaged, yielding unexpected, decisive victories for Gubernatorial, Senatorial, and Congressional candidates in several of the cycle’s most competitive races.<p>Applecart’s work has been featured by The Colbert Report, CNN, The Washington Post, The Associated Press, USA Today, The Huffington Post, among other prominent news outlets.<p>We are hiring for various positions in NYC.  We are currently looking for candidates to fill the following roles: Political Product Manager, Business Product Manager, Data Scientist, Senior Data Scientist, Senior Python Engineer, and Product Research and Development Intern.<p>For more information, or to apply, please visit: <a href=\"https:&#x2F;&#x2F;applecart.catsone.com&#x2F;careers&#x2F;index.php?m=portal&amp;portalID=47822\" rel=\"nofollow\">https:&#x2F;&#x2F;applecart.catsone.com&#x2F;careers&#x2F;index.php?m=portal&amp;por...</a>","time":1443798202,"type":"comment"}