{"by":"DLarsen","id":10312226,"parent":10311580,"text":"Connexity - Camarillo, CA (Los Angeles area) | on-site | <a href=\"http:&#x2F;&#x2F;connexity.com\" rel=\"nofollow\">http:&#x2F;&#x2F;connexity.com</a><p>Are you interested in learning advertising tech from the inside out?  (Yes, I know ad-blocking is all the rage these days.  Come be part of the solutions by enabling sensible display ads.)  We&#x27;re looking for a savvy individual who takes their personal development seriously and seeks to make a huge impact.<p>You&#x27;ll be working alongside a tight, driven team right in the heart of the profit center. Our division of Connexity works in online display advertising (aka &quot;banner ads&quot;) through real time bidding, and we run 50 to 100 million impressions each day. Our total transaction volume is between 5 and 10 billion per day, and I&#x27;d bet you a burger we&#x27;ve served ads on nearly every site you&#x27;ve ever visited.<p>#About Connexity:<p>Our team is sharp and works well together. We enjoy perks such as daily paid lunch, a 9&#x2F;80 schedule (to get every other Friday off) and unconstrained vacation; the culture of our team recognizes and respects the importance of your non-work life. Also, Ventura county is a pretty nice place to live&#x2F;work (unless you hate temperate coastal weather). If you&#x27;ve got Rails or other relevant web app experience, that&#x27;s a good start. More importantly, you&#x27;ll be eager to learn display advertising inside and out. Attitude, ambition and sound judgement trump experience with a specific set of tools.<p>We&#x27;re a small team within a medium-sized organization, and we work hard to keep the small-team vibe while availing ourselves of the best bits from the mother ship.<p>#Position 1: Rails + exposure to Scala, Hbase &amp; Kafka<p>We need someone to contribute to our Ruby on Rails app. It&#x27;s used to administer hundreds of advertising campaigns across hundreds of publisher sites. It&#x27;s not just boring CRUD. It provides a ton of control and insight to the team that operates our clients&#x27; campaigns; it&#x27;s truly the heart of our display advertising business. The business folks will know you, and you&#x27;ll find that excellence will stir up a tremendous amount of appreciation for your work.\nThis role is a great way to learn advertising tech at scale as well as other tools. In addition to Rails work, you&#x27;d get hands on experience with Redis, Hbase, PostgreSQL, R and Scala. Several on the current team started in the Rails app and have moved into other areas of interest (low-latency RTB bidder written in C, sophisticated reporting pipelines or novel optimization algorithms).<p>#Position 2: Data Savvy, Impeccably Responsible<p>We need someone to help our Data Science team operations. You&#x27;ll help us maintain and activate various data-driven ad targeting. For example, a client may provide us a billion records which we need to analyze and transform into an audience segment. This isn&#x27;t a software engineering position, but you&#x27;ll want to be (or learn to be) pretty capable at the command line, and able to work with Python&#x2F;Bash or other scripting languages. More than anything, we want someone who can maintain order among various client-facing tasks. On paper, we have a neat structured process; in reality, we need someone with sound judgement and above-average clarity of thought and word to help drive us forward. If you like combing through data in Excel, R or similar, this might be a great fit. If you&#x27;ve wanted the opportunity to get your hands on large amounts of data from an analysis or management perspective, please reach out to us.<p>-- Unless you prefer to start with a HR-oriented chat, you can reach me (a lead engineer on the team) at david.larsen@connexity.com.","time":1443716211,"type":"comment"}