{"by":"anthony_juvo","id":10312406,"parent":10311580,"text":"Juvo | San Francisco, CA (ONSITE)<p>Juvo is hiring Android and Backend developers in San Francisco. Please get in touch with me at anthony@juvo.com if you&#x27;re interested.<p>--- About Juvo<p>Billions of people around the world lack access to credit or banking services, two foundational concepts of financial security. They do, however, have access to a technology that can connect them to the world’s economy: a mobile phone. As smartphones become cheaper, historically underserved populations now have the opportunity to access world-class services through rich app experiences from virtually anywhere in the world.<p>Juvo partners with mobile operators around the world to offer access to credit and financial services via their everyday interactions with their mobile services. We are leveraging the rapid adoption of smartphones around the world to reimagine the way that consumers purchase prepaid mobile service and to address the challenges of financial inclusion.<p>Just 8 months since launching, we have processed over 8 million transactions in 8 countries for more than 2 million customers and are quickly expanding around the globe.<p>Our team of 15 is based in San Francisco, and made up of startup and telecom veterans who have played key roles at companies like Flixster, Rdio, HTC, Boku, and Virgin Mobile. We are well-funded by top-tier angels and VCs including Wing Venture Capital and Freestyle Capital.<p>--- Android<p>We are looking for talented Android engineers to work on our suite of applications. You will design and build applications from the ground up. Because of our focus on emerging markets, Juvo is an Android-first engineering department.<p>--- Backend<p>We are looking for talented backend engineers to work on the infrastructure that supports our applications and services. You will have an immediate impact on our decisions around architecture, technology, and scalability.","time":1443717196,"type":"comment"}