{"by":"Firepoint","id":10316135,"parent":10311580,"text":"Denver, CO | Senior UI&#x2F;UX | Full Time | ONSITE | Firepoint Solutions<p>Senior User Experience and Interface Designer (UX &#x2F; UI)<p>Company Information\nFirepoint is a quickly growing, energetic, investor-backed start-up company that is full of talented and fun people. We help residential real estate teams and agents to manage and generate business more effectively through sleek, intuitive, and well-designed web applications.<p>Job Description\nAt Firepoint, we emphasize great user experiences with beautiful and clean design as the most important part of well-designed software. Because of this, your ability to design excellent user experiences is crucial to the success of our product and company. Being able to think creatively, empathize with user’s needs, and make decisions is crucial.<p>As Senior User Experience and Interface (UX&#x2F;UI) Designer, your primary responsibility will be to understand the complex needs of users and product owners and translate them into a vision and design that is intuitive and delightful.<p>You will collaborate primarily with other Designers and the Product Owner to design mockups, wireframes, and&#x2F;or prototypes, then translate your concepts into real frontend code that backend developers can hook up. Once you’re done coding, you will write or explain how to implement the frontend code you’ve written to Backend Developers, so detail-orientation and strong communication skills are a must. UI or UX related questions related to your designs will naturally come up during the course of development, and you’ll be the one to address them.<p>Once the feature is usable, you will have the opportunity to conduct experiments and assess user feedback to ensure it meets their needs in an enjoyable way.<p>There is exceptional opportunity for growth and leadership within the organization.<p>Please view the full job description before applying on either of these sites: \n<a href=\"https:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;97944&#x2F;senior-user-experience-and-interface-designer-ux-firepoint\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;97944&#x2F;senior-user-exp...</a>\n<a href=\"http:&#x2F;&#x2F;denver.craigslist.org&#x2F;web&#x2F;5223773073.html\" rel=\"nofollow\">http:&#x2F;&#x2F;denver.craigslist.org&#x2F;web&#x2F;5223773073.html</a><p>To apply, please email info@firepoint.net and include a portfolio of wireframes, prototypes, and&#x2F;or pages you have designed and&#x2F;or coded.","time":1443750685,"type":"comment"}