{"by":"cleblanc","id":10312558,"parent":10311580,"text":"Arthrex Inc. | Naples, FL | Fulltime | Remote&#x2F;Onsite<p>Software Developer<p>----------------------------<p>We are looking for developers with either web or mobile experience to join our growing team in southwest Florida. Arthrex is a global medical device company and a leader in new product development and medical education in orthopaedics. As the software development team, we create innovative products to help support the company in education and research opportunities for our customers. Some projects that need immediate assistance include:<p>- Our main company website that serves as an education portal for our customers with tools and resources on our products<p>- A research registry that is being used by surgeons to track their patient&#x27;s progress both pre and post surgery<p>- Several innovative mobile applications that further educate surgeons on best practices and new techniques<p>Some of the technologies&#x2F;patterns we work with:<p>- Ruby&#x2F;Rails, Golang, Objective-C, Xamarin&#x2F;C#<p>- Amazon Web Services<p>- Postgres<p>- Microservices<p>Devops Engineer<p>----------------------------<p>We are looking for an experienced DevOps engineer to join our team and take ownership over of multiple production deployments and supporting services across our deployment such as our centralized logging service, or our Icinga setup.<p>- Experience with AWS services namely VPC &amp; Cloudformation required.<p>- Hands on experience developing, deploying, and maintaining Rails &amp; Go Apps required.<p>- Experience with Puppet is required.<p>Please cleblanc at arthrex.com or dbeard at arthrex.com if you have any questions or interest!<p>Arthrex was voted one for the top 100 places to work in 2015! Read more here: <a href=\"http:&#x2F;&#x2F;fortune.com&#x2F;best-companies&#x2F;arthrex-94&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;fortune.com&#x2F;best-companies&#x2F;arthrex-94&#x2F;</a>","time":1443718245,"type":"comment"}