{"by":"qntmfred","id":10313135,"parent":10311580,"text":"Kaplan Test Prep | New York | Onsite - Cloud Operations Lead<p>Kaplan Test Prep is a market leader in test preparation, we serve college students and young professionals studying for the MCAT (medical school), GMAT (business school), LSAT (law school), GRE (Master&#x27;s and PhD programs), and SAT exams. Our organization is entrepreneurial, growth-oriented, and energetic. Our team genuinely enjoys what they do and take pride in it. If you want a challenging, exciting, and creative engineering role -- while working with talented and passionate people -- consider applying for one of our roles.<p>We’re looking for a Cloud Operations Team Lead who can partner with our engineers to deliver game-changing solutions for our business needs. The pace is fast and you’ll make sure it stays that way, but that doesn’t ever mean compromising on integrity, so you’ll also be incredibly keen to protect the quality of service and business value.<p>You’ll need:<p>- Experience leading teams of Unix, Windows and Database engineers who design, build and support complex business critical systems<p>- A flair for the design and engineering of innovative technical solutions<p>- To enjoy collaborating with other technical leaders to design systems<p>- Continuously improve our infrastructure to be easily deployable, scalable, secure and fault-tolerant.<p>- Experience in the design and building of strong and functional continuous integration and deployment pipelines (e.g.: Teamcity, Jenkins, etc.)<p>- Proven experience working with configuration management systems such as Ansible, Chef or Puppet, or has built similar tools that don&#x27;t yet exist<p>- To understand the importance of monitoring and metrics and has used tools such as Nagios, Zabbix, New Relic, Appdynamics etc.<p>- To be comfortable working with Microservices and distributed systems<p>- Team player with strong interpersonal, written and verbal communication skills.<p>- Experience of running production systems in cloud based infrastructures, preferably AWS<p>You believe in:<p>- DevOps is a mindset. DevOps is devs and ops working together. DevOps is a way of organizing. DevOps is continuous learning.<p>- Automate Infrastructure as code<p>- Agile, lean and rugged<p>- Fail early, fail often<p>- Simplicity is better than complexity<p>- Resilience, Robustness, Antifragility<p>- Deploy smaller changes more frequently<p>- Measure everything (people, process and performance metrics)<p><a href=\"http:&#x2F;&#x2F;www.kaplan.com&#x2F;careers-at-kaplan&#x2F;our-culture&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.kaplan.com&#x2F;careers-at-kaplan&#x2F;our-culture&#x2F;</a> or find me on twitter @kenwarner","time":1443722372,"type":"comment"}