{"by":"tow21","id":10312336,"parent":10311580,"text":"Progressive Media International | London, UK | ONSITE | Senior PHP Developer<p>Part of the Progressive Media Group, PMI is a division which runs a suite of magazine and media websites with global reach, including high profile UK political websites such as the New Statesman (www.newstatesman.com). Following several major site relaunches recently (one of which won a Web User UK award), we&#x27;re seeing rapid audience growth, and we&#x27;re positioning ourselves with ambitious plans for development and growth through 2016 and beyond.<p>We need a senior PHP developer to come on board to develop and manage our team of UK and overseas developers. Your task will be to manage the software team (onshore &amp; offshore); drive architectural decisions, and set the technical strategy for the division.<p>You&#x27;ll report to, and work closely with the Commercial Director; you&#x27;ll need to be able to lead projects effectively and communicate well to stakeholders, and have a good sense of the ways in which technology can support the business.<p>You&#x27;ll also need a solid technical background to deal with the issues of driving and supporting growth in media websites at substantial scale; and you&#x27;ll work with other technology departments throughout the broader group.<p>Technical skills<p><pre><code>  * Significant expertise in both Wordpress and Drupal frameworks\n  * Proven experience in building and modifying custom modules in both frameworks\n  * Strong frontend development skills; HTML&#x2F;JS&#x2F;CSS\n  * Understanding of performance characteristics of media sites, frontend and backend.\n  * Comfortable with distributed version control (git)\n  * Comfortable with modern development practices.\n</code></pre>\nYou should also have<p><pre><code>  * A track record of delivering successful projects around high traffic media sites\n  * Good communication skills\n  * A good appreciation for website UI and UX principles.\n  * Organizational and management skills\n  * A keen interest in politics and current affairs\n</code></pre>\nPlease get in contact at tech-jobs@progressivecapital.ventures with a CV, cover letter, and pointers to any open source work and&#x2F;or sites you&#x27;ve worked on previously.","time":1443716792,"type":"comment"}