{"by":"PieSquared","id":10312289,"parent":10311580,"text":"Karius | Menlo Park, CA | ONSITE, Full-time | Software (Full Stack)<p>We are a team of crazy biologists, engineers, data scientists and clinicians on a mission to change forever the way infectious diseases are diagnosed and treated. We face incredibly interesting challenges in software engineering, machine learning and molecular biology, as we push the limits of diagnostics and genomic technologies.<p>We&#x27;re hiring software engineers across the board to help us with infrastructure, backend, frontend, and webdev. Join us on the ground-level for this exciting journey to shape our technology, product and company culture.\nIf you&#x27;re an engineer who&#x27;s willing to learn about biological problems, or have experience in next-generation sequencing, feel free to contact me directly: agibiansky@kariusdx.com<p>Some of the things we’re looking for in people (not all required):<p>• Comfortable and familiar with both backend and frontend technologies<p>• Able to glide across the stack as needed<p>• Algorithms development background and strong understanding of practical implementation issues<p>• Development experience on mobile, especially iOS<p>Potential responsibilities:<p>• Designing and implementing robust and scalable compute infrastructure on top of AWS<p>• Creating pipelines for analyzing, storing and visualizing complex genomic data.<p>• Creating robust and beautiful user interfaces to our customers and lab biologists.<p>We want you to have strong opinions -- backed by proven experience -- on how good systems should be built, as well as the ability and desire to roll up your sleeves and build them yourself. We are a lean, ‘Navy Seal’ team and looking for someone with a similar mentality to join us on our mission. We are looking for someone who is excited by the challenge of conceiving, architecting, and most importantly, implementing the infrastructure we’ll need to enable lightning fast diagnosis pipelines at scale, as well as large scale data analysis on complex genomic data.","time":1443716538,"type":"comment"}