{"by":"binaryryan","id":10314905,"parent":10311580,"text":"Mystery Tackle Box | Full-Stack Web Developer (C# .NET) | Chicago&#x2F;Evanston, IL | FULL-TIME, ONSITE, RELOCATION<p>Mystery Tackle Box is the leading subscription commerce startup in the $45 billion&#x2F;yr fishing industry. We are looking to change the way people purchase products for America’s #1 sport! Our team is founded by seasoned entrepreneurs and startup founders. If you are a passionate developer looking to create something impactful, then we would love to speak with you. A passion for fishing and the outdoors is a huge plus!<p>This is a great opportunity at an early-stage startup that is growing fast.<p>Work very closely with the technical co-founder&#x2F;CTO to...<p><pre><code>  - Design, code, implement, and support key line-of-business applications and third-party integrations.\n  - Establish the development process and build a small team of developers.\n  - Collaborate with a team of people who have successfully built and sold previous companies.\n</code></pre>\nTechnical Requirements<p><pre><code>  - At least three years of software development experience on public-facing web applications.\n  - An in-depth understanding of the Microsoft web application stack: C#, .NET Framework, ASP.NET MVC, Web API, and Microsoft SQL Server.\n  - Strong skills in database architecture, efficient indexing and ad hoc queries.\n  - Experience with a Javascript MVC&#x2F;MVVM framework such as Angular, Ember, Backbone, et al; or a view-only framework like ReactJS\n  - Experience developing for distributed systems, microservices, message queues (RabbitMQ, Amazon SQS), caching (Redis), and web sockets (SignalR)\n  - Mastery of HTML&#x2F;CSS&#x2F;Javascript. These should be second nature.\n  - Familiar with one or more HTML, CSS, and JS frameworks; preferably Bootstrap\n  - Able to effectively use source control systems and workflows in a small team environment; preferably Git and Gitflow.\n  - Familiar with Agile software development methodologies\n  - Can write quality unit tests and perform integration testing\n</code></pre>\nMystery Tackle Box is based in downtown Evanston with easy access from all major public transportation systems. The Davis stop on the purple line is a block away.<p>For more information or submit your resume: <a href=\"https:&#x2F;&#x2F;app.betterinterviews.com&#x2F;careers&#x2F;MysteryTackleBox&#x2F;vacancies&#x2F;10811\" rel=\"nofollow\">https:&#x2F;&#x2F;app.betterinterviews.com&#x2F;careers&#x2F;MysteryTackleBox&#x2F;va...</a>","time":1443735238,"type":"comment"}