{"by":"jonbischke","id":10314991,"parent":10311580,"text":"Entelo - San Francisco (SOMA), CA - Full-time - <a href=\"http:&#x2F;&#x2F;www.entelo.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.entelo.com&#x2F;</a> ; ONSITE only, no remote at the moment.<p>Our mission is to help organizations build diverse, cohesive and better teams. We&#x27;ve been building a variety of hiring solutions to help companies like Facebook, Salesforce, Zenefits and Lyft leverage the wealth of information online to find amazing prospective employees and make better hiring decisions. The sales and marketing worlds have many solutions that enable them to be more efficient and productive and it is our belief that we can adapt the best that sales and marketers have to recruiting&#x2F;talent departments.<p>We&#x27;re currently looking for a variety of positions including:<p>-Sr. Backend Engineer&#x2F;Architect: Our backend team deals with crawling, parsing, normalization and aggregation of hundreds of millions of social profiles (i.e. Linkedin, Github, Twitter) and use complex algorithmic and statistical methods to match disparate social profiles. We use a Java&#x2F;Postgres architecture for the backend and have dabbled with using Go.<p>-Lead Data Engineer: We&#x27;re looking for someone to help us continue to build out our analytics framework for prediction of when people are most likely to be looking for a new opportunity. We use Amazon Redshift for data warehousing but are open to those that have extensive experience with &quot;big data&quot; stacks (Hadoop, Spark, Storm, Kafka, etc.)<p>-DevOps Engineer: We&#x27;re looking for our first dedicated engineer to own DevOps for the long term. We take a software-centric (as opposed to an ops-centric) approach to DevOps, and have every engineer setup on PagerDuty in case something breaks in the middle of the night (hopefully we&#x27;ll avoid that!). We use a variety of modern technologies including Docker, AWS, Rails, ElasticSearch, Kubernetes and other tools such as New Relic, Loggly and PagerDuty.<p>If you&#x27;re interested in any of our open positions, you can reach out to me directly (I&#x27;m the founder) at jon at entelo dot com","time":1443735994,"type":"comment"}