{"by":"jacques_chester","id":10311634,"parent":10311580,"text":"Pivotal Cloud Foundry | ONSITE in SF, NYC, Boulder and many other locations | Engineers, Designers, Product Managers | Visa and relocation assistance<p>Pivotal Cloud Foundry is a division of Pivotal Inc.<p>We look for aptitude over APIs. It doesn&#x27;t matter wether your resumé says PHP or PhD: if you&#x27;re smart, know some stuff and have empathy, we want to work with you.<p>Cloud Foundry solves deployment and management. We&#x27;re the main contributors to CF. We&#x27;re expanding what is the leading opensource PaaS and our distribution has the fastest-growing sales of any opensource product ever. It&#x27;s also the only one I&#x27;d personally bet a company on -- except for integrated upstream code, every line is pair programmed and TDD&#x27;d. We dogfood the cutting edge of the technology on our own commercial public cloud (Pivotal Web Services). It works because we took the XP and Lean DNA of Pivotal Labs and scaled it up to build the best cloud platform bar none.<p>I spent 7 months on secondment to Cloud Foundry, coming across from Pivotal Labs, and it was awesome. Platforms of this scope and importance are created once in a generation, and I got to be part of it. You can too.<p>We provide visa and relocation assistance.<p>At the office we have free breakfast, weekly tech talks, good benefits and competitive pay. Ping pong is not mandatory, but it&#x27;s popular. I think west-coast ping pong is harder to beat, but east-coast style is more entertaining to watch. The beer fridge has more IPA than I prefer but I guess that&#x27;s life in paradise.<p>My time at Pivotal, in both Labs and CF, is the best job I&#x27;ve ever had -- I&#x27;ve learnt more here than anywhere else. Everyone is smart and fun to work with.<p>You can apply through our website: <a href=\"http:&#x2F;&#x2F;pivotal.io&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;pivotal.io&#x2F;careers</a>.  You can also email me at jchester@pivotal.io to answer any questions you might have and potentially help me score one of our generous referral bonuses.<p>Please note that emailing me confers no particular advantage over applying directly and I might not refer you. As a consultant I can only reply to emails during non-billable hours, I hope that&#x27;s OK.<p>I also posted an ad for Pivotal Labs: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=10311637\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=10311637</a>","time":1443711989,"type":"comment"}