{"by":"diafygi","id":10312315,"parent":10311580,"text":"Senior Python DevOps | <a href=\"https:&#x2F;&#x2F;UtilityAPI.com\" rel=\"nofollow\">https:&#x2F;&#x2F;UtilityAPI.com</a> | Oakland, CA | REMOTE | Solar Job<p>=Company Description=<p>We are a white-label SaaS that is used by solar and energy efficiency companies to collect their customer&#x27;s utility bill and usage data automatically. We write scripts that collect data from utilities, and these scripts can break unexpectedly when utilities change their interfaces, so being able to update them quickly is important. We recently got a large grant from the Department of Energy and closed a round of funding, so we have lots of runway. We are currently a team of six located downtown Oakland, and we are expanding rapidly.<p>=Job Description=<p>You will be helping test&#x2F;maintain&#x2F;monitor&#x2F;optimize&#x2F;scale the stack. Our current codebase is well organized, documented, and tested, and we will be adding compatibility for many new utilities over the next few years. We need to make sure our product stays top notch as we add utilities. You will have to visit Oakland periodically for all-hands meetings.<p>=Requirements=<p>* At least 6 years of Python stack and Linux devops experience<p>* Experienced with: AWS, django, celery, redis, postgres<p>* U.S. citizen or green card<p>=How To Apply=<p>Email me, Daniel Roesler, a cover letter and a PGP-encrypted pdf resume. Please include links to your github, bitbucket, or personal side project website (for reference, mine is daylightpirates.org).<p>=For Solar Skeptics=<p>In the last few years, the solar industry reached &quot;grid parity&quot;, which means that the unsubsidized installed cost is now cheaper than buying power from the grid. That&#x27;s why this industry is the fastest growing industry in the country. This isn&#x27;t some subsidy-dependent industry anymore. We work hard and we make real money (while conveniently also saving the planet).","time":1443716667,"type":"comment"}