{"by":"zer01","id":10315213,"parent":10311580,"text":"TL;DR: ThinAir | Backend&#x2F;Full-stack Developer (Python) | Palo Alto, CA | Full Time | On-site (with relocation!)<p>Greetings fellow HN perusers!<p>First off - I am not a recruiter. I&#x27;m the actual person (employee #5!) you&#x27;d be working with, and I&#x27;m looking for someone as driven and passionate about security as I am to come help us make a security product that <i>doesn&#x27;t</i> suck.<p>- Who am I -\nI built the backend here at ThinAir, but previously I worked on Palantir&#x27;s infosec team, as well as a bunch of open-source stuff (I&#x27;m the current maintainer of the Sulley Fuzzing Framework, I&#x27;ve contributed security fixes to ElasticSearch, as well as a few other things).<p>I love development and information security, so this was a natural marriage of roles for me. I get to build things I want, and change the future of data security at the same time! Groovy.<p>- What we do -\nWe&#x27;re ThinAir (<a href=\"https:&#x2F;&#x2F;thinair.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;thinair.com&#x2F;</a>), and we&#x27;re changing the (currently awful) data security landscape. We aim to solve the problem of breaches on both the large and small scales, with a good focus on usability from all sides (end user, admins, CSOs, etc). We don&#x27;t believe security products should be a game of &quot;select 2&quot; in the set of {real security, usability, stability}.<p>- What we need -\nWe&#x27;re looking for 1-2 more django peeps with decent security knowledge to come help me build out new features in our Django backend. Do you like self-documenting APIs and inception-like encrypted encryption keys? You&#x27;re probably who I&#x27;m looking for. Even if you aren&#x27;t exactly writing your own encryption algorithms, I still want to talk to you! Security is a mindset, not a finite set of knowledge.<p>- How to get in touch - \nI&#x27;m not going to make you submit your resume to a website. I just want to talk to you for 10-15 mins.<p>Email me (ryan@thinair.com) and we can arrange a time to talk - either in-person over coffee or over the phone.<p>Be prepared to answer one very simple question - &quot;What was the last cool thing you worked on, and why was it cool?&quot;<p>Cheers!\nRyan","time":1443738288,"type":"comment"}