{"by":"alexschiff","id":10333476,"parent":10311580,"text":"Occipital - Multiple Openings - San Francisco, CA or Boulder, CO (Full-time)<p>Interested in working with mobile devices for large scale SLAM?<p>Occipital is equal parts science lab and software startup, on a mission to bring spatial computing to everyday life. Last year, we launched Structure Sensor: (<a href=\"http:&#x2F;&#x2F;structure.io\" rel=\"nofollow\">http:&#x2F;&#x2F;structure.io</a>, <a href=\"http:&#x2F;&#x2F;kck.st&#x2F;16BkwuO\" rel=\"nofollow\">http:&#x2F;&#x2F;kck.st&#x2F;16BkwuO</a>). It was the first 3D sensor for mobile devices, and it was one of the top funded Kickstarter tech projects of all time. Today, Structure Sensor (and the associated Structure SDK) are reinventing the way people practice medicine, create visual effects for TV shows and movies, and much more.<p>We’re giving regular mobile devices a superpower — the power to capture and understand their real-world surroundings. Structure Sensor and SDK isn’t the first product we’ve launched: we’re also the company behind RedLaser (acquired by eBay) and 360 Panorama. We have a record of taking computer vision technology on the frontier of “possible,” and then being the first ones to make it consumer-ready on a smartphone or tablet. We know mobile.<p>We just announced our Series B from Intel Capital, Foundry Group, and Shea Ventures (<a href=\"http:&#x2F;&#x2F;techcrunch.com&#x2F;2015&#x2F;07&#x2F;29&#x2F;occipital-raises-13m-series-b-for-its-computer-vision-platform&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2015&#x2F;07&#x2F;29&#x2F;occipital-raises-13m-series...</a>), and we’re putting gas on the fire to accelerate.<p>Current openings:<p>* Computer Vision Engineer<p>* iOS Engineer<p>* Business Development Manager<p>* Electrical Engineer<p>* Developer Evangelist<p>* Firmware Engineer<p>If you’re interested, drop me a line at schiff@occipital.com. Make sure to include a fun fact about yourself, preferred Starcraft 2 race, or favorite so-bad-it’s-good movie.","time":1444067358,"type":"comment"}