{"by":"chollier","id":10376234,"parent":10311580,"text":"Quri : Senior &#x2F; Junior Javascript Developer<p>ONSITE San Francisco &#x2F; SoMa &#x2F; Interns &#x2F; Visa (we can do J1 for awesome profile)<p>ReactJS &#x2F; Flux &#x2F; Redux — We&#x27;re looking for someone interested in helping us improve our Customer Dashboard as well as the Internal Tools apps built with React. We use ES6, Babel Stage 0, we deploy daily and are not afraid to try out new stuff (the branch switching the app to Redux is almost ready !). You have experience with JS &#x2F; React development and want to apply that to your daily job ? Talk to us ! You&#x27;re just started with JS and Single Page Apps but are interested pursuing that gaining experience ? Talk to us as well we&#x27;re also recruiting Junior Devs !<p>Shoot me an email to loic@quri.com<p>About Quri :<p>We’re Transforming Retail Execution for the World’s Largest Manufacturers<p>Quri is transforming retail execution by providing real-time, store-level visibility into the performance of products and promotions in 150,000 retail locations across 6,000 cities. Partners like Procter &amp; Gamble, Heineken, Nest, Unilever, Kraft, Nestle, Coke, Kimberly Clark and 200 other global companies rely on us to unlock growth and increase the ROI of their $1 Trillion in trade spend and new product introductions annually. Quri is powered by an innovative combination of big data analytics fed through mobile technology used by our on-demand retail workforce. Today, Quri is the market leader in Retail Intelligence Technology providing the industry’s most innovative, easy-to-use solution for transforming retail execution to drive ROI.<p>We are growing rapidly and building a team to disrupt, win, and have fun doing it!<p>The team at Quri is small and experienced, but we are disrupting one of the world’s largest markets. We hire only the best talent, which means you’ll join a world-class team that you can both impact and learn from via a culture of meritocracy and teamwork. We encourage innovation and ownership in all our people, and have created a positive and happy environment for the best and brightest.","time":1444674858,"type":"comment"}