{"by":"AnkiJobs","id":10389928,"parent":10311580,"text":"Anki, Inc. is hiring!<p>LOCATION: San Francisco, CA\nPOSITION TITLE: Data Engineer (<a href=\"http:&#x2F;&#x2F;hire.jobvite.com&#x2F;CompanyJobs&#x2F;Careers.aspx?nl=1&amp;k=Job&amp;j=oiaT1fw6&amp;s=Website\" rel=\"nofollow\">http:&#x2F;&#x2F;hire.jobvite.com&#x2F;CompanyJobs&#x2F;Careers.aspx?nl=1&amp;k=Job&amp;...</a>)\nONSITE<p>We&#x27;re looking for a Data Engineer to oversee and expand the systems we use to store and analyze data on how people are using our products, as well as build out new systems to feed analytics data into our product, marketing, and operations systems. As a member of the analytics team, and as the primary analytics-focused engineer, you will develop and improve analytics infrastructure built on top of Anki’s existing big data capture systems (as well as expanding those our systems). We currently address data from product use, robotics performance, manufacturing, sales, marketing, web, and more. The infrastructure you work on will be used by data scientists to analyze product data, by the marketing team to feed product data into our marketing and customer engagement flows, and by other teams across the company to help Anki get more out of our data.<p>We are building a unique technology platform dedicated to the operation and real time optimization of the combination of mobile and physical games, robotics and artificial intelligence.  This is your chance to be part of gaming and robotics history!<p>Duties and Responsibilities\n<i>Create ETL pipelines across product, sales, marketing, and robotics data.\n</i>Own and expand Anki&#x27;s data warehouse infrastructure.\n<i>Work closely with the services and analytics teams on data collection infrastructure and data processing systems.\n</i>Create tools and systems to integrate product, sales, and marketing data with other tools (both internal and external) and allow easy access to multiple data sources.\n<i>Work closely with the larger engineering organization to create large analytics systems.\n</i>Work directly with Anki’s executive and management stakeholders to identify critical analytics needs at Anki, and provide systems to assist in answering core business questions.\n*Help us understand and shape the future of analytics architecture at Anki and the future of what Anki creates.<p>See more at <a href=\"https:&#x2F;&#x2F;anki.com&#x2F;en-us&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;anki.com&#x2F;en-us&#x2F;careers</a>.","time":1444861028,"type":"comment"}