{"by":"phs101","dead":true,"id":10392157,"parent":10311580,"text":"Senior Backend Developer (PHP &amp; JavaScript) at Retail Tech Startup<p>PocketHighStreet | London | www.pockethighstreet.com | Full Time | IN OFFICE<p>£42,000 - £60,000 + share options<p>We are a fast growing, funded start-up, based in the heart of Central London.<p>We are building a platform connecting the worlds of physical and digital retail, transforming the local shopping experience.<p>We’re looking for a skilled senior engineer to take a leadership role in our growing London development team. You’ll work alongside our CTO, implementing ideas to strategically drive our back-end system to the next level. You’ll be encouraged to engage closely with both tech and non-technical team members, support the business decision making process with technical expertise, and also be able to work independently.<p>We’re a technology-first company, and ideally you will have extensive experience in:<p>- Developing PHP applications using modern Composer-based libraries, and understanding of OO programming, functional programming and concurrency.<p>- JavaScript development, with modern backend (Node.js) and experience in any of the following frontend (Backbone, Angular, React) tools.<p>- Working with relational (PostgreSQL) and document database systems, using raw SQL and advanced concepts such as stored procedures, views, etc. Understanding of the performance and scalability implications of database code.<p>You’ll have 5+ years of software development experience. You should be able to demonstrate that you are able to write high-quality decoupled and maintainable code. You’ll have an understanding of software architecture and a track record in designing of complex service-oriented applications.<p>The role involves:<p>- Design and development of core APIs and backend services\n- Integrations with third-party enterprise systems.\n- Development of innovative shopping applications and experiences<p>For the full job spec and to find out all we can offer you please send your CV and a few words about yourself to ellena@pockethighstreet.com","time":1444901458,"type":"comment"}