{"by":"languagehacker","id":3300448,"parent":3300290,"text":"Bay Area (Burlingame): mid-level engineer. Our product is a highly configurable LAMP web application in the high-volume event management space. It's an end-to-end solution, from registration to check-in to reporting. There are also modules for exhibitor registration, session management, housing, and air travel.<p>Our technologies include the Zend Framework, Git, Jira, Hudson, and a highly-available MySQL replication solution. We use agile methodologies to support the product in two monthly maintenance releases, tightly paired to a sprint. If you're familiar with \"A Successful Git Branching Model\", you have a solid idea of how we pair sprints to releases. Our team is distributed between California and Virginia.<p>Some unusual selling points for our business:\n* Engineers spend roughly 10% of their total time traveling in support of events using the software. It's a fun opportunity to see new places, learn new things (we do a lot of major technology conferences), and get a lot of cool conference freebies.<p>* The business is <i>not</i> a startup; it's a small business. You can generally expect to go home on time every day. There is no \"sweat equity\" -- you get paid a fair market value for your time.<p>* We are on the federal holiday schedule. This generally allots a few more days off than your usual small business/startup.<p>* The product is currently fairly stable for the majority of its use cases. You'll have a lot of opportunity to work on enhancements and new features as you become more familiar with how it works.<p>* While we have a daily scrum meeting, we hold it in IRC. That means you have one less meeting to distract you from what you're doing every day, since you can work in parallel.<p>Feel free to check out <a href=\"http://www.aetherquest.com/\" rel=\"nofollow\">http://www.aetherquest.com/</a> to learn more about our company. If you're interested in applying or just have any questions, feel free to email me at relwell@ the domain above.","time":1322759768,"type":"comment"}