{"by":"pitdesi","id":3300501,"parent":3300290,"text":"FeeFighters<p>INTERN OR FULLTIME<p>Rails Developers or Intern (Chicago or Remote) and a Marketing Intern (Chicago only)<p><a href=\"http://feefighters.com\" rel=\"nofollow\">http://feefighters.com</a><p>Looking for a Rails developer. We’re a startup working like mad to disrupt a multi-billion dollar financial industry and cut out tens of thousands of inefficient middle-men. Customers include Fog Creek/Stack Exchange, Photojojo, Weebly, Kickstarter, Make a Wish Foundation, tons of awesome startups, and even some public companies! And... we're just getting started.<p>We recently launched a new product called Samurai into public beta. (<a href=\"http://samurai.feefighters.com\" rel=\"nofollow\">http://samurai.feefighters.com</a>) It's an all-in-one all-in-one solution for taking payments online. It has come out of the gate swinging - there is a ton of pent-up demand to fix this industry and we're excited at how many people have been interested in our new product. We have a few more tricks up our sleeve and need developers to help build them out!<p>We have passionate users, awesome investors and partners, and products that our customers love. We pay ourselves decent salaries, are generous with equity and we enjoy a very fun and stimulating work environment. Much of the Samurai dev team was early on in another payments startup that grew to be a $2Billion company (including the CIO of that company). Here are bios of some folks that you'll be working with: <a href=\"https://samurai.feefighters.com/about\" rel=\"nofollow\">https://samurai.feefighters.com/about</a>\nWe're still finishing up our job description - but here's a start. <a href=\"http://feefighters.com/jobs/rails-ninja-developer/\" rel=\"nofollow\">http://feefighters.com/jobs/rails-ninja-developer/</a><p>Email josh at feefighters with your interest.<p>Also looking for a marketing intern to help us with social media and PR. Lots of fun stuff! <a href=\"http://feefighters.com/jobs/kickass-marketing-intern/\" rel=\"nofollow\">http://feefighters.com/jobs/kickass-marketing-intern/</a>","time":1322760226,"type":"comment"}