{"by":"dabent","id":3300457,"kids":[3301982],"parent":3300290,"text":"Santa Monica, CA (Los Angeles area)<p>TRUECar.com - TrueCar shows consumers how much people actually paid for a particular new car in their area, then guides them to dealers we've certified.  When someone buys from a dealer we've sent them to, we get paid.  We already have solid revenues, are well funded and and are growing rapidly.  We need lots of technical talent to help us grow.<p>* JAVA - We are looking for talented Java developers and architects to design and build the technology used to power our production websites, APIs, widgets, and internal tools.  This is a chance for you to join a growing company and build something that's going  to scale to support millions of users/visitors and provide them with all kinds of data.<p>* Senior Systems Engineers - Got Linux?  Keep our 200+ servers going strong.<p>* Front End - HTML, CSS, JavaScript, etc.  Help build out our main site and our partner sites.<p>* QA engineers - More software, more bugs.  Help us find them.<p>* Statistician/Data Mining Specialist - We need bright people to help us develop statistical pricing models.  SAS/PROC SQL skills are needed.<p>* Python/Django - Our main site is in Django, which means we need serious talent to help it scale and expand as we continue to grow.  Plus, you'll get to work with me.<p>* We also have some non-technical openings for senior positions in marketing, customer retention, HR, finance and accounting.  Email me for details.<p>My story - moved from Atlanta all the way out to Santa Monica after stopping by the TrueCar booth at PyCon 2011.  I started here three month ago and love it.  I'm working with a great team that knows how to develop software and for management who seems to \"get it\" with regards to software developers.<p>The Python team in an open workspace that has a view of the ocean (<a href=\"http://picplz.com/user/dabent/pic/tpc4v/\" rel=\"nofollow\">http://picplz.com/user/dabent/pic/tpc4v/</a>), and all the Santa Monica offices are blocks from the beach.  They have great benefits, including company equity, 100% paid family medical, dental, vision, and a healthy 401k.  They also offer gym membership reimbursement ($50 a month), 12 holidays, career training, 3 weeks PTO and have a kitchen stocked with fruit, snacks and such.  I've honestly never had a job this good.<p>If you're interested, send me your resume.  My email is in my profile.","time":1322759818,"type":"comment"}