{"by":"alexsolo","id":3300911,"parent":3300290,"text":"San Francisco, CA<p>PagerDuty - <a href=\"http://www.pagerduty.com\" rel=\"nofollow\">http://www.pagerduty.com</a><p>FULLTIME, INTERN<p>* Software Engineers: (<a href=\"http://www.pagerduty.com/jobs/engineering/software-engineer\" rel=\"nofollow\">http://www.pagerduty.com/jobs/engineering/software-engineer</a>)<p>* Front-end Engineers (<a href=\"http://www.pagerduty.com/jobs/engineering/frontend-engineer\" rel=\"nofollow\">http://www.pagerduty.com/jobs/engineering/frontend-engineer</a>)<p>* Software Engineering Intern<p>What we do:<p>At PagerDuty, we're building an alerting and incident tracking system that helps IT operations groups detect and respond to high-severity issues.<p>You know how there are thousands of monitoring systems out there? We don't do monitoring. Instead, we plug into all of the existing monitoring systems and handle the people part of the equation: alerting (via phone, SMS, email), on-call scheduling for teams, auto-escalation of critical alerts, and incident tracking.<p>Our current product helps IT ops people know about critical problems as quickly as possible, collaborate as a team to fix problems quickly, and help track and improve incident response performance over time. Our vision is to expand into the event management space. This means treating data from monitoring tools as events and intelligently filtering and correlating events across monitoring tools in order to reduce the noise. It's like spam filtering for events: a critical problem, such as a bad deploy, will automatically alert the entire team via phone call, while a minor issue like a server going down in a fleet of 20 will only generate a low-priority email alert.<p>Why you should work with us:<p>We are different than many startups out there: we charge money for a product. Companies love our product; that's a lot to say for a system that frequently wakes our users up in the middle of the night. Our revenue is growing steadily at more than 10% month-over-month since we launched in Jan 2010. Our customers include: Netflix, National Instruments, VMWare, NBC Universal, Square, Heroku, and 37 signals. We're also fairly early stage (11 people, pre-series A). This combination means you'll get a market-rate salary plus a decent chunk of stock in a company that has already figured out its business model.<p>We have very interesting technical challenges. Our biggest challenge is engineering a system that never ever goes down. Since our customers rely on us to deliver their critical alerts, we are not allowed to go down ever. This means we've had to engineer a distributed system across multiple data centers that can survive a single data-center outage without skipping a beat. We're not done: we have a lot more work to do to ensure our system reaches the level of telephony reliability (five-nines). If you like engineering distributed fault-tolerant systems, join us.<p>To apply, please send your resume to jobs@pagerduty.com.","time":1322765280,"type":"comment"}