{"by":"Tashtego","id":3301029,"kids":[3302388],"parent":3300290,"text":"Santa Clara, CA\nProgressive Solutions (www.printhq.com and www.frecklebox.com)<p>FULLTIME Software Engineer<p>We are solving hard problems in the worlds of manufacturing, e-commerce, and mass customization. Can you help? We need an on-site programmer (no telecommute) in Santa Clara, CA to work closely with our executive and customer service teams. Initial responsibilities would include supporting internal customers of our technology and helping partners integrate with our online ordering system. You'd report to the director of engineering (that's me!) and be employee #3 in our development group.<p>We are a fun and fast-moving company. We rely heavily on a mix of open source software and applications built on Microsoft's .Net platform, so if you enjoy integrating systems there will be lots of fun opportunities for you. Although we are a small company, we've got big ideas, and you'd get to be involved in some big projects like transforming our production workflow, implementing automated continuous testing, and transitioning to Agile development methodologies.<p>Initial projects you'd be working on include:\n* Assist customers in the use of our XML-based online ordering gateway- add new features, automate testing, update documentation, and troubleshoot\n* Develop extensions to our online document customization engine and e-commerce systems (C#, SQL Server)\n* Troubleshoot and improve our production management scripts (Python, Perl, MySQL)<p>What we're looking for:\n* Experience developing web applications with an object-oriented compiled language such as C# or Java and a framework such as ASP.Net or one of the Java frameworks (Struts, etc.). A little preference is given to people who already know Visual Studio, C#, etc. but good general coding skills are way more important to us than knowledge of a particular toolset.<p>* Experience with an interpreted scripting language such as Python, Ruby, or Perl<p>* Patience and excellent communication skills. You will often be in a troubleshooting role, and you will be helping stressed-out people who just want the software to work already.<p>Our company is growing fast, and the small size of our engineering team means you will get a lot of input as we grow. 10% time means you'll have a chance to work on personal projects that benefit the company or do the refactoring that's been bugging you for weeks. This is a great opportunity for someone who is looking to join a team that is run like a start-up without the long hours and risk. Benefits include health care and participation in our company-wide Ownership Thinking profit sharing plan.<p>Check out our websites at printhq.com and frecklebox.com, and send resumes and cover letters to jobs@printhq.com. If you've got a github profile with public repositories or some cool scripts on gist, you'll be on the top of our stack.","time":1322767215,"type":"comment"}