{"by":"davidtspf01","id":3301652,"parent":3300290,"text":"Los Angeles, CA. Full time.<p>Software Engineer at ThinkNear<p>ThinkNear is an early stage start-up building solutions for location-aware mobile devices that are going to redefine how advertising works. One of our co-founders was a top-coder at Amazon, where he built a next generation customer targeting engine for Amazon’s credit card program, grew a highly-available payment service from 0-1&#60; million requests per hour, and then owned third party order management handling $10 billion annually.  The other has a top tier business background – experience building startups, formerly at Amazon, Harvard MBA, etc.  We’re funded by top tier VCs.  We have an alpha level product, but need to grow it into a true beta that can scale with the businesses massive growth.<p>We have built an incredible team of overachievers facing hard technical challenges and creating massive opportunity. We’re always looking for ambitious, driven self-starters who want to be on the leading edge of developing technology.<p>Check out our video at www.thinknear.com.<p>Role:<p>We are looking for a top tier software engineer or chronically under-recognized hacker. Along the top of your resume, you could list 30-odd acronyms from SQL to XML and back through the JVM a dozen times, but hate the idea that that’s what companies will evaluate you on. You don’t code, you craft. Your solutions are as elegant as they are simple. You love getting that perfect solution that takes only 4 lines of code instead of an ungodly 6.  At the same time, you can self-manage. When a critical deadline looms you can power through and deliver a reliable solution. You are the go-to guy (or girl) on whatever team you work.<p>Our ideal candidate will be ready to jump into an intense and high-growth start-up environment. You have experience building real products in the real world. We’re generally very focused on raw smarts and experience building awesome stuff.  However, sometimes you just really need in-house expertise. You are our leader when it comes to Gems, Ruby, and Rails. Technically when most people rank themselves from 1-10 on a language, they overestimate by at least 2-5 points -- you are legitimately an 8-9 in Ruby, preferably on Rails.  We are looking for someone capable of owning the whole stack of a project, from HTML/CSS/JQuery through to the database.<p>Final note: this job posting is for one of the first few engineers. You’ll be in a position to shape the direction of the code, the team, the product, and the company. We’re looking for people who are excited by that.<p>Responsibilities:<p>★ Design and code new features and enhancements across all our product offerings\n★ Participate in all aspects of a project life-cycle, from specifications through QA\n★ Collaborate on finding and fixing bugs and scalability/optimization issues<p>Requirements:<p>BS or MS in Computer Science or related field preferred\n2+ years experience building products for fast growing web products, 5+ years preferred; exceptional new grads considered.<p>Strong RoR experience.  Java or C++ also considered.\nExperience developing in Xnix (Mac counts if you use the command line a lot)<p>Comfortable in a small, intense and high-growth start-up environment<p>If you'd like to learn more please email careers at thinknear dot com.<p>Additional opportunities listed at <a href=\"http://careers.thinknear.com\" rel=\"nofollow\">http://careers.thinknear.com</a>","time":1322778113,"type":"comment"}