{"by":"zukhan","id":3302056,"parent":3300290,"text":"Delphix - <a href=\"http://www.delphix.com\" rel=\"nofollow\">http://www.delphix.com</a><p>FULLTIME or INTERN.\nOffices in San Francisco, Boston, and Menlo Park.<p>Delphix is a data virtualization company that does for databases what VMware did for servers -  this is a massive market, and we are on track for similar success. The product is unique and provides huge value to our users - in our first year of selling, we have already added 30 large corporate customers, including many of the Fortune 500 (Proctor &#38; Gamble, Staples, Qualcomm, etc.). The engineering team is top notch, which includes inventors and architects of the VMware platform, Oracle RAC, Sun ZFS file system, and DTrace. We believe database virtualization is the next frontier for achieving 100x payback in IT, and Delphix is leading the way.<p>Delphix engineering sits at the nexus of three core technologies: databases, operating systems, and the cloud.  We've taken the best and brightest across the industry and built an engineering culture where anyone with a good idea has a voice and can drive unique projects with the backing of a wealth of knowledge and experience.  Whether its developing new abstractions in the filesystem, designing an architecture to inter-operate with a novel database, or developing a new cloud paradigm for structured data, there is no lack of hard problems and opportunities at Delphix.<p> WANTED (intelligent/creative/passionate problem solvers)<p> Do you want to work with brilliant people in a culture where creativity and clarity of thinking is encouraged and rewarded?  Are you interested in working on the Data, the next big problem in Data Center?  Do you thrive on solving difficult technical challenges?  Do you take pride in writing beautiful code with a strong attention to detail?  Then we are looking for you!  Engineers who strive to master their craft; generalists who want to contribute at all levels of the application, from the database to the client and all things in-between.  Delphix offers awesome tough technical challenges in the Systems Management, File Systems, Distributed / Cloud Computing, Clustering, Databases, and software excellence.<p>Email jobs@delphix.com for more information and include Hacker News in the subject line.","time":1322784269,"type":"comment"}