{"by":"robeastham","id":3334240,"parent":3300290,"text":"LOCATION - Central London, UK<p>ROLE - Mid/Senior PHP developer with custom CMS experience...<p>We’re looking for an personable and creative mid-weight/senior web developer to undertake approximately 7-10 days freelance work. This will involve taking some static templates that have already been built using HTML, CSS and jQuery and creating a brand new custom CMS to support the site. The site and CMS will need to support multiple language and so experience with localisation is also  required. Ideally you would use Cake PHP to fulfil these requirements. Editing of the existing templates may be required and/or additional new templates may need to be built and so you will also have strong client-side development skills too. We are keen to get started on this ASAP and get the bulk of the work done before the Xmas break. We hope to choose someone after receiving CV's over the coming weekend (Sat 10th / Sun 11th Dec 2011). Initially you'll work on-site at our offices in Fleet Street but we would not be averse to a least few of the days being worked remotely.<p>REQUIREMENTS<p>•\tAt least 3 years experience in web development<p>•\tSignificant experience of PHP as well as CakePHP<p>•\tExperience architecting and planning web builds<p>•\tA great eye for detail, both visual, textual and in code<p>•\tEffective communicator<p>•\tHTML/CSS/Javascript/jQuery and SQL should be second nature to you<p>•\tIdeally you'll have a good understanding of Git<p>THE COMPANY<p>We’re a young fast growing digital agency based in the Fleet St area of London. There are currently 4 of us and we’re hoping to grow to 5 by the end of the year. We’re an easygoing bunch and we share our offices with a larger firm.<p>REMUNERATION<p>Day rate will be competivie and depend on the individual<p>HOW TO APPLY<p>If you’re interested please send an email to jobs.tinderfields@gmail.com along with a brief cover note containing some links to your work (including github profile) and attach your CV. Don't worry if you've just got lots of GitHub watches and not too many actual projects.","time":1323447535,"type":"comment"}