{"by":"evgen","id":17205874,"parent":17205865,"text":"Q-Branch Labs (<a href=\"https:&#x2F;&#x2F;www.q-branch.net\" rel=\"nofollow\">https:&#x2F;&#x2F;www.q-branch.net</a>) | Marketing Director, Hardware Product Manager, Python Developer | FULL-TIME | London | ONSITE | £50-75K + equity<p>Join a team helping to protect smart homes from the internet of insecure things.  We all know IoT and connected-devices are a security nightmare:  infrequently updated, often insecure by design, and a constantly growing source of zombie devices for botnet herders.  Help a seed-funded startup solve this problem for the huge mass of people who are not security&#x2F;networking experts and need an easy to install and easy to use solution!<p>Marketing Director - Q-Branch is looking for an ambitious marketing director who has experience in crafting a startup marketing plan from the ground up; messaging, PR, advertising and design.  Crowdfunding and social media management experience strongly desired.<p>Hardware Product Manager - We need someone with experience in delivering a consumer hardware product, from CAD design and injection molding to assembly and shipping.  We need someone with experience in sourcing parts, performing hardware QA and certification, and handling the end-to-end pipeline from development to delivery.<p>Python Developer - Q-Branch is also looking for an experienced Python developer with a strong linux&#x2F;unix background. Role will involve devops work (Ansible&#x2F;Kubernetes&#x2F;Terraform on AWS) as well as work on a large-scale event processing pipeline feeding a variety of analytics engines. Some experience in cyber-security, security data analytics, and machine learning are all major wins for a candidate.<p>Contact us at jobs@q-branch.net for more info or check us out on AngelList (<a href=\"https:&#x2F;&#x2F;angel.co&#x2F;q-branch-labs&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;q-branch-labs&#x2F;jobs</a>)","time":1527865299,"type":"comment"}