{"by":"andytw","id":17207669,"parent":17205865,"text":"ThoughtWorks | Senior Developer | New York, Atlanta, Chicago, Dallas, Denver, San Francisco, Nationwide | ONSITE plus travel | thoughtworks.com<p>ThoughtWorks is hiring talented Senior Developers across the United States! We have offices in New York, Atlanta, Chicago, Dallas, Denver, and San Francisco, but our technologists live all across the country. This is because, as consultants, we work almost exclusively on site at our client’s offices. Most of our consultants travel during the week and fly home for weekends. We know extensive travel is not for everyone, which is why we’re up front about it.<p>ThoughtWorks developers have contributed code to enterprise organizations, nonprofits, and open source projects for over 25 years. They also write books, speak at conferences, and help push software development forward—changing companies and industries along the way. Senior Developers play work on a huge variety of projects and play an important role in making our work a success. You could be helping to influence the digital strategy of a retail giant, building a new mobile application for a bank, or redesigning platforms using event sourcing and intelligent data pipelines. You’ll use the latest Lean and Agile thinking, solve mission-critical problems and challenge yourself everyday.<p>What we&#x27;re looking for:<p>* Ability to write high-quality, well-tested code. We don’t limit ourselves to one language; experience in any of Java, Scala, C#, Javascript, Ruby or Python is preferred<p>* Experience working with Agile, Lean and&#x2F;or Continuous Delivery approaches such as Continuous Integration, TDD, Infrastructure as Code, etc.<p>* Knowledge and appreciation of cloud technology such as AWS, Docker or Kubernetes is a plus<p>* A passion for automation; you don’t like doing the same thing twice<p>* We value diversity; we support traditional and nontraditional career paths.<p>If you’re interested, please email me your CV at acipolar@thoughtworks.com. To learn more or to apply directly, visit <a href=\"https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;careers&#x2F;us&#x2F;seniordev\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;careers&#x2F;us&#x2F;seniordev</a>","time":1527873691,"type":"comment"}