{"by":"iamspoilt","id":17207814,"parent":17205865,"text":"Wiivv | Senior Software Engineer | Vancouver, Canada | Full-Time | ONSITE | <a href=\"https:&#x2F;&#x2F;wiivv.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;wiivv.com&#x2F;</a><p>Wiivv is transforming how footwear and apparel are made today. We believe you are unique from your anatomy to how you move and that in order to truly move, feel, and live your best your footwear and apparel should be made to your unique spec​.​ With just a few photos from your phone, we can digitally map each foot, create a custom product (using 3D printing and other hybrid manufacturing techniques), and deliver it to your door in under 10 days.<p>Be a part of a team passionate about creating a great experience for our customers from web-to-app-to-feet. As a Senior Software Engineer, you will be involved in the software engineering process for the backend services and APIs that manage end-to-end e-commerce and product fulfillment life-cycle; building out data pipeline to assist on analytics and better understand the business as a whole. We firmly believe in technology that empowers people, at work and outside. No idea is too small and all ideas have potential to change the world. We live and breathe this philosophy, own our work and champion empowerment.<p>Our tech stack is mainly NodeJS, Python, RabbitMQ, PostgreSQL, Kubernetes, AWS and we are strong advocates of event-driven architecture. As a Senior Software Engineer, you will design and develop major components of the platform and 3rd party integrations.<p>If that sounds like something you could see yourself doing, feel free to reach me at rafay.aleem[at]wiivv.com<p>You can also apply at <a href=\"https:&#x2F;&#x2F;wiivvwearables.applytojob.com&#x2F;apply&#x2F;AvCAXPXmjE&#x2F;Senior-Software-Engineer?referrer=201805011735198CKRQPRWGPZRJSEV\" rel=\"nofollow\">https:&#x2F;&#x2F;wiivvwearables.applytojob.com&#x2F;apply&#x2F;AvCAXPXmjE&#x2F;Senio...</a>. Make sure to prefix your subject with [HackerNews].","time":1527874349,"type":"comment"}