{"by":"amitutk","id":17209682,"parent":17205865,"text":"Basepair | New York | Head of Bioinformatics | ONSITE<p>Basepair develops SaaS to manage, analyze and interpret next generation sequencing (NGS) data. Scientists and physicians at Harvard Medical School, NYU, UCSD, etc. analyze their data on Basepair to make breakthrough medical discoveries in cancer, AIDS, etc, and provide better medical care to patients.<p>We are looking at a technically skilled and detail oriented scientist to lead our bioinformatics effort. Your goal is to develop, validate and update best-in-class NGS pipelines. You communicate with existing and prospective users to answer questions about the pipeline, perform custom analysis and figure out new analyses Basepair should offer. You will be the face of Basepair’s bioinformatics expertise; conduct webinars, publish content, etc. As the company grows, you will help recruit, train and manage bioinformatics scientists.<p>* What you will be doing\n- Develop and validate best-practices pipelines for variant calling, gene expression, epigenetics, single cell RNA-Seq, etc.\n- Stay up to-date with the latest bioinformatics tools for QC, alignment, variant calling, annotation, expression analysis, peak calling, etc.\n- Have knowledge of public datasets and consortiums\n- Perform custom bioinformatics analysis for users\n- Conduct webinar, QnA, etc.\n- Publish research papers, white papers, blogs, tweets\n- Represent Basepair at conferences and meetings\n- Recruit, train and manage the bioinformatics team<p>* What you will need for this position\n- PhD in computational biology or related field\n- 3+ years of experience of building NGS pipelines\n- Expertise in Python algorithm development, data visualization, ability to read and modify other people’s source code\n- Proficiency in Linux, setting up servers, installing packages, bash scripting, etc.\n- Design reports to help non-technical users understand their data\n- Ability to work independently, prioritize tasks and manage your time productively\n- Excellent communication skills, including scientific writing<p>Email me at amit@[domain of website]","time":1527883973,"type":"comment"}