{"by":"alasano","id":17208062,"parent":17205865,"text":"Coveo | Recruiter - Marketing and Sales Scout | Montreal &amp; Quebec City, Canada | Full-time, ONSITE<p>Our talent acquisition team is a key element to our growing success and serve as guardians of the innovative DNA that lives in every Coveo employee. Here is your chance to take the lead of all recruitment processes for our Sales and Marketing teams that are deployed all over North America and in Europe. You will be a leader, so we’ll expect you to be creative in developing effective and innovative strategies to promote our employer brand. You will need to be skilled at distinguishing shining stars from annoying peddlers, identifying each candidate’s potential and convincing the best of them to join our ranks.<p>Every day brings new challenges and projects, but here is a typical day on the job:<p>* Start your day with a fresh espresso (or tea, according to your preference) and discuss with a few colleagues to see what’s going on in the company. A good recruiter knows their organization by heart.<p>* Back at your desk, you start research for a specific profile on LinkedIn Recruiter, and prepare a selection of candidates for a VP who is looking for a new sales star on the West Coast.<p>* You make your way to the conference room: your prospect for a business development role has arrived from Boston for a final interview with the COO. You greet him and answer a few of his questions.<p>* You go over the most recent applications you received via our ATS before heading down to lunch with your team. Turns out, 4 applicants have an interesting profile! You invite them to a call later this week.<p>* You have a few phone interviews this afternoon, so you take the time to go over the profiles, prepare your questions and tweak your pitch to convince them to join the company.<p>* You join a meeting with the rest of the recruitment team to plan the next HR marketing campaigns that will be launched next month. This is crucial, because we have open positions not only in Quebec and Montreal, but also in Atlanta, London and San Francisco. You’ll have to be creative to maximize the scope of the campaign.<p>* Discuss with one of our leaders in Europe: you want their input on a strategy to recruit a sales person in London.<p>While we offer all the perks people come to expect of a job (great new offices, top of the line equipment, competitive salaries and insurance, unlimited cappucinos and snacks, nerf gun battles), we think the best part about working with us is simply being excited about going to work every day. On a day to day basis you&#x27;ll continually face interesting challenges, have great autonomy and you&#x27;ll be able to bring your ideas to the table knowing that your team genuinely wants to hear them.<p>Coveo is positioned as the top leader for Insight Engines in Gartner&#x27;s 2017 Magic Quadrant (<a href=\"http:&#x2F;&#x2F;blog.coveo.com&#x2F;coveo-leads-gartner-magic-quadrant-for-insight-engines&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.coveo.com&#x2F;coveo-leads-gartner-magic-quadrant-for...</a>). We&#x27;re growing quickly and hiring talented, passionate developers to join our worldclass team. Our Montreal offices are brand new (<a href=\"http:&#x2F;&#x2F;blog.coveo.com&#x2F;coveo-montreal-finally-home&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.coveo.com&#x2F;coveo-montreal-finally-home&#x2F;</a>) and we&#x27;ve also rebuilt our entire Quebec City office to accomodate all our new hires in a great environment.<p>Interview Process: phone screen - interview - tech test - offer.<p>To get in touch : aasanovic (@) coveo.com","time":1527875649,"type":"comment"}