{"by":"fortysixpercent","id":17206838,"parent":17205865,"text":"Replicated | Various Positions | Los Angeles Onsite | <a href=\"https:&#x2F;&#x2F;www.replicated.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.replicated.com</a><p>At Replicated we are building applications to power modern enterprise software. We are hiring for various positions based in our Culver City office. Some of the key roles we are hiring for are below.<p>Implementation Engineer | Los Angeles or Bay Area Onsite | $110k-$150k + Equity<p>We are looking for an engineer with DevOps experience to help lead our technical discussions with potential customers. Our buyers are very technically sophisticated and need to deeply understand our product before deploying, the Implementation Engineer will help lead the technical side of our sales product from demos to initial deployments with end users.<p>Very important for this role will be experience with modern DevOps infrastructure Docker, Docker Swarm, Kubernetes, and Linux server administration.<p>More information is available here: <a href=\"https:&#x2F;&#x2F;bit.ly&#x2F;2kiRoVN\" rel=\"nofollow\">https:&#x2F;&#x2F;bit.ly&#x2F;2kiRoVN</a><p>Release Automation Engineer | Los Angeles Onsite | $100k - $150k + Equity<p>The Release Automation Engineer role will help build upon our test automation processes to ensure the quality of our cloud based and on premise products and help make our development process as effective as possible. In this role you would be a key part of an experienced engineering team that is solving interesting problems and developing innovative software.<p>In this role you’ll be working with tools like Docker, Kubernetes, Ansible, Linux, Selenium WebDriver, Golang and a lot more. You won’t need to have experience with the entire range of skills but a passion for learning is key.<p>More information is available here: <a href=\"https:&#x2F;&#x2F;bit.ly&#x2F;2FW0xvK\" rel=\"nofollow\">https:&#x2F;&#x2F;bit.ly&#x2F;2FW0xvK</a><p>Core Engineer | Los Angeles Onsite | $120k - $170k + Equity<p>We are looking for a Core Engineer to work on the backend of our product. In this role you will be working closely with the rest of the engineering team building out our products and contributing to the direction and architecture of our product. This will involve working deeply in Golang, Docker, Kubernetes, Bash, and Javascript.<p>More information here: <a href=\"https:&#x2F;&#x2F;bit.ly&#x2F;2soRXC3\" rel=\"nofollow\">https:&#x2F;&#x2F;bit.ly&#x2F;2soRXC3</a><p>You can apply on our site or email austin (at) replicated (dot) com","time":1527869804,"type":"comment"}