{"by":"edibiase","id":17207880,"parent":17205865,"text":"Apple | Software Applications Engineer - Spreadsheet Apps | Pittsburgh, PA | Onsite<p>Are you passionate about the future of consumer productivity software? Ready to create amazing user experiences for macOS, iOS and the web? Do you want to write code that is as elegant as the output it produces? The Numbers team is looking for a dynamic software engineer with the drive and desire to deliver beautiful and engaging applications on multiple platforms.<p>As a member of the Numbers team, you will contribute to current and future applications in the productivity group. You will collaborate with our design team to define new features, drive implementation of those features to completion and ultimately see them delight our customers. You will work closely with other engineers, human interface designers, and different groups across Apple. Your contributions will have a major impact on well-established but fast-moving software used and loved by millions of people to get things done at home, in their communities and their jobs.<p>Engineers on our team regularly have the opportunity to contribute to every facet of our products, from high-level UI to low-level data structures and algorithms to server code running on iCloud supporting shared document collaboration, as well as going beyond code to influence everything from user interface to project planning. iWork engineers have exposure to nearly every technology available on Apple’s platforms, get to ship code targeting many of our products, and get to learn from the many experienced people on our team and across the company. You’ll be trusted to work with your teammates to come up with the best solutions to technical problems and drive their adoption, and will make use of code review, automated testing, and other tools to help make sure your code meets our goals for code and customer quality.<p>Apply: <a href=\"https:&#x2F;&#x2F;jobs.apple.com&#x2F;us&#x2F;search?job=113586008&amp;openJobId=113586008\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.apple.com&#x2F;us&#x2F;search?job=113586008&amp;openJobId=113...</a>","time":1527874624,"type":"comment"}