{"by":"frayron","id":17212385,"parent":17205865,"text":"Voltaiq | Battery Analytics | Berkeley, CA | Multiple Positions: $110k-$180k | ONSITE<p>“The battery is the technology of our time.” -The Economist, January 16, 2016<p>Voltaiq&#x27;s cloud-based Battery Intelligence software platform brings unprecedented data analytics, visualization, and predictive capabilities to any company with a battery-powered business model. Top automakers, consumer electronics, and energy storage companies use Voltaiq to accelerate product development, improve performance, ensure safety and reliability, and secure financing for their products. Our high-powered team comprises PhD scientists, expert data professionals, and battery industry veterans, all passionate about enabling the global energy transition.<p>Positions:<p>- DevOps: automation of builds and deployments on AWS cloud and others.<p>- Data Engineer: data models, data pipeline, data API and machine learning platform.<p>- Data Scientist: data analysis and visualization, feature extraction and machine learning.<p>- Backend &#x2F; API Engineer: business logic, data models, and API.<p>- Frontend Engineer: client-side logic for data exploration and analysis.<p>- UI&#x2F;UX Designer: problem-solving complex scientific workflows, product design.<p>Candidates should be:<p>- Strong coders in one or more of: Python, Javascript, Java, Scala, Go.<p>- Experienced with modern development tools and technologies: Git, Linux, CI&#x2F;CD.<p>- Degree holders in CS, Physics, Math, Engineering, or related.<p>- Passionate about energy and solving hard science problems using data.<p>- Authorized to work in the US.<p>Our Stack<p>- Frontend: AngularJS, SASS, Gulp, Jasmine, Selenium, Plotly, Vue.js.<p>- Application: Django, Python, Pytest, ZeroMQ.<p>- Data Engineering and Database: Java, Scala, Postgres, Elasticsearch.<p>- Data Analysis&#x2F;Visualization&#x2F;ML: Numpy, Pandas, Matplotlib, Plotly, Scikit-Learn, TensorFlow.<p>- Deployment: AWS, Terraform, Ansible, Fabric, Nginx, uWSGI.<p>Competitive salary plus equity and full benefits.<p>Full job descriptions are on our website: <a href=\"http:&#x2F;&#x2F;voltaiq.com&#x2F;about-us#jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;voltaiq.com&#x2F;about-us#jobs</a><p>Send a resume to jobs@voltaiq.com.<p>Thanks, HN!","time":1527908113,"type":"comment"}