{"by":"cjp160","id":17211285,"parent":17205865,"text":"Dahlia Lights | Full Stack Software Engineer | Bay Area, CA | Full Time | Onsite | <a href=\"http:&#x2F;&#x2F;www.dahlialights.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.dahlialights.com</a><p>-- about us --<p>Lighting is a simple but powerful thing. It defines the look of a room and, if done properly, can amplify your home experiences. Unfortunately, not many people have the resources to get great lighting. The current options are either too expensive or complicated. At Dahlia Lights, we are working to bring great lighting to every home.<p>We are a small team of engineers working hard to get our first product out the door. We are exploring a number of different fun and useful ways to interact with light in the home. We focus on the intersection of sensing technologies and machine learning, and how the two working together can yield incredible results. If you’re interested in figuring out new ways to improve people’s lives, and want to be a core member of the team, come join us!<p>-- job --<p>As a full-stack Software Engineer at Dahlia Lights, you will be a core member of the engineering team defining and building a new kind of lighting product that will bring great joy to people’s lives. As an early member of the team, you will need to learn quickly and contribute to many parts of our product. You will also have a lot of freedom in choosing and defining the technologies and features we develop.<p>The wide range of potential tasks include scaling our cloud backend to handle lots of data, fortifying our data processing algorithms, developing for resource-limited Linux computers, working with smart light APIs, and building cross-platform mobile apps. The technologies we currently use are Python, React Native, Tensorflow, Google Cloud and Flask.<p>-- responsibilities --<p>- Make big contributions across our full product stack with thoroughly tested code. We are shipping a consumer product soon and everything should be built to work for thousands of users. \n- Take ownership and pride in everything you make. As an early member of the team, you will have a lot of autonomy in the work you do, make the most of it. \n- Be flexible in what you can do and the technologies you use. Since we are a small and fast moving team, what is needed of you will change. You have to be able to adapt, to learn new languages and technologies, and push for change if you see a better way. \n- Diligently safeguard user data. We deal with a lot of sensitive user information and we need to treat it with care throughout our product.<p>contact me at collin@dahlialights.com if you are interested in joining us!","time":1527894421,"type":"comment"}