{"by":"snowflake_data","id":17221032,"parent":17205865,"text":"Snowflake Computing | San Mateo, CA (ONSITE) | Full-time | <a href=\"https:&#x2F;&#x2F;www.snowflake.net&#x2F;about&#x2F;careers&#x2F;#open-positions\" rel=\"nofollow\">https:&#x2F;&#x2F;www.snowflake.net&#x2F;about&#x2F;careers&#x2F;#open-positions</a><p>Snowflake is the data warehouse built entirely for the cloud. Our Data and Analytics team is hiring two positions:<p>1. Data Engineer: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;snowflake&#x2F;352fc68f-e825-47cd-9f2f-d796526ec9c1\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;snowflake&#x2F;352fc68f-e825-47cd-9f2f-d796...</a><p>We&#x27;re looking for an experienced Data Engineer who has built production-grade, large-scale data pipelines. The person will be the first dedicated Data Engineer on our team, and have an opportunity to architect and implement a number of pipelines into our data warehouse (Snowflake, naturally), as well as pipelines from the warehouse into core business systems.<p>2. Data Scientist: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;snowflake&#x2F;ca490b99-54c7-4041-9a0d-7edf0e79b430\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;snowflake&#x2F;ca490b99-54c7-4041-9a0d-7edf...</a><p>We&#x27;re look for a seasoned Data Scientist who has real-world experience building and deploying models in mission-critical production settings. The lion&#x27;s share of our near-term projects are unsupervised or semi-supervised learning problems; we also have a lot of time-series analysis projects. We have a lot of interesting use cases around operational optimization—e.g., anomaly detection, forecasting server demand, adding intelligence to the automation of server provisioning, etc. There are opportunities for customer-facing features as well.<p>Languages we like: SQL, Python, R, Java, Scala, and Ruby.\nTools we like: Snowflake, Airflow, Docker, Spark, AWS Lambda, Alooma, Fivetran, and Looker.<p>The interview process:<p>1. Review application.<p>2. 30-minute conversation with hiring manager (Director of Data and Analytics =&gt; <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;scottdhoover&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;scottdhoover&#x2F;</a>).<p>3. 45-minute SQL coding session over the phone (we&#x27;re a database company—strong SQL and RDBMS understanding is essential).<p>4. Take-home coding project (either example pipeline for Data Eng. or analysis for Data Sci.). Should take no more than a couple of hours.<p>5. On-site with representatives from the Data team, Engineering, DevOps, and Product.","time":1528051445,"type":"comment"}