{"by":"BCG_Platinion","id":17229326,"parent":17205865,"text":"BCG Platinion | (Senior) Software Engineers (Application, Web, Mobile), (Senior) Data Scientists&#x2F;Engineers, (Senior) UX&#x2F;UI Designers | Berlin, Germany | ONSITE<p>We’re a Design and Engineering Team in Berlin staffed by a group of software engineers and designers. We use human centered design principles to ideate, design and build prototypes and MVPs for a variety of clients.<p>We’re part of the Boston Consulting Group family and are therefore backed by their resources and have access to their rich domain expertise and knowledge base. However since we&#x27;re a separate self-contained unit, we are not management consultants and are completely engineering focused.<p>We’re looking for self-driven individuals with a broad set of technical skills who can bring fresh ideas from multiple areas including artificial intelligence and machine learning, UI&#x2F;UX design, mobile and web application development, large scale system design, information retrieval, natural language processing&#x2F;generation, distributed systems and blockchain applications, etc. In essence, we’re looking for generalists who want to tackle a wide range of problems (Greenfield and Brownfield) in a fast-paced environment.<p>Our work spans multiple domains so we’re tech stack agnostic. We work with whichever cutting-edge technologies are needed for the problem at hand and we also encourage and support team members in broadening their knowledge and acquiring new skills.<p>Our team is currently small (5 people), close-knit and growing. We’re a mix of nationalities and our working language is English. We value diversity and believe the unique contributions we all bring to the table enables us to succeed.<p>We offer a very competitive salary with profit sharing, flat hierarchy, access to all the latest equipment and software you require, a large air-conditioned office building in Mitte and so much more.<p>If this sounds exciting, we&#x27;d love to hear from you! Please contact me at yeboah-antwi.kwaku AT platinion.com","time":1528128888,"type":"comment"}