{"by":"JessQuinn","id":17226299,"parent":17205865,"text":"Scrapinghub | <a href=\"https:&#x2F;&#x2F;scrapinghub.com\" rel=\"nofollow\">https:&#x2F;&#x2F;scrapinghub.com</a> | 100% Remote<p>Scrapinghub is looking for Python Engineers, Erlang Developers, Test Engineers and more: <a href=\"https:&#x2F;&#x2F;scrapinghub.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;scrapinghub.com&#x2F;jobs</a><p>Quick summary of the open positions:<p>- Python Engineer (scraping): you’ll be in charge of designing, developing and testing Scrapy web crawlers.<p>- Test Automation Engineer: you will build automated test frameworks and ad hoc test scripts to assist in the verification and validation of data quality.<p>- Erlang Engineer&#x2F;Tech Lead: you will lead our Crawlera team in developing and maintaining a high load distributed system.<p>We&#x27;re a fully distributed team with more than 120 Shubbers working from 30 countries, who are passionate about scraping, web crawling and data science.<p>You&#x27;ll have the chance to work on projects that harvest and transfer datasets of thousands of millions of records, as well as build some of the systems that will deliver data to current Fortune 500 companies and the startups that are building great products on top of our stack.<p>We have a very engineering-driven culture (two engineer-founders) and a great place to work if you&#x27;re self-directed, curious, and interested in working in open source environments. More on Open Source at Scrapinghub: <a href=\"http:&#x2F;&#x2F;scrapinghub.com&#x2F;opensource&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;scrapinghub.com&#x2F;opensource&#x2F;</a>.<p>Scrapinghub continues to grow significantly this year and we&#x27;re looking for great additions to our team, wherever you&#x27;re located! Positions are fulltime (40hours per week) and fully remote.<p>Interview process: 2 interviews and a technical trial project.<p>You can apply here: <a href=\"https:&#x2F;&#x2F;scrapinghub.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;scrapinghub.com&#x2F;jobs</a><p>Got questions? Feel free to contact me at jessica@scrapinghub.com.","time":1528107339,"type":"comment"}