{"by":"runtasticcareer","id":17235390,"parent":17205865,"text":"Open Jobs at Runtastic<p>We believe in supporting people to improve their fitness and overall health. With more than 220 million downloads and 115 million registered users on Runtastic.com, we face unusual and fascinating challenges everyday. \n== ONSITE | VISA ==<p>We offer jobs in various fields, check out our career page <a href=\"https:&#x2F;&#x2F;www.runtastic.com&#x2F;en&#x2F;career\" rel=\"nofollow\">https:&#x2F;&#x2F;www.runtastic.com&#x2F;en&#x2F;career</a> and see if any of our open positions match with your interests and background.<p>Senior Frontend Web Developer<p>YOUR MISSION<p>Working as part of an agile team, you boost Runtastic.com as home of our health and fitness portfolio. You will be responsible for:<p>- Responsive frontend development of our fitness site Runtastic.com with JavaScript, HTML and CSS<p>- Improving the visibility of our community and statistics by developing new features<p>- Collaborating with engineers, designers and product managers to create an engaging experience for millions of active users<p>- Developing with cutting-edge technology and contributing to the further technical development of your colleagues<p>YOUR PROFILE<p>- Excellent skills in JavaScript, HTML and CSS, as well as solid know-how in JavaScript frameworks<p>- At least 2 years of experience in frontend development, including responsive&#x2F;mobile websites<p>- Preferably, a degree in Computer Engineering or a related field (university or higher technical institute)<p>- Very good German and good English skills OR very good English skills (written and spoken)<p>- Willingness to work in a dynamic, fast-paced environment in beautiful Austria<p>Apply for the Frontend Web Developer position at: <a href=\"https:&#x2F;&#x2F;www.runtastic.com&#x2F;en&#x2F;career?jh=pcf5mw6kvvr39g43wct12c8ozoo5xzc\" rel=\"nofollow\">https:&#x2F;&#x2F;www.runtastic.com&#x2F;en&#x2F;career?jh=pcf5mw6kvvr39g43wct12...</a>","time":1528179742,"type":"comment"}