{"by":"ewa","id":17235924,"parent":17205865,"text":"Intercom | Dublin, Ireland | SOFTWARE ENGINEER (Experienced) <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;89980b421\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;89980b421</a> Full Time | ONSITE | SaaS<p>WHAT: We enable internet businesses to connect to their customers as humans. As our communications platform expands, we’re facing many exciting scaling challenges and building holistic roadmaps where your expertise can be applied to areas such as building a beautiful messenger composer, rule matching, deliverability, security, app availability and machine learning, to name a few.<p>ROLE: You&#x27;ll be a product engineer at Intercom - someone who solves real customer problems through a smart and efficient application of your technical knowledge and your tools. You will be able to see the impact of your work on millions of users that send messages via Intercom on a daily basis. We want you to contribute to our product roadmap and provide technical mentorship to other engineers.<p>BENEFITS: Competitive salary, meaningful equity, free food, health insurance, life assurance, open vacation policy, public transport and gym covered.<p>Hiring process consists of tech test, phone interview and an onsite interview with technical and culture sessions.<p>TECH: The core Intercom product is a Ruby on Rails application with an Ember.js frontend. We use MySQL, MongoDB and Amazon’s DynamoDB for most of our storage. Our web messenger is built on React. We have API and integration clients for Ruby &#x2F; Rails, Java, PHP, Node, Go, and .NET. We like to buy the best tools and services where available but will build our own when we need to—we use an in-house continuous deployment service and built our own lightweight project management tooling.<p>How we work and where to apply: <a href=\"https:&#x2F;&#x2F;www.intercom.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.intercom.com&#x2F;careers&#x2F;</a><p>Or you can email me directly :) ewa@intercom.com","time":1528188309,"type":"comment"}