{"by":"bwilsonkey","id":17313285,"parent":17205865,"text":"KeyBanc Capital Markets | Equity Data Specialist | Portland, OR | Full-time Onsite | <a href=\"http:&#x2F;&#x2F;www.key.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.key.com</a><p>KeyBanc Capital Markets Inc., a division of KeyCorp, seeks an equity data specialist to join the KeyBanc Capital Markets First Look Data team in Portland, OR. The specialist will acquire, analyze, and present datasets that help our research team gain unique insight into company models and broader industry trends.<p>Working collaboratively with equity research analysts and the data team, you will help triangulate key performance indicators and populate investment theses via signals from preexisting and organically acquired data sets. You will use creativity and persistence to deliver actionable insight on a set of companies spanning technology, industrials, real estate, consumer, and healthcare.<p>You will own end-to-end delivery, working across programming, finance, and design realms to build and maintain data products.<p><i>Primary responsibilities include:</i><p>-Acquire data from diverse sources, including scraped web data and internal repositories<p>-Query and transform data<p>-Work consultatively with the data team and research analysts to identify key performance metrics<p>-Build self-serve visualizations and data-retrieval platforms<p>-Present findings in a compelling fashion<p><i>Desired Skills &amp; Experience:</i><p>-Demonstrated ability (professional or academic) to manipulate large data sets (query, cleanse, join and update)<p>-Demonstrated ability (professional or academic) to succinctly and visually present findings from data<p>-Intermediate to advanced Python skills<p>-Interest in financial markets and understanding company models<p>-Demonstrated intermediate to advanced SQL capabilities<p>-Design skills (web layout, template design, BI dashboarding [e.g. Tableau], etc.)<p>-Familiarity with web-based frameworks such as Django","time":1528996549,"type":"comment"}