{"by":"stuartmaggs","id":17319291,"parent":17205865,"text":"Scaled Robotics | Full Stack Developer | Barcelona, Europe| Onsite | Full-Time | <a href=\"https:&#x2F;&#x2F;scaledrobotics.com\" rel=\"nofollow\">https:&#x2F;&#x2F;scaledrobotics.com</a><p>We are seeking a Full Stack Developer to join our tight-knit team producing robots for the construction industry, working closely with our industry partners to create innovative solutions to real-world construction problems, we are looking for a driven and dedicated engineer to help bring robots to construction.<p>In this role, you will be responsible for front-end and back-end web development for software that can interpret IFC (3D model) data using Autodesk’s Forge API. The candidate should have knowledge across all stages of software development and experience working with other engineers, developers and disciplines. The ideal candidate should be comfortable in a fast moving development environment, both in the lab and in the field testing their work on live construction sites, communicating with experts and laymen to solve challenging problems every day.<p>We are an ambitious, diverse and hardworking team looking for candidates with the experience below:<p>Responsibilities<p>- Develop a front-end and back-end for custom web-based IFC interface<p>- Interface with Autodesk Forge API<p>- Develop database management and storage tools for IFCs, point cloud and image data<p>- Develop WebGL based renderers with custom functionality<p>Qualifications<p>- Bachelors&#x2F;Masters in Computer Science or related field\n- Understanding of web services technologies such as HTTP, REST, WSDL<p>- 2+ years experience backend development using Node.js, Ruby or PHP, Python, Java<p>- 2+ years of front-end development experience JavaScript, HTML&#x2F;CSS<p>- 2+ years experience with database management and storage<p>- Knowledge of SQL, MongoDB, and how to connect to a backend database. Preferably (Node.js + MongoDB)<p>- Knowledge of CAD&#x2F;CAM<p>- Knowledge of Autodesk Forge API<p>- Goal oriented self-starter, analytical thinker, excellent team player<p>- Experience with version control (specifically GIT)<p>Please apply directly to info@scaledrobotics.com","time":1529066239,"type":"comment"}