{"by":"jconnolly","id":4992807,"parent":4992617,"text":"The Ladders - New York City<p>Looking for full time on-site developers.<p>We hire passion, not skills.  If you'd describe yourself as a polyglot, prize code quality and clarity, please do get in touch.<p>Some tech we use across our company:\nJava, Scala, Backbone.js, Storm, RabbitMQ, Puppet, Sass, Responsive Design, Objective-C and on and on.\nIdeal candidates probably have at least 5-7 years experience<p>Here's the \"job description\", if you are interested, you can email me directly: jconnolly@theladders.com<p>--<p>We’re looking for a few good programmers to join our team and help us achieve our mission of “the right person for the right job.”<p>Instead of giving you a list of buzzwords to describe the role, we’ll tell you about a project we started recently:\nA few months back, a small team of engineers and designers at The Ladders got together to design a new product. We started off by interviewing some of our customers to learn about their needs. Using that information, we held design studios and brainstorming sessions to flesh out what the actual features and user experience would be like.<p>On the front-end, we decided to build a new Javascript-powered rich UI using responsive design techniques. Many people are working on responsive design for content-based sites, but few are doing it for browser-based applications.\nOn the back-end, we designed an Event Driven Architecture that makes use of Event Sourcing. Instead of updating a relational database in-place when things change, we store a series of discrete application events. We can then replay those events to create the state of the world at any point in the past, right up to the present. (Yes, we’ve built a time machine!)<p>Does this sound like the sort of thing you’d like to do? If it is, we’d like to hear from you.<p>In return for your passion and commitment to code quality, you’ll enjoy an awesome work environment with perks like: Unlimited vacation days! Yes, unlimited! Quarterly hackathons A game room and a well-stocked kitchen Exciting events including holiday parties, picnics, talent shows, pumpkin carving and more Company sponsored athletic teams Competitive salary, bonus and stock options Health/Dental/Vision Insurance, 401K","time":1357055262,"type":"comment"}