{"by":"jqueryin","id":4992977,"kids":[5008157],"parent":4992617,"text":".CO - Miami, FL w/ Possibility of REMOTE<p>.CO is a cTLD domain registry with a passion for helping startups.  We're a highly profitable, bootstrapped company. Some of our partners include the likes of 500 Startups, Startup America, Startup Weekend, LeWeb, etc.<p>We are looking for a <i>lead frontend dev</i> to work as a key member of our development team to build and deliver a world-class experience for our users. In this role, you will be responsible for helping craft the future of our service from a front-end, design-driven perspective. You will also be working closely with people across engineering, product, and creative to help develop an amazing experience for our users. You must be open to the idea of moving to Miami, FL in the future if you wish to apply for the remote position.<p>You will be responsible for:<p><pre><code>    * Provide technical development across our family of websites, including: go.co, cointernet.co, startuplife.co, and any other websites developed by the marketing or operations teams\n    * Be the main front-end developer for updates and conversion optimization to these websites\n    * Work with internal and external partners to review and define website improvements - including guidance and participation in wireframe development, technical requirements definition, front end development, back end development, QA testing, deployment, management - and everything in between.\n    * Debug issues that arise with the performance of the websites - including making corrections directly and/or delegating tasks throughout the organization to resolve\n    * Guide our organization toward an industry-leading standard of user interaction and development\n    * Plan for future changes to the website, stay current with software and hardware, and make recommendations that can improve the success of the business\n</code></pre>\nRequirements:<p><pre><code>    * You're self sufficient, get shit done, and don't require hand-holding\n    * You have a passion for startups\n    * You love to build beautiful stuff for the web\n    * You are an HTML and CSS expert, including HTML5\n    * Have knowledge of PHP, with a desire to learn more\n    * Can work from and/or cut-up PSDs\n    * Have worked in a cross-functional team - either in-house or at an agency\n    * Can advise designers on best practices for design as they will apply to development\n    * Maybe even have a few design tendencies of your own (very nice to have!)\n    * Quality and detail-oriented\n</code></pre>\nIf you'd like to know more about us and things we're working on, please don't hesitate to ask. If you're a talented backend or fullstack dev with PHP experience, don't hesitate to send your info as well. Our development team is growing rapidly and we're open to bringing on additional talent. We're also in need of a lead designer, so if you know of anybody, please let them know!<p>Send relevant open source contributions, CV, example work, questions, etc. to <i>corey AT go.co</i> and I'll be in touch.","time":1357058576,"type":"comment"}