{"by":"eisokant","id":4993432,"kids":[4994399,5017981],"parent":4992617,"text":"Madrid, Spain\nFull-time in Madrid<p>Looking For Brilliant &#38; Passionate Web Developers<p>Tyba (<a href=\"http://tyba.com\" rel=\"nofollow\">http://tyba.com</a>) is giving junior talent a professional identity and changing the way companies recruit.\nWe have as a mission to advance the careers of young professionals.\nIf you’re looking for an international team that thrives in a startup culture, we’re the place to be!<p>We can only consider candidates who are allowed to work in the European Union.<p>We offer a challenging environment where you can develop your skills and build a product which people use and enjoy!<p>What technologies do we use?<p>PHP, Javascript, jQuery, MySQL, Nginx, Varnish, Amazon EC2, RDS, Cloudfront &#38; S3, and some other cool technologies.<p>You need to have:<p>* Strong learning and problem solving skills\n* Passion and enthusiasm about new technologies\n* Creativity and initiative\n* Empathy and ability to understand users’ needs\n* Good English level<p>Things that are a plus:<p>* Developing projects on your own\n* Contributing to open-source projects\n* Integration with Facebook and Google APIs\n* Experience with AWS\n* Working with git(hub)<p>We offer:<p>* Work in a dynamic environment with young talented people\n* Room to learn new technologies and skill sets\n* Building a product that impacts the careers of our users\n* A chance to live in one of Europe’s most vibrant cities<p>Who we are looking for?<p>We have several positions open so we are recruiting from experienced developers all the way to high-potential individuals with little experience. What all candidates will have in common is a passion for software development and a strong appreciation of the importance of the user experience. You have to be able to learn quickly, communicate well and co-operate effectively in a team.<p>Our team is international!<p>We are 8 nationalities but use English as our working language. You should be able to write and speak to a level where you can communicate clearly, but fluency is not a requirement.  Knowledge of Spanish is not a requirement.<p>Email us: contact@tyba.com","time":1357065764,"type":"comment"}