{"by":"ghotli","id":4994042,"kids":[4994527],"parent":4992617,"text":"------------------------------------<p>Mosaik Solutions | Memphis, TN | Full Time | Relocation Available<p>------------------------------------<p>8 Fortune 100 clients, Growing Stable Company, Great Benefits, Technical Freedom<p>------------------------------------<p>------------------------------------<p>Leader, Teacher, Software Generalist<p>------------------------------------<p>\"looking for a leader that loves to teach, to help solve architectural grade problems, and to help set the bar for technical prowess\"<p>------------------------------------<p>Here at Mosaik Solutions we’re building a platform for making sense of everyone’s big geospatial datasets. For twenty years we’ve been collecting all of the world’s cell coverage information, but for the last three we’ve transformed our business into a full blown software engineering and data visualization shop. Our mission is to provide our clients with quality solutions to their big geospatial data analysis and visualization needs whether they want the raw data analyses, an API, a beautiful infographic, or full blown custom applications that leverage our data, or theirs.<p>We believe that healthy teams are comprised of happy people that all have something exceptional and unique to bring to the table. At this point in our growth we’re looking for another leader that loves to teach, to help solve architectural grade problems, and to help set the bar for technical prowess. We don’t care if you’re experienced with our specific technologies, we just expect that you’re the kind of person that not too long from now you’ll know more about them them than anyone else. If you think this sounds like you (or the person you’re destined to become!), send us an email at hr@mosaik.com with your resume, a short letter, and anything else that would help us understand why you’re so awesome that we should hire you post haste.<p>------------------------------------<p>Ruby, Python, C, EC2, Chef, Backbone, D3, Bootstrap, PostGIS, Cassandra, ElasticSearch, Redis, OpenLayers, Varnish, HAProxy, Mapserver, Mapnik, Logstash, Graphite, Logstash...<p>------------------------------------<p><a href=\"https://workforpie.com/companies/mosaik-solutions/\" rel=\"nofollow\">https://workforpie.com/companies/mosaik-solutions/</a><p><a href=\"http://www.mosaik.com/\" rel=\"nofollow\">http://www.mosaik.com/</a><p>------------------------------------","time":1357075408,"type":"comment"}