{"by":"esamek","id":4996306,"parent":4992617,"text":"Washington DC (full-time, salaried)<p>HelloWallet - <a href=\"http://www.hellowallet.com\" rel=\"nofollow\">http://www.hellowallet.com</a><p>By utilizing powerful new technology, findings from behavioral economics, and a network of partnerships with industry experts, HelloWallet is able to offer high-quality, individualized financial advice to all Americans.<p>Senior Software Engineer\n------------------------------------\nDescription:<p>We’re looking for a solid Senior Software Engineer who does not shy away from challenges and opportunities to lead. We¹re a fun and dynamic startup, with a team of people who work together on everything from the latest front-end technologies to superb database design. If you join our team, you¹ll work in our agile engineering group, contributing your expertise to all aspects of our application.<p>Responsibilities:<p>Build amazing interactive experiences that empower our members to increase their financial wellness\nBuild powerful and easy-to-use features in the HelloWallet web and mobile applications\nBuild the tools, systems, and processes to support the HelloWallet service offering\nBuild software and services to integrate with our trusted vendor partners and client systems\nWork with CTO and Product Development Team to help shape product vision\nRequired Skills/Experience:<p>5+ years experience developing commercial quality web and/or mobile applications\nAdvanced knowledge and demonstrated experience with Java, AJAX, JQuery, JavaScript, and Web services (REST, SOAP)\nAdvanced knowledge of web technologies and protocols\nExperience with relational databases including transaction management, tuning and scalability, JDBC, and Hibernate\nAdvanced knowledge of enterprise concepts such as security, scalability, transaction management, and multi-threading\nWorking knowledge of front-end technologies (HTML, CSS, DOM)\nFamiliarity with Scrum agile development process\nDesired Experience:<p>Experience with Android and/or iOS is a huge plus\nExperience with Google Web Toolkit (GWT)\nExperience with Spring framework\nExperience with Subversion, Ant, Hudson, JIRA, and Linux\nMathematics and/or statistics\n Job Benefits:<p>Full benefits package with competitive salary\nExciting, fun, and entrepreneurial work environment\nThe opportunity to empower millions of U.S. consumers to understand and manage their financial lives\nFree Friday Lunches\nFree Time for Pet Projects\nWe’re in downtown DC.  We pay competitive rates and have a damn good time. To apply or if you have any questions, just contact Mitch at jobs@hellowallet.com.<p>Software Engineer\n-----------------------------------\nDescription:\nWe seek solid Software Engineers who do not shy away from challenges. We’re a fun and dynamic startup, with a team of people who work together on everything from the latest AJAX front-end technologies to superb database design. If you join our team, you’ll work in our agile engineering group, contributing your expertise to all aspects of the software.<p>Responsibilities<p>Develop features for the HelloWallet service\nDevelop tools and systems to support the HelloWallet service\nDevelop software and services to integrate with our trusted vendor partners and client systems\nWork with CTO and product strategists to help shape product vision\nRequired Skills/Experience<p>3-5 years experience developing commercial quality Web applications\nAdvanced knowledge and demonstrated experience with Java, XML, and Web services (REST, SOAP)\nExperience with Java EE application servers such as JBoss, Tomcat, WebLogic, WebSphere, etc.\nWorking knowledge of web technologies and protocols\nDesired Experience<p>Experience with Google Web Toolkit (GWT)\nExperience with Spring framework\nExperience with relational databases including transaction management, tuning and scalability, JDBC, and Hibernate\nWorking knowledge of enterprise concepts such as security, scalability, transaction management, and multi threading\nWorking knowledge of client side technologies (HTML, CSS, JavaScript, DOM)\nExperience with Subversion, Ant, Hudson, JIRA, and Linux\nMathematics and/or statistics\nFamiliar with Scrum agile development process\nJob Benefits:<p>Full benefits package with competitive salary\nExciting, fun, and entrepreneurial work environment\nThe opportunity to empower millions of U.S. consumers to understand and manage their financial lives\nFree Friday Lunches\nFree Time for Pet Projects\nWe’re in downtown DC.  We pay competitive rates and have a damn good time. To apply or if you have any questions, just contact Mitch at jobs@hellowallet.com.","time":1357129656,"type":"comment"}