{"by":"benporterfield","id":4997266,"parent":4992617,"text":"Software Engineer (San Francisco, Silicon Valley or Santa Cruz)<p>Looker is a Business Intelligence startup that focuses on the intersection of economics and engineering — helping customers use data to achieve success. We believe that businesses can only thrive when information is easily accessible and consistently defined across the entire organization.<p>More about us:<p><pre><code>  - We are an engineering-focused team of 8\n  - Post series A (but still giving great stock grants to the right people)\n  - Based in sunny Santa Cruz, CA\n  - Growing revenue and plenty of runway\n  - We have a product that our customers love. \n    Quote: \"I'd never start another company without Looker!\"\n  - Stack includes JRuby+Sinatra, Java, CoffeeScript/JavaScript, JQuery, SQL, and more\n  - Top tier clients list. Get to know some of the smartest people in the industry \n    and see how they think and operate \n    (after all, we're helping them to think about data)\n</code></pre>\nDoes this sound like you?<p><pre><code>  - Driven to excel in a fast-paced, autonomous, and fun startup environment\n  - Experience shipping exceptional products or projects\n  - A full-stack generalist, proficient in Ruby, Javascript, or equivalent\n  - Ability to quickly pick up new technology and apply it effectively\n  - Well-versed in common front and back-end challenges\n    (scaling, interacting with DB, debugging, REST, MVC, etc)\n</code></pre>\nWhat to expect:<p><pre><code>  - Meaningful equity, competitive salary, healthcare &#38; benefits\n  - Sane work hours and vacation policy - meaning we have no policy. We trust everyone \n    to work in a way that is most beneficial to them and to Looker\n  - Learning first-hand how a startup works (it's a lot more than just code!)\n  - Significant responsibility for architecting, deploying, and \n    maintaining critical features or infrastructure\n  - A genuine passion amongst teammates for helping great\n    companies become even greater through data discovery\n</code></pre>\nNote: We are still stealthy, so currently our web presence is minimal.<p>Interested? Please email ben@looker.com with some information about yourself and we'll get back to you!","time":1357142196,"type":"comment"}