{"by":"rgoldglass","id":4997093,"parent":4992617,"text":"Your next opportunity is with us<p>Avid Life Media Inc. is a leading social entertainment company that operates some of the most vibrant social networking and dating communities on the web. We currently have online presence in over 20 countries located around the world in a variety of languages, with aggressive plans to continue to expand the businesses. To support our continued compound annual growth and global expansion, we are looking for entrepreneurial, strategic and results oriented team members.<p>PHP Developer<p>As a PHP developer, working on properties such as Ashley Madison, CougarLife, Established Men, and ManCrunch you will be involved in all stages of developing the product you are working on. You'll create new product ideas and help guide the product roadmap, spec out what the next generation will look like, and implement it yourself. Because of this, we look for individuals who thrive in an environment where they will work creatively, take initiative and deliver on commitments.<p>The Challenge<p>As developers at Avid Life Media, we deal with some of the most challenging problems any of us have come across. The scale and speed of our growth force us to experiment with techniques and technologies only the very biggest websites ever need to use. Sometimes we find something other people have pioneered, and adapt it to fit our sites. Other times we’re the pioneers, inventing new solutions.<p>Here's what you'll do<p>-Contribute to product design and implementation discussions\n-Push the envelope on speed to implement projects from the idea phase to production\n-Test and iterate code before and after production release\n-Design, architect, implement, and QA new functionality<p>Here's what you'll need<p>-Experience with PHP\n-Strong JavaScript using JQuery\n-Good knowledge of SQL\n-Understanding of scalability, systems engineering, and algorithms\n-Sense of product and design\n-You know a lot of languages and you’re comfortable learning new ones quickly\n-You understand the importance of test/behaviour driven development\n-A general familiarity with Unix like operating systems (Linux, OS X, BSD) and a love for the power of the command line<p>It would be awesome if you had<p>-Experience with Ruby, Erlang, Objective-C\n-Experience with Sphinx, Lucene and/or Solr\n-Familiarity with Apache, Memcache, Nginx\n-Familiarity with Redis, Beanstalk\n-Knowledge of database scaling and common caching, sharding and partitioning approaches\n-BS or greater in an Engineering-related degree, Computer Science, Math, or Physics\n-Strong statistics/math skills (if you can’t measure it, you can’t understand it)<p>Qualified candidates should send a resume and cover letter to hr@avidlifemedia.com. In the e-mail subject line please reference \"Developer\".","time":1357140318,"type":"comment"}