{"by":"jtwaleson","id":5002148,"parent":4992617,"text":"Mendix <a href=\"http://www.mendix.com/\" rel=\"nofollow\">http://www.mendix.com/</a> (Rotterdam, The Netherlands) is on a hiring spree.<p><pre><code>  Looking for:\n  - Software Development Manager\n  - Devs (JS, C#, Java, Scala)\n  - Cloud Engineers (*nix, Puppet, Python, DNS, HTTP, etc),\n  - System Engineers (Hardware, Networking, etc)\n</code></pre>\nMendix is a fast growing Agile PaaS (100%+ per year revenue growth for the last 7 years) with HQ in Boston and R&#38;D in Rotterdam.<p>We're not some startup that's hoping to score a big hit, we're trying to change the world of software development.<p>If you've read \"Blue-collar knowledge workers will save the economy\" (<a href=\"http://seldo.com/weblog/2012/08/30/software_developers_can_save_the_economy\" rel=\"nofollow\">http://seldo.com/weblog/2012/08/30/software_developers_can_s...</a>), well, that's basically what we are doing.<p>We cater mostly to large businesses and deliver applications through our network of partners.<p>We're looking for a Software Development Manager to orchestrate R&#38;D (25+ people) and report to the CTO.<p><pre><code>  You should:\n  - have a hands-on mentality\n  - be a great fit with the team\n  - have at least 10 years of experience in software\n   engineering, including hands-on programming skills\n  - think that Agile/SCRUM is a good idea\n  - speak Dutch\n</code></pre>\nThis is a tough job but the salary will match.<p>We're also looking for very good developers / system engineers.<p>We work with the languages listed above, but if you're very good you can probably learn them soon enough.<p>Our team is great and we've had multiple international developers, however, relocation is required.<p>You can contact jobs@mendix.com and find more information at <a href=\"http://mendix.com/jobs\" rel=\"nofollow\">http://mendix.com/jobs</a><p>If you are interested in delivering applications using our platform: we have jobs for that in the US (Boston), the UK (Milton Keynes) and The Netherlands. Or you can sign up to become a partner!","time":1357218497,"type":"comment"}