{"by":"lost_my_pwd","id":7679557,"kids":[7695940],"parent":7679431,"text":"Moveline <a href=\"http://moveline.com\" rel=\"nofollow\">http:&#x2F;&#x2F;moveline.com</a> - REMOTE or Las Vegas, NV<p>TLDR: remote work, full-stack, JS, Node, Angular, Express, Mongo, Holacracy, Golang, Redis, Grunt, Bower, LESS, web + mobile<p>Moveline is transforming an industry older than the internal combustion engine. We ship every day and play Settlers on Fridays. Oh yeah, and Maker Day[1]!<p>We’re looking for a solid full-stack engineer who enjoys remote development, is self-motivated, and is ready to tackle tough problems.<p>&gt;&gt; About Us &lt;&lt;<p>- Winner of 2014 TBAN Las Vegas Tech Transplant of the Year [2]<p>- Driven to build software that dramatically improves the customer experience, end-to-end, around moving. Our web product is at the heart of it<p>- Well-funded by a group of world-class investors and advisors: (angel.co&#x2F;moveline)<p>- Our organization is flexible and embraces the Holacracy model of governance. Self-determination is encouraged and self-motivation is essential<p>- Have only begun to tackle the problem space. Serious fun and challenges still lie ahead<p>- Our stack is primarily MEAN — Mongo&#x2F;Express&#x2F;Angular&#x2F;Node - with some Golang on the backend. We regularly evaluate new tools and technologies for development advantages and not just because they are new and cool<p>- Techstars NYC 2012 graduate [3]<p>&gt;&gt; About You &lt;&lt;<p>- Fluent in Javascript and comfortable jumping between client and server side development<p>- Passionate about code, development practices, and maintainable solutions and want to work with others who are similarly so. You can’t sleep at night knowing something is not DRY and unit-tested<p>- Architected and developed end-to-end products that are currently running business applications in a production environment<p>- Energized when working closely with others on a small team<p>- Want to build stuff that solves real human problems<p>- Don’t care if the moving industry isn’t sexy<p>- Would rather make money than make the front page of TechCrunch (though we do that too)<p>&gt;&gt; Compensation &lt;&lt;<p>Market salary and meaningful equity is available. We’re primarily a remote engineering team, with the company (ops, marketing, customer service) based in Las Vegas in the heart of Tony Hsieh’s Downtown Project. Hackers in Vegas or remote in the US welcome. Full Time or Contract-to-Hire only please. No freelancers or recruiters need apply.<p>&gt;&gt; MENTION HACKER NEWS WHEN APPLYING &lt;&lt;<p>[1] <a href=\"http://www.fastcompany.com/3029158/agendas/why-your-office-needs-a-maker-day\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fastcompany.com&#x2F;3029158&#x2F;agendas&#x2F;why-your-office-n...</a><p>[2] <a href=\"http://vegastech.com/tbans-2014-tech-nevada-honors-event/\" rel=\"nofollow\">http:&#x2F;&#x2F;vegastech.com&#x2F;tbans-2014-tech-nevada-honors-event&#x2F;</a><p>[3] <a href=\"http://www.techstars.com/companies/stats/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.techstars.com&#x2F;companies&#x2F;stats&#x2F;</a>","time":1398950822,"type":"comment"}