{"by":"bkanber","id":7679699,"parent":7679431,"text":"Tidal Labs - New York City\nPHP&#x2F;JS&#x2F;HTML&#x2F;CSS Developer<p>We&#x27;re looking for an experienced PHP, JS, HTML and CSS developer to maintain a family of websites for our clients. You&#x27;ll be making incremental improvements to the sites, responding to tickets, and also managing a team of part time employees there to help you. The sites are built on an easy to use proprietary CMS inspired by WordPress.<p>Not everyone has the DNA for this type of job, and we want to make sure you&#x27;re in a role that you can thrive in and enjoy. Please consider the guidelines below before applying.<p>This role is good for you if:<p><pre><code>   * You like working on multiple projects simultaneously.\n   * You enjoy working with&#x2F;guiding&#x2F;managing junior developers, keeping an eye on code quality.\n   * Working with a CMS and developing themes appeals to you.\n   * You like thinking in terms of tickets, issues, and things to track.\n</code></pre>\nThis role is not good for you if:<p><pre><code>   * You would rather spend your time concentrating on just one product full-time.\n   * You&#x27;re not happy unless you&#x27;re innovating. \n   * You don&#x27;t like interacting with others or reading other peoples&#x27; code.\n   * You don&#x27;t like small, incremental changes and change requests from clients. \n\n</code></pre>\nSkills &amp; Requirements<p><pre><code>   * Mastery of HTML and CSS\n   * Very strong in modern PHP and JavaScript \n   * Minimum two years experience (or 8 projects completed) developing themes with CMSs like WordPress\n   * High level of attention to detail--you&#x27;ll be working with other developers and reviewing their code\n\n</code></pre>\nAbout Tidal Labs<p>Tidal is the world’s most comprehensive and advanced content marketing platform. The Tidal platform empowers communities behind many of the world’s largest brands and publishers through original, engaging content sourced from a pool of thousands of influential bloggers and creators unique to the Tidal Network. Businesses such as Conde Nast, Pepsi, Rakuten &amp; Random House partner with Tidal to create captivating, higher-trafficked and better monetized sites and social networks. We&#x27;re a thirteen-person team local to NYC that values education, personal growth, and work-life balance.<p>Why you should join us:<p><pre><code>   * market salary commensurate on experience\n   * health insurance\n   * personal growth and training budget\n   * work with an enthusiastic and intelligent team\n   * work from home 1 day per week\n</code></pre>\nHow to Apply:<p>We prefer applicants who can commute into NYC, but please apply if you feel you would be a good fit no matter where you are in the US.<p>Email us (using the button below, or at php@tid.al) with the following information:<p><pre><code>   * cover letter\n   * résumé\n   * brief description of the project you did your best work on\n   * brief description of the project you did your worst work on\n   * geographic location and your level of willingness to relocate\n   * desired salary</code></pre>","time":1398952297,"type":"comment"}