{"by":"stuartleigh","id":7679966,"parent":7679431,"text":"onefinestay - javascript application developer - London, UK<p># who are we?<p>There’s a new way to stay in a city. onefinestay is a trusted service for hosts to flexibly share their homes while they’re out of town. We give guests the best bits of a boutique hotel stay inside some of the most distinctive homes around.<p># why does onefinestay need developers?<p>As well as continuously improving www.onefinestay.com we’re building a whole bevy of tools to support the very real, very logistical business that depends on technology, from mobile tools to scheduling systems. Here’s a snapshot of some of the things we&#x27;re currently working on, will be working on soon, or maybe just finished.<p>Updating the entire online pre-stay experience for guests (we call it, online check-in)<p>Launched a brand new online magazine with custom cms called The Edition<p>Developed an authentication and staff management system to handle our ever-growing team<p>Completely revamping the entire site to support mobile devices (40% of our traffic comes from iOS)<p># who do we want?<p>We&#x27;re looking for someone who can question the status quo, bring new ideas to the table, see the full potential of a new feature (and push it to realisation), or if necessary tone down something that is getting out of hand. Everyone on the team is a fullstack developer, to some degree. But our django heavy application is moving more and more to the client in order to keep our interfaces as usable as possible. We&#x27;d like you to have some experience with server-side code in a production environment, but if yours isn’t in python or django, don&#x27;t worry, there’ll be plenty of time to learn. With that in mind, we’re looking for:<p>High-level ability in HTML&#x2F;CSS (SASS)<p>MVC style application development with javascript (backbone, underscore, react)<p>Some experience with server side frameworks (django, RoR, express)<p>Ability to work with our product team to develop high quality user experience<p>Strong knowledge of web standards and cross-browser compatibility<p>There&#x27;s a bunch of other stuff that will go a long way to get us excited:<p>Experience with source control (git, mercurial)<p>Experience with agile development methodologies<p>Comfortable working with pre-processors such as browserify, React&#x27;s jsx format<p>Experience with CI and automated testing (jenkins, jasmine)<p># what we can offer you?<p>Competitive salaries<p>Stock options<p>A social work environment filled to the brim with talented developers<p>Your choice of dev environment (on the penthouse floor of our sweet new offices)<p>Time to expand and grow your skills","time":1398954894,"type":"comment"}