{"by":"fmela","id":7679434,"parent":7679431,"text":"Connectifier (<a href=\"http://www.connectifier.com/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.connectifier.com&#x2F;careers</a>) is located in sunny Newport Beach, CA.<p>Every month millions of jobs are left unfilled. This means people look for work longer, companies move slower, and products and services that we all want don&#x27;t get delivered. Recruiting is a $400 billion per year industry, and there is ample room to make it better. Connectifier is a small but quickly growing venture-backed startup that’s passionate about solving the hiring problem. We build software to streamline the recruiting process and connect talented candidates with the companies looking to hire them. Join us to be an early employee at a fast growing startup!<p>Our engineering team has a depth of talent from places like Google, Microsoft Research, Berkeley National Lab, Carnegie Mellon, and Stanford. We’re committed to helping each other learn and grow while having a blast, and we’re looking for developers that are smart, ambitious, and get things done. We mostly work in Java, but you’ll get bonus points for server&#x2F;backend, Scala, HTML, JavaScript, or machine learning experience. You’ll get to design and develop large scale data processing systems, work alongside a talented set of peers, and make an impact beyond what is possible at a large, bureaucratic company.<p>We offer a highly competitive salary and stock compensation package, including 100% employee coverage for medical, dental, life, and disability insurance. We also provide lunch and a fully-stocked snack bar &amp; coffee station. To decompress, we play table tennis at the office, or volleyball at the beach (walking distance!).<p>Placing the right people in the right jobs is hard, and since we took on this challenge, we&#x27;ve already helped hundreds of companies, from fledgling startups to the Fortune 100s, find and recruit the best talent. We want to improve people&#x27;s lives by helping them work somewhere they love. If you want to help us change the world and drive the economy forward, shoot us an email at jobs+hn@connectifier.com","time":1398949388,"type":"comment"}