{"by":"fecak","id":7679686,"parent":7679431,"text":"Noom - NYC (Chelsea)<p>Noom is a health and wellness software company building mobile applications that have been downloaded over 20 million times worldwide. The company is fully committed to creating beautiful and functional products that enable users to live better and healthier lives. Noom’s headquarters is a spacious and bright gallery building in Chelsea, where ‘Noomers’ enjoy free daily gourmet lunches prepared by their in-house chef. Noom recently received a significant investment round and needs to expand their engineering team.<p>Noom’s Engineering Culture<p>Noom engineers are expected to contribute to a variety of projects, so it is not uncommon to work on the iOS or Android clients one week and the Python and Tomcat servers the next. Engineering efforts are broken into missions that generally last 4-6 months, with teams that may include cross-functional members from product and design. Once a mission is complete, engineers transition to a new mission which is likely to include an entirely new set of technologies. Noom practices include continuous build process, regular code reviews, and weekly deployments. Noom engineering moves fast – this means they always use the best tools for the job, or build them if necessary.<p>Their stack includes Nginx, Spring MVC, mySQL, and MongoDB for web and a hybrid approach with native Android and iOS SDK’s in Java and Objective-C mixed with HTML5 where appropriate.<p>The company is currently seeking Senior Engineers as well as Senior Designers (for both web and mobile).<p>Noom is a close group with a family feel. All Noomers receive 100% company-paid health insurance, $200 monthly health and wellness stipends, and a $700 annual gadget budget. The company offers flexible work schedules, stock options, competitive salaries, substantial paid time-off, and the opportunity to work with a skilled team making a difference. The company was named by Crain’s New York as a Best Place to Work in 2013.<p>apply to dave@fecak.com","time":1398952186,"type":"comment"}