{"by":"monejobs","id":7679733,"parent":7679431,"text":"Monetate - Conshohocken, PA (near Philly) - Relocation available.<p>Hiring a DevOps Engineer, and a Site Reliability Engineer.<p>Why we&#x27;re here<p>At Monetate, we help marketers identify and delight individual customers at scale, by personalizing web and email communications. We drive tens of billions of experiences each month crafted to treat each person as an individual. We&#x27;ve built a great foundation, and we&#x27;re only getting started.<p>What we believe<p><pre><code>    Our engineering team is passionate about scale and truly usable product. We believe in respect for each other and for our customers as a core value. We believe that as professionals we should find our work fulfilling and it should contribute toward our happiness in life. We believe that a small team with full technical authority and responsibility is key to both happiness &amp; project success. We believe in shipping and that done is better than perfect. We believe in working with the best and commit to continual improvement.\n    </code></pre>\nAbout the DevOps Engineer:  Conshohocken, PA. Relocation Available, No Remote.<p>Why we need you:<p><pre><code>    to help us ship software more quickly and reliably\n    to design and implement tools for reliable, zero-downtime, push-button releases\n    to measure, control, and improve our build, test, deployment, and release processes\n    </code></pre>\nWhat we&#x27;re looking for:<p><pre><code>    a highly collaborative technical leader\n    the ability and willingness to work on many different parts of our systems (Infrastructure, Operating System, Database, Application, Network)\n    a strong understanding of fundamental Internet technology\n    a strong understanding of operating systems, networking, and software engineering basics\n    experience using AWS or other virtualized infrastructure\n    experience using automation tools such as Ansible, Chef, or Puppet in production\n    five years running Linux&#x2F;Unix services in production\n    </code></pre>\nBonus Points for:<p><pre><code>    experience using AWS services at scale\n    experience running high-volume Internet services\n    contributions to Open-Source Software\n    </code></pre>\nAbout the Site Reliability Engineer:  Conshohocken, PA. London, UK. Palo Alto, CA. Remote-US. Relo available.<p>Why we need you<p><pre><code>    to monitor the availability, performance, and security of our services\n    to recommend and implement projects that improve the availability, performance, and security of our services\n    to further automate the building, testing, and deployment of our services\n    to implement and improve our monitoring, logging, and dashboard tools\n    </code></pre>\nWhat we&#x27;re looking for<p><pre><code>    excellent communication skills\n    independent problem-solving and decision-making skills\n    a rigorous and methodical approach to analysis and design\n    a deep understanding of fundamental Internet technologies (TCP&#x2F;IP, DNS, HTTP, IP load balancers, proxies, CDNs, etc.)\n    strong scripting skills (shell, python, etc)\n    experience using automation tools such as Ansible, Chef, and Puppet\n    five years of production Linux&#x2F;Unix administration\n    three years experience running virtualized servers in production\n    expertise with logging and monitoring tools (Nagios, New Relic, DataDog, etc.)\n    </code></pre>\nBonus Points for<p><pre><code>    experience using AWS services at scale\n    experience running high-volume Internet services\n    contributions to Open-source software\n    security expertise\n</code></pre>\nContact kway@monetate.com, or learn more at <a href=\"http://monetate.com/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;monetate.com&#x2F;jobs&#x2F;</a>","time":1398952593,"type":"comment"}