{"by":"benweatherman","id":7679821,"parent":7679431,"text":"Ordoro is a web app that helps people manage their e-commerce business. Like everyone else in the world, we need developers. Unlike everyone else in the world, we&#x27;re awesome. Come and work with us.<p>email ben@ordoro.com if you&#x27;re interested<p><pre><code>    Compensation and Perks\n    ======================\n    - $80k-$120k salary\n    - 0.1-1% equity\n    - Full health benefits\n    - Passionate and techno-curious teammates\n    - Chillaxed vacation policy\n    - A badass office in downtown Austin, TX (we&#x27;ll pay your moving expenses)\n    - Whatever gear you need for the job\n\n    Python Web Developers\n    =================\n    You&#x27;ll mostly be working on our Flask-powered JSON API. For the next few months\n    we&#x27;re focused on things like exposing our API publicly and caching. You&#x27;ll also\n    add whatever functionality is needed to support features our customers want.\n\n    In our dream world, the person we’d hire would love:\n    - Using Python, Go, Postgres, Redis, and exploring other technology that would\n      make Ordoro awesome\n    - Tuning SQL queries to keep the API fast\n    - Automation and testing\n    - Using 3rd-party APIs and figuring out all the fun little land mines their\n      docs fail to mention\n    - Deploying applications in a Linux environment\n\n    Javascript Frontend Developers\n    ==============================\n    You’ll be working on our client-side Javascript app along with adding\n    functionality to the Express-powered server. For the next few months we’re\n    focusing on porting code from a legacy application and adding several large\n    features our customers have been clamoring for.\n\n    In our dream world, the person we’d hire would love:\n    - Writing client- and server-side Javascript\n    - Discussing generators, promises, requirejs&#x2F;browserify, grunt&#x2F;gulp,\n      and not CoffeeScript\n    - The feeling you get when removing jQuery from a codebase\n    - Working closely with our designer to make a clean, intuitive\n      and world-class UX for our application\n    - Deploying large Javascript applications in a Linux environment</code></pre>","time":1398953557,"type":"comment"}