{"by":"sikakkar","id":7680348,"parent":7679431,"text":"San Francisco, CA - Front Row is hiring a generalist web engineer to join our high-growth, high-impact education startup. Email jobs@frontrowed.com<p>The business\nFront Row makes educational applications for students, teachers and principals that help them make data-driven decisions. As of today, more than a hundred thousand students have signed-up for Front Row and used it to receive custom-tailored guidance in their learning. Thousands of teachers use Front Row every day to save hours of time and make sure their students are growing at the fastest rate achievable. Front Row active users have been growing 100% a month for the past 6 months.<p>Front Row is successfully venture-funded and on the road to profitability.<p>As one of our very first engineers, you will be part of a team of developers who are passionate about their vocation, take pride in their craft and who push each other to grow as professionals. You will strive for pragmatism and 80&#x2F;20 in your work. You will be using tools that provide you with the most leverage and make you most effective. By working really smart, you will produce more than the average developer ever will, but without the crazy hours.<p>We love generalists who can quickly bring themselves up to speed with any technology we’re using: you will have the chance to learn a lot, and fast too. You will receive continuous support and mentorship on your journey to achieving mastery. We do however expect you not to need to be hand-held and rely on others for your own growth. You will have full autonomy over your work.<p>You must not be a drama queen, nor a brilliant jerk: your development chops alone will not cut it. You will work in an effective team that plans, executes and reflects together.\nBecause we’re a small team, everything you create will go into production and be used by hundreds of thousands of students. You will never do unimportant work: every contribution will make a clear and tangible impact on the company’s trajectory. Your personal success will be directly aligned with that of the company.<p>Most importantly, your work will have purpose: Front Row is a mission-driven company that takes pride in making a significant impact in the lives of thousands of students.<p>Tools\nFront Row is a polyglot combination of multiple web applications, mobile apps and asset generation tools. The front-end uses Backbone.js, several plugins and grunt.js for automation. The backend is predominantly made of Clojure-based app talking to PostgreSQL. Our tooling is a mix of Ruby scripts and Haskell apps. Operations relies on Ansible and Vagrant, with AWS for hosting.<p>Nice-to-haves\nYou have worked at a startup before\nYou have worked in small and effective Agile&#x2F;XP teams before\nYou have delivered working software to large numbers of users before\nYou are fluent in functional programming\nYou have a strong understanding of full-stack development, and are comfortable jumping from the front-end back to the DB if need be.<p>Front Row - our mission<p>It&#x27;s a sad reality that students from poorer families perform worse in school than students from wealthier families. Part of this reason has to do with home environment and absentee parents, but much of it has to do with inferior resources and less experienced teachers. The worst part of this problem is that if a student falls behind in any grade, they will forever be behind in every grade. So even if the probability of falling behind in 3rd grade is low (it isn&#x27;t), the probability of falling behind in 3rd grade or 4th grade or 5th grade (and so on) is really high.<p>That&#x27;s the core problem Front Row solves - it doesn&#x27;t let students fall behind. And if they fall behind, it catches them up really quickly. And it does this even if the teacher isn&#x27;t very good (although better teachers always help). Now, the probability of falling behind in any given grade is irrelevant, because it will never compound. The student who would have been the most at risk will instead be up to speed, and therefore far more motivated.<p>Email jobs@frontrowed.com to tell us a bit about yourself if you would like to apply.","time":1398958078,"type":"comment"}