{"by":"rjcantrell","id":7680463,"parent":7679431,"text":"Kabbage - San Francisco, CA and Atlanta, GA - <a href=\"http://www.kabbage.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.kabbage.com</a><p>Kabbage has successfully created a new market niche in providing short-term cash advances to small businesses via a completely-automated underwriting system. After linking Kabbage to a marketplace account, accounting system, or business checking account, users can have funds in their PayPal account in minutes. Data science and machine learning approaches underlie the underwriting model and provide a fertile bed for deeper understanding of (and potentially further products targeting) the SMB ecosystem.<p>Kabbage has received a metric ton of good press and awards from TechCrunch et al, the fintech industry, and the founders have been on Bloomberg TV and Fox News several times. Investors and board members include former Yahoo! CEOs, Square co-founders, UPS, and a veritable who&#x27;s who in the VC community -- <a href=\"http://www.crunchbase.com/organization/kabbage\" rel=\"nofollow\">http:&#x2F;&#x2F;www.crunchbase.com&#x2F;organization&#x2F;kabbage</a><p>Badass .NET jockeys sought in Atlanta, and badass data scientists sought in SF. Familiarity with the entire stack not necessary if the ability to learn it quickly is demonstrated.<p>Stats:<p><pre><code>  - Stack: ASP.NET MVC &#x2F; REST WebAPI &#x2F; EF &#x2F; SQL Server\n  - Employees: 80ish\n  - Office doors: zero\n  - Responsibility, ambition, development pace, salaries: all high\n  - Provided hardware: MacBook Pro Retina (or PC equivalent), plus as many Thunderbolt displays as you dare daisy-chain\n  - Lunch, snacks, drinks, parking: free!\n  - Kegs: 2\n  - Patents: 2 (plus four more applications)\n  - People who&#x27;ve beat Ghosts n&#x27; Goblins on the multicade cabinet: ZERO AAARGH\n</code></pre>\nI am an alumni of the company and therefore do not speak in an official capacity, but I&#x27;m happy to answer your questions or give feedback on your resume: rj@rjcantrell.com<p>More position info: <a href=\"https://www.kabbage.com/company/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kabbage.com&#x2F;company&#x2F;careers</a> (I would rather you send me your resume, but if you contact them directly, tell them RJ sent you)","time":1398959189,"type":"comment"}