{"by":"akubicek","id":7680098,"parent":7679431,"text":"Understory - <a href=\"http://www.understoryweather.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.understoryweather.com</a> - Boston, MA<p>About us:<p>Understory generates real-time, localized, atmospheric data, powered by its dense grids of proprietary weather stations. We are building the next generation of weather data and you can be an integral part of the team. Our weather stations are being carefully crafted for their first deployment and the atmospheric measurements are the most important asset.\nOur small company of three recently raised a seed round of $1.9 million and we are looking to grow our team.<p>We are currently working out of the Bolt (bolt.io) space in downtown Boston. It is an awesome office with great people, a ton of rapid prototyping equipment, idea paint conference rooms, full kitchen, and free coffee and (sometimes) beer. Come check it out!<p>We are looking for:<p>* Backend Developer * Data Scientist * Embedded Systems Engineer * Community Manager * Lead Product Manager<p>------------------------------------------------------------------------------<p>Backend Developer<p>Blend open-source technology with proprietary hardware to deliver real time data to customers quickly and efficiently. Build the robust interface between the weather stations and the web so that not a single data point is lost. Archive data so that it can be accessed years from now to lay the groundwork for the most detailed weather statistical models ever created.<p>------------------------------------------------------------------------------<p>Data Scientist<p>Use statistical and machine learning techniques with our proprietary sensor data to help solve the current data sparsity problem. Use findings from our local grids to improve the picture of nation-wide weather effects.  Explore the business opportunities for such high density data in the current market of sparse data. Join the team that will revolutionize weather data.<p>------------------------------------------------------------------------------<p>Embedded Systems Engineer<p>Write firmware that interacts with our next generation wind, rain, and hail sensor. Combine microprocessors and on-board Linux systems to create a robust observation and communication suite. Design printed circuit boards that support various sensors and systems.<p>------------------------------------------------------------------------------<p>Community Manager<p>Implement and maintain administrative systems and procedures. Grow and foster the Understory community though our website and blog. Analyze the Understory&#x27;s internal and external communications and design methods to improve them.<p>------------------------------------------------------------------------------<p>Lead Product Manager<p>Gain deep understanding and knowledge about markets and customers by channeling lean start-up techniques. Develop high-impact customer stories that help guide Understory’s product to create the most value with its customers. Work with the Understoy hardware and software teams to deliver products that utilize hyper-local weather data in a way that gets customers excited.<p>------------------------------------------------------------------------------<p>If you are interested in these positions, please see the full job descriptions at <a href=\"http://understory.theresumator.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;understory.theresumator.com&#x2F;</a> or email me at info(at)understoryweather(dot)com.","time":1398955920,"type":"comment"}