{"by":"capkutay","id":7680166,"parent":7679431,"text":"WebAction - Palo Alto, CA (relocation and remote are both possibilities)<p>jobs@webaction.com<p>Front-End Engineer at WebAction<p>“As far as the customer is concerned, the interface is the product”. - Jef Raskin, Designer of the Macintosh<p>As a Front-end Engineer at WebAction, you will work on creating a real-time interface to the world’s most valuable data. WebAction is a real-time big data platform that bridges the gap between users and terabytes&#x2F;petabytes of diverse, fast moving, and physically disparate data. We do this by offering high-speed acquisition of log data, distributed in-memory processing and caching, and real-time querying of stored data in one platform. As a result, it takes our customers less than a week to create real-time data driven applications that would normally take weeks to months of development effort with other products. Our unique solution is validated by our paying customers with use cases unmet by other big data products. You will be working at our headquarters in Downtown Palo Alto, just a block away from University Avenue. Founded by a team of Silicon Valley veterans with a track record of innovation and success, we are also backed by some of the most respected names in Silicon Valley. We are also well funded, including a recent $11 million funding round led by a private equity firm with a $15 billion fund.<p>===================================<p>Responsibilities may include:<p>-Work on an interface to help users explore vast amounts of real-time data with a simple drag and drop interface<p>-Implementing beautiful and robust dashboards in d3.js<p>-Collaborating both with designers and backend engineers to turn product requirements and wireframes into fully functional, efficient, and easy-to-use front-end components that surface the power of our platform<p>-Contribute ideas and define new ways of interacting with data with our innovative platform<p>===================================<p>About You:<p>-Strong knowledge of Javascript, CSS, HTML, and jQuery<p>-Enthusiasm for working in a startup environment<p>-Experience with Backbone.js or other front-end MV* frameworks<p>===================================<p>Nice to haves<p>-An interest in the type of scalable systems you hear about at Google, Facebook, Twitter, etc.<p>-You’re interested in telling stories and revealing anomalies through data visualization<p>-Concentration in Human Computer Interaction<p>===================================<p>Life at WebAction:<p>-You are walking distance to all that University Avenue has to offer in sunny Palo Alto.<p>-Perks and discounts at various businesses including airlines, hotels, gyms, restaurants, and many others<p>-Our kitchen is stocked with free snacks and drinks at all times<p>-We host Friday happy hours, get-togethers, and cater meals to our office patio<p>-You are entitled to excellent benefits, a competitive Silicon Valley salary, and generous equity.<p>===================================<p>Not a frontend engineer? We&#x27;re also hiring java developers who love distributed systems (think storm, ZMQ, HBase&#x2F;cassandra), big data application developers who want to dive into predictive analytics, and also marketing candidates.<p>===================================<p>You can reach us at jobs@webaction.com","time":1398956603,"type":"comment"}