{"by":"BlinkSoftware","id":7680973,"parent":7679431,"text":"Salt Lake City, UT: <a href=\"http://blinkss.com\" rel=\"nofollow\">http:&#x2F;&#x2F;blinkss.com</a> Blink is looking for a senior web developer to join our development team. We&#x27;re focused on cutting-edge development and creating custom web, mobile, desktop, and server applications. The majority of our web development consists of PHP and MySQL backends with lots of Javascript thrown in and responsive HTML frontends. We also write a lot of REST APIs to work with the native iOS and Android applications we create.<p>We have active projects on a number of different platforms which gives our developers opportunities to grow and use different technologies. Oftentimes, our projects involve multi-tiered architecture and we work together to build the server, API, website, and mobile solutions. We&#x27;re very interested in bringing someone onto the team who is passionate about specific platforms and can bring their expertise to our problem solving toolkit. We’re focused on web and mobile development and do everything from: large, custom admins for running various businesses, responsive front-ends interacting with real-time Node.JS backends, native iOS and Android apps for live video streaming, games, and touch screen kiosks.<p>Skills &amp; Requirements:<p><i>Strong programming capabilities and experience\n</i>Web development experience using LAMP\n<i>Expert Javascript skills and ability to create single page and multi page web applications\n</i>Expert PHP skills\n<i>Understanding of Node.js and Socket.io\n</i>Good understanding of MVC architecture\n<i>Mobile development experience on iOS and Android is a plus\n</i>Front-End web experience is a plus (pixel perfect specifically HTML&#x2F;CSS&#x2F;JS)\n<i>Ability to setup responsive HTML&#x2F;CSS a plus\n</i>Friendly, works well with others, ability to work on different types of projects<p>We&#x27;re project and task based at Blink and enjoy a very casual work environment. We offer medical, dental, and vision plans, a flexible and generous vacation policy, and a great place to code with a team, discuss projects, and meet new clients with interesting problems to solve. A few examples of recent projects we&#x27;ve worked on at Blink:\n<i>BYUtv iPhone and iPad apps\n</i>Deseret News iPhone and Android applications\n<i>Touch-Screen Kiosk for Primary Children’s Hospital\n</i>E Commerce site for Descente Clothing<p>We have a very laid back environment at Blink and because of the large portfolio of projects we work on our developers get to try new things and work on a large variety of technologies. We&#x27;re excited about the new projects we have coming in and are looking forward to making you a vital part of the team.<p>Apply online at <a href=\"http://careers.stackoverflow.com/jobs/55123/senior-web-developer-blink-software-inc\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;55123&#x2F;senior-web-devel...</a> or send an email to info@blinkss.com","time":1398963054,"type":"comment"}