{"by":"jgoldsmith","id":7681149,"parent":7679431,"text":"DoorDash  (YC S13) - Palo Alto, CA - hiring engineers and operations managers to build the future of on-demand logistics.<p>We&#x27;re creating a platform to connect small businesses with consumers for the next generation of local delivery. Unlike other local logistics companies, we operate a full stack delivery service: by partnering with merchants, hiring our own drivers, and building our own logistics software, we are able to control the entire delivery experience to make it more efficient for everyone.<p>Our team is looking to grow with talented people who want to build much more than just a food delivery company. We help small businesses grow, give underemployed people meaningful work, and offer affordable convenience to consumers. I&#x27;m happy to answer any of your questions: jonathan@doordash.com.<p>We&#x27;re hiring for all jobs listed here: <a href=\"https://www.doordash.com/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.doordash.com&#x2F;jobs</a>. DoorDash is growing very quickly and we&#x27;d love to have you join us!<p>Engineering:<p>* Front-end Engineer - build intuitive user experiences by interfacing with our APIs and using your framework of choice<p>* Software Engineer - create predictive models to efficiently assign drivers to orders and build out our backend systems<p>* iOS&#x2F;Android Developer - bring our products for consumers, merchants, and drivers to mobile<p>* Designer - work with all DoorDash teams to work on any part of the visual delivery experience, including print materials, marketing campaigns, and web UI&#x2F;UX<p>Operations:<p>* Operations support - join our elite ops team to delight customers by any means necessary and support drivers while they deliver<p>* Partnerships launcher  - bring DoorDash into new markets across the country by creating the launch playbook to partner with local \nmerchants<p>* Merchant account manager - support small businesses across the country as they grow and partner with DoorDash delivery<p>* Operations manager - build and scale out a world class driver workforce that&#x27;s excited about delivering happiness to our customers<p>* Delivery driver - work full-time or part-time delivery happiness (and food!) to delight our customers.<p>What you&#x27;ll get:<p>* Free lunch, dinner, snacks and drinks<p>* Health, Dental and Vision covered 100%<p>* Unlimited free deliveries via DoorDash!<p>* Competitive salary and equity packages<p>* Flexible hours. We&#x27;re an active team that loves to get outside every day<p>* Open vacation policy<p>* Free on-demand magic tricks from our in-house magician","time":1398964510,"type":"comment"}