{"by":"ashleyjohn","id":7681270,"parent":7679431,"text":"Academia.edu  |  Downtown San Francisco  |  Full Time Engineers  |  Relocation Available<p>Academia.edu is an agile startup located in San Francisco on Kearny and Bush Street.  Our CEO is Richard Price who received his PhD from Oxford in Philosophy and is an avid sailor.  Our team is also led by CTO Ben Lund who is not only a great technical leader, but also an amazing foosball player.<p>We are well-funded by Khosla Ventures and we are on a mission to Open Science.  Our goal as a company is to build an end-to-end publication system that provides the world with free and accessible academic and scientific papers.  So far we have 9,364,002 users.<p>Feel free to check out the technical projects that our engineers are tackling (see below) or visit our hiring page at <a href=\"https://www.academia.edu/hiring\" rel=\"nofollow\">https:&#x2F;&#x2F;www.academia.edu&#x2F;hiring</a> to learn more about us.  We look forward to hearing from you.<p>We are Hiring a Team to Build a Better Future<p>Here at Academia.edu you will have an opportunity to join an agile team of 9 Engineers who are all making a positive impact on the world by contributing to a movement called Open Science.  As a member of our team you will be given a lot of autonomy to choose projects that interest you the most and the ability to make product decisions with our CTO Ben Lund and CEO Richard Price.<p>We are currently tackling five incredibly difficult product challenges.  Some of these projects have been attempted by larger companies and have failed.  In order to be successful we will need to think way outside-of-the-box and take a leap into the unknown…<p>Peer Review<p>We want to build a peer review platform that allows layers of discussion on top of a single document.  One of the biggest challenges we face is that contextual commenting at a large scale has yet to be achieved.  In order to be successful we need to find original and novel solutions because simple approaches like putting a blog-style comment box at the end of the paper has been tried before and has not been effective.<p>To build Peer Review we must figure out a way to transform all the wide array of styles from any given PDF paper to a clean and consistent format that is embedded for a suitable commenting UI.  We are experimenting to build a rich inline-commenting and discussion interface as well as a reputation system that surfaces quality comments.<p>Interface Design<p>We currently have 7.5 million users who upload their research papers.  Academia converts these PDFs to HTLM5 to display in the browser.  We face the challenges of building web UIs for scientific content such as 3D molecular visualizations and tools for exploring genetic sequences.  We will also build back-end parsers, converters, and storage schemes to enable these UIs.<p>Recommendation Engine<p>We have a news feed that displays recommended papers to our users.  Currently we use a simple rule-based system where papers are tagged by research interests and our users can follow those research interests.  In addition, our users can follow each other.  We want our users to feel as if they are attending an amazing conference where everything we show them is the most relevant and up-to-date information that is available in their field.<p>In order to improve our recommendation engine, we will be immersed in Natural Language Processing and Machine Learning.  We want to identify which particular field of the paper it correlates to (math, biochemistry, anthropology, etc.) and the type of document (original research, a review article, a conference presentation, a lecture note or some other content).  Using everything from a paper’s previous viewers on Academia.edu to its author and content to its place in the citation graph, we want to determine the relevance of a particular document to a particular user.  Lastly, using large-scale data analysis we want to identify trending papers, highlight influential researchers and help the public uncover important new work more quickly and reliably.<p>Mobile App<p>Academia does not have a mobile app but we are dedicated to building one!<p>Working with a clean slate, we will design and build a mobile API that displays Academia’s core features.  These features will include the user profile, upload papers, news feed, analytic data, and the ability to make comments on papers (Peer Review).  In order to build a dynamic mobile API, we will write easy-to-use client libraries in a wide range of scripting languages that will encourage integration with Academia’s data, content and identity into their apps.<p>Speed, Scale, &amp; Storage<p>Our engineering team will have to build highly scalable systems that effectively store and analyze our entire stream of hits.  We have built an analytics dashboard so that every user can see how many people viewed their profile and how many people have read their uploaded papers.  We enabled this feature by storing structured data in DynamoDB- currently 343 million rows and growing 10% per month.  We want to build features that require more sophisticated aggregations on this data than DynamoDB can provide.<p>Furthermore we will need to figure out how to effectively store massive amounts of data while increasing the speed of our product especially to parts of the world where there is slower internet connections.  This is important because areas in the world with slower connections tend to be where researchers can benefit the most from open access to research.  Our platform must be useable for them too.<p>Future at Academia.edu<p>We have a fun and agile team and we are growing (our site usage grows 10% per month)!  We have the resources to make our mission come true.  We just raised $11 million from Khosla Ventures, Spark Capital, and True Ventures.<p>Apply<p>If you think you would be interested in solving some of these technical problems, then please do not hesitate to contact ashley@academia.edu.  Or if you are interested in chatting with our CEO Richard or meeting the team for a game of foosball, then let us know as you are more than welcome to drop by our office in Downtown San Francisco.","time":1398965416,"type":"comment"}