{"by":"kateegb","id":7681232,"parent":7679431,"text":"San Francisco – InstaEDU (www.instaedu.com)<p>We&#x27;re a 21-person education startup in downtown San Francisco looking to add to our engineering team.\nInstaEDU is a marketplace for online tutoring. As more education moves online and video and collaboration technologies reach a point where they can properly replace in-person learning, we see an enormous opportunity to reach a much wider category of students. We’ve been growing quickly and announced our series A this past August.<p><a href=\"http://techcrunch.com/2013/08/14/instaedu-series-a-battery-ventures/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2013&#x2F;08&#x2F;14&#x2F;instaedu-series-a-battery-v...</a><p>To keep up with our rapid growth, we’re excited to add new team members to our 10-person eng team. We&#x27;re looking for engineers with strong python programming skills, proficiency with javascript, HTML, CSS, and experience working with Django, SQL&#x2F;PostgreSQL, JQuery and&#x2F;or Redis&#x2F;NoSQL. We’re looking for both full-stack and backend focused (python) engineers.<p>Additionally, we’re currently looking for Mobile Engineers to help create InstaEDU’s first mobile apps. If you’re a strong Android or iOS developer interested in playing a major role creating the apps, we definitely want to hear from you.<p>More about the roles here: <a href=\"http://instaedu.com/about/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;instaedu.com&#x2F;about&#x2F;jobs&#x2F;</a><p>Benefits of working at InstaEDU include: close-knit team all passionate about the product we&#x27;re creating, weekly catered lunches and fully stocked kitchen, 401K, Medical, dental, and vision insurance, hack days, weekly Friday happy hour and monthly team events (Wine tasting trips, Giants games...)<p>Feel free to ping me at kate (at) instaedu (dot) com if you have any questions. To apply, send your resume, GitHub profile, blog, and&#x2F;or any projects that you&#x27;re proud of to jobs (at) instaedu (dot) com. If you&#x27;re awesome, we want to hear from you!","time":1398965128,"type":"comment"}