{"by":"alexbrynza","id":7681076,"parent":7679431,"text":"Technical Manager, Software Engineering - EMC Isilon \nSeattle, WA\n_____________________________________________\nSend me an InMail on LinkedIn. (Alex Brynza)<p>GENERAL SUMMARY\nData is the stick we use to promote change, the success we bring to the market is the carrot!\nThis job is about being able to make the hard decisions from a tactical and strategic perspective.   In Post Release Engineering, we support the front line and the backend.   Managing this team requires knowledge of code to assist in architecture decisions and reviews, an interest in the market, to help prioritize the tactical work and promote long term strategic returns, and the desire to have a seat at the table when the big decisions are made.  This is not a job around quick band-aids and calming the customer, this is a job around getting ahead of the curve and pushing code, process, and policy to bring relief.  I’m looking for a planner, not a mechanic!\nYour days will be a combination of helping understand and prioritize customer issues and product vulnerabilities and contributing to the overall growth and robustness of the organization from a tool, employee growth, and product point of view.  You’ll interact with product management, global support, core engineering, and customers, to bring our product to a broader and increasingly demanding market.   Accurate information is our food, intelligent code is our aim, delighted customers is our measure of success.   No whiners, wallflowers, or cowards….decisions are made by those who show up!<p>PRINCIPAL DUTIES AND RESPONSIBILITIES\nPrioritize and organize incoming issues into short term tactical mitigations and long term strategic development plans.<p>Review code and architecture for improvements, optimizations, or better diagnosis of the system<p>Engage and grow your team to provide quick returns on product issues and develop tools to increasingly improve our service to the customer<p>Advocate for the team and customer across the entire organization.<p>Grow and mentor the team\nResponsible for collecting data and assembling it into trends, weaknesses, and possible growth opportunities<p>Setting roadmap with measures for success in Post Release Engineering then execute to it<p>Collaborate with the management team to provide a cohesive and scalable post release engineering story.<p>SKILLS<p>Coding skills: able to review code both architecturally and technically<p>Analytical skills: must be a lover of data, able to assemble a picture, coalesce an accurate vision of the field out of the nuance of customer input.<p>Communication skills:  must be willing to advocate, prioritize, and push back…politely<p>Interpersonal skills: help grow the team, not just technically, but on soft skills and political understandings<p>Understanding of business environment, help know the market, set the priorities<p>Presentation skills: able to present a roadmap, a simple fix, or an endemic problem…clearly, concisely, and with purpose<p>Conflict resolution skills: able to work between teams, contribute to unity across organizations.<p>Mentoring&#x2F;Coaching skills","time":1398963859,"type":"comment"}