{"by":"cliftonk","id":7681263,"parent":7679431,"text":"OrgSync — Dallas, TX. Full-time.<p>Frontend &#x2F; Backend &#x2F; Full-stack<p>## Job Summary<p>We&#x27;re looking for a sharp engineer to work alongside a small team of developers and designers committed to building a robust, performant and scalable web application serving over 350 colleges and universities around the country. You have an attention to detail and a professional curiosity that extends beyond the workplace. You will work in a mostly autonomous environment, so you have to be just as awesome at getting things done as you are at composing elegant solutions.<p>Most of our code is written in Ruby and runs on the Rails stack backed by a MySQL database, but we also incorporate other technologies such as Node.js, Memcached, ElasticSearch and Redis. We use GitHub for version control and our infrastructure is entirely hosted via cloud services. We care about keeping our libraries up-to-date and test coverage. While most of our stack is on Rails today, we&#x27;re comfortable with other technologies and always strive to use the right tool for the job.<p>This is a full-time position at our headquarters in Dallas, TX and includes a competitive base salary, a full range of benefits, stock options, and an awesome team of creative people by your side.<p>## Requirements<p>- Passion for developing excellent software and an appreciation for elegant code<p>- Strong understanding of web services and REST concepts<p>- Strong understanding of relational databases including complex queries and optimization<p>- Experience writing object-oriented software guided by tests<p>- Strong understanding of performance optimization and caching techniques<p>- Being comfortable in a polyglot environment a plus<p>- Open source project contributions a plus<p>- Ability to play &quot;Careless Whisper&quot; on saxophone a plus<p>- Strong written and verbal communication skills<p>## Links<p>Open source: <a href=\"http://orgsync.github.io/\" rel=\"nofollow\">http:&#x2F;&#x2F;orgsync.github.io&#x2F;</a><p>Blog: <a href=\"http://devblog.orgsync.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;devblog.orgsync.com&#x2F;</a><p>Openings: <a href=\"http://www.orgsync.com/company/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.orgsync.com&#x2F;company&#x2F;careers</a>","time":1398965359,"type":"comment"}