{"by":"Killswitch","id":7681942,"kids":[7684259],"parent":7679431,"text":"Full-time in Chicago - Front-end Engineer<p>ThreadMeUp - <a href=\"https://www.threadmeup.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.threadmeup.com</a><p>Who we are and where we&#x27;re at<p>We’re an ambitious, funded startup hellbent on creating the ultimate custom apparel platform for designing, ordering, and crowdfunding. We are extremely dedicated to the quality of our web application. We will cut no corners and spare no expense to blow away all expectations and provide our users with an absolutely outstanding experience. We have a functional application that is already pushing orders, but we built it in a bootstrapped state, and have a much more ambitious vision for its future.<p>What we’re looking for<p>We need a true engineer to really take over the front-end of our web application and work together with us in a highly agile environment, onsite in our Chicago office. Before we were funded, our creative director did the whole front-end, but that was a temporary solution. We’re going to be rebuilding our platform, and we need your expertise on our team to produce a maintainable, flexible, scalable front-end, and continually improve our product into the future.<p>Why you might like being on our team<p>We respect your expertise: we will present you with the problem rather than the solution.\nWe care about being cutting-edge: we want you to explore new tools and technology.\nWe give you ownership of your work: for all things front-end, your word is gospel.\nThere’s no dead weight to carry: just like you, your teammates are experts in their own right. This means the product we create will be stunning.\nWe won’t control your hours: we only see progress, not time you’re in or out, just be integrated with the team and generally present.\nYou don’t have to be secretive: we want to win awwwards and be involved in the community.\nOur creative director can do the meticulously tweaked to perfection CSS for visuals&#x2F;motion himself, instead of bugging you to move things over a few pixels.\nWhere you would fit into the team<p>Primarily, you’d be forming a dynamic duo (neither of you has to be Robin it’s cool) with our creative director (see <a href=\"http://isaacpvl.com\" rel=\"nofollow\">http:&#x2F;&#x2F;isaacpvl.com</a> ) The two of you are responsible for everything our visitors see and feel, which is paramount to us. You’d have the opportunity to be part of the design process not just where it pertains to technology, but also to user experience. You’d also be highly involved with our CTO and lead software engineer, who are responsible for the back-end. We’d all be coming together to build, launch, and constantly improve, so transparency and integration within the team is a must.<p>The list of stuff<p>You have strong, dearly-held philosophies about proper organization and structure of client-side code.\nYou are well versed in JavaScript frameworks (like AngularJS,) and have an opinion you could back-up on which one you would use based on the situation.\nThe same goes for CSS frameworks (like Bootstrap 3.)\nYou have a fundamental understanding of software development, and web application architecture and design patterns.\nYou can effectively collaborate with the design process and quickly iterate based on the feedback it responds to.\nYou don’t just grasp the big picture, you have a vision for how you could make it better and want to be in a position to make that a reality.\nYou strive for the results of your work to be nothing short of stunning (and you want to be on the front page of awwwards.)<p>Compensation is negotiable but you can expect to paid competitively.<p>Just shoot our CTO an email introducing yourself! Cory Keane: cory@threadmeup.com","time":1398970500,"type":"comment"}