{"by":"mierle","id":7682339,"parent":7679431,"text":"San Francisco, CA and Cambridge, MA - Locu is hiring Frontend Engineers,\nBackend Engineers and Visual Designers for Full-time<p>Locu helps local businesses Get Found. With a patent-pending technology platform that digitizes and structures real-world data, Locu is building tools that help businesses connect with customers. Locu’s content platform is the easiest way for merchants to keep business information, menus and price lists updated and distributed across the Web, and Locu’s API gives developers access to the world&#x27;s largest real-time, structured repository of local business data.  Over 40,000 local merchants are using Locu to promote their businesses online.  Locu was founded by MIT graduates and is backed by investors including General Catalyst Capital Partners, Lowercase, Lightbank, and SV Angel. Our beautiful offices are in downtown San Francisco, CA (Union Square) and Cambridge, MA (Kendall Square). Check out photos and learn more about our other perks:<p><a href=\"http://locu.com/about/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;locu.com&#x2F;about&#x2F;jobs&#x2F;</a><p>Frontend Engineering<p>If you are passionate about building products that will touch millions of merchants and hundreds of millions of consumers through the applications powered by our local data APIs, Locu is the right place for you. [JQuery, Less, Django, node.js, etc.]<p>Backend engineering<p>We started Locu out of MIT to solve real-world problems by leveraging the latest research in computer science. If you are looking to solve some of the most challenging problems in machine learning, NLP and human computation, you&#x27;ll feel right at home. [Python, Django, Node.js, Postgres, Redis, AWS, etc.]<p>Design<p>We&#x27;re looking for visual designers who are excited to redefine what the future of local business data looks like across web and print, and to create tools that put modern web technology in the hands of merchants.<p>Interested? Drop us a line at jobs@locu.com. Please include &quot;[HN]&quot; in the subject of your letter. Learn more about us (now with photos!) at: <a href=\"http://locu.com/about/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;locu.com&#x2F;about&#x2F;jobs&#x2F;</a>","time":1398974197,"type":"comment"}