{"by":"ilz","id":7682581,"kids":[7684619],"parent":7679431,"text":"Blue Apron (New York, NY): Software Engineer<p>Blue Apron (<a href=\"http://www.blueapron.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.blueapron.com</a>) is an NYC-based startup delivering original recipes and premium, seasonal ingredients needed to prepare them, in exactly the right proportions. We&#x27;ve raised $58M from First Round Capital, Bessemer Venture Partners, and Stripes Group [1]. Forbes recently named us one of the hottest startups of 2013 [2].<p>After just 18 months, we now deliver over 600,000 meals each month nationwide, and we continue to double every quarter.<p>Our engineering team is building software to manage the forecasting, purchasing, preparation, and shipment of 60 to 80 different fresh ingrededients each week at a massive scale. The nature of our business carries with it unique supply chain and logistical challenges that require custom solutions and data analysis, the likes of which the industry has never seen before.<p>Our stack: Ruby on Rails, RSpec, Ember, PostgreSQL, HAML, Bootstrap, SASS, JQuery, AJAX, Git, Heroku<p>About you:<p>- You&#x27;ve taken features or products from concept to completion and have experience working with production web applications.<p>- You communicate your ideas clearly, and are capable of designing and implementing complex, scalable solutions.<p>- You want to build software that has impact on the lives of customers and coworkers alike.<p>- You are always learning and are excited at the prospect of mastering new technologies and techniques.<p>- You write tests to improve the quality and reliability of your code.<p>- You help teammates improve by reviewing their work and appreciate feedback when they reciprocate.<p>This role comes with health insurance, a flexible vacation policy, and competitive salary and equity. To apply, please submit a short email outlining your experience and why you are interested along with your resume to jobs@blueapron.com.<p>[1] <a href=\"http://blogs.wsj.com/venturecapital/2014/04/30/blue-apron-raises-50m-to-deliver-do-it-yourself-meal-kits-recipes/\" rel=\"nofollow\">http:&#x2F;&#x2F;blogs.wsj.com&#x2F;venturecapital&#x2F;2014&#x2F;04&#x2F;30&#x2F;blue-apron-ra...</a>\n[2] <a href=\"http://www.forbes.com/pictures/emjl45himd/blue-apron-4/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.forbes.com&#x2F;pictures&#x2F;emjl45himd&#x2F;blue-apron-4&#x2F;</a>","time":1398977110,"type":"comment"}