{"by":"mbaer","id":7682085,"parent":7679431,"text":"Skai, Inc. - Washington, DC Metro Area (Arlington, VA)<p>About Skai:<p>Originally funded out of the MIT computer science community, Skai is a fast-growing technology company. With over a thousand pages of intellectual property behind our core technology, we are disrupting the data integration market by delivering a cloud platform for the next generation of big data. Skai is working with some of the largest Fortune 500 companies. Although we can’t go into any more detail in this space, we’d love to tell you more once you’ve applied!<p>Senior Back-End Developer<p>Join our engineering team as we tackle the challenges of distributed data and computation. As part of the platform development team, you’ll participate actively in all phases of the development process: architecture, design and implementation. If you’re interested in graphs, distributed data structures, functional programming paradigms, reactive computation, or distributed systems, then we’d love to talk to you!<p>Skills &amp; Requirements:<p>Need to have: \n\t• Java proficiency\n\t• Excellent communication skills\n\t• Some experience with the Hadoop ecosystem\n\t• B.S. in computer science or equivalent experience\nNice to have:\n\t• HBase proficiency\n\t• Hadoop MapReduce proficiency\n\t• Distributed systems experience\n\t• Experience using Spark or other tools in Berkeley Data Analytics stack\n\t• Experience with Akka actor framework<p>Skai is looking for talented developers for a Front-End (CONTRACTOR)<p>Skills &amp; Requirements for Front-End:\nNeed to have:\n\t• HTML, CSS and Javascript\n\t• At least two years of experience in front-end web development\n\t• Excellent communication skills\nNice to have:\n\t• Experience working with a Java back-end<p>....and Software-Solutions (Full-Time) position<p>Skills &amp; Requirements for Software-Solutions:\n\t• Programming in Java\n\t• Java EE web frameworks\n\t• Hadoop ecosystem, including HDFS, MapReduce and HBase\n\t• Cloud-based deployments such as AWS<p>We want our developers to be happy and productive, and we don’t hesitate to buy whatever software or hardware tools are needed to make that happen. We also like to relax with board games and ping pong on Friday afternoons. We offer competitive compensation, including stock options.<p>If this sounds like the kind of work you want to do, then reach out to us at careers@skai.net","time":1398971813,"type":"comment"}