{"by":"tmatthew","id":7682352,"parent":7679431,"text":"NYC. Dublin. Limerick. VISA.<p>Gilt - www.Gilt.com<p>We have small, autonomous teams. Decentralized decision-making. Scala. NoSQL. Team ownership of end-to-end quality. Support for open source technologies. A friction-free production environment. Distributed systems. Continuous delivery. Simplicity. Automation.<p>==============================================================<p>More than 50 percent of Gilt’s traffic–and more than 40 percent of our revenue–comes from mobile devices, and we expect these numbers to increase over time. Given this projected growth, the Gilt Mobile team continuously works to discover new and better ways to build the lightest, fastest mobile experiences possible. That means developing custom applications that can successfully release millions of push notifications within seconds, devising ways to automate testing to match people’s behaviors, and creating the most elegant user experiences in the industry. The dynamic nature of our operations means that there’s always something new to learn, develop and explore.<p>Think an iOS role is for you? Apply here: <a href=\"http://www.gilt.com/careers/job/r1602/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.gilt.com&#x2F;careers&#x2F;job&#x2F;r1602&#x2F;</a><p>==============================================================<p>We are looking for Product Managers, Systems Engineers, Leads, Front-End Architects, Business Intelligence Engineers, Network Engineers, Big Data Scientists and more.<p>Check out our openings here: <a href=\"http://www.gilt.com/careers/department/technology-product-management/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.gilt.com&#x2F;careers&#x2F;department&#x2F;technology-product-ma...</a><p>Feel free to apply through our website or email me directly.<p>==============================================================<p>Also, check out our tech blog for the date of our free tech courses: <a href=\"http://tech.gilt.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;tech.gilt.com&#x2F;</a>","time":1398974326,"type":"comment"}