{"by":"jay908","id":7686012,"parent":7679431,"text":"YinzCam - Pittsburgh, PA<p>We are the leading mobile developer for sports-team apps in the United States, and work with football, basketball, hockey, soccer and rugby teams.<p>We are experiencing a period of significant growth in our business, and are looking to add more full-time iOS, Android and Windows Phone developers.<p>You will have the opportunity to work in a team of highly-skilled and experienced mobile developers, to work closely with designers, to innovate with new features (such as augmented reality, gaming, etc.), to interface with databases and official league&#x2F;team statistics and editorial-content feeds, to interface with third-party SDKs and plug-ins, and more. You will have the opportunity to build and launch mobile apps that will be promoted by sports teams&#x2F;stadiums as their OFFICIAL mobile app, and that will, therefore, be in the hands of millions of fans around the world.<p>Perks<p>You will have the opportunity to travel to stadiums&#x2F;arenas around the country (and potentially overseas) to see how sports technology works behind the scenes. You will be exposed to the sports industry and all aspects of the company&#x27;s business, including licensing, sales, advertising, revenue generation, etc. You will work in a company that invests significantly in the training of its personnel, with staff being routinely encouraged to attend professional-development and training conferences to hone and extend their skills. Benefits include competitive salaries and medical+dental insurance.<p>Why are we hiring?<p>We are currently expanding rapidly to take on even more clients, more teams&#x2F;stadiums and more sports, including overseas, and we are looking to grow our mobile team by adding full-time iOS developers to meet the demand for our products, and to bring even more innovations and features to our existing mobile offerings. Our company affords a close-knit entrepreneurial environment with every individual being exposed to, and having a tangible impact on, the company&#x27;s business.<p>Come join us, and you will be a part of developing the ultimate mobile experience for sports fans everywhere!<p>Send your resume and cover letter to jobs@yinzcam.com","time":1399042288,"type":"comment"}