{"by":"aguynamedben","id":7687188,"parent":7679431,"text":"San Francisco.  Full-time.<p>I&#x27;m the hiring manager, please email me directly at ben@firstround.com if you&#x27;re interested.<p>First Round Capital is building an in-house engineering team to work in venture capital.  We’ve funded companies like Square, Uber, Airware, Planet Labs, Warby Parker and Hotel Tonight in their infancy and worked alongside them to help them succeed. We&#x27;re looking for a full-stack engineer who’s interested in building products that help startups win.<p>You&#x27;d be working on First Round&#x27;s internal software platform that connects founders, CEOs, and startup leaders every day. Building a new, successful company requires unique information, so we’re digitizing that knowledge and making it available to our community. It’s not an odd-job position (although versatility is appreciated), but a role on a small engineering team that is proud, organized, and lean. You’d make a huge impact.<p>This is a rare opportunity to ship interesting features while getting a peek into how VCs and startups work. If you want to start a company one day, this is your chance for the ultimate education in all things startup.<p>Requirements:<p>- Inspired, interested in startups, venture capital, and learning.<p>- Enjoy attending community events. We have a lot of them.<p>- Versatile skill-set. You can jump between layers of stack, do it all and ship.<p>Technical Requirements:<p>- 1-8 years of experience (flexible)<p>- Web frameworks such as Rails, Django, or similar<p>- Deep knowledge of either Ruby or Python and associated tools<p>- RDBMS&#x2F;SQL experience<p>- JavaScript&#x2F;HTML&#x2F;CSS best practices<p>- Basic unit testing skills<p>- Basic ops skills<p>- Git skills<p>Nice to have but not required:<p>- Rails expert - Capybara, RSpec, ActiveRecord, Bundler, Gemfiles, 3rd party libraries, etc.<p>- Specific love for making things pretty on the front-end<p>- Experience customizing Twitter Bootstrap<p>- AngularJS or other JavaScript experience<p>- Experience with Redis, ElasticSearch, collective intelligence, or data organization<p>- Experience at a startup, dev shop, or any small company<p>Our stack is simple and nimble: Ruby on Rails, PostgreSQL, Heroku. Most of it is unit tested and has Selenium tests. We focus on the unsolved problems and the information side of building startups.<p>This position is full-time, salaried, and located in San Francisco near downtown. For more information please contact ben@firstround.com.<p>About First Round Capital<p>First Round Capital isn&#x27;t just an early-stage venture capital firm, it&#x27;s a vibrant network of technology companies changing the way people live. Whether it&#x27;s paying with Square or moving around your city with Uber, First Round companies touch hundreds of millions of lives. First Round is changing venture capital by providing its companies with the tools and resources they need to succeed. This includes the First Round Review, the first blog of its kind, delivering insights from tech luminaries on company building, design, strategy and more in an effort to help entrepreneurs build better companies. It also includes First Round’s Knowledge Program, which holds 70 events a year, ranging from 15-person CEO dinners to 200-person CTO Summits. With 2 events held a week, content is constantly being created and shared within the community.","time":1399054216,"type":"comment"}