{"by":"ce1","id":7699131,"parent":7679431,"text":"Software Engineer - Backend (Java&#x2F;Python)<p>Berlin, Germany (relocation, we&#x27;ll help)<p>More info through career (at) minodes.com<p>What we do: At Minodes, we develop cutting-edge products for in-store analytics, marketing attribution and iBeacon services. Our product provides actual insights and enhances the experience of millions of shoppers at leading retailers across various industry segments. We are growing fast and are looking for passionate people that can make things happen and have fun at it. Sounds promising?<p>What you will do: We are looking for a top software engineer to join our ambitious and talented team that is responsible for the development of our in-store analytics and marketing products and the data infrastructure that handles millions of data points every day.  As we expand our products, you will help tackle many challenges along the way, ranging from hardware to software, to make our platform more robust and efficient. If you are looking  to have real impact and a say in a future-ready product, this is for you.<p>And about you:<p>* You must have strong computer science fundamentals including a deep understanding of data structures and distributed algorithms.<p>* You have extensive experience with highly scalable web based systems, designing web APIs, managing plus analysing large datasets, and data visualisation.<p>* You care deeply about performance and performance monitoring.<p>* You are a polyglot programmer who uses the right language for the job and are not married to any for philosophical reasons - with expertise in one of the following technologies, proficiency in several, and curiosity about the rest: Java, Python, JavaScript, Ember.js, SQL and NoSQL databases, Unix-based systems.<p>* You are more pragmatic than idealistic when it comes to software development. You know how to compromise and can strike the right balance between a perfect solution and delivery on time and under budget.","time":1399304148,"type":"comment"}