{"by":"counsyl14","id":7700011,"parent":7679431,"text":"South San Francisco, CA\nHiring FT - Software Engineers and Automation Engineers (Mechatronics&#x2F;Robotics)<p>What is Counsyl?\nCounsyl is a health technology startup building a software platform that is revolutionizing the the healthcare industry. Our end goal is to build a scalable, consumer web facing product that helps people worldwide gain critical information about their bodies and plan for their futures. We offer an engineers the unique opportunity to not only build these meaningful software solutions but also get firsthand exposure to robotics within our own in-house wetlab!<p>What does a Software Engineer do at Counsyl?\nOur engineers build custom software from scratch based on a Python&#x2F;Django&#x2F;Postgres stack. They build new tools, workflows, and infrastructure when it comes to patient, physician, and internal communication. Some of the challenges they tackle daily are related to: \n\t◦\tTracking samples, inventory, billing, interactive applications in real time\n\t◦\tUsing complex algorithms and machine learning to target gene mutations that lead to the main causes of different diseases\n\t◦\tCreate software that connects lab robotics and patient samples for high throughput<p>What does an Automation Engineer do at Counsyl?\nOur Automation Engineers are handling all aspects of software design that goes into our robots. They are tackling everything from high-level software implementation to  mechatronics systems design to electrical circuits drawing to custom robotics parts development. These areas affect our lab processes when it comes to:\n\t◦\tDNA extraction\n\t◦\tControls software\n\t◦\tOverall sample management\n\t◦\tSensor software<p>A lot of companies can&#x27;t do custom hardware robotics stuff because it takes a lot of software. We are tackling this problem by taking nothing and turning it into full stack software. We are developing algorithms, using 3D printing for functional prototyping, and leveraging 2 decades worth of robotics to help people make effective health decisions on a macro scale. Come be a part it!<p>To apply, go to: \n<a href=\"https://www.counsyl.com/careers/software-engineer/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.counsyl.com&#x2F;careers&#x2F;software-engineer&#x2F;</a><p><a href=\"https://www.counsyl.com/careers/automation-engineer/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.counsyl.com&#x2F;careers&#x2F;automation-engineer&#x2F;</a>","time":1399312403,"type":"comment"}