{"by":"aseemk","id":7732344,"parent":7679431,"text":"Seattle, New York City. (Remote potentially okay, but we also offer relo. Visa transfers okay.)<p>FiftyThree - <a href=\"http://www.fiftythree.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fiftythree.com&#x2F;</a><p>Backend web engineers, devops engineers - <a href=\"http://www.fiftythree.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fiftythree.com&#x2F;jobs</a><p>==<p>FiftyThree makes tools for mobile creation.<p>Our first product was Paper for iPad, an app to let you capture your freeform ideas. It won both an Apple Design Award and App of the Year (2012).<p>Our second product was Pencil, an active stylus that works especially well with Paper. It too has received critical acclaim (e.g. &quot;the best iPad stylus yet&quot; —The Verge).<p>We&#x27;re hard at work on our third major product, a sharing and collaboration service to bring your ideas together. And we&#x27;d love your help in shipping it.<p>We&#x27;re looking for experienced back-end web engineers, both on the purely programming side and on the operations side. Our jobs page has all the details, but the highlights are:<p>- We run our app on Node.js (w&#x2F; CoffeeScript) deployed to Heroku.<p>- We run our non-app infrastructure (e.g. our Neo4j database) on AWS, e.g. EC2 and Route 53.<p>- We automate with Ansible and bash (moving over to Node.js).<p>Experience with most&#x2F;all of these isn&#x27;t expected, but at this stage, we are looking for existing experience somewhere. Show us what you&#x27;ve built.<p>It&#x27;s not every day you find a startup that&#x27;s building both software and hardware, that&#x27;s making multiple things people love, that&#x27;s making significant revenue from day one even as a consumer company, and that strongly values a maker culture at the same time.<p>If this sounds interesting to you, please do reach out. <a href=\"http://www.fiftythree.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fiftythree.com&#x2F;jobs</a> ==&gt; jobs@fiftythree.com<p>We look forward to hearing from you!","time":1399898284,"type":"comment"}