{"by":"danbenjs","id":14024087,"parent":14023198,"text":"Jane Street | Software Developer | New York, London, Hong Kong | ONSITE, FULL-TIME, INTERNS, VISA, <a href=\"http:&#x2F;&#x2F;www.janestreet.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.janestreet.com</a><p>Jane Street is a quantitative trading firm with a focus on technology, a scientific approach, and a deep understanding of the markets. We are a global liquidity provider and market maker, operating around the clock and around the globe, employing over 500 people in our offices in New York, London and Hong Kong.<p>It’s no secret that we’re big believers in functional programming; OCaml, a statically typed functional language, is our primary development platform. Jane Street’s technology group is small by design, which means we need to maximize the productivity of each person we hire. We believe functional programming (and specifically, OCaml) helps us do that. But it’s not about productivity alone: programming in a rich and expressive language like OCaml is just more fun. We’re also happy to spend time and money on making it easier for the people here to get things done. This ranges from big projects, like the work we do on development tools (e.g. Iron, our in-house code review and release management system, and Merlin, a tool for providing IDE-like features for OCaml), to little touches, like getting people whatever crazy keyboard will help them get their work done most comfortably.<p>Want to see some of our code? Visit Open Source @ Jane Street (<a href=\"https:&#x2F;&#x2F;janestreet.github.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;janestreet.github.io&#x2F;</a>), where you&#x27;ll find several OCaml libraries that we&#x27;ve released into the wild. These form the basis for all of our software, and we hope they make life better for some non-Jane-Street OCaml developers as well.<p>If you&#x27;re not yet convinced, feel free to poke around our benefits page (<a href=\"https:&#x2F;&#x2F;www.janestreet.com&#x2F;culture&#x2F;benefits&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.janestreet.com&#x2F;culture&#x2F;benefits&#x2F;</a>). If you ARE convinced and want some insight into our interview process, check out <a href=\"https:&#x2F;&#x2F;blogs.janestreet.com&#x2F;interviewing-at-jane-street&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blogs.janestreet.com&#x2F;interviewing-at-jane-street&#x2F;</a>. Or just drop us a resume at <a href=\"https:&#x2F;&#x2F;www.janestreet.com&#x2F;join-jane-street&#x2F;apply&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.janestreet.com&#x2F;join-jane-street&#x2F;apply&#x2F;</a>.<p>We’re looking for people with:<p><pre><code>  - Top-notch programming skills (no OCaml or FP experience necessary!)\n  - Strong interpersonal skills. Most work at Jane Street is highly collaborative,\n    and we are looking for people who can work effectively in small, close-knit\n    teams.\n  - Deep experience with — and love for — technology. There’s no specific\n    checklist; we use software to approach a variety of problems, so we’re\n    interested in everything from low latency networking to systems\n    administration to programming language design.\n</code></pre>\n(Note: no longer accepting internship applications for 2017.)","time":1491236349,"type":"comment"}