{"by":"the_ride","id":14028169,"kids":[14028347],"parent":14023198,"text":"Hustle | Software Engineer | San Francisco | ONSITE<p>Hustle is a peer-to-peer text messaging platform that provides organizations across the country with an affordable, efficient, and effective tool to reach their supporters. By facilitating two-way conversations, Hustle’s clients maintain genuine, personal dialogues with hundreds, thousands, and even millions of people. Our clients include Planned Parenthood, Human Rights Campaign, and Our Revolution (Bernie Sanders&#x27; organization). It&#x27;s 48 times more effective than making phone calls.<p>See a recent article about us in The Hill: &quot;Left Finds New Online Tools To Fight Trump&quot;: <a href=\"http:&#x2F;&#x2F;thehill.com&#x2F;policy&#x2F;technology&#x2F;320195-left-finds-new-online-tools-to-fight-trump\" rel=\"nofollow\">http:&#x2F;&#x2F;thehill.com&#x2F;policy&#x2F;technology&#x2F;320195-left-finds-new-o...</a><p>As a product engineer, you will be working on Hustle&#x27;s core web and mobile products: our web and mobile text messaging apps, our campaign administrative interface, and our message delivery backend.<p>Product engineering at Hustle is unique in that we do not have mobile, front-end and backend specialists. Instead engineers are empowered to develop and ship features in their entirety covering the whole stack. This feature of product development is enabled by Hustle&#x27;s particular technology choices: the use of JavaScript, React, React Native and Node.js through out the stack. It&#x27;s a stack that heavily rewards generalists that just want to ship things. It also makes for a very dynamic working environment: form a temporary team for a larger project where you decide to focus on shipping a polished mobile frontend and for the next project form another temporary team where you would focus on delivering a humming backend.<p>Hustle was started by engineers from Facebook and MongoDB and is backed by top VC firms including Social Capital and Index Ventures. Please apply on our site to learn more about us and our growing team of 25!<p><a href=\"http:&#x2F;&#x2F;hustle.life&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;hustle.life&#x2F;jobs</a>","time":1491261662,"type":"comment"}