{"by":"dkd25","id":14029299,"parent":14023198,"text":"Digital Impact Alliance, United Nations Foundation | Washington, DC | <a href=\"http:&#x2F;&#x2F;digitalimpactalliance.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;digitalimpactalliance.org&#x2F;</a><p>DIAL is a new global alliance to enable the digital ecosystem to deliver greater scale, efficiency and social impact by creating more inclusive digital economies. Working with partners, DIAL will generate evidence of what works through field-based projects, distil insights and tools to promote scale-up and replication, and provide mechanisms for co-investment throughout the ecosystem. DIAL is hosted by the United Nations Foundation, and the team is based in Washington, D.C.<p>DIAL is seeking a Principal Architect to join the Data for Development (D4D) team. The Principal Architect will set the vision and the strategic technical roadmap for the Data for Development (D4D) portfolio of investments.<p>The Principal Architect will support the buildout of the Data &amp; Analytics functions for the D4D team with the strategic intent of pushing the field of D4D forward. The Principal Architect will be responsible for steering our technical and implementation partners and driving our research partners’ agenda and investigations. Working with our technology partners, she will develop the required infrastructural components (technical, commercial) that will match data supply (e.g., MNOs) with data demand (e.g., programmatic partners in public health, agriculture, etc.). She will lead the in-country delivery of these solutions, and enable compliance with regulatory and data protection regimes. She will also drive the development of common data architecture and standards for utilizing telco and digital data for social good. Finally, she will work with partners to develop insights and indicators that can provide accelerated support for decision-making in the public sector.<p><a href=\"https:&#x2F;&#x2F;careers-unfoundation.icims.com&#x2F;jobs&#x2F;1458&#x2F;principal-architect%2c-data-for-development-%28d4d%29&#x2F;job?mobile=false&amp;width=965&amp;height=500&amp;bga=true&amp;needsRedirect=false&amp;jan1offset=-300&amp;jun1offset=-240\" rel=\"nofollow\">https:&#x2F;&#x2F;careers-unfoundation.icims.com&#x2F;jobs&#x2F;1458&#x2F;principal-a...</a>","time":1491277295,"type":"comment"}