{"by":"kjbekkelund","id":14023207,"parent":14023198,"text":"Elastic | Senior JavaScript Engineer | Anywhere | REMOTE (or ONSITE, if you want to)<p>Elastic is the company behind the open source projects Elasticsearch, Kibana, Logstash and Beats. We&#x27;re a truly distributed company with many teams that span the globe (the engineering organization is spread across 30+ countries). We&#x27;re actively looking for people _anywhere_ (so this is <i></i>not<i></i> a position limited to just US time zones).<p>(If you prefer working in an office, you can work out of any of our offices around the world. If you prefer nomading, you can do that too. I&#x27;ve travelled the world for &gt;7 months in this position.)<p>We&#x27;re looking for experienced JavaScript developers to work on several of our UIs, for example on Kibana and on our Cloud product.<p>Many know Kibana as a visualization platform on top of Elasticsearch, but it has now grown into our application platform that hosts all our open source apps in addition to our X-Pack commercial apps (and plugins that users write). Some of the things our apps cover are visualizations, time series analysis, machine learning, graph exploration, alerting, developer tools, security UI, data ingestion UIs, PDF reporting and so on. Kibana is today &quot;the Window into the Elastic Stack&quot;.<p>Because of our distributed nature we&#x27;re currently only looking for senior engineers with a strong self-drive. We&#x27;re looking for someone with extensive knowledge of JavaScript and one or more reasonably popular frameworks. You should also have at least 5 to 7 years of web application development experience.<p>We&#x27;re especially interested in people that also have a deep passion for a JS related topic, e.g. visualizations, security, performance, architecture or something entirely different, but this is definitely not a requirement.<p>Some SEO for the ctrl+f people: Angular, React, Redux, Jest, Webpack, Node.js, D3.js, RxJS<p>If you have any questions, don&#x27;t hesitate to contact me at kim@elastic.co<p>All our job descriptions: <a href=\"https:&#x2F;&#x2F;www.elastic.co&#x2F;about&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.elastic.co&#x2F;about&#x2F;careers&#x2F;</a>","time":1491231695,"type":"comment"}