{"by":"dbuxton","id":14025585,"parent":14023198,"text":"Arachnys | senior and junior engineers | London (UK) or NYC (USA) | Onsite<p>We use 120TB+ of data coupled with extraordinary user experience to help prevent financial crime worldwide. At the moment we&#x27;re looking for engineers of any experience level.<p>What’s different about us?<p>- No rockstar coders or brilliant jerks — just great people solving hard problems for real customers.<p>- Anyone can get involved with any part of our system — front-end developers can write Hadoop jobs if they fancy<p>- We have a committed focus on delivering quality, while not being scared of pushing back on customer demands. (A top bank recently told us that we were the first supplier that had asked them, &quot;Why?&quot;, about their requirements.)<p>Whats great about our culture?<p>- We work hard but it’s never “Crunch-Time” for us. No sleeping under desks or 14-hour days.<p>- Amazing communication between roles in the company. Developers chat to sales&#x2F;marketing&#x2F;AMs all the time, asking for feedback and input both ways.<p>- We use the best technology to solve problems, whether it’s something new or something established<p>- We’ve got great infrastructure for working from home (easy to drop-in hangouts, a lot of communication over chat and GitHub)<p>- Great collaborative environment. Everyone wants to improve and get better at coding.<p>We work with Python, JS, Docker, some Go, TDD, Hadoop, ElasticSearch, Terraform, Ansible, Neo4j and Dgraph. Experience in any of these is a plus but not required.<p>Drop me a line (email in profile) if any questions.<p>Email jobs@arachnys.com to apply, linking to your GitHub or some other code that you think tells a good story about you or apply via AngelList below.<p><a href=\"https:&#x2F;&#x2F;angel.co&#x2F;arachnys&#x2F;jobs&#x2F;220465-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;arachnys&#x2F;jobs&#x2F;220465-software-engineer</a>","time":1491243914,"type":"comment"}