{"by":"crazyguyonabike","id":14023312,"parent":14023198,"text":"Software Developer - Dependable Systems Lab (EPFL) | Lausanne, Switzerland | ONSITE<p>If you’re a hardcore programmer, are passionate about security and want to embark on a journey to fundamentally change the computer security landscape, this job is for you. You’d be joining a close collaboration between a small research team at EPFL and Cyberhaven, an advanced software security startup located at the EPFL Innovation Park, on the shore of Lake Geneva. The project is sponsored by the Swiss Commission for Technology and Innovation (CTI). Cyberhaven is a stealth-mode cyber security company on a mission to bring radical simplicity to enterprise security, and make it a lot stronger. Our technology is based on 7 years of lab research in deep application analysis, and is protected by 4 patents. The technology has been validated both in the field as well as through open-source projects like S2E, CPI, and SafeStack.<p>Profile:<p><pre><code>  - Exceptionally strong in computer systems, and love hacking both inside and outside an OS kernel\n  - Comfortable coding at any layer in the software stack\n  - Can learn new technologies quickly and are eager to do so\n  - Have a strong collaborative spirit and a contagious enthusiasm\n  - Experience with low-level systems languages like Rust&#x2F;C&#x2F;C++ etc.\n</code></pre>\nIf you have some of the following qualities, that’s even better:<p><pre><code>  - Python has no secrets to you\n  - Track record of releasing production-grade security products\n  - Experience working on security software, sandboxes, virtualization, malware scanners, endpoint protection platforms\n</code></pre>\nInterested?<p>Please send mail to George.Candea@epfl.ch with the following materials:<p><pre><code>  - Resume or Curriculum Vitae. Please include descriptions of previous projects you have worked on\n  - Contact information (email + phone) for two references who have agreed to speak about you, your work, and your potential. Please do not send us open letters of recommendation; we will directly contact your reference providers and solicit confidential feedback on you\n</code></pre>\nWe evaluate candidates on an ongoing basis, so please submit the materials as soon as they are available.","time":1491232338,"type":"comment"}