{"by":"temuze","id":14025634,"parent":14023198,"text":"Moat | Engineers, PMs, Designers | NYC, SF, Sydney, London | FULLTIME, ONSITE<p>Moat is an analytics startup with products in two areas:<p>1) Analytics<p>Moat Analytics measures content and advertisements for many of the most trafficked websites on the Internet. Most new ad deals require third party measurement and for many of the top brands and websites, Moat&#x27;s metrics are the go-to. We were one of the first companies to begin measuring ad viewability and we helped make these metrics a standard in the online ad industry. We handle over 19 billion impressions a day and tackle large scalability problems every day.<p>2) Search<p>Moat Search tells you who&#x27;s advertising where online. We give advertisers, publishers and other adtech companies an overview of the entire online ad ecosystem (kind of like the Bloomberg of the ad world). Our customers can see their competitors&#x27; ad campaigns, find prospects by seeing the clients of similar companies or see trends in the industry before anyone else. We have a free product, moat.com and a premium product, Moat Pro.\nIt&#x27;s great to work here! I&#x27;ve been here for about four years and everyone&#x27;s really talented and the problems are interesting.<p>We recently raised $50M and we&#x27;re still growing very quickly:<p><a href=\"https:&#x2F;&#x2F;www.wsj.com&#x2F;articles&#x2F;moat-raises-50-million-to-help-develop-digital-ad-currency-1458554401\" rel=\"nofollow\">https:&#x2F;&#x2F;www.wsj.com&#x2F;articles&#x2F;moat-raises-50-million-to-help-...</a><p>We&#x27;re hiring pretty much across the board - engineers, PMs, designers, recruiters, etc. Both technical and non-technical openings can be found at <a href=\"http:&#x2F;&#x2F;moat.com&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;moat.com&#x2F;jobs</a>.<p>The interview process involves a short coding assignment, 1-2 phone interviews and onsite.<p>Questions? Email me at rodrigo.menezes &lt;at&gt; moat.com","time":1491244299,"type":"comment"}