{"by":"mlent","id":14027275,"parent":14023198,"text":"SumUp | Fullstack Javascript Engineer | Berlin | ON-SITE, Visa | <a href=\"http:&#x2F;&#x2F;sumup.co.uk\" rel=\"nofollow\">http:&#x2F;&#x2F;sumup.co.uk</a> (or <a href=\"http:&#x2F;&#x2F;sumup.de\" rel=\"nofollow\">http:&#x2F;&#x2F;sumup.de</a> if you speak German already!)<p>I am looking for someone who loves JavaScript to join my team. Our fullstack position is frontend-heavy, so it&#x27;s also perfect for someone who is UI&#x2F;UX-oriented but also wants to become better rounded. It can also work for someone who is traditionally a backend-er and wants to see what all the hype in the frontend is about. Our base expectation is a solid foundation in programming, and we&#x27;re off to a great start. We are lovers of linux and tmux and vim, and it would be cool if you were too! You&#x27;ll fit in perfectly to our team if:<p>- You not only love coding, but also take the time to reflect on the benefits and drawbacks of your tools, be they frameworks, languages, or processes.<p>- You strive for clean code, but also know how to make your &quot;shortcuts&quot; easy to delete in a crunch.<p>- You know what to test, why to test it, and how to write flexible tests that won&#x27;t break with minor changes.<p>- You&#x27;re comfortable with Linux and know how to get things done on the command line, including on remote servers.<p>- You have experience with or interest in Functional Programming techniques. No more for-loops.<p>- You&#x27;re not afraid to use Google or ask for help when something is beyond your grasp.<p>- You care about user interaction, usability, and of course – making the interface beautiful.<p>- In general, technology excites you and you strive to learn something on a daily basis!<p>Some keywords: We&#x27;re switching from Angular to React. So a particularly good candidate would have experience with both technologies. However, knowing one, we can help you get up to speed on the other in no time.<p>I put a lot of effort into writing a comprehensive job ad that should give you a good idea of what we offer, and what we want to see in you, and what you would ACTUALLY be doing while working here. Please have a look and get in touch!<p>&gt;&gt;&gt;&gt;&gt; <a href=\"https:&#x2F;&#x2F;sumup.workable.com&#x2F;jobs&#x2F;373611\" rel=\"nofollow\">https:&#x2F;&#x2F;sumup.workable.com&#x2F;jobs&#x2F;373611</a><p>Note: If you are not an EU citizen, we can sponsor your visa, but please consider that our hiring process involves on-site interviewing and on-site trial work!","time":1491254595,"type":"comment"}