{"by":"kordless","id":14025280,"parent":14023198,"text":"Wisdom | Cryptocurrency Applied to APIs | Moraga, CA | REMOTE&#x2F;ONSITE | Founder<p>Wisdom is a project-in-progress I have been working on for a few years which applies cryptopayments to API method calls to implement the <i>402 Payment Required</i> response code for HTTP based requests using Bitcoin or other cyptocurrencies, which will eventually add support for the Lightning Protocol. A PoC of an early version of the idea was featured here on HN 3 years ago: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=8069386\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=8069386</a>. Time has passed since then and the idea, and technologies required for building it, have evolved. It is my belief the time for this idea, from a market-perspective, has arrived.<p>The service will be designed to improve the process of integrating a company&#x27;s API product with channel partners, either on-prem or in a hosted manner, with the intent to increase pass-through revenue on the API calls a company provides, while providing a simple federated layer based on blochchain backed data structures. This idea is in pre-funding, so I&#x27;m explicitly stating anyone interested in my idea should consider their founder-level involvement as purely self-choice driven. Influencing, making or removing choice for you in this regard is illogical and irrational, given the state of the company (non-existent) and funding (also non-existent). However, if you hold the view that the existing methods for securing the Internet&#x27;s infrastructure are woefully inadequate and you feel applying cryptocurrency to APIs could make companies more money by securing them against use by limiting calls with payments, then you should contact me and we should have a conversation about it.<p>Expertise in building scalable API calls with microservices-based architecture is desired, but a more general gift in development is also welcome. I code in Python, Javascript and C++, and am decently good at running infrastructure, given my history. My primary function is strategy, operations and architecture. I do not visualize, so I tend to communicate differently.<p>My email address is in my profile here on HN. Happy to just discuss the idea, if you are interested, as opposed to any expectation of finding someone this early on to join me.<p>If you&#x27;ve read this far, I appreciate you. I will note that this idea can be applied to AI in a less than obvious way. This reason is the primary purpose of the project, but making revenue in other ways first remains important.","time":1491242254,"type":"comment"}