{"by":"parisandmilo","id":14025960,"parent":14023198,"text":"Applied | UX &#x2F; Front-End Engineer, and Sales, Marketing &amp; Customer Success Lead | London, UK | NO CV NEEDED, Onsite or Remote, Visa, <a href=\"https:&#x2F;&#x2F;www.beapplied.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.beapplied.com&#x2F;</a><p>Applied was created to help people to hire the best person every time, regardless of their background. Actually doing that starts with us.<p><i>What makes us different from any other hiring platform out there?<p>Being spun out of the Behavioural Insights Team, our development &amp; product creation process is driven heavily by results from research in the behavioural sciences.</i><p><i></i>* NO CV NEEDED <i></i>*<p>---<p>With our first round of investment and major sales coming in, we’re now taking our ideas forward to build a sustainable, inspiring and rewarding business. We guarantee that won’t be easy. But we can make it easier by being sensible with how we grow and bringing in the right people. We&#x27;re making our 2nd and 3rd hires:<p><i>1) UX &#x2F; Front-End Engineer:</i><p>We&#x27;re looking for an individual who is creative, curious and user-focused to work with the team on rapid prototyping and development of the front end of our platform.<p>More than engineering, now is an exciting time to join the team if you are passionate about rethinking the hiring process, and wish to have a serious impact on its re-creation.<p>Skills: HTML, CSS, JS (incl D3.js), a strong interest &#x2F; prior experience in UX is desirable<p>Apply &amp; More details: <a href=\"https:&#x2F;&#x2F;www.beapplied.com&#x2F;apply&#x2F;ZZAwO5OCtp\" rel=\"nofollow\">https:&#x2F;&#x2F;www.beapplied.com&#x2F;apply&#x2F;ZZAwO5OCtp</a><p><i>2) Sales, Marketing &amp; Customer Success Lead:</i><p>We&#x27;re looking for someone to join us to craft your role and build a team we are calling &#x27;Sales, Marketing and Customer Success&#x27;. At Applied this person (and then team) will be in charge of all growth that is not product. You will:<p>- Own the marketing budget for all digital activities<p>- Shape and analyse the product&#x27;s go to market strategy<p>- Support current customers with onboarding and upselling<p>- Drive the expansion of the sales team (or ideally show us we can flourish without one!)<p>More details &amp; Apply: <a href=\"https:&#x2F;&#x2F;www.beapplied.com&#x2F;apply&#x2F;gBnn8TM1LD\" rel=\"nofollow\">https:&#x2F;&#x2F;www.beapplied.com&#x2F;apply&#x2F;gBnn8TM1LD</a><p>---<p><i>Alongside all other Applied team members you will benefit from:<p>- Equity in the business<p>- Open and fair pay (yep we put all payslips in the shared drive)<p>- Role in all aspects of the business, including being involved in making Applied a special place to work</i><p>---<p>Feel free to email me directly if you have any questions about Applied :) - <i>diana (at) beapplied (dot) com</i>","time":1491245951,"type":"comment"}