{"by":"NewsNow","id":14031210,"parent":14023198,"text":"Designer&#x2F;Developers &#x2F; Web Developers &#x2F; News Algorithm Developers &#x2F; Programmatic Advertising Engineers &#x2F; Product Managers | NewsNow.co.uk | London, UK or 100% remote (UK residents only) | Full-time, permanent<p>We may be a top ten UK media publisher, our website loved by millions. Yet despite our huge success, we&#x27;ve jealously protected our start-up culture over the past 20 years. Which means today, we&#x27;re still a company where everyone who joins us gets to make a massive impact.  Our ethos and news product are well proven, but we aren’t resting on our laurels.<p>Today, we’re on a mission to combat fake news, and puncture social media bubbles, through the biggest redesign of our homepage and section homepages in 20 years.<p>We currently have five opportunities:<p>- As a &#x2F;Designer&#x2F;Developer&#x2F;, you’ll be responsible for designing and developing our new homepage layout. You will be working with Adobe Creative Suite, JavaScript, CSS3, SASS, HTML5, Responsive Web Design, progressive enhancement and feature detection.<p>- As a &#x2F;Web Developer&#x2F;, you’ll integrate the new homepage layout with our back-end database and write the logic that drives the UI. You’ll also work on a wide array of other UI&#x2F;UX, SEO, and content integration challenges.<p>- As a &#x2F;News Algorithm Developer&#x2F;, you’ll develop automated curation algorithms that will produce the content for the new homepage layout.<p>- As a &#x2F;Programmatic Advertising Engineer&#x2F;, you’ll use JS (ES5, ES6) and NodeJS to develop our unique bespoke programmatic advertising technologies, helping maintain our role as the leading UK online publisher in ad tech.<p>- As a &#x2F;Product Manager&#x2F;, you’ll take over from our CEO in keeping all our development efforts incredibly well organised. You’ll grasp our strategic vision, consult with stakeholders to prioritise and specify desired developments, and co-ordinate the work of our agile development team to balance our editorial, development and commercial goals and deliver them with maximum efficiency.<p>All roles will be expected to work closely with our Founder &amp; CEO, and Principal Engineer.<p>All positions are available at our head office in London Euston&#x2F;Kings Cross, and developer roles are also available 100% remote (UK residents only).<p>If you like the sound of this, we’d love to hear from you, so get in touch!\n<a href=\"http:&#x2F;&#x2F;www.NewsNow.co.uk&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.NewsNow.co.uk&#x2F;careers&#x2F;</a> (not all positions may be showing online)","time":1491302504,"type":"comment"}