{"by":"katyinnes","id":14037102,"parent":14023198,"text":"Top Hat | www.tophat.com | Toronto, ON, Canada | ONSITE Full-time<p>Top Hat is hiring!! We are looking for smart software engineers to join our team. Some of the roles we have available are: iOS developer, Android developer, Mobile Lead, DevOps Engineer, and Full-stack Web developer (Python, Django, Javascript, React.js&#x2F;Flux, AWS, Ansible). Salary ranges based on experience from $80K to $130K.<p>We’re a pretty awesome growth-stage startup in the education space - we make the classroom more interactive, fun and engaging for both students and professors. We JUST raised our Series C round in order to take on the textbook industry, which you can read about here: <a href=\"https:&#x2F;&#x2F;www.bloomberg.com&#x2F;news&#x2F;articles&#x2F;2017-02-15&#x2F;top-hat-raises-22-5-million-to-go-after-pearson-mcgraw-hill\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bloomberg.com&#x2F;news&#x2F;articles&#x2F;2017-02-15&#x2F;top-hat-r...</a> - Union Square Ventures joined us this round, who along with our previous investors make up some of the top VCs in the world (having funded companies like Kickstarter, Twitter, Shopify, Salesforce, Box.net, etc.).<p>Top Hat helps professors make every lecture count by transforming mobile devices into powerful engagement tools, inside and outside the classroom. Recently, Top Hat has been building out interactive textbooks and creating a way for professors to collaborate on authoring new content and sharing it through our marketplace. In summary, we have a great dev culture and some really cool problems to work on!<p>We’re also running a Hack &amp;&amp; Tell community event on April 18—come see some cool tech demos and say hi! <a href=\"https:&#x2F;&#x2F;www.meetup.com&#x2F;Toronto-Hack-and-Tell&#x2F;events&#x2F;238088888&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.meetup.com&#x2F;Toronto-Hack-and-Tell&#x2F;events&#x2F;23808888...</a><p>If you are interested in our open positions apply here: <a href=\"https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?aj=oqatYfwL&amp;s=hn\" rel=\"nofollow\">https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?aj=oqatYfwL&amp;s=hn</a>","time":1491339265,"type":"comment"}