{"by":"dwightgunning","id":14031934,"parent":14023198,"text":"Stream (<a href=\"https:&#x2F;&#x2F;getstream.io\" rel=\"nofollow\">https:&#x2F;&#x2F;getstream.io</a>) | PHP Developer | Amsterdam | ONSITE | Full time<p>Stream is hiring a talented PHP developer to work on open source PHP projects: API clients, framework integrations, and example applications. In this role you&#x27;ll also have the opportunity to assist and support the open developer community around these projects.<p>Skills and requirements:<p>* A thorough understanding of the PHP language as well as the testing and tooling ecosystem (e.g. phpunit, Composer&#x2F;Packagist)<p>* Experience applying Object Oriented Programming principles in PHP applications<p>* A track record of bringing projects built with PHP frameworks like Symfony, Laravel, Silex, and CodeIgniter into production<p>* Strong understanding of the HTTP, REST web service principles and web security<p>* Dedication to working in a collaborative team setting with Github, quality testing and documentation<p>About the product:<p>Stream is an API for building, scaling and personalizing feeds. The technology relies heavily on Cassandra and machine learning. Stream powers the feeds for over 50 million end users and handles billion feed updates every day. Our customers include small startups as well as Fortune 500 companies. Building a scalable, highly available, secure and performant feed infrastructure is a hard problem.<p>About our company:<p>Stream was founded in The Netherlands and participated in Techstars in NY. We now have offices in both Amsterdam and Boulder, Colorado. Find out more about the company and team: <a href=\"https:&#x2F;&#x2F;getstream.io&#x2F;team&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;getstream.io&#x2F;team&#x2F;</a><p>Interview process:<p>1) Phone call for high-level tech background and culture fit 2) On-site technical interview (no whiteboards&#x2F;tests) 3) Offer.<p>Apply online at <a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;QkZleI\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;QkZleI</a> or email dwight@getstream.io","time":1491309851,"type":"comment"}