{"by":"Aretecjobs","id":14033505,"parent":14023198,"text":"Aretec, Inc| Information System Security Officer (ISSO)| Washington DC Area | $80-135k Salary + benefits | Full-time |ONSITE<p>Job Requirements:\nThis position requires U.S. citizenship due to federal contractual obligations. Bachelors in Computer Science, Information Systems, Software Engineering or other related analytical, scientific, or technical disciplines.\n4+ years of experience in IT security, including Certification and Accreditation and&#x2F;or IT security risk analysis&#x2F;advice, preferably in support of the Federal government. Knowledge of Federal government C&amp;A practices and policies, particularly ICS 503, FISMA, NISP SP 800-53, and DHS 4300. Experience with information assurance tools preferred. Experience vulnerability assessment scanning tools and reporting. Working knowledge of Ongoing Authorization with in the NIST Framework<p>Job Description:\nUse Federal Certification and Accreditation (C&amp;A) processes to research, verify and document information security controls in order for the &quot;systems&quot; to be accredited.\nCommunicate and enforce security policies, procedures and safeguards for all systems and staff, based upon NIST\nAnalyze and advise on the risk and remediation of security issues based on reports from vulnerability assessment scanners, patch management tools, and emerging threat information.\nInitiate, coordinate and track the patching and remediation of security weaknesses as they are discovered, via a &quot;Plan of Actions and Milestones&quot; (POAM).\nReport on security status and security incidents.\nEnsure event logs are reviewed at least daily or weekly.\nConduct Security Authorization document reviews.\nCreate and compile Authorization packages to include: Designation Letters, Security Plans, Contingency Plans, SOPs.\nConduct meeting with Government leadership and briefing on the State of Security for the systems in their purview.\nCreate&#x2F;maintain Work Break Down structures in MS Project for each System.\nEnsure the Configuration Management Database (CMDB) is continuously updated.\nCoordinate with the appropriate operational group to accurately update the System Design Document for each IT system.\nAssist in maintaining all configurations, architecture, installed software, accounts, data flows, ports, protocols, and other relevant data for each IT System and capture in design documents in MS Visio.\nProvide oversight and guidance regarding requests to modify technical policies such as firewall rules, ports, protocols, etc. for each IT system.\nWork with auditors to identify Key Controls which must be assessed on a recurring annual basis.<p>Salary is commensurate with experience.  Security certifications required (CISSP, CEH, Security+, CAP, GIAC, etc.). If you have a passion for cyber security and want to learn more about this position, please visit our career website <a href=\"http:&#x2F;&#x2F;www.aretecinc.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.aretecinc.com&#x2F;careers&#x2F;</a>  or e-mail your resume to careers@aretecinc.com","time":1491318938,"type":"comment"}