{"by":"aaroneous","id":14046220,"parent":14023198,"text":"ShopPad | Customer Success Engineer (entry-level) | Oakland, CA | ONSITE | <a href=\"http:&#x2F;&#x2F;www.theshoppad.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.theshoppad.com</a><p>ShopPad is the largest developer of applications for Shopify&#x27;s eCommerce App Store and we need YOUR help to make sure our amazing merchants always receive the best experience possible!\nOur apps power over 60,000 of the most exciting eCommerce companies on the internet. We work with companies like Tesla Automotive, Nine West, General Electric, Sundance Film Festival, Acer Computers, Starwood Hotels &amp; Resorts, David Blaine, 5-Hour Energy Drink and many more to deliver software experiences that perform and delight. \nOur founders are experienced entrepreneurs and we&#x27;re backed by some of the best angels in the Bay. The office is located in Oakland’s vibrant Uptown neighborhood — just a few blocks from 19th Street BART station.<p>What you’ll do:\n* Work with an enthusiastic and close-knit team to provide exceptional customer service\n* Investigate and resolve technical issues that merchants have with our applications\n* Solicit feedback to identify pain-points and report them to Director of Customer Success\n* Write technical documentation<p>Must-haves:\n* Ability to think logically and problem solve\n* Understanding of CSS and HTML\n* Effective verbal and written communication skills\n* A friendly, &quot;can-do&quot; attitude\n* Eagerness to learn\n* Personal integrity and strong work ethic\n* Experience with Shopify or eCommerce is a plus!<p>Work perks:\n* Fast-growing startup with lots of opportunities for personal growth, career development, mentorship &amp; continuing education\n* Medical + Dental + Vision + Commuter benefits\n* Option to work remotely on Thursdays\n* A fully-stocked kitchen with snacks and beverages\n* Two weeks PTO plus 15 paid holidays (including some fun ones like your birthday, Valentines Day, St Patrick’s Day, Halloween etc.)<p>Please send your resume and cover letter briefly explaining why you&#x27;re interested to careers-417@theshoppad.com","time":1491431067,"type":"comment"}