{"by":"pferrell","id":14101892,"parent":14023198,"text":"ThouandEyes | Data Analyst | SF | Full-time ONSITE | <a href=\"https:&#x2F;&#x2F;www.thousandeyes.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thousandeyes.com&#x2F;careers</a><p>The name ThousandEyes was born from two big ideas: the power to see things not ordinarily possible and the ability to collect insights from a multitude of vantage points. As organizations rely more on cloud services and the Internet, the network has become a &quot;black box&quot; outside of their control. ThousandEyes gives organizations visibility and insight into the now borderless network. It arms them with an accurate understanding of how the network impacts their applications, users and customers. ThousandEyes is used by some of the world&#x27;s largest and fastest growing brands, including 4 of the top 5 SaaS companies, 4 of the top 5 US banks and 3 of the Fortune 5. ThousandEyes is backed by Sequoia Capital, Google Ventures, Tenaya Capital and Sutter Hill Ventures, with headquarters in San Francisco, CA.<p>We’re looking for an inquisitive Data Analyst who enjoys working cross-functionally, has a strong passion for analytics and is eager to learn and implement cutting edge data technologies. The ideal candidate will have a background in a quantitative or technical field, has excellent communication skills and have demonstrated success in using analytics to drive understanding and to influence business decisions.<p>You will work across Product, Marketing, Sales, Finance and Customer Success teams to provide insight, identify opportunities and impact the strategy of ThousandEyes. This is a unique hybrid role where you will be able to apply your knowledge tallying up numbers and communicating your findings to different teams but also further develop your data science knowledge creating predictive models across different areas of the business.<p>In short, you will be a key contributor that has proven business analysis experience and is eager to explore and apply cutting edge data science models to accelerate ThousandEyes’ growth.<p>To get in touch: pferrell@thousandeyes.com","time":1492032234,"type":"comment"}