{"by":"sparkmeter","id":14110734,"parent":14023198,"text":"SparkMeter | Web Engineer (Backend Focus) | Waltham, MA | Full-time, ONSITE with flexible work location and schedule | <a href=\"http:&#x2F;&#x2F;www.sparkmeter.io&#x2F;en&#x2F;jobs&#x2F;webengineerbf&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sparkmeter.io&#x2F;en&#x2F;jobs&#x2F;webengineerbf&#x2F;</a><p>Come join SparkMeter’s software team and help increase electricity access in developing countries. As a Web Engineer, you will help build the web application our utility customers use to set up and operate our affordable smart metering systems. Your work will be high impact: the electrification your code will help enable is not an incremental improvement, it is a fundamental change in the way real people live, work, go to school, eat, and relax.<p>Our smart metering solution consists of hardware electricity grid sensors that communicate with each other and their base stations wirelessly over a range of up to several kilometers. Our customers use a suite of software called SparkApp to remotely monitor usage and load, adjust tariffs (electricity rates), and more. SparkApp consists of two primary Python (Flask) web applications: GroundBolt, running locally on the base station, and ThunderCloud, running remotely in the cloud. SparkApp is a key differentiator for our solution: other smart meters and similar products on the market don’t have anything like it.<p>In this role you&#x27;ll focus primarily on new feature development. You&#x27;ll work closely with Johan, our software engineer, and Lawrence, our frontend-focused web engineer, to create new features like a utility customer onboarding wizard, data visualizations, operator alerts, and more.<p>At SparkMeter, our core value is opportunity: the opportunity for underserved communities to achieve great things. That&#x27;s why our mission is to increase access to electricity in underserved communities - it is electricity and the services derived from it that unlock and create those opportunities. This value is reflected in our hiring ethos: we believe that the strongest teams have diverse backgrounds. Our approach to hiring has been validated by academic and industry studies that show that workforce diversity improves team and business performance. (It has also been validated by the quality of the team we’ve assembled so far!) We encourage applications from members of groups currently underrepresented in software engineering.<p>You can read the complete description for this role, including requirements and how to apply, at <a href=\"http:&#x2F;&#x2F;www.sparkmeter.io&#x2F;en&#x2F;jobs&#x2F;webengineerbf&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sparkmeter.io&#x2F;en&#x2F;jobs&#x2F;webengineerbf&#x2F;</a>. Thanks!","time":1492115974,"type":"comment"}