{"by":"kapnobatairza","id":6995396,"parent":6995020,"text":"MaxSquare - New York City<p>MaxSquare is developing a suite of capabilities accessible through SMS, mobile apps or the web that allows local businesses to leverage what we call the &quot;the local marketplace API&quot;. We believe there is a huge opportunity in developing a better way for local businesses to interact with their potential customers and vice versa.<p>We are well capitalized through angel investors and positioned to leverage several key strategic partnerships once the initial product offering has completed development.<p>WHAT WE NEED<p>We are looking for our #2 and #3 hires so we need candidates that thrive in an environment where they would be involved in building the company from the ground up. We are looking for engineers that can understand the whole stack but more specifically: One talented front-end developer comfortable working with multiple platforms with a great eye for UI&#x2F;UX, and one talented back-end developer that can work on the API.<p>Right now we have been working with the web2py framework in the application tier, with a MySQL database. We&#x27;ve started development on the front-end using RAD using Sencha Touch to develop an MVP that will eventually be wrapped in PhoneGap. We need someone that can work with the contracted developers to finish the MVP in Sencha Touch, and can work in native iOS, Android, and desktop web frameworks later on.<p>One of these hires will be assuming the CTO role while the former CTO will be assuming the COO role, so you will be responsible for taking the lead of development teams. The other position is for the senior developer role, and will need to be comfortable churning out code as well as reviewing code from contracted developers.<p>We are also looking to rapidly evolve so you will need to be comfortable with prototyping and iterating frequently.<p>WHAT WE OFFER<p>Compensation in the range of 100-200k for the CTO role, 50-100k for the senior developer role.<p>A meaningful equity stake and founder title.<p>Health, dental and vision benefits.<p>An awesome, huge workspace in a brownstone building in the Upper East Side of Manhattan.<p>Free lunches, snacks, seamless in the office.<p>Flexible work hours, no counting vacation or sick days.<p>Choice of MacBook Pro or 2xCinema Displays<p>No forced work environment: All we care about is building the product and nurturing a very hacker-friendly culture.<p>A business that puts solving the problems of our customers first, and money second. We care about creating technology that keeps small local businesses in their neighborhoods.  Because who wants to live in a world where every other building is a bank, megabrand or franchise?<p>Contact me if you are interested:\nmichael@max2.com","time":1388594128,"type":"comment"}