{"by":"jlafon","id":6995143,"parent":6995020,"text":"Front end web developer, OpenEye Scientific Software - Santa Fe, NM<p>I&#x27;ve pasted in the job description below. Email hr@eyesopen.com for details.<p>About OpenEye Scientific Software, Inc:\nOpenEye Scientific Software provides software to the pharmaceuticals industry for molecular modeling and cheminformatics. It has done so since 1997 in its continuing mission to provide novel software, new science and better business practices to the industry. Central to our approach is the importance of shape and electrostatics as primary variables of molecular description, platform-independent code for high-throughput 2D and 3D modeling, and a preference for the rigorous rather than the ad hoc.<p>With offices in the United States, Germany &amp; Japan, OpenEye Scientific Software is a global company. However, with fewer than 50 employees we offer a unique working culture. We believe that work should be fun and our working environment supports this philosophy. For the third year we have been a recipient of the Alfred P. Sloan Award for Business Excellence in Workplace Flexibility.<p>FRONT END WEB DEVELOPER<p>Location: Santa Fe, New Mexico\nEmployee type: Full-time\nIndustry: Computer Science, Biotechnology\nManages others: No\nJob Type: Information Technology\nEducation: BSc degree\nExperience: 3 or more years\nTravel: Occasional\nPost date: January 2014\nRelocation covered: Yes\nContact information\nSend cover letter and resume to:\nOpenEye Scientific Software Recruiting\n9 Bisbee Court, Suite D\nSanta Fe, NM, 87508<p>Contact information\nSend cover letter and resume to:\nOpenEye Scientific Software Recruiting\n9 Bisbee Court, Suite D\nSanta Fe, NM, 87508<p>or email to hr@eyesopen.com.<p>Job Description:<p>The ideal candidate for this position is someone who can design and implement interactive web interfaces. The candidate should understand user interface design, and be familiar with state of the art web application technologies. Although the position is primarily for interfaces, the candidate should have an understanding of how interactive web applications work.<p>You will be working in a small focused team that is envisaging how we build applications for deployment on Amazon Web Services and delivery via the web browser. You are not expected to be a seasoned chemist, but expect to pick some chemistry up along the way.<p>Requirements:<p>* BSc degree in computer science, or a similar area.\n* Minimum 3 years of experience in a similar position.\n* Proven track record of deploying interactive web interfaces using HTML5 &amp; CSS3.\n* Requires experience as follows:<p>* Use of CSS, optionally using SASS or Compass.\n* Use of Bootstrap or similar frameworks.\n* Use of JavaScript and Ajax via CoffeeScript.\n* Use of jQuery, Dojo, AngularJS, Closure, Ember or similar JavaScript libraries.\n* Use of real time technologies such as WebSockets and other HTML5 advancements.\n* Use of testing frameworks associated with these technologies. For example Selenium, Jasmine, PhantomJS or similar.\n* Use of mockup software such as Balsamiq, Moqups or similar.\n* Software development using Windows, Linux, and Unix operating systems and common browsers they support (with an appreciation of there numerous idiosyncrasies).<p>Desired experience as follows:<p>* Use of Python.\n* Use of Python web frameworks such as Django, Flask and Tornado.\n* Appreciation of Amazon Web Services.<p>OpenEye Scientific Software is an Equal Opportunity Employer","time":1388589049,"type":"comment"}