{"by":"spicyj","id":6995058,"kids":[6995591,6995613],"parent":6995020,"text":"Hi all,<p>As you&#x27;re planning your New Year&#x27;s resolutions, consider: if you could work anywhere, what would you do?<p>- Wouldn&#x27;t you want to work towards <i>really</i> making the world a better place?<p>- Wouldn&#x27;t you want to work with a top-notch team alongside some of the brightest engineers in the industry?<p>- Wouldn&#x27;t you want to work on solving interesting problems that haven&#x27;t been solved before?<p>---<p>At Khan Academy, I truly believe that you can find all of those things and more. We&#x27;re a small, 50-person non-profit tech startup making a big difference in the world. Here&#x27;s a testimonial we received just last night:<p><i>December 31, 2013</i><p><i>I have recently turned thirteen, and accompanied by your proficient and efficient teaching style, I have successfully advanced into multi-variable calculus. When I was 9 I began Calculus. However when I started these courses, I was capable of grasping these concepts in a deep level of intuition. Now I am advancing into Green&#x27;s Theorem, Triple Integrals, Divergence, Curl, Gradient, and Partial Derivatives. In essence, I would just like to say thank you for providing this revolutionary interconnected education interface. Hopefully I will be taking the AP Calculus examinations soon!</i><p><i>Thank you for everything!</i><p>How cool is that? Think of how many similar students are born to learn advanced math and science but never get the chance. We&#x27;re working to change this. This letter is one story; every month we hear about hundreds more lives like this that we&#x27;ve totally transformed.<p>We&#x27;re starting to do a big mobile push. Around 20% of our traffic comes from phones and tablets but we have only two mobile devs right now. We&#x27;re totally overhauling our iOS app; if you join us now you can build large parts of a product that&#x27;s guaranteed to have millions of users. If you are (or you know) a mobile developer we can build a great team around, <i>please reach out</i>. You can&#x27;t find this sort of opportunity in very many places.<p>Lots of people know us for Sal&#x27;s videos, but we also have hundreds of videos by other teachers and a huge library of interactive exercises. Our 100,000+ math problems have been done over 1.5 billion times total. That&#x27;s a huge number.<p>With this scale, we&#x27;re able to study learning in a way that no one has previously been able to do. We&#x27;ve run tests which show that students learn more when they&#x27;re advanced quicker by a custom machine-learning algorithm [1]. Right now we have dozens of A&#x2F;B tests running to help us understand what we can do to make people learn more, such as testing how Socratic-style lectures affect engagement. (We&#x27;re also beginning to release anonymized data to interested researchers.)<p>Whether you&#x27;re a machine learning guru or you take pride in perfecting UI details for a dropdown menu [2], we have something for you. You&#x27;ll be working alongside a small team with the best in the business – though we have &quot;celebrity&quot; devs like jQuery creator John Resig and Google&#x27;s first employee (and former Director of Technology) Craig Silverstein, we have many more you haven&#x27;t heard of but who are just as awesome.<p>We really have a great team and culture. We use (and contribute to) new technology [3], we invest heavily in mentoring interns (and full-timers) [4], we have lots of fun at and around work [5], and even though we&#x27;re a non-profit, we pay well too.<p>---<p>As I said above, mobile is a big priority for us and we&#x27;re doing everything we can to find great mobile devs.<p>We&#x27;re hiring engineers (frontend, backend, mobile, data science), product designers, a community manager, and more. And if you want to have an amazing summer (or fall or spring) building real features for real users, we&#x27;re hiring interns too.<p>Please apply at <a href=\"https://www.khanacademy.org/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.khanacademy.org&#x2F;careers</a> directly (say you saw us on HN!), but if you have questions, feel free to ask here or to email me at alpert+HN@khanacademy.org.<p>Thanks for reading; have a great 2014!<p>[1]: <a href=\"http://derandomized.com/post/51729670543/khan-academy-machine-learning-measurable-learning\" rel=\"nofollow\">http:&#x2F;&#x2F;derandomized.com&#x2F;post&#x2F;51729670543&#x2F;khan-academy-machin...</a><p>[2]: <a href=\"http://bjk5.com/post/44698559168/breaking-down-amazons-mega-dropdown\" rel=\"nofollow\">http:&#x2F;&#x2F;bjk5.com&#x2F;post&#x2F;44698559168&#x2F;breaking-down-amazons-mega-...</a><p>[3]: <a href=\"http://joelburget.com/backbone-to-react/\" rel=\"nofollow\">http:&#x2F;&#x2F;joelburget.com&#x2F;backbone-to-react&#x2F;</a> (sorry about the background, but there are dinosaur pictures!)<p>[4]: <a href=\"http://bjk5.com/post/71559049069/the-most-common-feedback-we-give-dev-interns\" rel=\"nofollow\">http:&#x2F;&#x2F;bjk5.com&#x2F;post&#x2F;71559049069&#x2F;the-most-common-feedback-we...</a><p>[5]: <a href=\"http://life.khanacademy.org/\" rel=\"nofollow\">http:&#x2F;&#x2F;life.khanacademy.org&#x2F;</a>","time":1388587068,"type":"comment"}