{"by":"geofft","id":6995090,"kids":[6995442],"parent":6995020,"text":"Moka5 - San Francisco Bay Area (Redwood City and Emeryville, CA), interns and H1Bs welcome<p>Moka5 makes life easier for large corporate IT departments who have too many computers to manage, and life better for end-users who would otherwise have to deal with a corporate IT department that&#x27;s enforcing ridiculously restrictive policies for their own sanity. Our primary product, Moka5 Player, delivers you a VM image of a corporate system that you can run on your own computer (Windows or Mac). You can install whatever software you want, and we automatically split new files into &quot;layers&quot;, so IT can push a new base layer that takes effect as soon as you reboot, and you can press a button and wipe all locally-installed software including IE toolbars and other nonsense, but keep IT-provided software and non-application files like documents. Since it&#x27;s running locally, you can get work done offline (unlike Citrix, VMware View, etc.), and not hate your life if you&#x27;re not on the LAN. We also do a bunch of security work to make it reasonable to run a corporate VM on your personal machine: this way, you&#x27;re not stuck carrying two laptops around.<p>One product that&#x27;s been seeing lots of growth is Moka5 BareMetal, a stripped-down Ubuntu derivative that boots directly into Moka5 Player. By providing our usual management capabilities on an underlying OS you don&#x27;t have to think about, you get the benefits of our product (easier updates, layering, single image, etc.) on corporate-owned hardware. We&#x27;re also writing iOS and Android apps for remotely accessing your files and other data on the go (even when you don&#x27;t have a network connection), and currently finishing up a client-side encrypted filesystem for synchronizing your files between your desktop and mobile device. There&#x27;s also quite a bit of work on the server side -- you get to solve fun problems about reliability, scalability, and geographic redundancy, but since we sell a product and not a service, nobody on our team has to carry a pager and get woken up to fix things for customers.<p>We&#x27;re not per se a virtualization company: we don&#x27;t write the hypervisor, since other people already do a great job of that. We do write a lot of things just above and just below the hypervisor layer, and in general a lot of computer systems work. If you enjoy operating systems, file systems, virtualization, or networking, come talk to us. If dynamic-linker trickery sounds like your idea of fun, we&#x27;ll get along well. We work in C++ and C# on the desktop, J2EE on the server, and the native languages (Objective-C and Java) on mobile; there is also a fair amount of open source work to be done in various languages, and we try to be good citizens and work with upstream.<p>See moka5.com for more info, and send me an email (gthomas at that domain name) if you&#x27;re interested! I&#x27;m in Boston all January and will be at the Real World Crypto conference in NYC, so if you&#x27;re in one of those cities and want to say hello, I&#x27;d be glad to chat.","time":1388587639,"type":"comment"}