{"by":"bound008","id":6995358,"kids":[6995433,6995593,7034415],"parent":6995020,"text":"Secret: HALF-TIME&#x2F;INTERN&#x2F;REMOTE<p>Hey, HN. One of you is perfect for this idea.<p>I am a serial entrepreneur who is currently trapped in the body of a freelance contractor. I have a relatively stable 40 hour a week project, and incoming projects as well that I generally can&#x27;t take due to lack of resources (time, the most precious one)<p>So here&#x27;s the idea.\nYou. Are interesting and have some experience in coding (webapps, mobile, whatever) would be a coding apprentice.\nI would give you a guaranteed 20 hour a week gig for now, and flex additional work as it comes in and you are available.<p>You would work on entrepreneurial ideas and contracts and get paid for doing so. If something took off the ground we could negotiate revenue&#x2F;equity, but no matter what you will be getting paid.<p>Here is what you get.\nMoney\nFreedom and Flexibility (need the day off to deal with a hangover because you are in college and its friday?)\nReal World Education\nAbility to become a killer coder\nand whatever else. i&#x27;m pretty flexible<p>Languages?\nPython&#x2F;Ruby Obj-C Javascript\nYou name it.\nIf you can show competency in some language I currently do, then we can work together and you can get paid to learn and become an expert at any other languages as required.<p>About me, your &#x27;boss&#x27;.\nLate 20s. Been in and out of various startups. Started ideas from scratch. Reasonably connected in the &#x27;valley&#x27;. No stranger to a term sheet. I have done hiring for a YC company.  Been on both the business and engineering side of places.<p>Currently living in NYC (manhattan) with enough room for you to come clock hours, but you can be remote as well, or both.\nI have been travelling a lot because it means that working 9-5 EST is a much more reasonable 12-8 or even sometimes 9pm - 5am.<p>I like tinkering with OSS and hardware too, obsessed with gadgets.<p>Long story short, you will get paid to learn how to code in the real world, become an entrepreneur or freelancer (or both) and then hopefully be able to repeat this process.<p>You&#x27;ll get hands on attention and code reviews without some PM breathing down your neck. (unless you are working on a project that requires it).<p>We&#x27;ll figure out a good hourly rate, and when you are working on a project that is paid, probably double it. And then fall back to the normal rate when we are working on whatever random ideas I want to incubate.<p>email hn0114@boun.cr with a little bit about yourself, a resume if you have it, and most importantly either a github or code sample.","time":1388593343,"type":"comment"}