{"by":"bejonbee","id":6995229,"parent":6995020,"text":"We&#x27;ve got 16+ openings, from Front End Developers to Ruby-on-Rails devs, Director of Development, QA Analysits, and an Outsourcing Project Manager.<p>You can see all the openings here: <a href=\"http://www.developwithpurpose.com/join-the-team/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.developwithpurpose.com&#x2F;join-the-team&#x2F;</a><p>As an example, here is the Ruby-on-Rails posting:<p>----<p>Ruby on Rails DeveloperAPPLY NOW<p>Full Time\nBrentwood TN<p>What You&#x27;ll Be Working On<p>We are now using Ruby on Rails to help people make REAL change in their life. We are seeking developers who are interested in building the right things and building the things right. If you like occasionally hearing how your code is used every day to take a family from desperation to HOPE, then sharpen that resume and apply.<p>WHAT WE&#x27;RE LOOKING FOR<p>Responsibilities<p>* Write application tier code, connecting UI to our backend and third party systems\n* Write front-end code in Ruby, HTML&#x2F;CSS, and Javascript\n* Participate fully in our SCRUM planning and process\n* Utilize full Ruby on Rails ecosystem: gems, git, testing, PaaS\n* Work closely with, and incorporate feedback from, product management, interaction designers, and back-end engineers\n* Rapidly fix bugs and solve problems<p>Qualifications<p>* Demonstrable experience building world-class, consumer web applications\n* Expert programming skills in Ruby on Rails&lt;\n* Excellent Javascript&#x2F;HTML&#x2F;CSS&#x2F;Ajax coding skills\n* Disciplined approach to unit and integration testing\n* Great written communication and documentation abilities<p>Desired Skills<p>* 3+ years of Ruby on Rails Development experience\n* Actively participating in the Rails community<p>Check out our tech stack: <a href=\"http://www.developwithpurpose.com/tech-stack/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.developwithpurpose.com&#x2F;tech-stack&#x2F;</a><p>Who we DON&#x27;T want applying<p>Someone just looking for a j-o-b. Who will punch a clock and give the bare minimum to get a paycheck. Those who love Silos. We operate in a team environment and collaborate on a daily basis.<p>No Toadstools<p>Pushing the limits of technology is a part of the average work day. That means we expect our team members to push the envelope on their own skills as well. If you aren’t growing, you’re planting roots into your chair as the light from your screen transforms you into a toadstool… and well, who would want that!?<p><a href=\"http://www.developwithpurpose.com/join-the-team/opportunity/?ref=199000\" rel=\"nofollow\">http:&#x2F;&#x2F;www.developwithpurpose.com&#x2F;join-the-team&#x2F;opportunity&#x2F;...</a>","time":1388590806,"type":"comment"}