{"by":"chrisduesing","id":6996463,"kids":[6997688],"parent":6995020,"text":"Mercaris - Chicago, IL - Rails Developer<p>Mercaris is a data service and trading platform for identity preserved (Organic, non-GMO) agricultural commodities (corn, wheat, soybeans, etc.). We are currently raising a series A after closing a seed round and getting early traction. Things are going well and we are excited to be expanding the team! Not only are we a startup (the team went through Excelerate 2011, which is now Techstars Chicago) but we are working on a real problem that should help companies meet the rising consumer demand for healthier food options. What I love about posting this job on HN is it is a community of people who get excited about this kind of thing :)<p>You will be our first engineering hire (outside of myself) and will contribute to the website, the data collection tool, subscription reports and our auction platform. All are currently Rails, with a live trading platform under development that is Erlang&#x2F;Elixir. The front end relies on jQuery and some graphing libraries. The code is ripe for some refactoring (don&#x27;t worry, it isn&#x27;t awful, but we pursued a few directions that we did not end up going in). You will have a large degree of flexibility to add functionality, clean things up, upgrade libraries, etc. with the strong caveat that you must write tests to make sure that you don&#x27;t break anything and that you test browser compatibility. Ideally you should have enough experience to be able to contribute immediately but not so much as to be bored. Some other potentially interesting projects that will need to be tackled include a more robust testing suite and continuous integration.<p>I work out of a combination of 1871 and from home, so schedule will be flexible. I like to provide a fair degree of autonomy, but that only works with a large degree of communication. We use Asana to track tasks and email&#x2F;phone&#x2F;in person meetings to ask questions, discuss features, etc.<p>Salary will be dependent on experience. Options, 401k and health insurance are also part of the compensation package.<p>If this sounds interesting, please send me a note to chris at mercariscompany.com and let&#x27;s talk. Thanks!","time":1388608307,"type":"comment"}