{"by":"trace","id":6996447,"kids":[6998472],"parent":6995020,"text":"thoughtbot - New York City, Denver, Philadelphia, Raleigh, San Francisco, Boston, or Stockholm - Designer or Developer - Full Time<p>At thoughtbot, we&#x27;re looking for expert designers who make things people want with simple, beautiful design and code.<p>Here are the skills we look for, in order of importance:<p>• Product design<p>• Interaction design<p>• Visual design<p>• Coding (HTML, CSS; Javascript&#x2F;Coffeescript and iOS optional)<p>Our designers make web and mobile products for our clients. They are responsible for making sure the team builds the right product. They simplify and ship often. They work directly with users to gather feedback. They make decisions about how (or whether) to integrate that feedback.<p>We prioritize how the product works but also expect a high level of visual refinement. Our designers must have excellent understanding of grids, typography, color, and design principles in order to build high-quality, compelling products.<p>We start many new projects with a Product Design Sprint: <a href=\"http://playbook.thoughtbot.com/#product-design-sprint\" rel=\"nofollow\">http:&#x2F;&#x2F;playbook.thoughtbot.com&#x2F;#product-design-sprint</a><p>Our designers code. See <a href=\"http://github.com/thoughtbot/bourbon\" rel=\"nofollow\">http:&#x2F;&#x2F;github.com&#x2F;thoughtbot&#x2F;bourbon</a> and <a href=\"https://github.com/thoughtbot/neat\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;thoughtbot&#x2F;neat</a> for examples showing the level of their HTML&#x2F;CSS expertise. They stay up-to-date with Apple&#x27;s Human Interface Guidelines (HIG). We believe coding is critical in order to tighten feedback loops and iterate more often.<p>We have a strong teaching and learning culture. Our designers&#x27; abilities and coding skills improve every day. We welcome applicants with some combination of HTML&#x2F;CSS&#x2F;JavaScript&#x2F;iOS skills, but believe we can teach these on the job more so than product, interaction, or user experience design.<p>We&#x27;re also hiring Ruby, JavaScript, and iOS developers in all our locations, and an office manager in New York City.<p>We have some great benefits, including unlimited PTO, paying for 50% of conference expenses and 100% if you&#x27;re speaking, and our Investment Day every Friday for continuous improvement. We don&#x27;t do client work that day, and instead spend that time giving back to ourselves, the company, and the community. For example, our open source projects (<a href=\"http://github.com/thoughtbot\" rel=\"nofollow\">http:&#x2F;&#x2F;github.com&#x2F;thoughtbot</a>) and blog posts (<a href=\"http://robots.thoughtbot.com.\" rel=\"nofollow\">http:&#x2F;&#x2F;robots.thoughtbot.com.</a>)<p>Please apply at thoughtbot.com&#x2F;jobs.","time":1388608127,"type":"comment"}