{"by":"cody_at_cat","id":6996102,"parent":6995020,"text":"Catalyst Repository Systems - Denver, CO &#x2F; Remote<p>Software Developer - Backend<p>Job Summary:<p>Catalyst is seeking a software developer to work on the backend platform which supports our text mining and prediction product lines.  This platform has active customers and we’re beginning the process of transitioning the platform out of R&amp;D and into daily operations.<p>  You will write code and tests daily for bug fixes, enhancements, and new features.  The bulk of the development is done in python with some shell scripting glue.  The code ranges from basic operational scripting to shared libraries and multi-threaded service applications.  The platform also integrates with a variety of services including RabbitMQ, Redis, Elastic Search, and Swiftstack.<p>  Additionally, you may find yourself handling light systems administration, gathering feedback from internal product users, and communicating with a variety of staff to create and clarify specifications.  Documentation, training, and other communication on behalf of a new platform may also be required.  <p>Catalyst is remote work friendly and this role can be 100% remote.  The project lead is also 100% remote.  We use email, Jira, instant messaging, a wiki, google docs, and google hangouts for communication and collaboration.<p>  This role will be hired in to the development department, but work closely with the technical lead in the research &amp; development group.  Candidates should be comfortable working across team boundaries.  There will be flexibility in defining the responsibilities of this role. <p>Qualifications:<p><pre><code>  * 1-3 years of software development experience\n  * Strong written communication skills\n  * Strong troubleshooting and reasoning skills\n  * Willingness to work across technical boundaries\n</code></pre>\nPreferences:<p><pre><code>  * Python\n  * Linux administration\n  * Distributed systems\n  * Messaging systems\n  * Prior remote work roles\n  * Prior ISP or SAAS roles\n\n</code></pre>\nCatalyst offers a flexible work environment, competitive compensation package (including base salary, bonus potential, medical&#x2F;dental&#x2F;vision coverage, and company-matched 401k).<p>Interested candidates should email their resume to numbers@catalystsecure.com.  Questions, resumes, LinkedIn profiles, and public repo links are welcome via email.<p>(If you have any questions, feel free to email me personally.  My email is in my profile.)","time":1388603780,"type":"comment"}