{"by":"jpoloney","id":6997864,"parent":6995020,"text":"Union Square, San Francisco, CA. Full-time. Full-stack Engineer, All Levels.<p>Red Hot Labs (RHL) is looking for full-stack engineers at all levels that want to work on cutting edge business intelligence &amp; machine-learning tools and services for mobile developers.<p>=Responsibilities=<p><pre><code>    - Write both server and client-side code for massively scalable analytics architectures. \n      (We can teach you this!)\n    - Actively learn and work with new technologies. There’s a very good chance \n      you’ll pick up experience with a new language &#x2F; technology stack here!\n    - Collaborate closely with our CEO and the rest of our team to develop \n      products and services with a high quality user-experience. \n    - Architect and own big parts of our infrastructure. \n\n</code></pre>\n=Your skills=<p><pre><code>    - REQUIRED: CS degree or significant experience in a low-level language (C, C++). \n         - We&#x27;re trying to hire smart folks that have a solid CS foundation.\n    - REQUIRED: Prior experience working with either Javascript or Ruby.\n    - REQUIRED: Ability to pick up new languages and frameworks quickly.\n    - PREFERRED: Prior experience developing business intelligence or analytical tools.\n\n</code></pre>\n=Why Red Hot Labs=<p>We’re a small 4-person FUNDED startup founded by the guys who made FarmVille and CityVille. We’re building business intelligence tools and services that we think are missing from the mobile ecosystem. This is not our first startup; our last one was acquired by Zynga and led to them being able to IPO using our core-tech and games.<p>Our company culture is one built on learning and the belief that everyone is a student and everyone is a teacher. We want to work with folks that inspire us to learn more and do our best work. We invest in our employees and want to help you grow in both your core skill-set and other areas you may be interested in. We can afford to do this while we’re small.<p>We originally began building mobile games and realized there was a big hole in mobile business intelligence and in bringing together and understanding all of the data that exists out there. We focus on shipping quickly and constantly (our first product was built in 6 weeks with no pre-existing client-side code), so this is a great place to experience shipping multiple products.<p>We have since shut down the development of games and are focusing 100% on our tools and service products. We still maintain and run the games and use them as test beds for new ideas.<p>=Perks=<p><pre><code>    - WORKCATIONS! We’re a small company so we do unscalable things such as \n      rent a house for the whole team and spend a week working from a Ski-house Tahoe \n      or in a beach-house in Hawaii. \n    - Early-stage startup equity grants\n    - Health&#x2F;Dental&#x2F;Vision insurance\n \n</code></pre>\n=Our stack=<p><pre><code>    - Redis, Couchbase, Rails for our backend API.\n    - Mostly AWS with a little bit of Heroku for our hosting.\n    - AngularJS, jQuery, Underscore for our dashboard and web apps.\n    - 3rd party services: Facebook, Mixpanel, Stripe, Mailgun\n\n</code></pre>\n=Relevant press=<p>About our culture:\n<a href=\"http://gamesauce.org/news/2013/05/31/red-hot-labs-sons-of-zynga-forge-bridge-to-the-beyond/\" rel=\"nofollow\">http:&#x2F;&#x2F;gamesauce.org&#x2F;news&#x2F;2013&#x2F;05&#x2F;31&#x2F;red-hot-labs-sons-of-zy...</a>\nAbout our strategy:\n<a href=\"http://blogs.wsj.com/venturecapital/2013/02/28/zynga-veterans-red-hot-labs-says-can-cut-game-development-time/\" rel=\"nofollow\">http:&#x2F;&#x2F;blogs.wsj.com&#x2F;venturecapital&#x2F;2013&#x2F;02&#x2F;28&#x2F;zynga-veteran...</a>\nAbout our funding: \n<a href=\"http://techcrunch.com/2013/02/28/red-hot-labs/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2013&#x2F;02&#x2F;28&#x2F;red-hot-labs&#x2F;</a><p>=Applying=<p>Send an email to jobs+HN@redhotlabs.com with a little bit about yourself and what you’re looking for in a new role and we can chat a bit more about what we’re up to in detail. We look forward to speaking with you!<p>-Joel (Founder)","time":1388629977,"type":"comment"}