{"by":"jkeesh","id":6997541,"parent":6995020,"text":"CodeHS: Software Engineer in San Francisco<p>CodeHS is a site that helps teach computer science to beginners with a focus on working with high schools. We work with students and schools all over the US and all over the world. Make a big impact on a small team in an exciting space.<p>See more at <a href=\"http://codehs.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;codehs.com&#x2F;jobs</a><p>We are a company with a social mission, and we believe that we can help make computer science more fun and accessible to high school students. If you are a programmer, but also consider yourself a teacher--or if you love coming up with creative ways to explain things--or if you want to work on a meaningful project instead of programming widgets at the widget factory--then send us an email. You can email me at jkeesh@codehs.com<p>We&#x27;re a small team of 4 with funding and a business model and soon to be a lot bigger. We have a monthly team hackathon (and recently had one for 150 students and teachers at Facebook <a href=\"http://facebook.com/codehs\" rel=\"nofollow\">http:&#x2F;&#x2F;facebook.com&#x2F;codehs</a> ), and are always thinking of ways to make working more fun.<p>See what students and teachers say about CodeHS: <a href=\"http://codehs.com/testimonials\" rel=\"nofollow\">http:&#x2F;&#x2F;codehs.com&#x2F;testimonials</a><p>How We Start Teaching:<p>We start teaching programming with &quot;Karel the Dog,&quot; a dog that lives in a grid world and only knows four commands: move, turnLeft, putBall and takeBall. We use karel to teach that computer science is about problem solving. We start in JavaScript, but use a thin teaching library because we believe in teaching concepts over syntax.<p>Try it out and let us know what you think at codehs.com.<p>Our site is built in python, django, JavaScript, and we&#x27;re on ec2.<p>CodeHS was recently a winner at NBC&#x27;s Education Nation and has been featured on the Today Show and a number of other places.<p>Thanks, and happy new year!\nJeremy<p><a href=\"http://blog.codehs.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.codehs.com&#x2F;</a>","time":1388623288,"type":"comment"}