{"by":"chrchr","id":7007029,"parent":6995020,"text":"LegitScript is hiring software developers in Portland, OR<p>We make the online health product sector safer and more transparent for individuals and businesses. We analyze and report on rogue online pharmacies and dangerous health products. Our services include monitoring, investigative reports, online pharmacy certification, and health product classification. Our clients include Google, Microsoft, Visa, Twitter and the FDA.<p>Our team focuses on producing simple, reliable software through excellent developer testing practices and collaboration, including test driven development and pair programming. We make our software better by responding to business demands.<p>Requirements:<p>* You should be able to demonstrate ability in Ruby, Python or similar dynamic, objected oriented languages. We use Ruby.<p>* You have experience writing developer tests. We use rspec.<p>* You should be familiar with relational databases and SQL. We use MySQL.<p>* You should have experience with modern web frameworks, such as Rails, Django, Sinatra, or Flask. We use Rails.<p>* You should be able to work with Web technologies such as HTTP, HTML, JavaScript, CSS, jQuery, et cetera.<p>* You should be comfortable working with the Unix command line. Our production systems run Linux.<p>* You have a degree in computer science or equivalent experience. You should know a little about algorithms and data structures.<p>You can find out more about what we do on our website (<a href=\"http://www.legitscript.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.legitscript.com</a>) and our blog (<a href=\"http://blog.legitscript.com\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.legitscript.com</a>). We were also recently featured in 37signals’ &quot;Bootstrapped, Profitable and Proud series&quot; (<a href=\"http://37signals.com/svn/posts/3612-bootstrapped-profitable-proud-legitscript\" rel=\"nofollow\">http:&#x2F;&#x2F;37signals.com&#x2F;svn&#x2F;posts&#x2F;3612-bootstrapped-profitable-...</a>). The company is entirely self-funded and has been profitable since 2010. We offer a stable workplace with good benefits and regular pay increases. We believe in working at a sustainable pace with regular office hours. We have a dog. Her name is Parker.<p>Please apply here <a href=\"http://www.jobscore.com/jobs/legitscript/software-developer/bRT-GmnBqr47HLeJe9fLhG?ref=rss&amp;sid=68\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jobscore.com&#x2F;jobs&#x2F;legitscript&#x2F;software-developer&#x2F;...</a><p>Thanks!","time":1388773090,"type":"comment"}