{"by":"archonjobs","id":7018193,"parent":6995020,"text":"Toronto, Canada - Full Time<p>WHO WE ARE<p>We’re Archon Systems, a rapidly growing (and profitable!) startup making software to help small businesses. Our flagship product, inFlow Inventory, has been downloaded by over 500,000 small businesses around the world and reached #1 in its space on Google and CNET download.com.<p>Both of our founders are developers, and we take the time to build products that look and work beautifully. We care a lot about both our employees and our customers. We value you as a whole human being, not as a cog in a machine. Check out www.archonsystems.com for more about us.<p>Job perks:<p>- Work from home 2-3 days a week (Yup. <a href=\"http://bit.ly/KtKPeO\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;KtKPeO</a>)<p>- Top-notch computers<p>- Beautiful office<p>- All-expense-paid conferences<p>- Health benefits<p>- Stock options<p>- Make a difference: you’ll be the 11th member of our team<p>You&#x27;ll get to work with and learn from our other awesome members:\n- Ex-Googler who previously graduated #1 from University of Waterloo’s math faculty.<p>- Past Mozilla developer and designer<p>- Past co-founder of a VC-funded startup (and in a past \nlife, video and interactive artist with work shown internationally)<p>- Past lead-developer of a VC-funded startup<p>- Marketer who won an international marketing competition twice, beating out Fortune 500 companies<p>- ... and other great people!<p>JOB DESCRIPTION<p>Here’s what you’d do:<p>- Design and develop new features for our flagship product: from UI &amp; database design to coding and testing<p>- Fix bugs and make improvements for usability, speed, etc.<p>- Use modern C#, .NET, Azure, git, HTML&#x2F;CSS, SQL, etc.<p>- Occasionally do customer support (email, phone, etc.) to develop your customer-understanding and product-design skills<p>- Initiate your own ideas and projects to help us grow<p>You should have:<p>- 1+ year of software development experience<p>- Bachelor’s degree or higher in Computer Science, Engineering, or a related field<p>- Experience with C#<p>- The ability to thrive in a small team with lots of freedom<p>Nice to have (but not necessary):<p>- User experience design skills<p>- Experience developing APIs, web services or web applications<p>- Experience with Windows Forms<p>Other stuff we’d be happy to hear about:<p>- Experience with business systems (accounting, inventory, CRM, etc.)<p>- Open-source or recreational coding projects<p>- Awards and contests<p>- Close experience with small businesses","time":1389112971,"type":"comment"}