{"by":"mjwhansen","id":7036610,"parent":6995020,"text":"WASHINGTON, DC | ON-SITE | FULL-TIME<p>Engage (<a href=\"http://enga.ge\" rel=\"nofollow\">http:&#x2F;&#x2F;enga.ge</a>) is an interactive agency that provides technology and strategy to Fortune 500 companies, political organizations, and nonprofits, and we&#x27;re looking for a Front-End Developer to join our team of developers. Our creative team is always looking for newer, cooler, better ways to do things. We love what we do and it shows.<p>This is a full-time position and you must be able to work on-site in Washington, DC. This is an immediate opening, but we&#x27;re willing let you temporarily work remotely until you can relocate.<p>We prioritize proven work, so please submit work samples with your application (links to live projects preferred). Otherwise, it will be very hard for us to gauge whether you&#x27;re a fit. You&#x27;ll probably need at least 2 years of experience in a front-end development role to meet the qualifications below.<p>Must-haves:<p>- Mastery of CSS3, HTML5 and JavaScript;  able produce clean, standards-compliant markup \n- Experience with several (ideally all) of the following: jQuery, Backbone, Underscore, RequireJS, Twitter Bootstrap, Media queries&#x2F;Responsive design, Cross-browser compatibility, testing &amp; support\n- Not a designer but good design instincts -- strong UI &amp; UX skills\n- Understands and pursues pixel perfection for every site &amp; project\n- Skilled with Photoshop &amp; the Adobe Creative Suite\n- Comfortable working on tight deadlines and in a team environment\n- In general, a nice person to be around who enjoys tackling challenges and learning new skills\n- Comfortable with version control - Git preferred<p>​Bonus points if you:<p>- Have experience with Facebook Connect, Twitter Login, OAuth, etc\n- We occasionally use open source and third-party CMS, so some experience with WordPress or Expression Engine is helpful but not required\n- Have a basic understanding of PHP or MySQL (but your primary experience&#x2F;interests should be in front end work, not back end)\n- Have experience with Vagrant<p>Job Perks:<p>- Small, passionate, agile team -- tons of opportunity to show off your skills, try new things, collaborate with other top-of-their-game developers and advance\n- Competitive salary &amp; performance bonuses\n- Generous benefits package\n- Team outings (Segway tours and Nationals baseball games)\n- Snacks\n- Energy drinks\n- Play around with our Google Glass in your spare time\n- Company-paid hackathon and conference attendances\n- Dog-friendly office\n- Located in an up-and-coming area\n- Close to 395 &amp; the Metro (Blue and Orange lines)<p>To apply, please include your resume, work samples, link to your GitHub profile, and a brief description of why you’re interested in the position.<p>APPLY HERE: <a href=\"http://engagedc.theresumator.com/apply/VzN338/Front-End-Web-Developer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;engagedc.theresumator.com&#x2F;apply&#x2F;VzN338&#x2F;Front-End-Web-...</a>","time":1389363222,"type":"comment"}