{"by":"draftster","id":7059208,"parent":6995020,"text":"Santa Monica, Ca - FULL TIME Javascript &amp; Python application developers<p>COMPANY DESCRIPTION\nAre you passionate about sports? Do you like money? Draftster.com combines the two by offering daily\nfantasy sports contests for cash. We are a private equity backed, large-scale fantasy sports gaming startup\nthat includes founders with previous exits. We have disruptive aspirations, an aggressive customer\nacquisition strategy, and a vision that will transform sports as we know it. Draftster is entering into beta with\nplans for a US launch in spring 2014.<p>We are looking for brilliant application developers to join our team as we bring our product to market. Our\nideal candidate will be a self-starting, code-shipping, team focused engineer with a passion for elegant code. Our technology includes python, nginx, tornado web, angular, and mongoDB.<p>Javascript Developer Job Description:<p>The javascript developer will be a lead for the UI Engineering team. This candidate will work to\ncreate new UI architectures, interfaces, and functionality by integrating back-end API’s, create and maintain\nUI Development Standards and Best practices, and provide technical leadership, feedback, and oversight\nfor various technical initiatives across the organization. This candidate should excel in all components of the\nRich Internet Application development skill set, as well as the UI Engineering&#x2F;Web Development skills (CSS\n3, Javascript, HTML 5, AJAX and Javascript Libraries such as jQuery and Angular).<p>Application Developer Job Description:<p>The Senior Application developer will lead the engineering team. The candidate will work with our CTO to\ncreate and maintain architecture standards, implement application features, create supporting web API’s,\nand provide technical leadership, feedback, and oversight for various technical initiatives across the\norganization. This candidate should excel in all components of the Rich Internet Application development\nskill set as well as NoSQL database administration.<p>Please contact info@draftster.com for more information.<p>Cheers, \n--Michael","time":1389728454,"type":"comment"}