{"by":"sdtony","id":7970625,"parent":7970366,"text":"Slickdeals - Las Vegas, NV<p>Slickdeals is the nation’s largest and most trusted community sharing deals, coupons and product reviews with over 8 million unique visitors per month. We’ve been around since 1999!<p>--------------------------------------------------------------------------------<p>Mobile Product Manager (full-time, no remote, relocation)<p><a href=\"http://slickdeals.net/corp/job-mobile-product-manager.html\" rel=\"nofollow\">http:&#x2F;&#x2F;slickdeals.net&#x2F;corp&#x2F;job-mobile-product-manager.html</a><p>The community and site are rapidly expanding and Slickdeals is looking for a Mobile Product Manager to build and grow our mobile platform. Currently, we’ve got over a million downloads of our apps, across Android and iOS devices in a little over a year.<p>- Owning the mobile products for Slickdeals across multiple devices<p>- Forward thinking product planning and product design that delivers a cohesive experience across mobile and web<p>- Developing a comprehensive mobile product roadmap to deliver on business goals<p>- Working with internal stakeholders and customers to answer questions, gather insights, and bring new features and offers to production<p>- Managing the product development process from design, development, integration and testing<p>--------------------------------------------------------------------------------<p>Web Developer (full-time, no remote, relocation)<p><a href=\"http://slickdeals.net/corp/job-web-developer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;slickdeals.net&#x2F;corp&#x2F;job-web-developer.html</a><p>- Designing, developing, testing, and debugging web applications for the Slickdeals website.<p>- Integrating new solutions into our existing platforms using either custom code or APIs.<p>- Optimizing and maintaining existing code&#x2F;applications.<p>- Maintaining thorough documentation of all programs and procedures.<p>- Participating in code review and design.","time":1404222945,"type":"comment"}