{"by":"lipsmack","id":7970558,"parent":7970366,"text":"Football Radar - London, UK<p>More about engineering at Football Radar: <a href=\"http://engineering.footballradar.com\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.footballradar.com</a><p>To apply for any of the positions below, please visit: <a href=\"http://www.footballradar.com/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.footballradar.com&#x2F;jobs&#x2F;</a><p>Football modelling &amp; statistics<p>====================<p>We are a leading company in forecasting the outcome of football matches. We have a variety of interesting and challenging projects. Our team works with complex regression models, time series models, high-dimensional data, text parsers and statistical classifiers, and the sheer amount of data we collect means that there are countless hypotheses to investigate and test.<p>How we work:<p>==========<p>While our company is amongst the best in the world at what we do, and consequently has grown rapidly over the past years, we’ve retained the feel of a start-up: you manage your own time and have your say on what we do.<p>You’ll get a competitive salary that is reviewed regularly, with an annual bonus option. We have free fruit, snacks, Nespresso and catered lunches and dinners every day; fun social get-togethers; our own 5-a-side football teams; as well as clubs for running and cycling. And you get to choose your own development kit.<p>SOFTWARE ENGINEER (full-time, permanent, on-site)<p>======================================<p>We’re looking for an experienced programmer to help us build real-time trading software, work with large datasets, do complex statistical modelling and invent new ways to help our staff analyse football. You will be working mainly with the modelling department, in close cooperation with our statisticians and football experts, building the infrastructure and the foundations of our models.<p>The main language we use for our real-time and modelling systems is Scala, but we use Python and PHP too. We don&#x27;t expect you to know Scala, but we expect that you will be excited to learn it if you don&#x27;t know it already.<p>You should have mastered at least one compiled object-orientated language, have worked on at least one big software project, and feel comfortable working autonomously on designing&#x2F;building large scale maintainable and testable systems.<p>JUNIOR SOFTWARE ENGINEER (full-time, permanent, on-site)<p>============================================<p>We&#x27;re looking for an engineer who can write structured, testable code for our web applications. You should have experience of object-oriented programming in PHP and one other language. You should also have some practical experience of building and maintaining commercial applications. Ideally you&#x27;ll have some experience of working with MVC frameworks and especially Symfony2 components.<p>You should have a good Computer Science degree, or similar. We will happily consider applications from candidates with other educational backgrounds, but we will expect you to demonstrate strong knowledge of computer science fundamentals to an equivalent standard.<p>JAVASCRIPT DEVELOPER (full-time, permanent, on-site)<p>========================================<p>The ideal candidate will be experienced in frontend development, with experience working with rich user interfaces and single-page applications. We are scaling up our business operations, and we need someone who can create powerful interfaces that help us grow.<p>We need developers with a keen understanding of browser performance and the unique constraints of rendering high volumes of data in realtime. Demonstrable experience of modular design and event-driven architecture is also highly desirable.<p>Some of the technologies that power Football Radar:<p>* Backbone, Marionette, React, jQuery<p>* AMD (Require.js), CommonJS (Browserify&#x2F;Webpack)<p>* Grunt, Bower, NPM<p>* Node.js<p>* Mocha, Nodeunit, Istanbul, PhantomJS","time":1404222300,"type":"comment"}