{"by":"marmarlade","id":7970670,"parent":7970366,"text":"HOPSTER - LONDON&#x2F;UK - <a href=\"http://bit.ly/gethopster\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;gethopster</a><p>Always looking for good people, particularly developers (Python&#x2F;GAE), growth people, creatives (animators&#x2F;voice actors&#x2F;producers - contract&#x2F;partnerships)<p>If you&#x27;re excited about the idea of making TV better for kids (better = more educational, interactive, engaging), get in touch: marie@hopster.tv.<p><pre><code>   ***************************\n   ** MAKING KIDS TV BETTER **\n   ***************************\n</code></pre>\nKids in the UK watch 6bn hours of TV every year. At Hopster, we’re trying to make that time better. Our first product is a beautiful iPad app for kids aged 2-6, which combines gorgeous TV shows with contextual learning games - and we plan to go much further. Launched in December, we have had great reviews from parents so far plus thousands and thousands of MAUs. Oh, and we have paying customers.<p>We&#x27;re a funded London-based start-up, launched in late 2013. Our team includes people from a range of backgrounds (from start-ups to non-profits and corporates), all with a solid track record of developing and delivering innovative and successful products to consumer audiences.<p><pre><code>   ******************\n   ** OUR STACK(S) **\n   ******************\n</code></pre>\nTECH\nFront-end: Angular, Bootstrap, HTML5, CSS3, Javascript, JQuery\nBack-end: Python, Google App Engine, Google Cloud Endpoints &amp; Storage\niOS App: Cocos2d-x, C++, Objective-C<p>MARKETING\nWordPress, Localytics&#x2F;Google Analytics, Mailchimp&#x2F;Mandrill, Google Experiments&#x2F;Unbounce&#x2F;Optimizely, Buffer, SocialBro&#x2F;Sprout, SensorTower&#x2F;AppAnnie<p>TEAM\nTrello, bitbucket, Google Docs, Google Hangouts, Friday curry sessions, climbing wall &amp; go kart track in the same building<p><pre><code>   ***************************\n   ** WHO WE&#x27;RE LOOKING FOR **\n   ***************************\n</code></pre>\nAs usual, always looking for good people. The team is broadly split into development, product, marketing&#x2F;growth and creative (and creative actually means creative, incl. animation, characters, voice acting etc.!).<p>If you&#x27;re excited about the idea of making TV better for kids (better = more educational, interactive, engaging), get in touch: marie@hopster.tv.<p>----<p>PS: thanks, speek, for the inspiration on making headers more obvious ;-)","time":1404223251,"type":"comment"}