{"by":"JoeCortopassi","id":7970877,"kids":[7973393],"parent":7970366,"text":"OneHealth - Solana Beach, CA (San Diego area)<p><pre><code>  ---------------------------------\n  -------  About OneHealth  -------\n  ---------------------------------\n</code></pre>\nOneHealth™ is an award winning behavioral modification platform that increases outcome-driven wellness and reduces the cost of health care by combining clinical principles, social technologies and game mechanics to extend the reach and benefits of professional medical and clinical care.  We are revolutionizing the health care industry so we can help saves lives every day.  OneHealth Solutions, Inc. was founded in 2008, is backed by a leading industry Venture Capital firm, and is located in Solana Beach, CA. (www.OneHealth.com)<p>This is an opportunity to join a small company making a big impact. We have an engaging corporate culture that combines high standards, professional discipline and an enjoyable team-oriented environment.  Competitive benefits package including health, dental and vision insurance, 401K and Equity Incentive plan.  Our offices are located one mile from the beach and we offer a free weekly yoga class and surfing meet ups.<p><pre><code>  ---------------------------------\n  --- Senior Software Engineer ----\n  ---------------------------------\n\n  http:&#x2F;&#x2F;jobvite.com&#x2F;m?3WsLugwo\n\n  -- Essential Duties &amp; Responsibilities: --\n\n  * Design and build clinical and social backends and related APIs that drive our web and mobile sites.\n  * Develop and improve A&#x2F;B Testing of new features on our platform allow us to drive company decisions with supporting metrics.\n  * Help evolve and scale the platform and its core rule and analytic engines to improve outcomes and improve peoples lives.\n\n  --- What we are looking for: ---\n\n  * BS in Computer Science (or equivalent)\n  * 5+ Years of Linux and web development experience\n  * Solid knowledge of JavaScript&#x2F;PHP website development.\n  * Thorough understanding of protocols such as HTTP, XMPP, SMTP, AMQP\n  * Working knowledge of RequireJS, Backbone, Handlebars, SASS, HTML and CSS\n  * Experience with data stores such as Redis, MySQL, LocalStorage.\n  * Experience with agile development practices and methodologies such as Scrum, TDD, BDD and Unit Testing.\n  * Experience with Continuous Integration and automated development tools and processes\n  * Familiarity with asynchronous&#x2F;event driven architectures and graph theory\n  * Familiarity with open source software development and have an active account on github\n  * Experience with building PHP&#x2F;Node Extensions, Ruby gems and Debian Packages is a big plus\n  * Experience with HIPAA, HITECH, PHI and related security and privacy laws is a plus\n  * Passionate, Accountable with excellent organization and communication skills\n\n  ---------------------------------\n  --- Android Software Engineer ---\n  ---------------------------------\n\n  http:&#x2F;&#x2F;jobvite.com&#x2F;m?3OrLugwf\n\n  -- Essential Duties and Responsibilities --\n\n  * Design and build hybrid apps and web experiences for mobile phones and tablets\n  * Work directly with our platform and analytics engineers and contribute the mobile perspective\n  * Collaborate daily with development, QA, product and management teams\n  * Maintains a working knowledge of relevant government and industry standards\n\n  -- Qualifications --\n\n  * BS in Computer Science or equivalent experience\n  * 3+ Years of mobile development experience\n  * Knowledge of protocols such as HTTP, OAuth and REST\n  * Thorough understanding of JavaScript, HTML5 and CSS3, REST APIs\n  * Experience with native app development for Android (Java), Android Frameworks and technologies such as WebView, Intents, Testing and Volley\n  * Experience with Android tools such as proguard, systrace, adb, bmgr and jobb\n  * Experience with GIT, Continuous Integration and automated development tools and processes\n  * Experience with design patterns, such as Model View Presenter, Data Mapper, Polymorphism, DRY, Decoupling\n  * Experience with agile development practices and methodologies such as Scrum, Refactoring, TDD, BDD and Unit Testing\n  * Strong interest in learning new technologies, standards and working with open source software\n  * Passionate, accountable with excellent organization and communication skills\n  * Experience with CORS, HTML5 WebSockets and C2DM based Push Notifications a plus\n\n  ---------------------------------\n  - Lead Test Automation Engineer -\n  ---------------------------------\n\n  http:&#x2F;&#x2F;jobvite.com&#x2F;m?3WIewgw9\n\n  -- Essential Duties and Responsibilities --\n\n  * Plans and directs the development, application, and maintenance of quality standards for our software.\n  * Develop and update test cases.\n  * Report product bugs using the Company’s bug-tracking tool.\n  * Collaborate daily with development, product and management teams. Create clear status reports and concisely communicate with relevant parties.\n  * Recommend streamlining of processes to improve test efficiency.\n  * Maintains a working knowledge of relevant government and industry standards.\n  * Interprets quality assurance philosophy to key personnel in the Company.\n  * Reviews all data obtained during all quality assurance activities to ensure consistency with Company policies and procedures.\n\n  -- Qualifications -- \n\n  * BS in Computer Science (or equivalent)\n  * 6+ Years of developing, managing and ensuring quality of a web platform and&#x2F;or service.\n  * Solid knowledge of automated test frameworks such as Watir, Selenium or Sahi and related best practices.\n  * Hands-on experience with testing large scale AJAX based websites.\n  * Hands-on experience with testing web services\n  * Have built out and maintained regression test frameworks.\n  * Used agile development practices and methodologies such as Scrum\n  * Deeply familiar with TDD, BDD and Unit Testing.\n  * Experience with Continuous Integration and Continuous Delivery pipelines\n  * Experience with RSpec, PHPUnit, SimpleTest\n  * Must pass a background check and drug test\n\n  ---------------------------------\n  ------- Engineering Intern ------\n  ---------------------------------\n\n  http:&#x2F;&#x2F;jobvite.com&#x2F;m?3wKewgwL\n\n  -- What you will do: --\n\n  * Build fast, secure, beautiful and scalable web apps\n  * Use modern web technologies to disrupt healthcare\n  * Be exposed to a broad range of technologies such as Chef, RabbitMQ, Redis, APIs and real time applications  \n  * And as always, debug hard problems\n\n  -- Requirements: --\n\n  * Current student at a top university majoring in Computer Science&#x2F;Computer Engineering \n  * Solid knowledge of data structures and algorithms\n  * Experience building web applications using PHP, Python or Ruby\n  * Web development experience (HTML 5, CSS, JavaScript, Ajax)\n  * Experience with Angular or Backbone is desirable but not required \n  * Most importantly, high energy and willingness to learn new technologies\n  * Must be able to pass a background check and drug screen\n  * This is a part-time position</code></pre>","time":1404225046,"type":"comment"}