{"by":"Synergyse","id":7970520,"parent":7970366,"text":"Synergyse - <a href=\"http://synergyse.com\" rel=\"nofollow\">http:&#x2F;&#x2F;synergyse.com</a>  - Toronto, ON (Local, Remote, Visa, Relocation)<p>Synergyse creates highly interactive and measurable Google Apps training. Our mission is to teach everyone how to use Google Apps proficiently. We are working on hard problems in big data, HTML5, media delivery and real time technology. Our backend technology and web runs on the highly scalable Google App Engine. Our frontend uses the Chrome Extension to inject content directly into Google Apps. We love using the latest technologies from Google!<p>Synergyse is based in Toronto and we managed to be profitable within a couple of months of starting it. Our clients tend to be in the enterprise and education world, but our technology is consumer facing and fun. It’s the best of both worlds. We are seeking a highly talented founding Software Engineer to join us in building the future of training software.<p>Why you should join us<p>======================<p>- Ability to define product and engineering as one of our first hires<p>- Work with a highly motivated and talented founding team<p>- Be a part of a business that has a good business model, good revenue stream, and makes flagship technology<p>- Flexible and casual work environment with opportunity to work remotely<p>- Competitive compensation ($100k-$150k), equity (0.5%-1.5%) and full benefits<p>What we’re looking for<p>======================<p>- Software Engineer with a full-stack experience<p>- Experience with cloud technologies (GAE, AWS, or Azure)<p>- Experience with Javascript (experience with Chrome Extensions is a plus)<p>- Ability to solve difficult technical problems<p>- Ability to lead and run projects<p>- Degree in Computer Science or equivalent, or 4+ years of professional engineering experience<p>Synergyse is on a mission to teach the world how to use Google Apps, our interactive training system is deployed in over 1000 schools and businesses around the world, supporting over 1 million end-users. Join our team of ex-Google engineers and learn what it takes to run a B2B business focused on the enterprise and education markets.<p>Apply: <a href=\"https://careers.stackoverflow.com/jobs/61050/senior-fullstack-java-javascript-engineer-synergyse\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;61050&#x2F;senior-fullstac...</a>","time":1404221894,"type":"comment"}