{"by":"stugrey","id":7971424,"parent":7970366,"text":"London, UK<p>Fully funded PhD Studentship in Space Debris Environment Modelling using Spatio-Temporal Analysis<p>University College London<p>=============<p>Although largely unrecognised by the general population, the world has never been more reliant on access to space. However, continued use of the space environment over the last 60 years has polluted the orbits around the Earth with debris. Currently only a small fraction of space debris is tracked. Failure to capture this data more accurately, and model its behaviour, could result in us losing access to space entirely if a space debris cascade event is allowed to occur.<p>The aim of this PhD project is to describe the current space debris environment using cutting edge astrodynamics methods and model its evolution over time using machine learning techniques and spatio-temporal data analysis. The Space Geodesy and Navigation Laboratory (SGNL) has become a world leader in accurately modelling the many forces acting on spacecraft in orbit. Our models are currently employed by both NASA and ESA to supply data to support scientific environmental monitoring missions (JASON-1, SENTINEL). SpaceTimeLab have a wealth of experience in the analysis, modelling, simulation and visualisation of large spatio-temporal datasets, with applications in transportation, crime and disaster response. This is an exciting opportunity to build on these models and develop novel techniques to gain new insights into the behaviour of the space debris environment.<p>Skills you will learn include design, development and testing of algorithms, software and database development, experimental design and implementation, data analysis and both technical and interpersonal communication. You will also have the opportunity to build a network of contacts within both the astrodynamics and spatio-temporal data analysis communities.<p>This project is a collaboration between UCL’s Space Geodesy and Navigation Laboratory and SpaceTimeLab and will be supervised by Dr Stuart Grey and Dr James Haworth.<p>Eligibility: Applications are invited from UK and EU members, residing in UK.<p>Application Procedure: Applicants should send a covering letter and CV to s.grey@ucl.ac.uk<p>Start Date: The post will be available from September 2014<p>Duration: 4 Years<p>Funding: The scholarship covers UCL registration fees and provides a stipend of £15,726 per annum tax free. Travel expenses and research equipment will also be paid for.<p>Funding Body:EPSRC (Engineering and Physical Sciences Research Council)","time":1404229375,"type":"comment"}