{"by":"clarkevans","id":7971545,"parent":7970366,"text":"Prometheus Research, New Haven, CT ; <a href=\"https://prometheusresearch.com\" rel=\"nofollow\">https:&#x2F;&#x2F;prometheusresearch.com</a><p>* Sr. Dev Ops Engineer (New Haven, Chicago, or U.S. Remote) *<p>Prometheus is building out our hosting infrastructure \nfor customized OSS RexDB deployments.  You&#x27;ll be joining \ntwo competent systems folk, and a delightful product manager.  \nWe use reStructuredText and Sphinx for documentation, Python \nfor scripting, Ansible for automation, and, soon Docker for \napplication releases.  We&#x27;re also moving from Apache to nginx \nwith the help of customized lua scripts.<p>We&#x27;re really interested in someone who has broad technical\nknowledge yet groks networks and security.  To collaborate \nremotely with our staff and clients, you need to be an \naccomplished writer with solid task management skills.  \nWe&#x27;re a custom development shop, with clients of varied\ntechnical skill levels; since our system group is often \nthe primary contact for technical issues, you&#x27;ll have to \nfearlessly tackle all sorts of challenges... both technical\nand political.<p>Unfortunately, since access to Protected Health Information\nis required, we&#x27;re only hiring in the U.S. for this position.<p>* Sr. Application Developer (New Haven, or Worldwide Remote) *<p>Our clients have all sorts of medical informatics challenges.\nPrometheus is also looking for someone to help build out our\nopen source RexDB software (<a href=\"http://rexdb.org\" rel=\"nofollow\">http:&#x2F;&#x2F;rexdb.org</a>) and deliver \ncustomized applications using it.<p>The backend is written in Python using PostgreSQL, and we&#x27;re\nbusy updating our client code to use Facebook&#x27;s React toolkit.\nWe&#x27;re especially looking for someone who loves analytics, and\nwishes to improve HTSQL (<a href=\"http://htsql.org\" rel=\"nofollow\">http:&#x2F;&#x2F;htsql.org</a>) with data processing\nand graphing features.  For more information, you could browse\nthe code base at <a href=\"http://bitbucket.org/rexdb/\" rel=\"nofollow\">http:&#x2F;&#x2F;bitbucket.org&#x2F;rexdb&#x2F;</a> and <a href=\"https://github.com/prometheusresearch\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;prometheusresearch</a><p>Of course, it&#x27;s great if you could join our core team in New\nHaven, CT.  Since most of our company is remote, you will need\nto work independently, and, <i>love</i> to write succinct\nanalysis and usage documentation.<p>Thanks in advance for dropping us a note at <i>hn-201407@prometheusresearch.com</i> - Clark","time":1404230326,"type":"comment"}