{"by":"theseanz","id":7971725,"parent":7970366,"text":"New Matter - <a href=\"http://newmatter.com\" rel=\"nofollow\">http:&#x2F;&#x2F;newmatter.com</a> - Los Angeles (Pasadena), CA<p>3D printing should be as easy as how we create and communicate. That’s why New Matter is more than just a printer. It’s an end-to-end 3D printing system, including our breakthrough MOD-t 3D printer, complimentary software, and a store full of cool 3D-printable designs.<p>Check out the last few days of our crowdfunding campaign here: <a href=\"https://www.indiegogo.com/projects/new-matter-mod-t-a-3d-printer-for-everyone\" rel=\"nofollow\">https:&#x2F;&#x2F;www.indiegogo.com&#x2F;projects&#x2F;new-matter-mod-t-a-3d-pri...</a><p>* Senior Software Engineer - Back End *<p>We&#x27;re looking for an engineer to lead the development of the back end of the 3D printing marketplace that’s tightly integrated with our 3D printer. We’re very early so you really get to own this piece of the product. You’ll work closely with product, front end engineers, mobile engineers, and firmware engineers to develop an API that talks to both our marketplace as well as our printers. Being self-driven is important since the team is small and we want to build an ambitious product quickly.<p>Preferably Ruby&#x2F;Rails, but we are early enough that you can pretty much build it out the way you want. You should have strong experience developing large-scale web applications and experience designing and building REST APIs.<p>* Senior Software Engineer - Front End *<p>We are also looking for engineer to lead the development of the front end of the marketplace. We’re very early so you really get to own this piece of the product. You’ll work closely with product and design to implement the best possible user experience across both desktop and mobile.<p>An ideal candidate would be up to date on current best practices for developing complex user interfaces, including front end frameworks and communicating with REST APIs. Being self-driven is important since the team is small and we want to build an ambitious product quickly. You should have strong experience developing large-scale web applications (desktop and mobile web), experience with modern web frameworks (such as Backbone, Angular, Ember, etc), experience working with REST APIs, and, obviously, experience with and extensive knowledge of web technologies (HTML5&#x2F;CSS3&#x2F;Javascript). Major plus if you consider yourself a full-stack developer (ie, you know how to integrate the front end with the back end)<p>* Other positions *<p>We don&#x27;t have formal job descriptions written yet, but if you are a desktop software or firmware engineer, please get in touch with us.<p>Email me (Sean Stevens) at sean@newmatter.com","time":1404231677,"type":"comment"}