{"by":"jmozen","id":7971159,"parent":7970366,"text":"Table XI - Sr. Software Developer, Designer - Chicago<p>&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F; About Table XI &#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;<p>(<a href=\"http://www.tablexi.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tablexi.com</a>)<p>Table XI is a Chicago-based digital consultancy, focused on building web and mobile applications that deliver business value to our customers. Many of our clients look to us to be their IT department, and we make decisions that affect the long-term success of their businesses. We do most of our work from our studio in Chicago and have a chef on staff who prepares gourmet lunch daily.<p>As a Table XI employee, you’ll work side-by-side and get exposure to many different people and projects. We’ve developed web and mobile applications for clients like Roger Ebert Digital, The Field Museum, Chicago Ideas Week, the YMCA of Chicago, fashion designer Maria Pinto, The Spice House, PechaKucha, Northwestern University, and many more. We love a challenge, and we’re not afraid to reinvent the wheel when the wheel isn’t good enough.<p>&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F; Sr. Software Developer &#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;<p>(<a href=\"http://tablexi.theresumator.com/apply/N5C5q5/Senior-Software-Developer\" rel=\"nofollow\">http:&#x2F;&#x2F;tablexi.theresumator.com&#x2F;apply&#x2F;N5C5q5&#x2F;Senior-Software...</a>)<p>We&#x27;re looking for experienced developers who:<p>* are curious and love exploring new technologies<p>* believe there’s a solution to every problem and are excited to find it<p>* have a few years of web development experience and are looking for an exciting new opportunity<p>* have a background in one or more of the the following: Ruby, JavaScript, HTML&#x2F;CSS and Objective-C. (Most of our projects currently use these languages; however, if you’re a strong developer with experience in related tools, we’d still love to hear from you. Experience with TDD is a plus, as is database or DevOps experience.)<p>&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F; Designer &#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;&#x2F;<p>(<a href=\"http://tablexi.theresumator.com/apply/kUX5Qr/Designer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;tablexi.theresumator.com&#x2F;apply&#x2F;kUX5Qr&#x2F;Designer.html</a>)<p>We&#x27;re looking for a designer who:<p>​* works as comfortably in HTML and CSS as in Photoshop<p>* views the job of a designer as being deeper than what is seen on the screen<p>* thinks about the fluidity of designs beyond “mobile”, “tablet” and “desktop”<p>* has experience working on web projects with small teams<p>* hasn’t ever used the phrase “good design will sell itself”<p>* has opinions on [fill in current web trend here]<p>* possesses strong typographic skills<p>* has mastered the principles of layout and color theory<p>* is familiar with and understands the basic syntax of HAML and SASS","time":1404227652,"type":"comment"}