{"by":"derrzzaa","id":7971421,"parent":7970366,"text":"Linux &#x2F; Big Data Engineer — Permanent role — Appsbroker, Swindon UK<p>Appsbroker continues to grow its Cloud Platform capability.  We are looking for strong Linux Engineers to join us from the South West of England to help us build the next generation of cloud platforms for our customers.  The chance to learn Big Data skills and enhance your Dev Ops capabilities are part of this role. Engineers at Appsbroker get the opportunity to excel in multiple technology disciplines.<p>You will get exposure to the latest Google and Amazon technologies including Google Compute Engine, App Engine, BigQuery, Managed VMs, Docker, Amazon EC2, S3 plus Puppet &#x2F; Ansible for CM &#x2F; automation.  Training &amp; certification in Google and Amazon cloud platform technologies provided on the job and by Google &#x2F; Amazon.<p>Responsibilities<p><pre><code>  - Development of cloud hosting platforms infrastructure (auto scaling &amp; load balanced resilient architectures, monitored &amp; audited, secure &amp; auto deployed)\n  - Tooling for cloud hosting platforms - Deploying and managing cloud infrastructure using Google Cloud Platform tools and&#x2F;or AWS and configuration of Linux operating systems using puppet, chef, ansible etc.\n  - Monitoring costs and managing budgets for the deployed technology stack\n  - Work on one or more projects reporting to the lead of Delivery Team &#x2F; Platform Department\n  - Automating system administration \n  - Best practice for rolling out security patches &amp; operating system major releases \n  - Assist development team with test platforms &amp; continuous integration activities\n  - Architecture of Big Data solutions:  On premise ETL -&gt; Big Query -&gt; Analysis &#x2F; Visualisation\n  - Talend Big Data ETL (Extract &#x2F; Transform &#x2F; Load) activities for extracting data from a multiplicity of data sources including SQL Databases, Web Services, flat files etc to support Big Data activities.\n  - Google BigQuery table design to support Big Data activities.\n</code></pre>\nMandatory skills<p><pre><code>  - Experienced administrator &amp; platform engineering skills for a major Linux-based operating system. Particularly RPM based Linux (RedHat, Centos, Unbreakable Linux and Fedora).\n  - Good programming skills in at least 1 modern language (Java, C#, python, PHP, ruby etc)\n  - Good scripting skills in at least 1 Linux based language (Bash, ksh, awk, perl, ruby, python) \n  - Prior experience with Linux in Virtual Machine environments: VMware &#x2F; vsphere, docker, kvm, xen\n  - Solid cloud firewall experience: iptables, AWS security groups etc\n  - Able to work in small Agile teams with other developers, project managers and stakeholders\n  - Able to commit to deadlines &#x2F; sprint outcomes and deliver and demonstrate tested components\n  - Able to accurately estimate time to complete tasks based on stories &#x2F; requirements\n  - Able to work across multiple projects within the same timeframes\n  - Able to interpret requirements and assist in producing designs that meet those requirements\n  - Source code control &#x2F; release management skills\n  - Working knowledge of securing a Linux server from attack threats\n  - Good documentation skills\n  - Dry sense of humour essential\n</code></pre>\nDesirable skills<p><pre><code>  - Experience building custom Linux platforms &amp; releases:  RedHat satellite, spacewalk, cobbler\n  - Conversant in Configuration Management automation - puppet, chef, salt or ansible.\n  - Conversant in JSON and Cloud Platform REST web services\n  - Prior experience with Google Cloud Platform and &#x2F; or Amazon Web Services Infrastructure as a Service offerings\n  - Ability to create RPMs\n  - Able to draw &#x2F; describe platform architectures visually using modern diagramming tools (Visio etc)\n  - ETL (Extract, Transform, Load) - Talend \n  - Google Cloud Storage or Amazon S3\n  - noSQL datastore experience - Google High Replication Datastore, Google Cloud Datastore, Amazon DynamoDb, MongoDb\n  - Google APIs (OAuth, Maps, Cloud Endpoints, Google Apps etc)\n  - Working knowledge of HTML &#x2F; CSS, HTML5 &#x2F; CSS3\n  - Working knowledge of JQuery &#x2F; Javascript\n</code></pre>\nAbout Appsbroker:\nAppsbroker is a cloud solutions consultancy &amp; product organisation. We specialise in providing the following Cloud services:<p>Google Cloud Platform Partner:  Compute Engine, App Engine, Big Query, Cloud Storage\nAmazon AWS Reseller &#x2F; Consulting Partner: EC2, S3, DynamoDb\nGoogle Search Premier Partner\nGoogle Apps Premier Partner\nGoogle Maps Premier Partner<p>Appsbroker is a fast growing organisation and as a result of this growth we are looking for good people to join us on a continual basis. Our clients include Jaguar Land Rover, Vodafone &amp; Travis Perkins and we are premium enterprise partners of both Google and Amazon AWS.  Appsbroker employees enjoy a wide range of social activities and quarterly special events. Employees benefit in being an active part of all project development and contributing directly to the success of these projects. Cloud services is a fast moving industry with constantly evolving web technologies that employees can employ directly in their next project.<p>Location:  The job will be based at our office in Swindon, Wiltshire.\nSalary: Dependent on experience<p>Contact:  info@appsbroker.com  (quote hackernews!)","time":1404229369,"type":"comment"}