{"by":"eddietejeda","id":7971547,"parent":7970366,"text":"Bay Area, Full Time&#x2F;Contract<p>- Ruby on Rails Developer<p>- Sales and Business Development Lead<p><a href=\"http://civicinsight.com/jobs.html\" rel=\"nofollow\">http:&#x2F;&#x2F;civicinsight.com&#x2F;jobs.html</a><p>===About Us===<p>At Civic Insight, we are helping to build a world where all members of society have access to the data necessary to make informed and inclusive decisions about the trajectory of their neighborhoods. Our online platform makes official data about the management of buildings, permitting and construction available to the public in a refreshingly simple yet powerful interface. We have seen how lack of access to this information can be costly to businesses, governments and communities, and we’re working to change that.<p>We’ve graduated from Code for America’s Incubator, we have investments from the Knight Foundation, and we’re generating consistent revenue. Our platform has garnered praise from PBS News Hour, Time Magazine, and the Wall Street Journal.<p>We’re live in New Orleans and Palo Alto, and we’re confirmed to launch in 11 new cities by the end of the year.<p>This is where you come in.<p>===Seeking===\nWe are seeking a talented Ruby on Rails Developer to help us on-board new customers as well as continue to streamline and improve the platform in response to user and customer needs. We’re looking for a team player who’s eager to get their hands dirty working on a multi-tenant Rails application with lots of GIS data that has the potential to change the way we relate to the built environment in our cities.<p>===Our current technology stack:===<p><pre><code>    Ruby on Rails\n\n    PostGIS database\n\n    Leaflet.js &#x2F; Mapbox &#x2F; ESRI &#x2F; Google Maps\n\n    HighCharts.js\n\n    Grape RESTful API microframework\n</code></pre>\n===You’re excited to work on:===<p><pre><code>    Integrating new customers into the platform\n\n    Building out a comprehensive analytics framework\n\n    Enhancing our geospatial searching and filtering capabilities\n\n    Increasing automation and backend management\n\n    Improving scalability and performance\n</code></pre>\n===You have:===<p><pre><code>    Bachelor&#x27;s degree in CS or related field or equivalent experience\n\n    Experience with Ruby on Rails\n\n    Strong proficiency writing RSpec tests\n\n    Experience with with MVC Javascript\n\n    Experience with GIS data\n\n    Experience working with a variety of APIs and&#x2F;or building large data importers\n\n    Good communication skills and a collaborative mentality\n</code></pre>\n===Bonus points:===<p><pre><code>    You dabble in data science and have built a data visualization or two\n\n    You have an eye for design; you have the ability and an interest in contributing to design conversations\n\n    You have a passion for making cities work better, and maybe even some experience working on civic technology projects\n\n    Experience working with time-series data\n\n    Experience with building Ruby on Rails Engines\n\n    Experience with multi-tenant Rails &#x2F; SaaS applications</code></pre>","time":1404230332,"type":"comment"}