{"by":"tarmigan","id":7972967,"parent":7970366,"text":"Tesla Motors, Stationary Storage Group,  Palo Alto<p>Our Stationary Storage product offers battery storage systems that can attach to power grids, commercial areas, or residential systems.  As the need for and the available sources of energy increases, efficient and smart energy storage is quickly becoming the only solution for meeting these demands.<p>We are have several open positions for firmware and embedded software within this team.  Finding the right person for the group and then defining a role for their skillset is more important to us than listing several generic job descriptions.  If you are passionate about this field and technology, feel free to contact us.<p>Below are some specific skills and experience that we know we will need (we do not expect all of these in the same candidate).  I&#x27;ve clustered them into two groups of skills, but we&#x27;d be happy to have a candidate with a blend from both clusters.<p>Embedded Firmware<p>-----------------<p>- Embedded C<p>- Realtime operating systems and applications<p>- Low-level embedded experience with linkers, bootloaders, drivers<p>- CAN bus<p>- Embedded TCP&#x2F;IP (driver level)<p>- Experience with power electronics<p>- Familiarity with electronics, schematics, PCBs (can use an oscope)<p>- Design for safety critical systems<p>- State machines<p>Embedded Linux<p>--------------<p>- Embedded linux application deployment<p>- Protocol buffers<p>- Golang<p>- Zigbee<p>- Industrial or utility SCADA protocols like modbus and DNP3<p>- Experience with power electronics or the energy industry<p>- General networking: ppp, ssh, vpn, iptables<p>- Code generation + DSLs<p>You should be interested in, excited about, or experienced with the Energy Industry to apply for this position.  Our team is a small part of the company but we are working on becoming a larger part.  These positions will have a significant impact on the design and behaviors of our next generation Stationary Storage products.<p>At this time, we are not looking for interns or people working remotely.<p>Please email tcasebolt@teslamotors.com for more information.<p>If you are interested in other positions at the Tesla (for example working on vehicles), it is most helpful if you have a position in mind that you are interested in and I can forward your info on to the right people.  For other positions, please see <a href=\"http://www.teslamotors.com/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.teslamotors.com&#x2F;careers</a>","time":1404243062,"type":"comment"}