{"by":"jdleesmiller","id":7972026,"parent":7970366,"text":"writeLaTeX (<a href=\"https://www.writelatex.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.writelatex.com&#x2F;</a>), London, UK<p>About Us:<p>We&#x27;re building &#x27;Google Docs for Science&#x27;, making science and R&amp;D faster, more open and more transparent by bringing the whole scientific process into the cloud, from idea to writing to review to publication. Our users have already created more than 1,000,000 documents on writeLaTeX, and it is being used in hundreds of universities worldwide for teaching and research.<p>We&#x27;re a London-based startup, supported by Bethnal Green Ventures (<a href=\"http://bethnalgreenventures.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;bethnalgreenventures.com&#x2F;</a>) and founded by two mathematicians who were inspired by their own experiences in academia to create a better solution for scientific collaboration and communication.<p>We&#x27;re looking for a full stack engineer:<p>You&#x27;ll be working closely with our team to build new and awesome ways for scientists to collaborate and communicate. We&#x27;re looking for full stack engineers — your projects will span our database (PostgreSQL), web app (Ruby &amp; Rails, Node.js, Meteor), front end (HTML, CSS, Javascript) and infrastructure (Heroku, Linux on Amazon EC2, RackSpace) layers. We also have projects for mobile, if you&#x27;re into Android or iOS.<p>You&#x27;re an independent thinker and fast learner. You&#x27;re resourceful and knowledgeable, but you ask questions when you get stuck. You take pride in your work, and you ship it early and often, because you love to see it out there in the real world. You learn new programming languages and techniques for fun, and you contribute to open source.<p>If this sounds like you, send your CV, current salary, and a link to your profile on github&#x2F;bitbucket to jobs@writelatex.com. We&#x27;ll get in touch to arrange an informal interview in person if possible, otherwise via Skype&#x2F;Google Hangout.<p>This is an immediate vacancy for a permanent position with a two month probationary period. Working arrangements are flexible. The primary place of work will be at our London office.<p>We look forward to meeting you!","time":1404234300,"type":"comment"}