{"by":"paf31","id":7972443,"parent":7970366,"text":"DICOM Grid <a href=\"http://dicomgrid.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;dicomgrid.com&#x2F;</a> - Phoenix, AZ or REMOTE<p>DICOM Grid, a SaaS start-up in the healthcare technology field, is looking for a JavaScript&#x2F;TypeScript developer to maintain and enhance DICOM Grid’s front-end medical image sharing and reading web application. You will report to the Director of Dev Ops.<p>Familiarity with modern front-end web development is essential.<p>The ideal candidate would be able to work independently with minimal supervision, and be enthusiastic about keeping up-to-date with the latest web technologies.<p>The team is distributed with team members working remotely in Phoenix, Los Angeles, Boston, and New York.<p>Required:<p>* HTML5, CSS, JavaScript<p>* JQuery, Underscore<p>* Working knowledge of Linux<p>Familiarity with any of the following would be a big plus:<p>* TypeScript<p>* Handlebars, Backbone<p>* Scala, Java<p>* Functional programming techniques<p>* Linear algebra<p>* DICOM, HL7<p>Position Responsibilities<p>* Plan, evaluate, implement, test and document new features and bug fixes for the DICOM Grid web application.<p>* Work with other development team members to integrate with backend services.<p>* Work with DevOps to deploy code into our production and UAT environments.<p>* Work with customers and professional services to gather requirements.<p>* Conform to company standard operating procedures.<p>What qualifies you to join?<p>* A combination of a college degree in CS, Math, Physics, or related, relevant work experience, and&#x2F;or a strong open source portfolio<p>* General interest in the healthcare field<p>* Strong communication and interpersonal skills<p>* Meticulous attention to detail with strong organization skills<p>* Base salary and stock options depend on experience; health insurance, paid holidays and vacation are part of the package.<p>Send your resume, cover letter and&#x2F;or links to your StackOverflow, GitHub profiles, etc. to pfreeman+hn@dicomgrid.com.<p>For bonus points, include a solution to the following short task, including code in JavaScript or the frontend language of your choice: write a function which identities the largest common set (not list) of words appearing as prefixes of two input strings. For example, the largest common prefix set of the strings &quot;His dog and the cat&quot; and &quot;The dog and his ball&quot; is { &quot;the&quot;, &quot;dog&quot;, &quot;and&quot;, &quot;his&quot; }<p>No recruiters please.","time":1404237960,"type":"comment"}