{"by":"wbharding","id":7972041,"parent":7970366,"text":"Bonanza.com. Seattle, WA. <a href=\"http://www.bonanza.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bonanza.com</a><p>Full-Stack Rails Developer<p>We&#x27;re looking for a full time, full stack Ruby on Rails developer to continually improve the user interface, performance, feel, and other aspects of our site to make our customers happier, save time, and have more fun buying and selling on Bonanza.com.<p>We’ve already built Bonanza into a leading person-to-person marketplace, but we&#x27;ll never stop making it even better. Some things you’ll be responsible for might include:<p>* Fix bugs reported by customers and the dev team\n* Implement new features as needed\n* Learn and grow your skills under the guidance of world-class Rails coders on our dev team\n* Use the website regularly and contribute your own suggestions on how we can make it better<p>Requirements<p>We strongly prefer that you have some Ruby on Rails experience in a production environment. You’ll be working in the full stack, from the mysql database up to jQuery and HTML&#x2F;CSS. You should be comfortable receiving sometimes-vague bug reports, and having the doggedness to track down repro steps and make an appropriate fix. You should have the empathy to see problems from our customers’ perspectives and keep their needs in mind while building solutions. An innate sense of good UX design would be super helpful in this position.<p>Because we’re a small and close-knit team, attitude is a critical element in our selection process. The ideal candidate will be able to speak both &quot;geek&quot; and &quot;human,&quot; and will approach problems with a &quot;can-do&quot; attitude.<p>Note: If you&#x27;re not currently located in the Seattle area, we&#x27;re open to working remotely with a strong candidate.<p>Benefits<p>In addition to a very competitive salary, Bonanza offers the following perks:<p>* &quot;Work from home Wednesday&quot; - every Wednesday we get to work from home, coffee shops, or wherever suits us (remote staff can work from home every day!)\n* &quot;Freedom February&quot; - every February we retreat from the gloom of Seattle and work from a remote tropical locale. So far we&#x27;ve been to Costa Rica and Oahu. Next year we&#x27;re eyeing Nicaragua.\n* Fast growing (averaged 50-100% yearly growth over 5 years), and already-profitable company. It&#x27;s fun to work for a winner.\n* Work from a waterfront office in downtown Seattle (food trucks aplenty!)\n* Full arcade room in the office\n* Pong table on site\n* All employees get fully paid health insurance coverage, vacation benefits, holidays, stock options, and more.<p>Apply for this job<p>To apply to any of the above jobs, please email jobs -at- bonanza.com. Specify in the title the position you are applying for, and include a one page cover letter, plus your resume. We look forward to hearing from you!","time":1404234451,"type":"comment"}