{"by":"simonix","id":7972535,"parent":7970366,"text":"Numerate Inc, San Bruno, CA (25 mins from San Francisco)<p>Senior Infrastructure Engineer - Distributed Systems<p><a href=\"https://github.com/Numerate/hiring\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;Numerate&#x2F;hiring</a><p>--- Who we are ---<p>Numerate is a group of cutting-edge scientists and engineers trying to solve very difficult problems at the interface of medicinal chemistry, data science, machine learning and cloud-scale analytics. We have developed a computational platform that can predict how a potential drug will behave in the lab and the body. We use this platform to process large spaces of chemistry while searching for therapies for some of the world’s most important diseases, such as, obesity, heart failure, Alzheimer’s, and Huntington’s disease. Our platform makes the drug development process cheaper, faster, and results in higher success rates than traditional approaches.<p>--- Our Stack ---<p>Our stack consists of a proprietary distributed computational platform, Numatix, which in-turn consists of cloud management, job management, job execution engine and custom dataflow language layers. We generally run this on top of Amazon Web Services, where we often scale the system to more than 10,000 cores. We are working to scale it to over 100,000 cores. On top of Numatix we run a number of custom libraries and services, such as machine learning, cheminformatics, bioinformatics, mathematics, etc. At the very top of our stack sits a number of user-facing tools, including web-based GUIs, NIX command line tools, and custom plugins for third party data analysis and chemistry tools. All of the layers use various storage types (MySQL, S3, Couchbase, custom built). The code base is written in Java, Scala, Python, and some C++. All of these layers are being actively developed and improved.<p>Join us, and code for more than just clicks!<p>For more information see <a href=\"https://github.com/Numerate/hiring\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;Numerate&#x2F;hiring</a> or shoot us an email to eng_job@numerate.com","time":1404238680,"type":"comment"}