{"by":"ianmchenry","id":7972379,"kids":[8030918],"parent":7970366,"text":"Beyond Pricing - San Francisco, CA - Full-Stack Developer (<a href=\"https://beyondpricing.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;beyondpricing.com&#x2F;</a>)<p>Beyond Pricing is seeking our second full-stack developer to help bring dynamic pricing to the $85B vacation rental market (think Airbnb and HomeAway).  As our second engineer, you&#x27;ll have a huge influence on the product.<p>Email jobs@beyondpricing.com if you&#x27;re interested.<p>==========\nAbout Us\n==========<p>Beyond Pricing is bringing dynamic pricing to Airbnb, VRBO, and the $85B vacation rental market.<p>We leverage massive datasets including hotel prices, local occupancy rates, airline data, and more to power a predictive and reactive pricing model that updates prices for each of our customers, daily.<p>We are already pricing over 6% of San Francisco Airbnbs in the two weeks since our public launch, and see between 15-40% increases in revenue for our customers.  We have 1000s of customers in over 100 major global cities waiting for us to launch in their city.  That&#x27;s why we need you.<p>We are a seasoned team, all with prior experience as founders or early employees at YC companies and with strong backgrounds in revenue management for hotels and airlines.  We have a great set of seed investors who have invested early in companies like Uber, Hipmunk, Optimizely, and Homejoy.<p>==========\nAbout You\n==========<p>Ideally you will have worked on the full stack of a web product before, but we’re open to talented or senior front &#x2F; back-end specific engineers. You’ll be joining a small team - currently one full time and two part time engineers - so you’ll have a big influence over our product going forward.\nOur stack is Python &#x2F; Django on the back end, coffeescript &#x2F; sass &#x2F; ember on the front end.<p>=======\nSKILLS\n=======<p>Experience in any of the following is preferred but not required:<p>python\ncoffeescript\nsass &#x2F; css\nember\nmachine learning\nstatistical modeling<p>=======\nCULTURE\n=======<p>We are team of YC vets who understand that people come first, product comes second, and the rest should follow.<p>While you will probably love coming into our office (two floors, two kegs, chess boards &amp; foosball), people are free to work from anywhere.<p>Outside of work, we are comprised of marathon runners, bikers, wine makers, chess players, and artists.<p>========\nBENEFITS\n========<p>All employees have full health benefits, include dental and vision.<p>We&#x27;d love for you to join us!<p>- David, Andrew, Ian and the rest of the Beyond Team","time":1404237364,"type":"comment"}