{"by":"artin","id":7972158,"parent":7970366,"text":"Push Science (<a href=\"http://pushsci.com\" rel=\"nofollow\">http:&#x2F;&#x2F;pushsci.com</a>) Toronto, ON, Canada (Happy Canada Day!)<p>Open Positions:\n- Ruby on Rails API Developer (local or remote contract)\n- Front-end Angular JS Developer (local or remote contract)\n- DevOps Expert (contract)\n- UX Designer (local contract)<p>Communication services and the Service Providers play an important role on our daily lives. But the fact is most of us hate dealing with our telco service provider. We think that’s crazy and needs to change.<p>Starting with the retail store touch point, Push Science is empowering front line agents to deliver exceptional customer experience using mobile software tools for sales and customer care. Our patented technologies allow agents to connect with customers and provide service in brand new ways.<p>We think that dealing with your telco (or any other service provider) should be a pleasure and delight. We’re looking for passionate designers and engineers that can make this possible.<p>Our technology:\nCloud based backend running on Ruby on Rails, Rails 4, Active Model Serializers, Postgres. Frontend Angular JS, Cordova. We develop and maintain a RESTful JSON API that powers our application at multiple touch-points. Developing new systems for real-time asynchronous communication. Writing libraries to integrate with external systems.<p>We use an agile scrum process with 2-week sprints. Our team of 10 people includes designers, engineers, business development, and a stellar batch of telco advisors. Our office is located on King and Bathurst in the heart of Toronto’s entertainment and fashion district.<p>You can reach us at careers@pushsci.com\nPush Science job board: <a href=\"http://pushscience.theresumator.com/apply\" rel=\"nofollow\">http:&#x2F;&#x2F;pushscience.theresumator.com&#x2F;apply</a>\nPush Science website: <a href=\"http://pushsci.com\" rel=\"nofollow\">http:&#x2F;&#x2F;pushsci.com</a>","time":1404235489,"type":"comment"}