{"by":"techwraith","id":7972430,"parent":7970366,"text":"Getable — San Francisco, CA<p>Getable is a small team (~10 people) working on changing the construction industry by helping contractors order and manage their rental equipment. We focus on producing high quality apps for three separate users: Contractors, Suppliers, and Getable itself.\nWe develop our applications using a modular approach on both the frontend and backend, using a modern, mostly open source JavaScript based stack: CouchDB, Node, Engine.io, Backbone, and responsive design.<p>Our frontend is based heavily on Atomic Design and Development, using an open source library we built called Atomify. We optimize for developer happiness and eliminate as many barriers to getting things on production as we can: we don&#x27;t have any build steps, we have a live reloading component development workflow, and we have tests that run as you write your code.<p>Most of our apps are very frontend heavy, but our backend is all realtime. We share model code between the server and the client to make interacting with our data easy.\nAt the end of the day though, none of that is what makes us get out of bed in the morning. It all comes down to creating great feeling interactions to help our users get their jobs done.<p>Day to Day:<p>- Participate in the team&#x27;s direction and come up with new ideas<p>- Build modules for both the frontend and backend. We embrace open source and modularized development<p>- Participate in and contribute to product discussions<p>Requirements:<p>- Have a passion for building easy to use apps for underserved users<p>- Love to write small, well tested components that can be reused in many contexts<p>- Have experience working on large JS codebases with a team of other highly skilled  engineers<p>- Be able to work on both the frontend and the backend - it&#x27;s all JS<p>We provide:<p>- Meaningful equity<p>- Better than average health plans<p>- Backed by industry leading VCs<p>- Opportunities to grow as a leader or individual contributor<p>- Fun and smart coworkers<p>Sound like a good deal to you? Apply here: <a href=\"https://angel.co/getable/jobs/30560-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;getable&#x2F;jobs&#x2F;30560-software-engineer</a> or email daniel@getable.com","time":1404237836,"type":"comment"}