{"by":"astockwell","id":7972785,"parent":7970366,"text":"US - Phoenix, AZ (fulltime, local only)<p>P.S. Studios in sunny Phoenix, AZ is looking for a local full-time, well-rounded web developer to enhance our creative and committed team. Our clients range from local arts and cultural organizations to architects, national educational institutions and retailers. We focus on providing an excellent working experience for our clients and continually pushing the envelope with design on the web.<p>Your main responsibility will be building web experiences using a variety of front- and back-end technologies. We are primarily a Wordpress shop, so this will include intensive PHP development as well as interaction and UI development and design. Projects will include everything from coding simple HTML emails, to planning, building, and deploying customized publishing platforms and web apps. You will become an integral part of our team, helping craft and execute cutting-edge projects for small and large web efforts, with emphasis on design and performance.<p>-------- Day-to-day on the Job --------<p>Since we are a small studio, no two projects are the same and a lot of our success is due to our flexibility.<p>The ideal candidate will have strong knowledge of PHP, HTML5 and CSS3 and can demonstrate experience building websites from design to launch. Experience with modern web development workflows (preprocessors, MVC principles, modular&#x2F;OO design patterns) is key. Must understand the development process and have the ability to scope and architect Wordpress and other database-driven sites. Have a deep understanding of SEO principles, web standards and responsive design, and can isolate browser-compatibility bugs back to IE8 when called for. The ability to jump in and successfully troubleshoot an unfamiliar site is a must. Familiarity with version control systems (git) is important, and knowledge of other development languages&#x2F;platforms (Rails, Flask, etc) and&#x2F;or database administration is a plus.<p>This is a full-time in-house position at our Phoenix studio. Salary is commensurate with experience.<p>-------- Skills &amp; Requirements --------<p>- Ability to solve complex technical problems and communicate the solution clearly to other non-technical designers and client teams<p>- Examples of hand-coded, standards-based HTML5, CSS3 and javascript work (doesn&#x27;t have to be from client work)<p>- Experience developing custom Wordpress sites or themes, both front-end and back-end, from scratch when necessary<p>- Experience with modern front-end development tooling: Sass, Bower, Codekit&#x2F;Grunt&#x2F;etc, git or other VCS<p>- Experience with UX development: Responsive design, Semantic markup, mobile optimization<p>- Understanding of MVC architectures or maintaining&#x2F;deploying a LAMP stack are a plus<p>- A strong sense of craftsmanship and pride in your work<p>-------- About PS Studios --------<p>We’re a small studio of a dozen people who share a sense of craft and want to make a difference for our clients. We go to work everyday in a beautiful mid-century modern building located in midtown Phoenix, Arizona, work on the latest generation of Mac Pro machines, and provide delicious illy espresso as creative fuel. Please email me at astockwell@psstudios.com if interested. Examples of finished work along with your inquiry are preferred.","time":1404241231,"type":"comment"}