{"by":"flylib","id":7973576,"parent":7970366,"text":"Inbox Health - Bridgeport, CT<p>About Inbox Health:<p>Inbox Health is developing software to improve the efficiency of healthcare. We&#x27;re particularly focused on creating solutions to patient billing and payments. This may sound boring, but it&#x27;s a tremendous issue, and an exciting challenge. We&#x27;re dedicated and passionate about making change in the healthcare space. We&#x27;re well funded from several angel investors, and are currently closing a large seed round that will allow for ample runway and team growth.<p>What We&#x27;re Looking For:<p>We&#x27;re currently looking to add at least two engineers and a full stack UI&#x2F;UX designer to our current team. Candidates should be passionate about healthcare innovation (particularly on the business operations side of things), SaaS business models, startups in general. If you&#x27;re not sure if you&#x27;re interested in working for a healthcare startup, stop reading this post, buy the book &quot;Where Does it Hurt?&quot;, and read that. Then come back.<p>Skills&#x2F;focuses that are desirable, but not necessarily all required:\n- Ruby on Rails development experience or significant experience with server-side development languages&#x2F;MVC frameworks\n- Front-end development and&#x2F;or UI&#x2F;UX Design\n- Experience in designing and utilizing modular and reusable HTML5 templating (ERB) and Javascript libraries and frameworks\n- Previous experience with GitHub version control software and concepts (forking, merging, committing, branching, etc.)\n- Passion for database architecture and design\n- Experience with REST architecture design patterns\n- Familiarity with Linux\n- Server-side UNIX development and command-line scripting<p>Requirements:\n- Public GitHub projects and work and&#x2F;or be willing to create or share sample work\n- Must be willing to commute to, or relocate to the area. <i></i>This is an on-site position only.<i></i><p>Other Details:<p>Compensation will be in line with current market pay. Obviously it depends on your skill level and experience. We&#x27;re offering equity. We provide health benefits and vacation time and such. Side note: If you&#x27;re leaving your job looking for a better salary, don&#x27;t contact us. If you&#x27;re looking to make an impact on an industry, have more ownership over a product, work on something you&#x27;re passionate about etc... then lets talk.<p>We enjoy long walks around the block with the office dog, the occasional Mario Kart competition, and the occasional philosophical tangent. The office is generally dog friendly. As long as he or she gets along well with the current dog(s).<p>Apply at blake@inboxhealth.com","time":1404249553,"type":"comment"}