{"by":"traff_ss","id":7973462,"parent":7970366,"text":"Lead Developer - Python&#x2F;Django \nBriggo Coffee Haus, Austin, TX\n<a href=\"https://briggo.com/web/#about\" rel=\"nofollow\">https:&#x2F;&#x2F;briggo.com&#x2F;web&#x2F;#about</a><p>--  Opportunity:<p>If you are looking for the opportunity to lead the development of the cloud-based UI&#x2F;UX for an exciting start-up that&#x27;s revolutionizing the coffee industry then you’ve found the right place! Briggo is revolutionizing the way that people order coffee (think the Redbox of coffee) and is looking for someone to lead the development effort for their web, mobile, middleware and user experience.<p>--  Key Responsibilities &amp; Skills<p><pre><code>    Deploy, maintain and support infrastructures of cloud-based, middleware application servers. Experience with Amazon Web Services, especially EC2 and S3 is a plus.\n\n    Monitor all production servers, applications and services\n\n    5+ years of web related development experience. Lead developer&#x2F;architecture experience a plus\n\n    Must have experience with Python and Django framework\n\n    Must have experience creating RESTful API applications. Experience with open source tools like Tastypie are a plus.\n\n    Must have experience in designing a database architecture. Knowledge of PostgreSQL is a plus.\n\n    Experience with HTML5, CSS3, and JQuery\n\n    Experience with JavaScript framework such as Backbone.js, grunt,js, and require.js\n\n    Must be proficient in Linux\n\n    iOS and&#x2F;or Android development and deployment experience is a large plus\n\n    Experience with Nginx\n\n    Knowledge of messaging systems\n\n    Puppet, Salt experience a plus\n\n    Knowledge of Nagios or other monitoring platforms.\n\n    Excellent analytical, problem-solving and technical troubleshooting skills\n\n    Strong verbal and written communication skills; ability to remain composed and professional in stressful, high-pressure situations.\n</code></pre>\n--  Required Knowledge &amp; Experience<p>Degree in Computer Science, MIS, Math, or related fields. At least 5 years of experience developing successful internet and&#x2F;or mobile-based products. Experience utilizing software development processes and tools (eg, source control, issue tracking, test-driven development, etc). Start-up experience is strongly preferred. Experience designing software architecture and database architecture is strongly preferred.<p>If this sounds interesting, email me at tim.dehne@briggo.com","time":1404248225,"type":"comment"}