{"by":"bendog24","id":7973323,"parent":7970366,"text":"Portland, OR: Treehouse - Java Teacher - <a href=\"http://teamtreehouse.com\" rel=\"nofollow\">http:&#x2F;&#x2F;teamtreehouse.com</a><p><a href=\"https://teamtreehouse.com/jobs/at-treehouse-0e946294-cb80-4524-b782-60d391414905\" rel=\"nofollow\">https:&#x2F;&#x2F;teamtreehouse.com&#x2F;jobs&#x2F;at-treehouse-0e946294-cb80-45...</a><p><i></i>Overview<i></i><p>Treehouse is an educational technology company. Our mission is to bring affordable technology education to people everywhere, in order to help them achieve their dreams and change the world. As a teacher at Treehouse, you’ll join our amazing teaching team to create world class learning material for Treehouse students. Due to the nature of high quality video production, you will need to work from our production office in Portland, Oregon.<p><i></i>Responsibilities<i></i><p>- Work with other teachers to design the Treehouse curriculum at a high level by identifying topics that are critical to job-readiness.<p>- Write structured educational content and work with the video team through production and release. This includes writing scripts, creating engaging example projects, building assessment material using Treehouse Quizzes and Code Challenges, and recording all course materials both on-set and as a screencast.<p>- Iterate quickly on courses to keep them up-to-date with the latest tools and technologies.<p>- Research new languages, tools, frameworks, open source projects, and other material to stay on the cutting-edge of technology.<p>- Support Treehouse courses after their release by responding to student questions and making critical updates to courses as necessary.<p><i></i>Qualifications<i></i><p>- Deep knowledge of Java for desktop and web application development<p>- Deep knowledge of related web technologies for Java web development (HTML&#x2F;CSS&#x2F;JS)<p>- Knowledge of native Android development is a plus<p>- Passionate about sharing knowledge and teaching others<p>- Outstanding writing abilities<p>- Excellent presentation skills and on-camera confidence<p><i></i>Benefits<i></i><p>- Full coverage for medical, dental, and vision insurance<p>- 4-day, 32-hour work week (we don&#x27;t work on Friday)<p>- 18 days (or 4.5 weeks) paid time off<p>- 401(k) contribution matching, 100% up to 6% of your salary<p>- $5,000 office setup budget<p>- $1,500 annual education budget (conferences, books, classes, etc.)<p>- Free iPhone or Android phone and monthly contract compensation<p>- Free lunch every day","time":1404246553,"type":"comment"}