{"by":"greattypo","id":7974474,"parent":7970366,"text":"Clever (YC S12) is hiring full-stack engineers to hack education<p>Steve Jobs described education as one of the final frontiers still untouched by modern technology. Clever (YC S12 - <a href=\"https://clever.com\" rel=\"nofollow\">https:&#x2F;&#x2F;clever.com</a>) is building the data platform needed for great software to make its way into the classroom. Just like Stripe has made it simple for developers to build payment processing into their apps, Clever has made it easy for developers to build applications for schools using student data.<p>We&#x27;re a small, highly technical team with deep experience in education. In under two years, 1 in 7 schools in America has begun using our APIs, meaning that Clever moves data for eight million students every day.<p>Our newest project is essentially Facebook Connect for education: one identity to tie together all of a student’s learning applications into a cohesive experience.  We’re making that happen with our Instant Login service, which allows students to log in once and immediately get access to all their apps: <a href=\"https://www.edsurge.com/n/2014-05-14-no-more-passwords-clever-shows-off-instant-login\" rel=\"nofollow\">https:&#x2F;&#x2F;www.edsurge.com&#x2F;n&#x2F;2014-05-14-no-more-passwords-cleve...</a><p>And while we have all the startup perks (a beautiful loft office in SoMa, free lunch, unlimited Amazon credits for learning..) – hands down the best part of the job are the calls and emails from schools describing how much Clever helps them.<p>As an education company, we’re all about learning personally too – it’s practically a prerequisite to work here. In the past few weeks we’ve done tech talks on things like exoplanets, set theory, and kitesurfing.  (We also love a good round of bughouse chess – just ask Magnus Carlsen <a href=\"http://screencast.com/t/xD7umWfo\" rel=\"nofollow\">http:&#x2F;&#x2F;screencast.com&#x2F;t&#x2F;xD7umWfo</a>)<p>We’re looking for full-stack engineers who can hack in Node, Go, and Python (or are willing to learn), but more importantly, we’re looking for people who share our passion for improving education.  If you’re interested, we’d love to hear from you.<p><a href=\"https://clever.com/about/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;clever.com&#x2F;about&#x2F;jobs</a><p>At Clever, we want to work with the best people - applicants of all backgrounds and beliefs are welcome to come improve education with us. We&#x27;re committed to making our office a safe and comfortable environment for all employees.","time":1404262535,"type":"comment"}