{"by":"Clairesheng","dead":true,"id":7975348,"parent":7970366,"text":"Remote or one of our offices: San Francisco, CA - Shanghai, China<p>---<p>We build products at the intersection of technology around data. Lots of data visualization, big data and infrastructure.<p>We work with large organizations on challenging problems (the World Bank, the United Nations, CNN) OR on our own products (mostly developer tools, things like <a href=\"http://devo.ps\" rel=\"nofollow\">http:&#x2F;&#x2F;devo.ps</a> or <a href=\"http://octokan.com\" rel=\"nofollow\">http:&#x2F;&#x2F;octokan.com</a>).<p>We are a multicultural team with French, American, British, Chinese, Korean, Dutch and Finnish colleagues. We are about to settle a third office in Berlin and are looking at remote hiring in Spain and Seoul.<p>We work a lot with Javascript (node.js, AngularJS), Python, occasionally Go and Erlang. Lots of single page apps, APIs and infrastructure automation.<p>We are looking for full-time or interns:<p>- Developers; front-end (HTML5 + Compass + AngularJS), backend (node.js, Python), ops (Python, Go).<p>- Designers; you have design chops, understand technology (HTML&#x2F;CSS...) and do more than nice pictures (content strategy, color theory, ...).<p>- Strategist; you can quickly immerse yourself in a new field of knowledge, have a knack for data and are quick at recognizing patterns. You are a jack-of-all-trades that can think a solution and get it shipped, either alone or with a team.<p>- Marketing; you have what it takes to grow a brand or product online and understand how to leverage online and offline tools to get there.<p>- Business Development; if you are in Washington DC, Berlin or Paris, understand enough of our space and would like to help us grow our services, shoot us an email.<p>---<p>Drop me a line at job@wiredcraft.com, or go to <a href=\"http://wiredcraft.com/careers.html\" rel=\"nofollow\">http:&#x2F;&#x2F;wiredcraft.com&#x2F;careers.html</a>","time":1404278366,"type":"comment"}