{"by":"urlwolf","id":7977263,"parent":7970366,"text":"Data Science Retreat - <a href=\"http://datascienceretreat.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;datascienceretreat.com&#x2F;</a> -Community manager - Berlin, Germany<p>Outgoing, eloquent and friendly Community Manager.\nThis is our pitch to prospective students: \n&quot;Data Science Retreat (DSR) is the only data science course in the world with chief-data-scientist-level mentors. DSR helps coders or people with significant quantitative training (e.g. science, engineering, or math graduates) ramp-up rapidly for a data science career - arguably the fastest-growing, highest-demand profession.<p>DSR is a 3-month, in-person, rigorous, and full-time&#x2F;intensive course in the startup-capital of Europe: Berlin. You’ll learn software engineering, data science, business analysis and communication faster and more deeply with mentors doing code reviews and pair-programming - all on real-world data and problems. You will develop a portfolio project, demonstrating you can own a business problem, solve it, and communicate why your results are definitive.<p>You bring your training, tuition, and drive to master our curriculum alongside our world-class mentors and partners. Towards the end we provide a networking event with top-tier technology companies, where you will show off your new skills and portfolio project, likely leaving with a career-changing job.&quot;<p>We&#x27;re looking for someone to take charge of operations, accounting, and event coordination at Data Science Retreat. This job will entail everything from managing our office space to handling inbound email to planning events to working with our accountant.<p>You will get to meet lots of interesting people and companies, and be at the center of the data science action in EU.<p>Find out more about DSR and apply at <a href=\"http://datascienceretreat.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;datascienceretreat.com&#x2F;</a><p>We are profitable from day one and growing.<p>Who we&#x27;re looking for:\n_____________________________________\nWe&#x27;re looking for someone who writes well, exercises good judgement, is extremely effective, and is energized by being around other people.\nHours:\nThe job will initially be 20 hours per week on a freelance basis. Assuming you can meet your targets equally well, then you can work from home most days, meaning you&#x27;ll save that unpaid daily waste that exists in other jobs: commuting.<p>What we offer:\n_____________________________________\n•\tMeaningful work, with a huge effect on people&#x27;s lives. You will help people make a career change into arguably the fastest growing profession today.\n•\tMarket rate pay\n•\tA friendly and intellectual atmosphere, and a tight-knit and supportive team.\n•\tA warm and welcoming office (near lots of good food and transit).\n•\tYou can sit on our classes when you are not busy; that is, you can start your path to become a data scientist yourself if you are interested\n•\tLots of interaction with famous data scientists who come to teach or give talks.\n•\tPotential for growth. If you get things done, you will be a permanent hire. If you understand the business side of DSR, and help achieving objectives, you will be a crucial part of it\nWhat makes you a strong candidate in our eyes?\nWe don’t expect any single candidate to have all of these but please mention relevant experience when applying.\n•\tGood spoken German (native or close).\n•\tYou live in Berlin\n•\tAttention to detail. You will deal with bills, receipts, etc. Familiarity with doing taxes a plus\n•\tSome understanding of Facebook and Twitter (Likes, RTs, @, #, DMs, …).\n•\tConfident writing skills are essential. You will communicate with companies\n•\tAn interesting personality. Let&#x27;s be realistic: a large component of sales is charm.\n•\tExperience selling over email.\n•\tComfortable and confident talking with people you haven&#x27;t met “In Real Life” (one secret: just babble about something random and interesting to break the e-ice).\n•\tNative or native-level English spelling and grammar.<p>What would be a plus:\n_____________________________________\n•\tTech-savvy and deep passion for data\n•\tPrior experience in sales\n•\tPrior experience assisting an executive<p>What your day-to-day will look like:\n_____________________________________\n•\tOrganizing accommodation for visitors\n•\tHelping students in their day-to-day activities\n•\tContacting companies that are hiring data scientists, informing them of our program\n•\tFollowing up with companies that responded, arranging a call  \n•\tKeeping calendars and checklists\n•\tDeveloping process out of chaos\n•\tHelping us automate as much as possible","time":1404312475,"type":"comment"}