{"by":"JonLim","id":7977523,"parent":7970366,"text":"Unhaggle - <a href=\"http://www.unhaggle.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.unhaggle.com</a> - Toronto, Canada<p>We&#x27;re looking for: Python&#x2F;Django Developer (Remote)<p>=====<p><i>Who We Are</i><p>Unhaggle is Canada&#x27;s largest live online marketplace for new cars.<p>Our tools and data are trusted and used by car buying services for Yahoo Autos, MSN Autos, AOL Autos, and the Globe and Mail. With over 700 Partner Dealers nationwide and average customer savings of $3,618, Unhaggle provides customers with a positively unforgettable experience by removing the frustrating inefficiencies of the traditional car buying process.<p>Since 2011, Unhaggle has become the number 1 web portal in Canada for New Car Buying, providing over $87,000,000 in savings to over 250,000 satisfied customers and making the new car buying process easier, faster and more transparent for car buyers and dealers alike.<p>=====<p><i>What We&#x27;re Looking For</i><p>Unhaggle is looking for a Python developer with experience in web application development.\nThis is a full-time contract position. We are looking for developers who will be working from home and ideally to work with us on a long-term basis. We accept applications from candidates anywhere in the world.<p>Our management team is based in Toronto, Canada. Selected candidates will be asked to work as much as possible in Toronto Time &#x2F; EST Time (GMT -4).<p>=====<p>We use GitHub to manage tasks and code reviews. Basecamp is used sometimes for general project management.<p>You will be primarily involved in three different projects:<p>- Our web portal unhaggle.com<p>- REST APIs, for integration with different partners<p>- An internal and innovative web application we built for industry clients<p>=====<p>Additional information:<p>- All projects are written in Python and Django. The scope will usually include front-end (CSS&#x2F;Javascript and AJAX&#x2F;XHTML) and back-end (Django, Python, PostgreSQL and general server software).<p>- We take quality seriously and you should expect to be involved in well written code bases following standards such as PEP-8 and good software engineering practices.<p>=====<p>Qualifications:<p>- Strong hands on experience with Python, experience with Django is important, but we might still be willing to consider candidates with strong Python skills and none or little knowledge with Django.<p>- Strong web development experience: we expect that you know XHTML, CSS and Javascript well.<p>- Hands on experience with jQuery is a big plus<p>- Track record of delivering completed projects, preferably web-based<p>- Good SQL knowledge and databases, PostgreSQL is a plus<p>- You should be very familiar with Linux<p>- Experience using version control software, Git is a plus<p>- Understanding of code best practices and standards. We also expect that you follow PEP-8 style guide and use tools like Pyflakes and Pylint very often<p>- Easy-going personality. You will actively participate in design discussions and code review<p>=====<p>Skills:<p>Python, Javascript, CSS, jQuery, SQL, AJAX, Django, RESTful Services, Front-End Development, Git, PostgreSQL, Linux, XHTML, Backend Development, Version Control<p>=====<p><i>How To Apply</i><p>Shoot us a note at hackernews.careers@unhaggle.com and let us know that you&#x27;re coming from HN and that you&#x27;re interested in this role, or you can send me a note personally at jon+HN@unhaggle.com and I can forward you along to the right people.<p>Please send your application with the following additional information:<p>- Your expected hourly rate<p>- Any important details about your availability that we should be aware of. Note that this is a full-time position (8 hours per day &#x2F; 40 hours per week).<p>- Any small sample of Python code that you have written and are really proud of [OR] any links to accounts such as github, google code, bitbucket or stackoverflow would be great too.<p>- A list of some projects that you have previously been involved in and that are currently online\nSelected candidates will be contacted for a technical phone interview + coding interview.<p>We thank all candidates for taking the time to apply, but only those who have been selected for an interview will be contacted.<p>No relocation available, we are a distributed team.","time":1404315020,"type":"comment"}