{"by":"bbncyber","id":7979113,"parent":7970366,"text":"Raytheon BBN Technologies Cyber Security Department is hiring (Cambridge, MA and Columbia, MD). I currently work here in a technical position.<p>What You Could Do<p>&quot;As part of the Cyber Security team at BBN, you might write Android apps and inject them with malware to test malware detection tools, devise creative ways to graphically represent data about the lineage of malware, reverse engineer an embedded device looking for vulnerabilities that a hacker could exploit, or create and implement algorithms and code to prevent data exfiltration from military networks.&quot;<p>I know that is copied from the req. I don&#x27;t want to post details that might get me in trouble. That being said, it is an accurate description of what you could do.<p>What We Are Looking For<p>We are looking for developers, reverse engineers, cyber researchers, etc., BS to PhD, 0-6 years experience. US citizenship required, willingness to obtain clearance preferred but not required. Offices in Columbia, MD and Cambridge, MA.<p>Job Requirements:\n* Great imagination\n* Strong written and oral communication skills\n* Solid programming skills, particularly in C&#x2F;C++ or Java but also x86 (or other) assembly language, Python or Perl\n* Some experience in designing and developing software systems, as well as performing system test and integration<p>Experience or interest in any of the following is desirable:\n* Networking code development\n* Operating system internals and&#x2F;or kernel development\n* Network protocol analysis techniques\n* Virtualization and sandboxing\n* Reverse engineering\n* System analysis and engineering\n* Static and dynamic binary analysis\n* Low-level knowledge of consumer electronics (e.g., mobile phones, ARM processors, etc.)\n* Embedded systems\n* Other security topics like fuzzing, memory analysis, malware techniques, cryptography, etc.<p>Shoot me an email at ebarnes@bbn.com if interested. I&#x27;m happy to answer questions.","time":1404329426,"type":"comment"}