{"by":"cornellwright","id":7980779,"parent":7970366,"text":"TerrAvion - <a href=\"http://www.terravion.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.terravion.com</a> - Dublin, CA<p>Apply at <a href=\"http://www.terravion.com/careers.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.terravion.com&#x2F;careers.html</a> or email hr@terravion.com.<p><i></i>Hardware &#x2F; Systems Engineer<i></i>\nWe have an opening for a hardware &#x2F; systems engineer and are looking for talented, hard working, innovative candidates interested in working in an early stage company.  We are Y Combinator alumni, venture backed, and growing fast.  Our core product, OverView, has seen over 200x growth in the last year.   If you live to deploy scalable hardware to the field, this job is for you.   You will have primary responsibility for building and maintaining our imagery collection system, which mounts on to the belly of a single engine airplane.  The first version is already flying and generating revenue, but you are going to design the fleet.<p><i></i>Responsibilities<i></i>\nArchitect, design, and build hardware and software for imagery collection which can be reliably deployed in the field\nAssist in data processing activities - this requires training and working with our ops team on new features you will deploy\nCommunicate with stakeholders (operations and customers) to determine requirements for imagery collection system and imagery calibration\nInterview and evaluate potential engineering job candidates\nAssist in other activities as necessary in an early stage company<p><i></i>Requirements<i></i>\nBachelors degree or higher in Electrical Engineering, Optics, Remote Sensing, Software Engineering or Computer Science or equivalent experience\nDemonstrable experience designing new hardware systems and writing low level software\nExperience designing and deploying complex systems in the field\nExperience working in C, Java, and Python on Linux\nStrong problem solving abilities\nVery strong hardware and software troubleshooting skills\nStrong written and oral communication skills\nAbility to work well alone or in teams, with limited supervision required\nAbility to commute as necessary to Dublin, CA (our office is a 10 minute walk from the West Dublin BART)<p><i></i>Bonus Attributes<i></i> (These are skills&#x2F;experience we would really like to see but candidates without them should still definitely apply.)\nCAD&#x2F;mechanical engineering experience\nKnowledge of radiometry, image calibration, cameras, and optics\nInterest in general aviation\nExperience with UAVs or drones \nGIS experience\nFarming experience, interest, or connection","time":1404348055,"type":"comment"}