{"by":"cerego_japan","id":7981303,"parent":7970366,"text":"Cerego - <a href=\"http://www.cerego.co.jp/en/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.cerego.co.jp&#x2F;en&#x2F;</a> - Tokyo, Japan - Full Time - Front-End Software Engineer<p>Cerego builds learning technology that helps people learn more efficiently. We currently have teams located in San Francisco and Tokyo. This position is for the Tokyo team.<p>The Tokyo team develops iKnow! (<a href=\"http://iknow.jp\" rel=\"nofollow\">http:&#x2F;&#x2F;iknow.jp</a>), a cross-platform service specializing in language learning. The current focus of iKnow! is the huge ELL (English language learning) space in Japan. iKnow! is a proven and successful product, with tens of thousands of paying users and almost 10 million hours logged of study time.<p>With powerful core learning technologies in place, we are now looking to greatly expand the platform. We go from ideas to prototypes to working features quickly, and we’re looking for someone who can help us every step of the way. We think that fast, focused releases are the best way to craft the best learning experiences for our users.<p>In addition to our core technology stack, we love learning new tools, technologies, and techniques. If you’ve got a favorite language, framework, library, or practice, pitch it to the team, and we’ll explore integrating it into our workflow.<p>Cerego is interested in engineers who have both engineering proficiency and creativity. We&#x27;re looking for a front-end engineer who:<p>Writes well-crafted HTML, JavaScript, and CSS\nHas experience with a server-side web framework, REST based APIs, and version control\nFeels a sense of ownership and pride over anything he or she builds\nWorks well with a small, close-knit team\nWants to live in Japan and learn Japanese\nIs excited about solving language-learning problems<p>As a frontend engineer, you&#x27;ll be primarily working with:<p>Ruby on Rails 3+\nHTML&#x2F;ERB\nJavaScript&#x2F;CoffeeScript&#x2F;jQuery\nCSS&#x2F;SASS<p>Your primary responsibilities will be:<p>Designing, implementing, and maintaining front-end features\nExpanding the JavaScript-based learning applications to cover new kinds of learning\nWorking with the product team to craft the optimal user experience<p>And you&#x27;ll be working in:<p>A sunlit office in the heart of Shibuya with incredible views of Tokyo and Mt. Fuji on a clear day\nAn extremely flexible and friendly working environment<p>We are a small, dedicated team of passionate individuals who believe in the value of the service we are creating. English proficiency opens many doors in Asia both personally and professionally, and we know our product is that rare product that can actually make a difference in people’s lives.<p>If you think you&#x27;re a good fit for our team, please send an email to jobs@cerego.com with a brief introduction, resume, and a few code samples you&#x27;d like to talk about during an interview. Tell us what you&#x27;re most proud of, what you&#x27;ve accomplished, and why you&#x27;re interested in Cerego.","time":1404358427,"type":"comment"}