{"by":"tcbitly","id":7983760,"parent":7970366,"text":"<i>Data Scientist at 42matters in Zurich, Switzerland, Job type: full­time, Starting date: immediately</i><p>42matters is a rapidly growing start­up, leading the development of next generation mobile user modeling technology. Our solutions are used by big brand companies within the mobile advertising market to serve mobile users intelligently targeted content. We are an international team, with an innovative and fast­paced company culture.<p>We&#x27;re growing our data science and analytics team and are looking for experienced data scientists to be a part of projects that cover the full spectrum of machine learning and statistical programming. We are specifically interested in people with experience in classification and clustering algorithms, natural language processing, predictive analytics and recommender systems.<p><i>Highlights</i><p>● Globally focused company with international team<p>● Directly see the impact of your contribution<p>● Collaborative work environment<p>● Development of cutting­edge technologies<p>● Enjoy the high quality of living Zurich has to offer<p><i>Responsibilities&#x2F;Opportunities</i><p>● Research, design, and implement user modeling systems for very large­scale data sets<p>● Analyse and understand our data and present insights in a clear way<p>● Improve the quality of data and the efficiency of our algorithms<p>● Implement highly available, scalable and performant systems<p><i>Requirements</i><p>● M.Sc. or Ph.D. in Statistics, Math, Physics, Computer Science, or other quantitative discipline<p>● Proficiency in applying discrete math, statistics, probability theory, and machine learning to\nanswer complex questions<p>● Experience with python or other programming languages<p>● Experience in relational and non relational databases<p>● Proactive, organized, practical and solution oriented<p>● Team player but also a self starter<p>● Experience with MongoDB or Couchbase is a plus<p>● Experience with statistical programming environments like R or Matlab is a plus<p>● Experience with Hadoop, Pig or Hive is a plus<p>● Experience with Amazon AWS (or similar cloud services) is a plus<p><i>Our offer</i><p>● Full­time position<p>● International travel for industry and academic events<p>● Discounted access to gym and other sports&#x2F;activities<p>● Free discount card (halbtax) for local transportation<p>● Competitive salary<p><i>Interested in the Data Scientist position?</i>\nTo apply, please send us a short email at jobs@42matters.com, including:<p>● Your CV<p>● Your motivation<p>● First possible starting date<p>● Link to online portfolio, Github, LinkedIn or public available projects that shows your work\nexperience, if any<p><a href=\"http://42matters.com\" rel=\"nofollow\">http:&#x2F;&#x2F;42matters.com</a> Sumatrastrasse 3, 8006 Zürich Switzerland","time":1404402558,"type":"comment"}