{"by":"BrianPetro","id":7988108,"parent":7970366,"text":"NodePrime: Help our rapidly growing early stage team in SF build the future of IT Management<p>&quot;NodePrime is building the next generation Management and Analytics Platform for Datacenter Infrastructure. &quot;<p>Web UI Developer in San Diego, CA<p>&quot;Fast growing startup, partnered with Spotify, is building the next generation of musical apps! Bring your passion for design and music to F#.&quot;<p>Recent Grads! Join LaunchHub to help Solve Industry Shaking Problems w&#x2F; BigData. Palo Alto, CA<p>&quot;Competitive compensation, Elite experience required. Work w&#x2F; High Traffic clients, Machine Learning, and next generation user interfaces.&quot;<p>Angular Developer to help build a cutting-edge, next generation UI in Downtown Seattle, WA<p>&quot;Build JavaScript heavy apps in an agile environment. Join a self-motivated &amp; empowered team at one of Washigton&#x27;s &quot;Best Companies to Work for.&quot;&quot;<p>Lead Developer to update Backbone app w&#x2F; AngularJS in New York City<p>&quot;Wayla is a seed funded start-up that documents cultural events and provides advanced crowd data. &quot;<p>Front End Engineer - Javascript&#x2F;Angular - San Francisco Bay Area<p>&quot;F5 Networks is looking for a talented web applications developers with Expert JavaScript skills to LEAD the design and implementation of comprehensive new application delivery and security features for our platform.&quot;<p>Frontend Magician &#x2F;&#x2F; AngularJS &amp; RequireJS pro &#x2F;&#x2F; Amsterdam, The Netherlands<p>&quot;Backbase is uniting masters of the AngularJS Framework. We are building software used by millions of people. Join us asynchronously!&quot;<p>Awesome Frontend Developer to Embed AngularJS at PetroCloud - Irving, TX<p>&quot;Building real-time dashboards for remote embedded devices. Software stack includes AngularJS, NodeJS, Mongodb, websockets. &quot;<p>Front End Engineer at Thumbtack | San Francisco<p>&quot;Front End Developers, @thumbtack needs you to help change how we Hire Local Services. #AngularJS #JavaScript #Frontend Jobs&quot;<p>Create Beautiful UIs w&#x2F; AngularJS for Support.com in San Francisco, CA<p>&quot;Focus on usability, design, and performance. Earn a competitive salary while getting to work from home 1-2 days per week! &quot;<p>Impact Advertising w&#x2F; AngularJS. Experience High-Growth w&#x2F; 100M+ Users Weekly! Work in Boston or NYC<p>&quot;Both Junior &amp; Senior Available! Focus on JavaScript. TDD Angular components. &quot;Never lost a developer over price&quot; - CTO&quot;<p>Apply  here:<p>&gt; <a href=\"https://www.AngularJobs.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.AngularJobs.com</a>","time":1404468886,"type":"comment"}