{"by":"benradler","id":7989821,"parent":7970366,"text":"Loggly - <a href=\"http://loggly.com\" rel=\"nofollow\">http:&#x2F;&#x2F;loggly.com</a> - Fulltime in San Francisco, CA (right by Montgomery St. Bart)<p>We&#x27;re looking for an Infrastructure Engineer and a Lead Developer.  The technologies that power our product include Python, Apache, Tomcat, Kafka, Elasticsearch, Amazon AWS  REST, API, JSON, HTTP, RDBMS.<p>To apply, please email karen@loggly.com with the subject &quot;Hacker News Loggly Job Application&quot;. Thanks!<p>Loggly is the world’s most popular cloud-based log management solution, used by more than 3,500 happy customers to effortlessly spot problems in real-time, easily pinpoint root causes and resolve operational issues faster to ensure application success. Founded in 2009 and based in San Francisco, the company is backed by Trinity Ventures, True Ventures, Matrix Partners, Cisco, Data Collective Venture Capital and others.<p>Loggly helps cloud-centric organizations—organizations that build and manage cloud-facing applications—to solve operational problems faster, easier and without the cost or complexity associated with traditional software-based tools.  Our service is designed around the needs of modern DevOps teams and purposely built to dramatically simplify the log management experience for start-ups through Fortune 500 organizations.<p>Engineers at Loggly are responsible for designing and delivering the cloud-based log management product.  As a key member of this team you will collaborate with engineers, product management and the operations team to develop innovative features on top of our big data stack. You will be  responsible for technically leading the infrastructure team. You will have full life cycle responsibilities for key product functionality spanning architecture, design, development, implementation and mentoring the infrastructure team. You will provide and ensure excellence in product design and implementation with regard to efficiency. You will be responsible for planning, organizing and performing technical work and ensuring the integrity of significant and diverse projects.<p>You will be expected to create robust, scalable, multi-threaded and distributed systems that operate 7x24x365. This is an exciting opportunity to work in a highly innovative environment with new technologies as we continue to evolve our products and extend our leading market position. . Our culture is fast paced, fun, performance oriented, open and collegial.","time":1404499629,"type":"comment"}