{"by":"nonagonal","id":7991082,"parent":7970366,"text":"Edge, Inc. - Boston, MA - REMOTE possible\nedge.recruiting.boston@gmail.com<p>About Us:\nWe’re a small company founded by MIT grads that is taking a data-driven approach to online retail. We buy and sell goods in online marketplaces at a large scale based on mathematical models and our solutions to a set of optimization problems. We employ more than 50 workers around the world, but the core team has only a few engineers who have automated most of our process. Our infrastructure is built completely in Python and runs on AWS.<p>Our core team is very small, so our culture is laid back and fun, but we’re all driven and work very hard. We’d like to find a candidate who can thrive in such an environment.<p>About the Job:\nWe’re looking for a full-stack Python developer to create the next generation of our infrastructure. It’s running on a single AWS server, but we’d like to move to a more scalable distributed model. The infrastructure mostly consists of a backend framework that generates very large datasets, organizes &amp; processes the data, and makes decisions in realtime. There is also a front end written with Flask that will need to be redesigned eventually.<p>The new infrastructure will need to rely on test automation throughout the code, so we’re looking for someone who really understands best practices when it comes to testing. We can handle controlled downtime, but data integrity and the decisions our algorithms make are critical to our business, so we need to build up several layers of testing to ensure correctness.<p>Responsibilities will include:\n- Rewriting our Python-based backend and frontend so it’s more maintainable and scalable\n- Deploying the new infrastructure on AWS\n- Helping us migrate from the existing codebase to the new one\n- Modifying the new codebase as we move forward and develop our mathematical models and algorithms<p>Required Qualifications:\n- Strong Python development experience\n- A solid grasp of test automation, and more importantly some real enthusiasm for it\n- Experience designing and deploying on cloud platforms such as Amazon Web Services\n- Familiarity with both SQL and NoSQL databases, especially relating to their performance\n- BS Computer Science or equivalent<p>Preferred Qualifications:\n- Experience working both single-handedly and in small groups (2-4 developers)\n- Experience with popular Python frameworks and the ability to learn new Python frameworks quickly<p>Email edge.recruiting.boston@gmail.com to learn more.","time":1404536263,"type":"comment"}