{"by":"afjohansson","id":7994273,"parent":7970366,"text":"Crowd Vision Ltd - London, UK<p>Analytics Developer<p>-- Job Description --<p>Crowd Vision Ltd is a small, fast-growing, software company based in North Greenwich, London.  Our video analytics software enables clients to measure and analyse the flows or people and crowding in busy locations, such as airports and events. We are expanding our team and are looking for someone with an intuitive understanding of data and analytics, and the skills to develop analytical algorithmic elements for integration into our core product.<p>You must have an intuitive feel for data and analytics and experience of writing analytical algorithms. You will be an enthusiastic and delivery-focused person, and relish the opportunity to contribute very directly to building a successful business by working in a small, high quality and diverse team.<p>-- Skills &amp; Requirements --<p>Essential:<p>- Programming: C++ with a focus on algorithms, data structures and data processing\n- Scripting: Proficiency in at least one scripting language to quickly automate simple tasks\n- Analytics: Data analysis; plotting; statistics; algorithms\n- Databases and data structures: SQL (preferably MySQL); XML\n- Environments: Linux (Ubuntu) - both native and virtualised (VMware)<p>Desirable:<p>- Image&#x2F;video processing\n- Big Data analytics: Experience working with real-time noisy sensor data (e.g. from video analytics)\n- Web frameworks development<p>-- About Crowd Vision Ltd --<p>Crowd Vision Ltd is a pioneer of live crowd analytics. Our mission is to provide live, actionable and predictive insights into pedestrian and crowd behaviour. CrowdVision video analytics software is currently used to measure passenger flows and queuing in airports to optimise airport operations and improve customer experience. It is also used by event operators to assure public safety and optimise event delivery. The company is also an active participant in the maturing Smart Cities scene.<p>To apply: <a href=\"http://careers.stackoverflow.com/jobs/61427/analytics-developer-crowd-vision-ltd\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;61427&#x2F;analytics-develo...</a>","time":1404646356,"type":"comment"}