{"by":"akarrer","id":8011738,"parent":7970366,"text":"Aggregage is the building the biggest B2B marketing and media company.  We create industry-specific B2B market communities that surpass those of traditional publishers or online-only content sites. We have a proprietary technology platform that leverages the explosive growth in sources of online B2B content and uses social media signals to automatically curate that content.  The reader sees the most interesting and relevant content in their vertical.  That’s why our site in eLearning has become the highest trafficked site in that industry.  And we’ll be launching over 1,000 of these business verticals.<p>Come join an experienced and successful group of founders -- Clicker, eHarmony, etc. – and their team at this groundbreaking time.  We are well-funded for the next several years.  Our billion dollar potential is based on a real business model, not just hope and dreams.  Our small team is going to do big things.<p>We are looking for a full-stack Java web developer.  Currently we’re a small team looking for a solid programmer who can grow with the company.  Someone who is a team player.  Even if you don’t have experience with everything listed in this job description, we offer excellent learning opportunities for those who are eager to expand their skill sets.<p>Job Responsibilities<p>Working in a small development team, you will take a central role in the technical design, and development of the front-end and back-end of the application that’s written in Java, MySQL, Lucene, JavaScript, HTML&#x2F;CSS.  This application deals with fairly large scale of content and users, so understanding of robust, high-performance sites is a plus.<p>Job Qualifications<p>In addition to programming capability, candidates must have experience working on collaborative development teams and good communication skills.<p>Ideal candidates will have experience building all facets of software systems including the data model, business logic, and front-end.<p>Knowledge of the following is required:\n•\tJava \n•\tHTML&#x2F;JavaScript&#x2F;CSS\n•\tJava Frameworks such as Spring, Dropwizard, or Wicket<p>Knowledge of the following is a plus:\n•\tLucene or SOLR\n•\tjQuery\n•\tORM (Hibernate, etc.)\n•\tMySQL and SQL query tuning\n•\tAnt&#x2F;Maven&#x2F;Git\n•\tApache\n•\tLinux<p>That said, we&#x27;re mostly looking for great developers who are great to work with. If you don&#x27;t have experience with everything listed above but are a solid developer eager to learn new things, you might be a great fit here.<p>If you are interested, send your resume to: tony.karrer@aggregage.com","time":1404934020,"type":"comment"}