{"by":"amandawild","id":8012203,"parent":7970366,"text":"iOS Lead in NYC for Tech Legal Startup<p>We are looking for an experienced iOS developer to join our growing team.  Do you enjoy creating beautiful iOS apps?  Do you have an Apple logo tattooed on your body (completely optional, but that would be very impressive)?<p>Qualifications and Experience:<p>At least 2 years of Objective C hands-on programming\nIn-depth XCode&#x2F;iOS experience\nFan of agile process and test driven development\nCompassion for the end user and an eye for design\nServer Side MVC OO programming experience (Django, Rails, Struts, asp.net, Cake)\nBeliever of Modular Design principles\nHungry to make an impact and take ownership\n5+ years of experience\nShake is a venture-backed legal tech startup based in New York.  Our mission is to make the law accessible, understandable and affordable for consumers and small businesses.  We’re starting with simple agreements and building for mobile first.  The company was founded in 2012 by an experienced team of entrepreneurs and investors with executive leadership experience at companies such as Google, Spotify, AOL, Buzzfeed, and RRE Ventures.<p>Shake Principles and Beliefs:<p>We are not afraid to be bold, push the envelope, and challenge the status quo\nWe are driven by what legal transactions can and will be, not what they have been historically\nWe value innovative design and superior mobile user experiences\nWe are a technology company solving a legal problem, not a legal company trying to understand technology\nWe believe that the legal market is highly underserved by technology and begging for disruption\nWe believe that significant change in the legal industry will be driven by consumers and small businesses, not by lawyers and law firms\nWe believe that the value in mobile technology is in building utility not serving banner ads\nIf you share our beliefs and are passionate about transforming an outdated $250B industry, we look forward to hearing from you.  Feel free to be creative in your application; we like to be surprised!<p>For more information, visit www.ShakeLaw.com.","time":1404939522,"type":"comment"}