{"by":"jwingy","id":8012176,"parent":7970366,"text":"New York, NY - Brooklyn Museum - Web Developer (Full-time):<p>The Technology department at the Brooklyn Museum seeks a web developer to join our team to help manage the museum’s web presence. You’d be working with a small team on a variety of web and mobile projects related to art, community engagement, visitor experience and open access.<p>As a small team, we work across disciplines and support each other. Accordingly, qualified candidates will possess a broad range of skills navigating the full stack of web and web-for-mobile development, SQL to CSS. We have adopted a number of Agile practices in our development process in order to adapt to the fast-evolving nature of our projects and we’re looking for someone who thrives using this methodology.<p>Here’s what we’re after:<p>Strong command of object-oriented PHP.\nStrong command of HTML and CSS, as well as a commitment to web standards and making accessible, usable websites which degrade gracefully on older browsers.\nExperience with JavaScript and relevant frameworks, e.g. MooTools, jQuery.\nExperience with relational databases, e.g. MySQL, MSSQL.\nExperience working on mobile platforms, e.g. iOS, Android and web-for-mobile frameworks such as Cordova or Sencha.\nSome experience with Linux web server administration and deployment, e.g. Apache, Bash scripting, etc.\nFamiliarity with version control, e.g. git, svn.\nFamiliarity with Amazon Web Services cloud architecture patterns and practices.\nFamiliarity with Agile development practices.\nAdditionally, we’re keeping an eye out for exceptional candidates who may have:<p>Experience with UX design and information architecture.\nExperience building and maintaining content management tools.\nFamiliarity with at other dynamic programming languages, e.g. Ruby, Objective-C.\nExperience with e-commerce and PCI compliance.\nThe successful candidate will have a demonstrated ability to work collaboratively with other project stakeholders, to manage multiple responsibilities independently, while adhering to established departmental technology standards both in back-end and front-end architecture. With mobile development crossing further into web-based territory with frameworks like Cordova, we’re also looking for someone who can push the boundaries of what is possible with web technologies for mobile devices.<p>This is a full-time position located at the Museum’s offices in Brooklyn. Located on the top floor, our office lacks fancy furniture or ping-pong tables, but we’re housed inside a 19th century neoclassical monument sharing space with priceless art, so we’re ok with that. This is a fast-paced, but fun environment which we balance by keeping a commitment to a 35 hour week. This position does not include telecommuting or relocation; qualified candidates must be able to commute daily to the Brooklyn Museum. No recruiters please.<p>Brooklyn Museum is an Equal Opportunity Employer. Applicants for positions are considered without regard to race, creed, color, country of origin, sex, age, citizenship, disability or sexual orientation. Candidates of color are strongly encouraged to apply. The Immigration and Control Act (1986) requires that all hires be in conformity with the law.<p>Please send resume, cover letter and salary requirements to job.webdev@brooklynmuseum.org. Include your cover letter in the body of the email and attach your resume.","time":1404939165,"type":"comment"}