{"by":"essrand","id":2397071,"parent":2396027,"text":"I am a data mining engineer at polyvore and we are looking for frontend/backend/generalist/data mining engineers.<p>Below is our official pitch :), I am regular lurker here at HN, you can email me at bhaskar@polyvore.com if you want to know more, or just apply to the jobs link below.<p>Cheers!<p>Polyvore is looking for stellar software engineers to join our team.  If you're at all interested, I'd love to grab coffee or have you stop by our office to meet the team.<p>A little background on the company -- Polyvore is a social shopping platform. Our user community curates and merchandises products from all over the web in the form of digital collages that we call \"sets\". We have about 6.5M unique visitors per month, which makes us one of the largest fashion sites on the web. Our eventual goal is to expand to other product categories.<p>We're a team of 18 people, including a lot of folks from Google and Yahoo.  Our founders are all engineers or have computer science backgrounds, so we're very technical and eng/product-driven.  You can see the profiles of our team members here.  It's also a really fun working environment.  Our Happy Hours activities range from board games to taco trucks to book club (with beer and other equally attractive drinks!).<p>Polyvore has a lot of interesting product challenges and neat technology under the hood.  For example:<p>The Editor -- Our virtual styling tool features pretty nifty JavaScript.<p>Style Analytics -- Our users interact with tons of products on a daily basis (50K clips/day, 35K sets/day), which makes for really interesting data mining opportunities.<p>Monetization -- Think of Polyvore sets as user-generated ads.  There are lots of resonant monetization opportunities.<p>We've also been getting great buzz lately:<p>Polyvore Goes Sky High with Times Square Billboard (about our billboard in Times Square, which we got for free)<p>Fast Company - An Army of Anna Wintours (about our recent partnerships from Fashion Week)<p>TheNextWeb - The Rise of Polyvore: Trendsetting Goes Social (testimonials from our advertisers)<p>The New Yorker - Fashion Democracy (an older article that focuses on our awesome user community)","time":1301678097,"type":"comment"}