{"by":"shaynesweeney","id":2416396,"kids":[2416403],"parent":2396027,"text":"Instagram is.<p>We are currently hiring extraordinary engineers and designers who want to build and scale one of the fastest growing companies in the social web. We're in the business of building a new way for people to communicate and share their lives via media on the go. We're looking to grow our team into a world-class group of engineers that want to focus on big, meaningful technical challenges.<p>In a handful of months, Instagram has amassed well over 2.5 million users on the iPhone platform alone. As an Instagram Engineer, you have the unique opportunity to face many different kinds of challenges and touch many different kinds of technologies that allow the service to continue to grow at an increasing rate.<p>We're looking for people who want to face interesting infrastructure challenges. You should be constantly excited by questions like: How do you tackle increasingly vast amounts of data? You should get excited about exploring and implementing sharding and partitioning schemes. You should get a thrill out of processing gigabytes of data to inform product decisions. You should be able to design and implement systems that scale seamlessly with the vast numbers of users that decide to share their lives through images every day.<p>We also face product challenges like how to prioritize, design, and build a compelling product while maintaining simplicity and usability. Our product challenges span different platforms (mobile &#38; web) and you should be comfortable moving between different parts of the system whether that be learning objective-c to contribute to our iPhone client, or writing solid JavaScript to make a web experience immersive and interactive.<p>Instagram is also an incredibly important part of everyone's life that works here. We pull many late nights and weekends, and you should be excited to jump in and make Instagram the primary focus of your life. We put in extra effort because we love Instagram and love to see it flourish and you should want to as well.<p>The bottom line is: we want smart, extremely motivated people who are willing and able to contribute quickly to all parts of Instagram, and who are excited by the challenges we face.<p>Here's a list of characteristics that we're looking for in an engineering candidate:<p>- A college degree in Computer Science or equivalent. \n- A scrappy, entrepreneurial attitude that gets high-quality projects done quickly. \n- Deep understanding, familiarity and skill with programming for the web. \n- Experience in Objective-C and Python is a plus, but not required. \n- Ability to touch many different parts of our system such as: deploying a new set of boxes on EC2, debugging network inefficiencies, implementing optimized graphics algorithms in C or OpenGL, writing optimized SQL queries, writing full python classes, or writing NodeJS applications. Point is: you should be able to pick up new things very quickly. \n- A demonstrated history of intellectual and entrepreneurial exploration. \n- Be able to write elegant, readable, and well-documented code.<p>We're a small team, and we're looking for people to make a big impact. This means you should want to take on lots of responsibility and be able to manage projects independently. You should be able to think critically about a problem, evaluate the solution set, and be able to pick the right course of development given the set of constraints. Of course we're looking for great engineering talent, but it's extremely important to us that everyone our team has a solid product design sense.<p>We truly believe in Instagram's potential to change the world for the better, and we're looking for a select group of individuals up for challenge to see that vision through.<p>Send your resume to jobs@instagram.com and let us know why you think you're a great fit. We're looking forward to hearing from you!","time":1302115835,"type":"comment"}