{"by":"vt57","id":10313164,"parent":10311580,"text":"Are you someone with a passion for programming and a love for learning? We want you to join us.<p>Title: Ruby on Rails Developer and Django Developer\nReports to: Chief Technology Officer (CTO)\nDepartment: IT\nLocation: Telecommute &#x2F; Work from Home\nReply to jobs@cyanna.com (Please include GitHub username)<p>At Cyanna, we believe education should be accessible to everyone, and that if you’ve got knowledge to share, nothing should stand in your way. So we work with educational institutions to help them launch, run, and market their schools — and make sure they’re compliant with government regulations along the way.<p>One of the things we offer is customized software solutions that make it easy for institutions to track and teach students, and for regulatory agencies to track institutions. Right now, we’re looking for a full time Ruby on Rails Developer with PHP Experience to help build our next generation e-learning platform.<p>Join our team from wherever you are:\nEveryone here works remotely, although we meet and collaborate online all the time. We also meet up in person occasionally throughout the year. You’ll be able to find the perfect balance of working independently and being part of a supportive team that’s got your back.<p>Here’s who we’re looking for: \n- A life-long learner who’s always on top of new technologies, but still able to pick the right tools for the right job. Pragmatism is totally your thing. \n- A seasoned developer with a couple of years experience working with Ruby, Ruby on Rails or a similar platform.\n- A Github guru who believes Github pull request workflow is the only way to go. You love contributing to open source. \n- An expert on Agile methodologies like Scrum and Kanban. \n- An adventurer who’s unafraid of Ruby 2, Rails 3&#x2F;4, Bundler, ES6, HTML5, Git, Test::Unit, Rspec, PostgreSQL, TDD, clean code, and refactoring.\n- A trooper who writes tests and feels familiar with automated build tools like CircleCI or Travis.\n- A natural communicator who speaks and writes English as easily as you speak and write code.\n- An easy-going personality who’s also adept at working efficiently in a virtual, fast paced environment.<p>These are the skills we expect you to have:\nRuby, Rails, Python, Django, JavaScript, HTML, CSS (SASS), jQuery (Backbone.js or Ember.js a plus), SQL (PostgreSQL a plus), Git, API development, Browser compatibility issues, Deployment methodologies (e.g. Capistrano), Database&#x2F;query optimization<p>Sound like you? Send us your resume, and get ready to show us your existing projects, demo your code, and sell us on why you love to do what you do.","time":1443722579,"type":"comment"}