{"by":"kscottz","id":10313974,"kids":[10314047],"parent":10311580,"text":"<p><pre><code>    ___       ___       ___       ___       ___   \n   &#x2F;\\  \\     &#x2F;\\  \\     &#x2F;\\__\\     &#x2F;\\  \\     &#x2F;\\  \\  \n   \\:\\  \\   &#x2F;::\\  \\   &#x2F;::L_L_   &#x2F;::\\  \\   &#x2F;::\\  \\ \n   &#x2F;::\\__\\ &#x2F;::\\:\\__\\ &#x2F;:&#x2F;L:\\__\\ &#x2F;::\\:\\__\\ &#x2F;:&#x2F;\\:\\__\\\n  &#x2F;:&#x2F;\\&#x2F;__&#x2F; \\:\\:\\&#x2F;  &#x2F; \\&#x2F;_&#x2F;:&#x2F;  &#x2F; \\&#x2F;\\::&#x2F;  &#x2F; \\:\\&#x2F;:&#x2F;  &#x2F;\n  \\&#x2F;__&#x2F;     \\:\\&#x2F;  &#x2F;    &#x2F;:&#x2F;  &#x2F;     \\&#x2F;__&#x2F;   \\::&#x2F;  &#x2F; \n             \\&#x2F;__&#x2F;     \\&#x2F;__&#x2F;               \\&#x2F;__&#x2F;  \n</code></pre>\nTempo Automation | San Francisco, CA | On-site (remote on a case by case basis)<p>Tempo Automation is a venture-backed robotics start-up that is building the quick-turn electronics factory of the future. The goal of Tempo is simple and delightful; we want to make hardware development happen at the pace of software development. Our process starts with our website where we ingest customer designs, perform design for manufacturing reviews, price circuit boards and components, and automatically generate a quote. Once a customer is happy with their design our factory swings into action using a mixture of our own proprietary robots, traditional manufacturing equipment, and good old-fashioned hard work.  Using this model Tempo is already delivering prototype circuit boards in the Bay Area in as little as three days. We are seeking talented and hardworking engineers, technicians, and operations people to help us radically change electronics manufacturing. Current open positions include the following:<p>* Senior and mid-level &quot;back-end&quot; and &quot;full-stack&quot; software engineers. We are a Django&#x2F;Linux&#x2F;Python shop.<p>* Junior and senior roboticists in both software and mechatronics. We&#x27;re a ROS shop!<p>* Software Operations<p>* Factory Operations and Logistics.<p>* Generally Useful Graphic Designers<p>* Assembly Technicians<p>* Office Manager<p>A full list of positions can be found here: <a href=\"http:&#x2F;&#x2F;www.tempoautomation.com&#x2F;home&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tempoautomation.com&#x2F;home&#x2F;careers</a><p>For more information contact us at : careers [at] tempoautomation.com<p>Note: as a policy Tempo Automation does not work with recruiters, ever.","time":1443727602,"type":"comment"}