{"by":"caitlinspothero","id":10311877,"parent":10311580,"text":"SpotHero | Chicago, IL | <a href=\"http:&#x2F;&#x2F;spothero.com\" rel=\"nofollow\">http:&#x2F;&#x2F;spothero.com</a>\nSpotHero is changing parking, and our tools will redefine the transportation industry. With over a million cars parked, fast growth, and solid funding (<a href=\"https:&#x2F;&#x2F;angel.co&#x2F;spothero\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;spothero</a>), SpotHero offers countless ways to make an impact on the company and your career.<p>Engineering Roles:\n Data Engineer - <a href=\"http:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;87905\" rel=\"nofollow\">http:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;87905</a> \nWe have a ton of data sources, and a crap ton of data. Want to build our first real data warehouse? Love redshift, cassandra, luigi and airflow? We do too...<p>Senior Software Engineer in Test - <a href=\"http:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;91854\" rel=\"nofollow\">http:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;91854</a> \nQA is a part of every engineer&#x27;s process here at SpotHero. However, we need someone dedicated to bringing automated test best practices to the team, and someone that can figure out how to test the really hard things. We have a love&#x2F;hate relationship with Selenium. And if you don&#x27;t know why, then you&#x27;re probably not ready for this role. Come help us tame the beast...<p>Software Engineering Intern - <a href=\"http:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;88312\" rel=\"nofollow\">http:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;88312</a>\nInterns are as important as Lead Engineers at SpotHero. They are the future of our team, and the future of our industry. You&#x27;ll be paired with a Senior Engineer from day 1, and solving real problems that make it to production your first week. Buckle up and hold on tight, you&#x27;re about to learn a crap ton here!!<p>Lead Software Engineer, iOS&#x2F;Android \nNo, we don&#x27;t expect you to build both iOS and Android apps by yourself. BUT, you should know how to!! This role is half managing the iOS &amp; Android apps, and half architecting &amp; developing. You&#x27;ll have both iOS and Android developers (1 for each platform) on your team, and you should be able to jump back and forth, as needed. If you&#x27;re a first time manager, no worries; we&#x27;ll coach you on those skills. Just be sure you&#x27;re a master of both platforms.<p>Software Engineer, Android - <a href=\"http:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;88317\" rel=\"nofollow\">http:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;88317</a>\nSpotHero is a mobile product. If you love building Android apps, you&#x27;ll love what we&#x27;ve got in store. We have an amazing Android app, that we&#x27;re looking to do a full ground up redesign on. So there is a lot of bluesky work in the very near future.<p>To apply, please email your resume to jobs@spothero.com. Include any github account, linkedin profile, and any project that you’re particularly proud of. We love seeing work that others loved working on.","time":1443713881,"type":"comment"}