{"by":"vt57","id":10313185,"parent":10311580,"text":"Are you someone with a passion for programming and a love for learning? We want you to join us.<p>Title: DevOps Engineer with Ruby Experience\nReports to: Chief Technology Officer (CTO)\nDepartment: IT\nLocation: Telecommute &#x2F; Work from Home\nReply to: jobs@cyanna.com(Please include GitHub username)<p>At Cyanna, we believe education should be accessible to everyone, and that if you’ve got knowledge to share, nothing should stand in your way. So we work with educational institutions to help them launch, run, and market their schools — and make sure they’re compliant with government regulations along the way.<p>One of the things we offer is customized software solutions that make it easy for institutions to track and teach students, and for regulatory agencies to track institutions. Right now, we’re looking for a full time DevOps Engineer with Ruby Experience to help build our next generation e-learning platform.<p>Join our team from wherever you are:\nEveryone here works remotely, although we meet and collaborate online all the time. We also meet up in person occasionally throughout the year. You’ll be able to find the perfect balance of working independently and being part of a supportive team that’s got your back.<p>Here’s who we’re looking for: \nA life-long learner who’s always on top of new technologies, but still able to pick the right tools for the right job. Pragmatism is totally your thing. A seasoned systems administrator who’s got experience with Linux preferably using Ubuntu&#x2F;Debian, and general experience with Windows. Some RedHat and CentOS experience a plus. A cloud ace who’s well versed in Amazon Web Services : EC2, VPC, RDS, S3, CloudFront, OpsWorks, and IAM. An expert on networking, and securing systems and networks on AWS. A natural communicator who connects with people as quickly as you connect boxes.An easy-going personality who’s also adept at working efficiently in a virtual, fast paced environment.<p>This is the experience you should have:\nUsing automated build configuration tools like Ansible, Chef, or Puppet. Architecting scalable web application infrastructures on AWS. Understanding Ruby programming. If you have experience with Ruby on Rails and Sinatra, that will be pretty good, too.<p>This is what will take you over the top:\nExperience with other virtualization technologies like Xen, VirtualBox, VMWare, containers&#x2F;Docker, etc.<p>Sound like you? Send us your resume, and get ready to show us what you can do and why you love it. If you’re a fit, we’ll contact you within two weeks. If not, you won’t hear from us (we wish we could contact everyone who took the time to show us an interest in Cyanna, but sadly we just can’t get to everyone).","time":1443722726,"type":"comment"}