{"by":"cyngn-recruit","id":10315744,"parent":10311580,"text":"CYANOGEN | Seattle, WA and Palo Alto, CA | On-site Only | Relocation Assistance | Full Time | Visa<p>Cyanogen Inc was founded to make our popular open source CyanogenMod project accessible to a broader consumer base worldwide in the form of Cyanogen OS, a mobile OS built on Android that is known for its revolutionary personalization features, intuitive interface, speed, improved battery life, and enhanced security.<p>Here’s a sampling of our open positions:<p>1) Sr. Software Engineer - Signals &amp; Intelligence Graph: The Signals and Intelligence Graph Team will enable key new personalized experiences to Cyanogen users at massive scales. As a Software Engineer on the Signals and Intelligence Graph Team you will have the opportunity to build a scalable graph platform that powers our worldwide customers with personalized, relevant, and contextual mobile experiences.<p>You’ll need experience in building massively scalable data pipelines and big data for information retrieval or graph processing using technologies such as: neo4j, Titan, Hadoop MapReduce, Spark, Storm, Kafka, Zookeeper, Pig, Cassandra, Voldemort, Parquet, or Netty.<p>2) Sr. Android Software Engineer: You’ll contribute work that is fundamental to the Cyanogen experience by  adding features to the Android frameworks, exposing them to apps, and allowing for deeper, richer experiences for our community to utilize. You’ll need extensive experience developing complex Android applications and exceptional OO design and development skills.<p>3) Sr. Platform &#x2F; Web Services Engineer: Build the scalable, distributed systems that power our mass-market mobile services accessed by 50M+ users. You’ll need hands-on experience with large-scale, distributed platforms, such as AWS, and excellent OO development skills. These services are being developed with Java NIO and open source frameworks like Vert.x and Netty<p>Working at Cyanogen, you&#x27;ll get to collaborate with developers from around the world and contribute daily to a platform used by millions of people. Community involvement is an integral part of our everyday work. If you have a passion for open source and innovation, can demonstrate strong skills and a great attitude, we want to speak with you!<p>Check us out at <a href=\"http:&#x2F;&#x2F;cyngn.com\" rel=\"nofollow\">http:&#x2F;&#x2F;cyngn.com</a> and view all of our open positions here: <a href=\"http:&#x2F;&#x2F;goo.gl&#x2F;A69etV\" rel=\"nofollow\">http:&#x2F;&#x2F;goo.gl&#x2F;A69etV</a>, or email us at recruiting AT cyngn DOT com with questions.","time":1443744683,"type":"comment"}