{"by":"mattcaldwell","id":10312355,"parent":10311580,"text":"Endgame | Arlington, VA | Back End Software Engineer | ONSITE | <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3mqUBhw3\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3mqUBhw3</a><p>Endgame is hiring a Back End Stack Engineer who loves working across the full spectrum of web technologies and gets excited about developing an unparalleled, cutting edge, end-to-end command and control solution using the latest web technologies. You will be working with the top minds in this field developing a scalable, intuitive, and multi-tenant data aggregation application allowing for rapid information discovery, correlation, and interaction in real-time. If you are looking to work in a fast-paced, agile development environment creating new software components for game-changing data and security products, we would happily welcome you. This position is located in Arlington, VA. Ability to obtain a clearance desired.<p>Workflow Requirements<p>You like the practice of Continuous Integration and aspire to practice Continuous Deployment.\nYou like or are open to using Git for version control and following GitHub Flow.\nWhen submitting GitHub pull requests, you include automated tests.\nYou are familiar with Agile&#x2F;Scrum and you like or are open to trying these approaches.\nYou like trying out emerging technologies and fail fast when they don’t work out.\nBackend Technical Requirements<p>3+ years experience using Python (alternatively Ruby and a willingness to pick up Python).\n2+ years experience using Django web framework (alternatively Ruby on Rails).\nExperience using Linux and developing applications that run on Linux (Ubuntu, CentOS, etc)\nStrong skills using PostgreSQL (alternatively MySQL) and you know how to optimize SQL queries.\nExperience scaling databases with lots of data.\nFamiliarity with document search engines like ElasticSearch or SOLR.\nFamiliarity with queuing systems like RabbitMQ&#x2F;AMQP, Kafka, ActiveMQ, AWS SQS, ZeroMQ, etc.\nKnowledge of HTTP and you know how to make a RESTful web application (e.g., Django REST Framework)\nExpertise in one or more of the following areas desired:\nContainerization with Docker\nGeospatial tools such as PostGIS and Shapely.\nCellular networks (GSM, CDMA, UMTS, LTE, etc)\nApache Storm\nRiakCS (or Amazon S3)\nExperience with cloud computing providers such as Amazon Web Services (EC2)\nA deep understanding of systems, networks and protocol buffers","time":1443716889,"type":"comment"}