{"by":"0xa","id":10318607,"parent":10311580,"text":"Kensho, Boston, MA (Cambridge), New York, NY (NYC), San Francisco (SF), Stamford, CT: FULL TIME Software Engineers, Data Scientists (esp. Machine Learning or NLP), SRE, SET, or UI Designers ONSITE<p>Kensho&#x27;s growing engineering team[0] overlooks in Harvard Sq. We are making financial analysis faster, accessible, intuitive and beautiful through our partnerships with Goldman Sachs[1] and CNBC[2]  Please say hello to us at:<p><pre><code>  solve &#x27;&#x27;.xrlv([bpo(roi(b) - 1) nro b lv &#x27;isfn&#x27;]) + &#x27;@gfvapr.brt&#x27;\n\n</code></pre>\nSoftware Engineers, Site Reliability (SREs), Test&#x2F;QA (SET), and hands-on Data Scientists (PhDs a plus)<p>We&#x27;re hiring fun-loving, hands-on nerds at every experience level, layer of the stack and facet of our technology. We look for people who a hungry to learn, figure things out quickly, and are massively productive using technology and math.<p>While we primarily use Python, AngularJS, React and d3js, that is just implementation detail and you can interview in the language of your choice.<p>UI Designers<p>Design is critical to every aspect of our work. We look for a crisp design aesthetic applied to complicated workflows the produce intuitive designs. We hope you will share your portfolio and work through a design exercise with us.<p>Experience with finance is not expected. A willingness to play bughouse, play ticket to ride, and shoot zombies is a plus.<p>[0] <a href=\"http:&#x2F;&#x2F;kensho.com&#x2F;#team\" rel=\"nofollow\">http:&#x2F;&#x2F;kensho.com&#x2F;#team</a> \n[1] <a href=\"http:&#x2F;&#x2F;www.bloomberg.com&#x2F;news&#x2F;features&#x2F;2015-07-28&#x2F;how-goldman-sachs-became-a-tech-investing-powerhouse\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bloomberg.com&#x2F;news&#x2F;features&#x2F;2015-07-28&#x2F;how-goldma...</a>\n[2] <a href=\"https:&#x2F;&#x2F;www.cnbc.com&#x2F;kensho\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cnbc.com&#x2F;kensho</a><p>ps.  Puzzles not your thing?  <a href=\"https:&#x2F;&#x2F;kensho.com&#x2F;#&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;kensho.com&#x2F;#&#x2F;careers</a>","time":1443794885,"type":"comment"}