{"by":"jtheory","id":10312364,"kids":[10317816],"parent":10311580,"text":"Patients Know Best -- REMOTE ONLY. Core hours for most of us are in London time, but we now have developers also in EST and CST (partly overlapping). We&#x27;re slowly hiring mid-level and senior full stack developers (one every couple of months), but our next hire or two will be focused on app dev!  We have patient and clinician apps that need to be re-worked and greatly expanded (to navigate a diverse medical record), and we&#x27;ve been working for a while now on a maternity app that takes the midwives and mother all the way through a pregnancy.  That app is based on AppGyver Steroids (which in turn is built around Cordova), so you should be able to jump into that fairly easily.  We&#x27;re thus working with JavaScript, WebSQL, jQuery, backbone, HTML&#x2F;CSS.  Extra points if you&#x27;ve dealt with large&#x2F;complex apps and managing data offline (and the complexity that comes with synching periodically with the server, where new data may come from either the app or the server);<p>For the server side -- apps authenticate with OAuth2, speaking JSON to a REST API; our server-side back end and webapp are primarily Java-based, gradually being refactoring towards a microservice structure.  So if you&#x27;re interested in helping out as well implementing new REST calls as needed, Java experience will ease that path.<p>More about PKB<p>I&#x27;ve worked in a lot of different sectors since I first started writing code in the late 90s, including education, b2b supply chains, POS systems, e-commerce, banking, and anti-spam.<p>PKB has been head-and-shoulders above the rest in everything I care about.<p>We&#x27;re building something that actively, directly, improves the lives of people in general -- not selling more stuff, helping others sell more stuff, or making comfortable people a bit more comfortable. If you&#x27;re interested in PKB&#x27;s growth, funding, profitability, contracts, etc., ask -- our CEO is also active on HN. I&#x27;m in the CTO role.<p>We&#x27;re pragmatic about work&#x2F;life balance. I work from France, or sometimes from Malaysia, where my in-laws live. Almost half of the developers have small children at home -- personally, I get my kids up in the morning, and I&#x27;m with them entirely late-afternoon &amp; evening (while my wife works), then I fill in some extra hours around the edges as needed. We&#x27;re collaboratively figuring out what works (e.g., how many working hours should you overlap to collaborate effectively?), and planning our lives and our work around what&#x27;s effective, not around some photocopied list of rules stapled to a cubicle wall. One of our developers only codes part time (and occasionally takes long leaves of absence), because he&#x27;s also a theatre director.<p>Culture -- we live in various parts of the UK, central France, Bangalore, Vienna, Budapest, NYC and Costa Rica; we range in age (though I don&#x27;t actually know everyone&#x27;s ages, so I can&#x27;t say exactly!). We&#x27;re not all native English speakers -- but communication skills trump even technical skills for remote teams, so we all understand, speak and write English easily and with the confidence to interrupt if we didn&#x27;t catch something. We collaborate, not compete -- let ideas fight it out, but we&#x27;re on the same team. We like to laugh (but jokes stay tasteful), we share stories of what we did over the weekend (but these don&#x27;t normally end &quot;then I passed out&quot;).<p>If we sound like a good match, get in touch: <a href=\"https:&#x2F;&#x2F;www.patientsknowbest.com&#x2F;careers.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.patientsknowbest.com&#x2F;careers.html</a> (I&#x27;m also contactable directly -- see profile -- but I get a lot of email).  I do review all applications, though currently our hiring process is slow and with not-great communication; you should probably mention it if you think you&#x27;re a great fit but need to jump to something immediately.","time":1443716937,"type":"comment"}