{"by":"michaelhoffman","id":10311824,"kids":[10312795,10312898],"parent":10311580,"text":"Princess Margaret Cancer Centre: Postdoctoral fellowships in computational biology and machine learning - <a href=\"http:&#x2F;&#x2F;pmgenomics.ca&#x2F;hoffmanlab&#x2F;join&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;pmgenomics.ca&#x2F;hoffmanlab&#x2F;join&#x2F;</a><p>Toronto, ON<p>The Hoffman Lab at the Princess Margaret Cancer Centre and the University of Toronto, seeks new members for our team. We develop machine learning techniques to better understand chromatin biology. These models and algorithms transform high-dimensional functional genomics data into interpretable patterns and lead to new biological insight. A key focus of the lab is to train a new generation of computational biologists.<p>We seek postdoctoral fellows for several projects in computational genomics and machine learning. Selected projects include:<p>1. Integrating epigenomic and sequence data to better understand human gene regulation.<p>2. Creating models of transcription factor binding that allow us to predict the effects of perturbations.<p>3. Developing deep learning techniques to find novel behavior in multiple functional genomics datasets.<p><i>Required qualifications</i>: Doctorate in computational biology, computer science, electrical engineering, statistics, or physics, obtained within the last five years. Submitted first-author or joint first-author papers in genomics or machine learning research. Experience in scientific programming in a Unix environment.<p><i>Not required, but preferred qualifications</i>: Experience with epigenomics and graphical models. Published first-author papers in peer-reviewed journals or refereed conference proceedings. Experience programming in Python, R, C, and C++.<p><i>Benefits</i>: Includes extended medical insurance, dental insurance, maternity benefits (15 weeks), parental benefits (additional 35 weeks), child care program (fee applies), Canada Pension Plan contributions, and employment insurance. Flexible work hours.<p>We will consider candidates who need a VISA to work in Canada. We are especially interested in candidates who are women or members of underrepresented minorities.<p><i>To apply</i>: We will accept applications until the position is filled. Please submit your CV (as PDF), your best paper (as PDF), the URL of a code sample, and the names, email addresses, and phone numbers of three references to the address at <a href=\"http:&#x2F;&#x2F;pmgenomics.ca&#x2F;hoffmanlab&#x2F;join&#x2F;#postdoc\" rel=\"nofollow\">http:&#x2F;&#x2F;pmgenomics.ca&#x2F;hoffmanlab&#x2F;join&#x2F;#postdoc</a>","time":1443713448,"type":"comment"}