{"by":"paulaminc","id":10311738,"parent":10311580,"text":"San Francisco, CA | Full Time Onsite + Remote<p>#TheXamarinStory. We created Xamarin (<a href=\"https:&#x2F;&#x2F;xamarin.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;xamarin.com&#x2F;</a>) because we knew there had to be a better way to build mobile apps. We’re developers, so we know what developers want: a modern programming language, powerful tools, an efficient and delightful workflow and the power to create the best user experiences. We are on a mission to make it fast, easy and fun to build great mobile apps.<p>Systems Engineer (SF Onsite) <a href=\"https:&#x2F;&#x2F;xamarin.com&#x2F;jobs&#x2F;ojxx0fw7\" rel=\"nofollow\">https:&#x2F;&#x2F;xamarin.com&#x2F;jobs&#x2F;ojxx0fw7</a> Would you like to be part of the beginnings of Xamarin&#x27;s internal tech ops team? This is the challenge you have been waiting for! You will be heavily involved with both server and identity infrastructure automation, network operations, and infrastructure support and security.<p>Mobile Architect (SF Onsite + Remote)  <a href=\"https:&#x2F;&#x2F;xamarin.com&#x2F;jobs&#x2F;ou6n0fwH\" rel=\"nofollow\">https:&#x2F;&#x2F;xamarin.com&#x2F;jobs&#x2F;ou6n0fwH</a> We are looking for Senior Mobile Consultants to join our small Strategic Client Services team across the globe to help our clients realize the most out of their investment in our products (Xamarin Platform, TestCloud, and Insights).  Successful candidates are multidimensional developers and client facing leaders that love to architect, build and optimize exciting mobile apps across every single industry around the world.<p>Junior Mobile Development Trainer (Remote Contract-to-Perm) <a href=\"https:&#x2F;&#x2F;xamarin.com&#x2F;jobs&#x2F;oLLxZfwM\" rel=\"nofollow\">https:&#x2F;&#x2F;xamarin.com&#x2F;jobs&#x2F;oLLxZfwM</a> Do you have an ability to teach and inspire others regarding technical concepts and skills? Do you love C# and mobile development? Would you take pride in helping individuals and companies transform themselves and achieve their mobile strategy objectives? Yes to all - send us a note and tell us why - Xamarin University is excited to hear from you!<p>We have more jobs available in Boston, San Francisco and London including a few REMOTE positions! Complete list of all Xamarin opportunities (multiple locations): <a href=\"https:&#x2F;&#x2F;xamarin.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;xamarin.com&#x2F;jobs</a><p>Interested to learn more, chat about what it’s like to work at Xamarin? My direct: paula@xamarin.com","time":1443712757,"type":"comment"}