{"by":"mattcaldwell","id":10312388,"parent":10311580,"text":"Endgame | San Francisco, CA | Full Stack Python Developer | ONSITE | <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3FrUBhwn\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3FrUBhwn</a><p>You will be building scalable, innovative, groundbreaking software that powers the backend of our Cyber Security Products. Faced with challenging problems on a daily basis, you will work within a team to resolve the unique challenges of threat detection in highly dynamic environments. You will use high-level programming languages and work with terabytes of data in an ecosystem of NoSQL products. With Data Science at our core, you will collaborate with data scientists to implement advance threat detection models.<p>Join Endgame in Building Next Generation Cyber Security Products! \nDescription\nJoin Endgame in Building Next Generation Cyber Security Products!<p>We are looking for a highly technical, creative and motivated software engineer who is excited to work in a fast-paced, innovative, and agile development environment, while solving critical cyber security problems. Ideal candidates have experience in rapid and early product lifecycle development.<p>What’s the Job?<p>You will be building scalable, innovative, groundbreaking software that powers the backend of our Cyber Security Products. Faced with challenging problems on a daily basis, you will work within a team to resolve the unique challenges of threat detection in highly dynamic environments. You will use high-level programming languages and work with terabytes of data in an ecosystem of NoSQL products. With Data Science at our core, you will collaborate with data scientists to implement advance threat detection models.<p>Requirements<p>At least 3-5 years of experience in the Software Engineering field\nMust be very familiar with development in a POSIX environment (Linux, *NIX)\nMad Python skills\nSkilled at building robust RESTful APIs\nExpertise with Django or similar framework (Rails, Grails)\nExperience with Queuing Technology like RabbitMQ&#x2F;AMQP, Kafka, ActiveMQ, AWS SQS, ZeroMQ, etc.\nFluent with Git and Github and comfortable using SSH\nSignificant expertise with eventing concepts&#x2F;libraries — epoll, libev, libevent, Node.js, gevent, requests<p>Who are we?<p>Endgame develops world-class cyber security products for the most demanding enterprise and government customers.  Our products protect both corporate and national interests, by combining expertise across data science, threat research, and cloud computing. Endgame was founded in 2008 and has offices in Washington, DC, San Francisco, CA, Atlanta, GA, Melbourne, FL, and San Antonio, TX.","time":1443717067,"type":"comment"}