{"by":"dgsiegel","id":10320567,"parent":10311580,"text":"NOT JUST A LABEL | <a href=\"https:&#x2F;&#x2F;www.notjustalabel.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.notjustalabel.com</a> | London, UK | Onsite | Full-time<p>Every day people wake up and think about changing the world. Join one of the most innovative start-ups in digital fashion, help and support thousands of creatives and make change happen. Become part of fun, dynamic and simply awesome team and take the NOT JUST A LABEL platform to the next level by shaping its future.<p>At NJAL we are the leading designer directory for showcasing pioneers in contemporary fashion, and we are looking for an experienced Drupal developer for an immediate start at the company’s head office in Shoreditch, London. The role would be ideally suited to a skilled and enthusiastic developer with at least two years experience in Drupal development, who is now looking to take the next major step to progress their career.<p>NJAL operates in a start-up environment with a team of committed and enthusiastic individuals. We are strong supporters of free and open source software and therefore give back to the Drupal community by encouraging our development team to engage closely with the Drupal project. We are looking for a new member to take main technical responsibility while engaging in all sides of the business across different sectors: giving input and sharing opinions. She&#x2F;he will work closely with the founding members of NJAL to envision and further develop the brand&#x27;s place on the web, helping to cement its position as the market leader in digital fashion.<p>Responsibilities:<p>- Envision and develop new key features for the NOT JUST A LABEL Drupal based platform<p>- Optimise existing features for performance and stability<p>- Find and resolve issues with the platform in close communication with our users and co-workers<p>Requirements:<p>- Have extensive experience in Drupal 7 and the Drupal community<p>- Be able to display 2+ years of in-depth experience with high-performance Drupal sites<p>- 3+ years PHP programming experience<p>- Be self-directed and able to effectively manage their own tasks<p>- Be familiar with Git and Drupal development technologies such as Drush, Features and Context<p>- Have a well-rounded knowledge of Drupal-adjunct technologies such as the LAMP platform, HTML5, CSS3, jQuery&#x2F;JavaScript<p>- Have a great insight in Drupal modules like Drupal Commerce, CCK and Views<p>- Willing and able to delve into all parts of Drupal and learn quickly<p>- Firm understanding of Drupal, its form API, menu API, theme layer, templating system.<p>- Great SQL skills, including complex queries. Writing and UI design skills are a great plus<p>- Be a team-player, have an interest in design and show creative thinking<p>- Highly organised, self-motivated, with an attention to detail<p>- Ability to cope well under pressure and keep tight deadlines<p>Email us at jobs@notjustalabel.com","time":1443812884,"type":"comment"}