{"by":"maxwell","id":10332066,"parent":10311580,"text":"Crater (crater.co) – Sonoma County, CA or REMOTE – Contract to start<p>We&#x27;re bringing video collaboration to organizations. Moving companies and home service providers are using our software to video chat with their customers, music teachers are holding lessons with students across the world, sports coaches are reviewing and annotating games, and we&#x27;re just getting started.<p>We&#x27;re a startup, in private beta, focusing sales efforts on capturing our first vertical. We&#x27;re offering something that&#x27;s not available anywhere: branded, automatically recorded and secure video chat with cross-device playback. We&#x27;re changing the way businesses communicate with customers, and enabling a new level of support.<p>Our team is distributed across North America, with members based in California, Nevada, Mexico City, Virginia, NYC, and Maine. Our culture is fast-paced, innovative, and progressive.<p>We&#x27;re growing, and looking to take on two new engineers:<p># Video Software Engineer<p>We&#x27;re looking to bring on an engineer to lead the next phase of development on our video player, playback, and chat features. Fixed scope contract project to start.<p>HTML, CSS, JS, Python, Golang, Haskell, WebRTC, AWS, Parse, BitTorrent, document-oriented databases, RESTful HTTP API.<p># Mobile Software Engineer<p>We&#x27;re looking to bring on an engineer to lead the next phase of development of our iOS app, which is currently a simple video chat app. You&#x27;ll be adding a video player and optimizing playback, along with extending the chat features. Android experience a plus, but initial focus would be solely on iOS. Fixed scope contract project to start.<p>HTML, CSS, JS, Objective-C, Swift, Python, Golang, Haskell, WebRTC, AWS, Parse, BitTorrent, document-oriented databases, RESTful HTTP API.<p>Interested? Send links to code you&#x27;ve written (preferably on GitHub) and demos of projects you&#x27;ve worked on to jodi@crater.co.","time":1444055815,"type":"comment"}