{"by":"jobsatrealhq","id":10377340,"parent":10311580,"text":"Real HQ | REMOTE, US-based<p>We build things that make buying and selling houses easier – and we&#x27;re looking for a seasoned Ruby on Rails developer to join our team. We maintain a custom-built, in-house CRM that supports our consumer-facing service, Agent Pronto. We’re currently one of the largest real estate referral services in North America and are experiencing exponential growth. We plan to expand our product line even further over the next several months and the increase in data, scale, and customer acquisition will create even more technical challenges for our Product team to solve. Currently, our Product team consists of two senior-level Rails developers and one frontend developer&#x2F;designer.<p>We build our products using the following tools and languages, and we’ll expect you to be proficient in each:<p><pre><code>  *Ruby, Ruby on Rails\n  *HTML (Haml)\n  *CSS (Sass)\n  *Javascript (jQuery, CoffeeScript, Ajax)\n  *Data stores (MySQL, Redis, Memcached)\n  *(Testing tools (RSpec, Capybara)\n  *Continuous integration and deployment\n  *Linux\n  *Git\n  *Nice-to-haves: Bootstrap, Backbone.js\n</code></pre>\nWe’re looking to hire immediately for a full-time, salaried position. You can expect to be paid a competitive market rate and work around 40 hours per week. We request that you reside in the United States, but once hired, you’ll have the flexibility to work from anywhere. You&#x27;ll also be provided with perks and benefits, including:<p><pre><code>  *Comprehensive health, dental, and vision coverage. We pay 100% of your premiums and 50% for your dependents.\n  *Flexible vacation policy (we don&#x27;t track vacation – take what you need). \n  *Up to 12 weeks of paid maternity &#x2F; paternity leave. \n  *Any tech you need to do your job well, plus laptop and phone upgrades every three years. We’ll also pay your monthly phone bill. \n  *Ongoing education stipend to use toward conferences, seminars, etc. \n  *Biannual retreats in awesome locations. \n  *A stellar, technical Product lead, plus company leadership that values input and insight from the Product team.  \n  *Clear, precise company-wide goals.\n  *A truly remote culture.\n</code></pre>\nIf you think you&#x27;re a good fit, learn more and find out how to apply at <a href=\"http:&#x2F;&#x2F;realhq.com&#x2F;jobs&#x2F;senior-rails-dev\" rel=\"nofollow\">http:&#x2F;&#x2F;realhq.com&#x2F;jobs&#x2F;senior-rails-dev</a>.","time":1444689982,"type":"comment"}