{"by":"santry","id":5472987,"parent":5472746,"text":"Boston, MA (South End, no remote) - MeYou Health<p>I'm Lead Engineer at MeYou Health and we're hiring engineers (and a web designer). We work mostly in Rails and Node.js, building web apps that help people improve their well-being through small, healthy actions that are within reach for everyone. Our apps leverage social connections and game mechanics as well as our original research in health and behavior change.<p>I've been with MeYou Health for about 6 months and it's the best job I've ever had. We ship code every day of the week, multiple times per day. We're all users of the products we build so we're all really invested in making the products great. It's a fantastic team and a great environment.<p>Some highlights from our jobs page:<p>We have a practically unheard of work/life balance. We are very flexible and family friendly when it comes to work and vacation time. Those crazy hours you find at most start-ups? Practically nonexistent here.<p>We're friends. We know and like each other, quirks and all.<p>We care about workplace well-being. Health matters here.<p>We play games. We have an Xbox and know how to use it.<p>We're in this together. We have a great team dynamic with a go-get-’em attitude.<p>We have fun. Conversations are lively and there's plenty of laughter.<p>We're making a difference. Our well-being solutions are creating meaningful, lifelong change.<p>* Competitive salaries with annual bonus structure<p>* 23 paid days off a year, plus flex days and holidays<p>* 401(k) matching with no vesting schedule<p>* Comprehensive health benefits, including life, AD&#38;D, vision and dental, for you, your family, or your significant other<p>* New software and equipment (we’re mostly on Macs) and an iPhone<p>* Flexible and open working environment<p>* Walking distance from Back Bay, Arlington, and Park Street MBTA stations<p>Please feel free to contact me directly at sean.santry@meyouhealth.com<p>or read more and apply at<p><a href=\"http://meyouhealth.com/jobs\" rel=\"nofollow\">http://meyouhealth.com/jobs</a>","time":1364824361,"type":"comment"}