{"by":"grumps","id":5473815,"kids":[5474192],"parent":5472746,"text":"Interactive Strategies is seeking a Full Stack .NET Developer in DC / DMV area. Remote might be possible for exceptional proven candidates. No H1B - Sorry.<p>We are 17 person full service web agency located in the heart of Washington, DC.<p>We approach each project with a comprehensive strategy phase and then determine the correct technology for the project. That often results in us selecting Sitecore for the client's content management needs. For this position, we are looking specifically for someone to assist on our .NET ASP.MVC and Sitecore projects, and having production experience (jQuery, CSS, markup) would also be quite helpful.<p>Requirements:<p>We don't care as much about years of experience as we do your talent and passion. But here is the type background you should have:<p>-Deep experience with the .NET framework Sitecore CMS/DMS experience a huge plus<p>-Experience developing web applications using the Microsoft stack (MS SQL Server, IIS, .NET framework, ASP.NET, ADO.NET, C# or VB.NET)<p>-Experience in object-oriented programming Strong oral and written communication skills<p>-Web agency experience<p>-Ability to apply creative thinking to technology issues \nCuriosity to learn about new web technologies and approaches \nExperience in PHP, MySQL and open source frameworks a plus<p>Your Qualities:<p>-A team player with great communication and interpersonal skills<p>-Intellectually curious with innovative and creative problem-solving skills<p>-Well-organized and able to work under deadlines and multiple projects<p>-A highly motivated self-starter Able to work effectively with other developers, account management staff, and designers Someone who understands the importance of documentation, but can also figure things out on their own<p>Curious?<p>If this sounds like a place you would like to work, contact us at programmer@interactivestrategies.com  add the subject \"Hacker News Post\" or checkout out the full listing <a href=\"http://www.interactivestrategies.com/netsitecore-web-developer\" rel=\"nofollow\">http://www.interactivestrategies.com/netsitecore-web-develop...</a>","time":1364831747,"type":"comment"}