{"by":"atto","id":5473111,"parent":5472746,"text":"Mountain View, CA - full time - hiring Scala Backend Engineer / Machine Learning &#38; Information Retrieval Engineer / Full Stack Engineer / Mobile Engineer (would prefer someone local so we can easily bring you in the office and show what we're working on)<p>We're FortyTwo, a stealth-mode well-funded startup in Mountain View, CA. We're working on a consumer web product that will be released in the next 4-5 months. We started about 5 months ago, and are looking for engineers who can hit the ground running and work with our existing team. We use Scala, Play!, Akka and JavaScript. Check out our site for complete job descriptions, and to learn a little about us: <a href=\"http://www.42go.com/join_us.html\" rel=\"nofollow\">http://www.42go.com/join_us.html</a>. Also, check out our engineering blog to see about some of the problems we're working on: <a href=\"http://eng.42go.com/\" rel=\"nofollow\">http://eng.42go.com/</a><p>• Backend Engineer:\nGrowing and scaling up FortyTwo’s backend. At this stage of the company it means going all the way from building clusters of services, optimizing concurrent processing, building data pipelines, working with various types of databases and implementing devops automations. We are building our systems on using technologies like Scala, Play, Akka, ZooKeeper and Guice.<p>• Machine Learning / Information Retrieval Engineer:\nFortyTwo is dealing with massive amounts of user events, analytics data, social graphs and web documents. You will be asked to design and build a new breed of Machine Learning and Information Retrieval systems that will be of large scale with tight throughput and latency requirements.<p>• Frontend Engineer:\nDesign and build high quality, modern consumer web user experiences. Our front-end engineers should be comfortable working at all levels of the development stack (database, server, browser).<p>• Software Engineer, Mobile:\nDesign and build high quality, modern consumer mobile user experiences. Define and implement APIs (library and network) for mobile apps. Our mobile engineers should be comfortable working at all levels of the development stack (storage, server, multiple mobile platforms).<p><a href=\"http://www.42go.com/join_us.html\" rel=\"nofollow\">http://www.42go.com/join_us.html</a> or email us at towel@42go.com","time":1364825611,"type":"comment"}