{"by":"chomchom","id":5474161,"parent":5472746,"text":"Novoda / Central London &#38; Berlin\nSenior Software developer. Full Time.\nwww.novoda.com<p>=======================================<p>You will be interested in working within small teams of developers within either London or Berlin. We are all hackers. We love software development and encourage it getting done really well. Although we specialise in Android, we care about all technologies and the future of our industry. If you want a challenge and want to work in the best possible company for the future of Android development, lets chat.<p>We are looking for seasoned developers who likely have significant Android experience but who definitely care about software craftsmanship.<p>First 6 months at one of our offices. Open to negotiations on working situations after this time.<p>Novoda develop the world's most desirable Android software. Our clients are typically venture capital funded tech startups who with our help  realise an amazing products for their very new services. We help them hit the ground running and innovate with their services to the best of the platform's ability. This means that Novoda see lots of project variations and we work with lots of amazing interesting technologies! Far from being just about phones, Novoda's believes Android's real  future is Glasses, wearables, Factories, Vending machines, Satellites and a world of future interconnected devices.<p>We are very social :) \nWe like to meetup and so we help run the London Android meetup at least once a month: <a href=\"http://www.meetup.com/android\" rel=\"nofollow\">http://www.meetup.com/android</a>\nWe also run London's Droidcon <a href=\"http://www.droidcon.co.uk\" rel=\"nofollow\">http://www.droidcon.co.uk</a><p>If you are interested please get in touch: <a href=\"http://novoda.com/contact\" rel=\"nofollow\">http://novoda.com/contact</a><p>=======================================\n          www.novoda.com\n=======================================","time":1364834436,"type":"comment"}