{"by":"mmalone","id":5474017,"parent":5472746,"text":"San Francisco, Full Time, H1B is OK<p>Betable is hiring awesome software engineers.<p>About Us<p>Betable engineering is an elite team of hardworking dreamers and tinkerers. We’re pragmatic, but we don’t let that interfere with our perfectionism. We’re fluent in computing concepts from anonymous memory management to monadic zeros.<p>We’re building a platform. Engineering innovation is our competitive advantage. We’re doing something new and different in an industry that hasn’t seen any real innovation in the last century. That excites us.<p>We try to be technology agnostic, preferring suitability to ideology. Our services are small and chatty, communicating through well-defined interfaces. Sometimes we compose them in ways that are surprising even to us. We think that’s healthy for a platform company. In general, we believe that sound system architecture and design are more important than any particular technology.<p>Day to day we use Node.js, Cassandra, Jenkins, Go, Java, Puppet, and GitHub. We like continuous integration. In fact, we like most forms of process automation. Sometimes our tools make us happy, sometimes they make us sad. When they make us sad, we make them better.<p>We like to work. We love to play. We don’t consider these activities mutually exclusive.<p>There aren’t many of us. We’re looking for more.<p>About You<p>You’re an engineering powerhouse who wants to work on challenging problems with a group of equally amazing colleagues. Your depth of knowledge in many areas of computing should qualify you as a specialist, but your breadth of expertise demands that you describe yourself as a generalist. Sometimes you think the two aren’t so different, but you resist that sort of reductionism.<p>You’re well rounded. You have hobbies that don’t involve computers. Despite your expertise, you sometimes surprise casual acquaintances with your profession. You can’t carry a tune but you sing anyways. Your recreational reading includes works by  Kurt Vonnegut, W. Richard Stevens, and Dr. Seuss.<p>You’re not sure whether P equals NP, but the possibility leaves you feeling both titillated and terrified. Sometimes, while considering the repercussions, you lose composure.<p>Mutable state is your frenemy. You appreciate what Scala has managed to do on the JVM. You’ve developed several profiles of the language, each Turing complete. You’re curious about the future of Go. You’ve toyed with several syntactic variants of your own competing language based on the π-calculus. You’re an expert at SQL, but would never describe yourself that way.<p>You had a check for $2.56 from Donald Knuth. You cashed it when your bank started displaying digitized check scans in your transaction history because you hate physical media.<p>You can explain technical concepts to non-technical people. Non-technical people enjoy the experience. At parties your conversations transition seamlessly from Emacs vs. vi to Beatles vs. Stones.<p>You consider coding a craft – as much art as science. It’s your creative outlet. You consider quines a form of poetry. You often describe code as beautiful.<p>You’re self aware. Some of these statements don’t apply to you, but you can read between the lines. Others upset you. You understand why at a fundamental level. You can argue your position, and you can win.<p>Sound like you? Join us.<p><a href=\"http://betable.theresumator.com/apply/KYLS0t/Software-Engineer.html\" rel=\"nofollow\">http://betable.theresumator.com/apply/KYLS0t/Software-Engine...</a>","time":1364833336,"type":"comment"}