{"by":"andrewroycarter","id":5475861,"parent":5472746,"text":"DevOps Developer<p>Are you a talented server side developer who wants to build best-of-class mobile applications?  Do you want to work with talented developers and interact with your clients instead of dealing with project managers? Would you like to see the fruits of your labor out in app stores rather than working on internal, corporate projects that never launch?<p>Do you enjoy thinking about data in general: how it gets stored, indexed, queried and represented? Want to live on the bleeding edge of the latest App technology, and continuously learn about new frameworks and patterns as they emerge.<p>If you've answered yes to a few of the above questions, we'd like to talk to you.  To be successful at this job you will have a deep understanding of a high-level programming language (preferably Python, Ruby, Java or PHP), a friendly personality and the ability to work in collaboration with other developers and our clients.<p>Do any of these apply to you as well?<p>Expert knowledge of an MVC web-oriented framework like Django, Rails or App Engine.\nHave experience with any of the following data stores: Postgres, MySQL, Oracle, SQL Server, Mango DB.\nComfortable on UNIX-type command lines (Ubuntu, CentOS, Fedora,  OSX). \nFamiliarity with cloud-based infrastructure vendors (Linode, AWS, Rackspace, Slicehost).\nFamiliarity with Configuration Management systems like Salt, Chef or Puppet.\nFront-end development experience on any platform that does HTTP calls (iOS, Android, HTML5).\nUnderstanding of scalable and highly-available systems.\nYou appreciate being called a hacker. \nYou really love mobile devices.<p>The WillowTree Apps’ office is a fun, exciting place to work.  Check out <a href=\"http://www.willowtreeapps.com/jobs/\" rel=\"nofollow\">http://www.willowtreeapps.com/jobs/</a> to see some of the perks of working with us. We are one of the largest and most respected mobile development companies in the US – one of only two app development companies on the 2012 Inc. 500 list. The company has won several industry awards including being named a Top 3 Global App Development company by both Best Web Design and SourcingLine. We’ve won numerous Webby awards, and have had our apps repeatedly selected by Apple to feature as top apps in various categories. Our entire 50+ person team is located in our Charlottesville, VA headquarters. Nothing is outsourced. Our open office environment is designed to facilitate collaboration among our team. Our team members are frequent speakers at mobile design conferences. We hire the best in the industry.<p>The technology industry we live in is fast moving and always changing. If you are the type of person that thrives in that environment then we want to talk to you. Apply at willowtreeapps.com/jobs.","time":1364849591,"type":"comment"}