{"by":"andrewroycarter","id":5475860,"parent":5472746,"text":"Web/JavaScript Developer<p>Are you a talented web developer who wants to build best-of-class web applications for mobile and desktop web?  Do you want to work with talented developers and interact with your clients instead of dealing with project managers? Do you want to see the fruits of your labor out in the wild rather than working on internal, corporate projects that never launch?<p>Do you think JavaScript only gets a bad wrap because most developers don't understand prototypal inheritance? Or maybe you think Compass' image spriting features are the COOLEST THING EVER. Maybe you're one of the few that think they're merely AWESOME.<p>If you've answered yes to a few of the above questions, we'd love to talk to you.  To be successful at this job you will have exceptional JavaScript skills, a friendly personality and the ability to work in collaboration with other developers and our clients.<p>Do any of these apply to you as well?<p>You've built something cool using Backbone.js, AngularJS, or some other   client-side MV* framework. \nKnow HTML(5) and CSS(3) inside and out. \nYou know Less, SASS or some other CSS preprocessor. Maybe you've even built your   own toolkit that sits on top of your preprocessor of choice. \nYou've worked with at least one high-level server-side language. \nYou can clearly articulate why \"responsive design\" isn't a panacea. \nYou appreciate being called a hacker. \nYou love the web. \nYou really love mobile devices.<p>The WillowTree Apps’ office is a fun, exciting place to work.  Check out <a href=\"http://www.willowtreeapps.com/jobs/\" rel=\"nofollow\">http://www.willowtreeapps.com/jobs/</a> to see some of the perks of working with us. We are one of the largest and most respected mobile development companies in the US – one of only two app development companies on the 2012 Inc. 500 list. The company has won several industry awards including being named a Top 3 Global App Development company by both Best Web Design and SourcingLine. We’ve won numerous Webby awards, and have had our apps repeatedly selected by Apple to feature as top apps in various categories. Our entire 50+ person team is located in our Charlottesville, VA headquarters. Nothing is outsourced. Our open office environment is designed to facilitate collaboration among our team. Our team members are frequent speakers at mobile design conferences. We hire the best in the industry.<p>The technology industry we live in is fast moving and always changing. If you are the type of person that thrives in that environment then we want to talk to you. Apply at willowtreeapps.com/jobs.","time":1364849582,"type":"comment"}