{"by":"sbisker","id":5475798,"parent":5472746,"text":"San Francisco, CA and Cambridge, MA - Locu is hiring Frontend\nEngineers, Backend Engineers and Visual Designers -\nFull-time; H-1B OK<p>Locu is developing technologies to change local search ($35bn advertising market by 2014) through a number of initiatives that help local businesses better connect with their consumers.\nAs part of this vision, we created one of the world's largest semantically-annotated repositories of real-time small-business data, which is now distributed and viewable on sites like OpenTable, Citysearch and TripAdvisor (and more). We recently launched Locu.com, our local business facing product, that combines great tech and beautiful design to help local businesses better manage their online presence.<p>Our beautiful offices are in downtown San Francisco, CA (Union Square) and Cambridge, MA (Kendall Square). Check out photos and learn more about our other perks: <a href=\"http://locu.com/about/jobs/\" rel=\"nofollow\">http://locu.com/about/jobs/</a><p>Frontend Engineering<p>If you are passionate about building products that will touch\nmillions of merchants and hundreds of millions of consumers through the applications powered by our local data APIs, Locu is the right place for you. [JQuery, Less, Django, etc.]<p>Backend engineering<p>We started Locu out of MIT to solve real-world problems by leveraging the latest research in computer science. If you are looking to solve some of the most challenging problems in machine learning, NLP and human computation, you'll feel right at home. [Python, Django, Node.js, Postgres, Redis, AWS, etc.]<p>Design<p>We're looking for visual designers who are excited to redefine what the future of local business data looks like across web and print, and to create tools that put modern web technology in the hands of merchants.<p>Interested? Drop us a line at jobs@locu.com. Please include \"[HN]\" in the subject of your letter. Learn more about us (now with photos!) at: <a href=\"http://locu.com/about/jobs/\" rel=\"nofollow\">http://locu.com/about/jobs/</a>","time":1364849076,"type":"comment"}