{"by":"ReelGenie","id":5476223,"parent":5472746,"text":"Washington, DC (full-time)\nSenior Rails &#38; Front-end Developer\nReelGenie www.reelgenie.com<p>At ReelGenie, we are revolutionizing the way stories are told and shared. We make it easy for anyone to create high-quality movies online to capture life’s most important memories. Our company is growing rapidly. We’ve been named one of DC’s hottest startups and were finalists in the prestigious SXSW Accelerator.<p>Our technical team strives to build the best User Experience, which combines stunning UIs and a robust backend.  We have come a long way in a short period of time, but to keep up the pace we are looking for the best and brightest technical talent to join our team. If you can tackle the responsibilities below, and are open to dive in as new opportunities emerge, this role is for you.<p>The primary responsibilities of this role include:\n* Quickly learn the architecture of the application from UI to video processing.\n* Design and develop various components of the system either independently or as part of small internal groups.\n* Work on distributed processing and video processing components that may require understanding tools and APIs we use.\n* Prioritize the development effort and organize functionality across multiple builds.  We value shipping features rapidly with varying degree of complexity.\n* Bring expertise in Ruby and Rails, and be open to mentoring junior developers.\n* Help team members embrace automated unit testing and continuous integration.\n* Collaborate with other developers, QA team and business stakeholders to build the right thing the right way as efficiently as possible.\n* Participate in Scrum meetings to keep product priorities moving forward in a planned fashion.  We need people who can estimate their work and lay out different possible scenarios upfront if technical challenges are expected.\nDesired Skills &#38; Experience<p>We are looking for someone who:\n* Has 5-10 years of experience in web technologies, with at least 3-4 years in Rails.  Numbers are flexible for exceptional candidates.\n* Has solid understanding of MVC pattern.\n* Has experience using git, <i>nix, heroku, postgresql, ruby gems, cloud platforms such as AWS, UJS, Javascript frameworks such as JQuery, </i> Third party Javascript  plugins, AJAX, API integration via REST or other protocols.\n* Has a proven track-record of success in working in fast paced environments and delivering defect free code.\n* Gets things done. If you’re not a doer, don’t apply\n* Can prioritize a long list of to-dos and thrives in the unpredictable startup world.\n* Is personable, outgoing, energetic, and works well with others.\n* Appreciates a good story (and a good laugh).\n* Is located in the Washington, DC area.<p>The position can be a contract-to-hire or a full-time position based on what you bring to the table. We are happy to share the URL to our private Beta site, which was launched at RootsTech and is currently open to a select community.<p>Apply by emailing your resume to jobs@reelgeniefilms.com","time":1364853488,"type":"comment"}