{"by":"hiring_m3d","id":5476299,"parent":5472746,"text":"San Fransico<p>Measur3D is looking for a physical simulation programer.  Our team is actively seeking an experienced Physical Simulation Programer to be the first hire for our Fabric Simulation Team.  The Programmer will be responsible for implementing a production version of a high performance fabric model described in paper1 (<a href=\"http://graphics.berkeley.edu/papers/Wang-DDE-2011-08/Wang-DDE-2011-08.pdf\" rel=\"nofollow\">http://graphics.berkeley.edu/papers/Wang-DDE-2011-08/Wang-DD...</a>) &#38; paper2 (<a href=\"http://graphics.berkeley.edu/papers/Narain-AAR-2012-11/Narain-AAR-2012-11.pdf\" rel=\"nofollow\">http://graphics.berkeley.edu/papers/Narain-AAR-2012-11/Narai...</a>).  You will be starting with a 'research code' implementation of the fabric model and be directly working with the people who created the model.  The fabric simulation will be implemented in C++ and must be reliable and performant.  The candidate will have strong C++ (or C) experience as well as a strong math background.  Ideally, the candidate will have experience with physical simulation and graphics algorithms.  Because the person who created model is on member of our team, we believe a candiate who loves to code and has a strong math background can be highly successful in this role.<p>Responsibilities:\nImplement physics based fabric simulation in C++ \nInteract with team to design improvements and optimizations to the current model<p>Required Skills: \nC++ or C experience and knowledge of object oriented programing - show via previous success in a large project.\nStrong Math background - at the level of BS in Math, Applied Math, or Physics - must be comfortably implementing algorithms. \nStrong Linux development experience: git, gdb, ldd, cmake/make, vim/emacs etc.\nDiscipline and determination to resolve complex problems, reformat code, debug, and optimize.\nEnjoys working with smart people on detailed technical problems.<p>Desired Skills: \nExperience with Numerical methods, OpenMP, SSE.<p>Interested?  Send us a note: hiring.m3d &#60;at&#62; gmail.com","time":1364854599,"type":"comment"}