{"by":"dougzor","id":5477595,"parent":5472746,"text":"Palo Alto, CA - full-time, SurveyMonkey, Mobile Software Engineer<p>We are seeking a seasoned mobile developer to become the <i>first hire</i> in our brand-spanking-new mobile team to help define, design and support our growing communication applications. As a developer you will work closely with other talented mobile developers and designers to drive the evolution and expansion of our current applications portfolio into new technology areas and market segments.<p>What I'm looking for:<p>* Direct experience building mobile applications for iOS and/or Android.<p>* Bonus points for building apps that enhance the user experience for a high traffic website or online property.<p>* Experience working with backend APIs and making improvements to them as necessary. We are a Python shop on the backend (Pyramid web-framework for those interested).<p>Email me (doug [AT] surveymonkey [DOT] com ) or apply via this job link if interested: <a href=\"http://hire.jobvite.com/j/?cj=oRq7Wfw4&#38;s=Doug\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oRq7Wfw4&#38;s=Doug</a><p>We also have lots of other jobs openings! Check them out and an overview of our company/culture at: <a href=\"http://www.surveymonkey.com/mp/jobs/\" rel=\"nofollow\">http://www.surveymonkey.com/mp/jobs/</a><p>About SurveyMonkey<p>=======<p>SurveyMonkey is the world's leading provider of web-based survey solutions, but there's really much more to us than that. We're a smart, passionate group of people who work hard to deliver the best survey experience on the planet, period. We do this because we believe everyone deserves easy access to the insights and information they need to make better, more informed decisions.<p>We're also proud to admit that despite our incredible growth over the past 10 years, we refuse to grow up. We are still small and nimble; everyone plays an impactful role; and when we say good ideas can come from anyone, we mean it.<p>SurveyMonkey is trusted by millions of customers, including 99% of the Fortune 500, as well as other businesses, academic institutions and organizations of all shapes and sizes. In any given month, we collect more than 40 million survey responses from people in all countries around the world.<p>If this sounds like home to you, and you're ready to make your work matter to millions, we'd love to meet you.","time":1364874619,"type":"comment"}