{"by":"thetron","id":5477572,"parent":5472746,"text":"Melbourne or Sydney, Australia - involved.com.au<p>With a content-first approach, we develop bespoke digital experiences for some great clients – from global travel and tourism companies to local boutique arts- and media-based clientele – including a long-established interface research relationship with University of Melbourne. We design and develop eCommerce sites, custom CMS-driven sites, Android/iOS apps, digital campaigns and much more. Our clients are Australian, Asia Pacific and UK based, we’re open source and proud, in love with Ruby and all things mobile, and enjoy helping good people futureproof their digital presence. Our flat structure and open communication encourage contribution from every level.<p>We’re looking for…<p>An experienced front-end developer to join us in Melbourne, working closely with our design team and technical director. Someone that’s adept at crafting high quality user experiences for desktop and mobile, with at least a couple of years experience in a similar role. A team player, that quickly becomes instrumental in every project, from inception to delivery, as we firmly believe in a collaborative, inclusive approach to our projects.<p>You’re ideally...<p>* a lovely person, committed to continual learning and sharing;<p>* passionate about great web experiences, quality design and fanatical detail;<p>* experienced in building nice things for appreciative clients and end-users;<p>* equally happy to contribute to client workshops and design sessions, as you are getting stuck into serious code;<p>* established and active in the development community, with a GitHub profile we can have a poke at;<p>&#38;&#38;<p>* you.skills.include?(“Ruby”) == major_bonus_points<p>We offer...<p>* a lovely little studio space in the heart of Collingwood, with top coffee at arm’s length;<p>* a busy but relaxed, friendly environment with constant music and no politics;<p>* the chance to work with some major brands, on influential projects that matter;<p>* a great salary, negotiable dependent on prior experience;<p>* a realistic approach to working hours and life balance;<p>* the opportunity for personal growth through attending relevant conferences and workshops.","time":1364874111,"type":"comment"}