{"by":"measlyweasel","id":5532205,"parent":5472746,"text":"CARFAX provides trusted information that helps millions of people buy and sell used cars with more confidence. At CARFAX, we’re at our best when we’re growing, and we believe the same is true of the people who work here. That’s why we invest in the growth of our employees and offer rewarding, creative, fast-paced work, as well as many other opportunities to challenge you.<p>Why you want to work for Carfax: - Your high energy, entrepreneurial spirit will be appreciated<p>- You work well in an environment that is chaotic at times<p>- Team dynamics are important to you<p>- You are comfortable being yourself at work<p>- You thoroughly know and have created useful projects in a high-level language such as Java, Groovy, Ruby or Python<p>- You particularly like technologies whose names start with 'G' ( our main stack involves Groovy, Gradle, Grails and Git)<p>- You've got a solid knowledge of at least a few of the following: HTML5, CSS3, Javascript/CoffeScript/jQuery, Web Standards, MVC architectures, RESTful/Service Oriented Architectures, Spring, Oracle, Mongo, RabbitMQ, Continuous Integration, TDD.<p>- We love messing with the latest and greatest technologies and will send you to conferences/training to find out more about the state of the art<p>- We promote a teaching environment even when it requires us to slow down<p>- Personal Dev time every Friday afternoon, work on your own projects, many devs here own/run productive side projects<p>- Agile/XP flows through our veins, we are meta about this probably to a fault. We pair program, use TDD, and we frequently review agile concepts and their application to our work flow<p>- Comfortable work/life balance, excellent benefits, competitive salary and bonus program<p>- We like to have FUN at work -- lots of events and team building (zombie paintball, annual paper airplane contest, musical chairs competitions for extra vacation days, theme dinners, SWAG, parties, the list goes on and on...)<p>We want developers that are comfortable learning new technologies and really diving deep into optimizing our existing stack. If you can be a top notch contributor on our team then please apply at <a href=\"http://jobvite.com/m?3YUpHfwI\" rel=\"nofollow\">http://jobvite.com/m?3YUpHfwI</a> and we'll get back to you as fast as we can","time":1365691156,"type":"comment"}