{"by":"kbmax","id":6653684,"parent":6653437,"text":"HTML5 Javascript Developer - Virtual Office - REMOTE\n<a href=\"http://www.kbmax.com/company/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.kbmax.com&#x2F;company&#x2F;careers</a><p>The Culture<p>KBMax is a rapidly expanding software &amp; services company based in Austin, TX with technology centers in the Bay Area and Parma, Italy.  Our product configurators automate the design and quote process for custom manufactured products around the world.<p>Our virtual office model requires professionals who understand communication, accountability, and teamwork.    We succeed because our people are responsible to each other and care about the company.  This entrepreneurial attitude is important to our culture and is built into compensation packages for appropriate employees.<p>The work includes occasional travel to customer sites in the US and Europe.  These trips provide great opportunity for the KBMax team to bond while exploring local and corporate cultures.  We also provide a yearly two day off-site in Wine Country to encourage team building.<p>Our employees are at their best when happy and rested.  Four weeks paid vacation is standard for new hires with flexible scheduling for personal and sick days.<p>The Position<p>You will telecommute with periodic meetings at our San Jose offices and occasionally travel to customer sites in the US and Europe.  We will consider exceptional applicants located anywhere. Salary and benefits will be competitive based on experience level with potential for equity in company based on performance.<p>As a KBMax developer, you will utilize your mastery of HTML, CSS, and Javascript to engineer the front-end of our next generation cloud-based configurator platform.  You will utilize current and powerful technologies like AngularJs and LESS to develop new and creative user experiences.  Your work will require a focus on collaboration, accessiblity, and globalization, and will be used on a myriad of devices (desktop, tablets, mobile).<p>You will be flexible and adaptive in your work, and have a strong and persistent desire to learn. As you become comfortable at KBMax, you will be encouraged to grow and expand your horizons.  We have many fields of expertise for a developer to expand into, including 3D (WebGL &amp; CAD API’s), Enterprise Software Integration (Salesforce.com, ERP), Web APIs, Cloud Architecture, Databases &amp; Search (Lucene).<p>You will be comfortable talking to customers, demoing your work in front of small audiences, and speak fluent English.  Communication is paramount at KBMax.<p>Please be prepared to present a strong portfolio of work during the interview process.<p>Responsibilities<p>* Architect, develop, maintain and test our next generation cloud configurator platform\n* Collaborate with a small team of developers in a fast-paced agile environment\n* Engage with KBMax engineers and customers for feedback, feature requests, and solutions<p>Required Qualifications<p>* BA&#x2F;BS or equivalent experience\n* Languages:  HTML5, CSS3, Javascript, LESS or SASS\n* Libraries: AngularJS, JQuery<p>Extra Points for Experience in...<p>* 3D Development using WebGL\n* Enterprise Software Integration (CRM, ERP)\n* TSQL\n* ASP.NET Web API (C#)\n* Visual Rule Languages<p>How to Apply<p>Interested parties please send resumes and highlight matching qualifications to jobs@kbmax.com.   Please include expected salary ranges.   Outsourcing development companies and non-US work eligible applicants need not apply.","time":1383313894,"type":"comment"}