{"by":"kentf","id":6653835,"kids":[6653855],"parent":6653437,"text":"Toronto, Canada - Full-Time Test Engineer @ Top Hat<p>Top Hat builds software for modern educators to help them make every lecture count.  We have over 350 universities and colleges using our software with over 100K active students. This is high impact stuff!  You excited yet? Good, keep reading...<p>We are looking for a Test Engineer!<p>Why: Because we are a rapidly growing dev team &#x2F; company and are looking to make sure that our QA team has the proper resources to keep the app running without bugs and showstoppers.<p>- We are looking for a smart, motivated person that can learn and adapt quickly (Obviously)<p>- We are all about automation, so you need to have at least a few years of automated testing experience (through work or personal projects.)<p>- You will need to wear your management hat to manage the testing team to produce superior automated tests<p>- Write and maintain integration tests in Python using Lettuce<p>- Write and maintain a load testing framework.<p>- Manage the complexity of testing infrastructure and focus your efforts on the important things<p>- Evolve our current Continuous Integration system to be more robust<p>- Gather data from production systems to diagnose undiscovered problems<p>- Be really passionate about testing and know how important it is!  We are looking for someone pro-active not re-active<p>What&#x27;s cool is that our client side app is built on a fairly sophisticated JavaScript framework and makes use of JQuery, backbone.js, and all the usual suspects. The server side is written in Python on Django, with a MySQL database. In addition we use Node.js and SockJS for our real time components. Our systems all run on Amazon web services.  We have a lot of moving pieces!  Hence, why we need YOU!<p>We think the best sign of a good Test Engineer is interesting projects they&#x27;ve done on their own time, not just things they were assigned by their boss or in university. So please showcase any cool side projects, open source contributions or community involvement.<p>Some cool things make that Top Hat pretty awesome:<p>- Outstanding company culture, with a team that is super smart, highly motivated &amp; stoked to be a part of a company that is changing the face of education.<p>- Our investors&#x27; portfolio companies include Salesforce, Yammer &amp; box.net. We&#x27;re in good hands and in good company.\n- Competitive health and dental benefits<p>- We are looking for people who want to grow with us and are in it for the long haul.<p>- We are one of the top education technology companies in North America (named one of the Top 50 Companies to Watch by Deloitte Consulting)<p>We also have a Top Hat! Yes! A real one that you can wear.  I know... we think it&#x27;s pretty special too.<p>-------------<p>Send your applications to matt (at) tophat dot com<p>Hit us up on Twitter too @tophat","time":1383315123,"type":"comment"}