{"by":"shocks","id":6653987,"parent":6653437,"text":"Yearbook Machine - London, UK (Shoreditch) - Graduate &#x2F; Junior PHP Developer<p><a href=\"http://yearbookmachine.com/jobs/graduate-php-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;yearbookmachine.com&#x2F;jobs&#x2F;graduate-php-developer</a><p>Yearbook Machine is a fast-growing technology startup company, supplying leavers&#x27; yearbooks to schools and universities across the UK and Europe. Since being founded in 2009 by recent Cambridge and UCL graduates who noticed a gap in the market when making their own leavers&#x27; yearbook, we have had considerable success: over the past two years our sales have grown more than tenfold and we are now the market leader in the UK. After a particularly successful academic year in 2012-2013, we’re expanding our development team and are now looking for an ambitious Junior &#x2F; Graduate Developer to help us to continue to grow.<p>Your job will involve working on many different aspects of our software and technology systems. We’ve managed to automate a highly complex design process, allowing us to create customised book layouts at the push of a button. This has involved bringing together many of the latest and most exciting software technologies and combining them in new ways to build a genuinely innovative piece of engineering. While we won’t expect you to understand it all straight away, you’ll be given the freedom to work on whichever parts of the system most interest you, and will be supported by the rest of the development team in learning the best practices of modern software engineering. This will include opportunities to get involved with: front-end development using the latest OOP JavaScript frameworks, back-end development, DevOps and automated server provisioning using Chef and Vagrant, automated testing, continuous integration and automated layout design.<p>Working at Yearbook Machine is not the corporate grind: we’re a small group of like-minded, focused individuals working to create a product we genuinely believe in. We work hard but our environment is relaxed and friendly. Our office is based in a light and airy converted warehouse in central Shoreditch, which we share with another design startup. We&#x27;re currently a team of just 6 people, 5 of whom are developers.<p>Requirements<p><pre><code>  - 2:1 above in Computer Science or other similarly technical degree subject\n  - Experience with OOP and at least some knowledge of modern software development paradigms such as MVC\n  - A genuine passion for technology: we’ll be interested to see what you’ve been doing in your spare time!\n</code></pre>\nBenefits<p><pre><code>  - Highly competitive, above-market salary\n  - Generous stock options\n  - The best equipment: Your choice of computer and monitor(s) and a comfortable chair\n  - Job satisfaction: we make a product that is fun to build and that our customers love!\n</code></pre>\nTo apply, please email your CV and cover letter to jobs@yearbookmachine.com with the subject “Graduate &#x2F; Junior PHP Developer”","time":1383316438,"type":"comment"}