{"by":"ryeguy","id":6653559,"parent":6653437,"text":"North American Bancard<p>Company Overview:<p>North American Bancard is a privately held multifaceted payment solutions provider. Our team of 750+ employees within NAB and affiliate entities facilitate the processing of electronic payments for over 180,000 merchants nationwide. The launch of our mobile POS solution, Pay Anywhere, has enabled us to remain on the forefront of technology and meet the evolving needs of our customers.<p>This position offers a competitive salary, based on experience, medical, dental and optical insurance and 401K. NAB has been selected as a Best &amp; Brightest Wellness Champion, as we offer healthy vending options and reimbursements for race participation. We also receive discounts on cell phone plans, online retailers, vacations, entertainment tickets and much more!<p>About us:<p><pre><code>    - We practice agile development using scrum.  \n    - Flexible work hours.  \n    - Laid back environment (casual dress, open floor plan, lan parties, etc)  \n    - Headquartered in Troy, MI.  \n    - We just moved into a new space with a pretty cool design, check it out:\n      http:&#x2F;&#x2F;i.imgur.com&#x2F;mft0wbR.jpg  \n</code></pre>\nTechnology stack:<p><pre><code>    - PHP 5.3+\n    - Symfony 2 and Doctrine 2 for most new projects\n    - Postgres\n    - RabbitMQ\n    - Git and SVN (SVN is on its way out here)\n</code></pre>\nTechnical goals:<p><pre><code>    - Move to a service oriented architecture, using RESTful web services for our\n      internal systems.\n    - Rewrite and rework some of our older systems, improving user experience and\n      code modularity.\n</code></pre>\nYou should:<p><pre><code>    - Have experience writing PHP applications in MVC style.\n    - Have experience working with large enterprise-level codebases. \n    - Follow excellent object oriented design principles.\n    - Have experience with unit&#x2F;integration testing, or at least be familar with it.\n    - Believe that refactoring is an integral part of development.\n    - Be able to write complex SQL queries as well as understand ORMs.\n    - Be able to work on-site in Troy, MI.\n</code></pre>\nOther beneficial skills:<p><pre><code>    - Experience working in a PCI-DSS compliant environment\n    - Experience with service-oriented architecture\n</code></pre>\nPositions:<p><pre><code>    - Sr. PHP Developer\n    - Web Services Developer\n</code></pre>\nEmail your resume or questions to rlepidi@nabancard.com","time":1383312898,"type":"comment"}