{"by":"wkm","id":6653533,"kids":[6657469,6654316],"parent":6653437,"text":"Square — NYC <a href=\"https://squareup.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;squareup.com&#x2F;</a> ---<p>Square! In October 2012, we acquired the design firm 80&#x2F;20 and have had New York based colleagues for some time now. Our logical next step was to bootstrap a NYC Engineering presence to tap in the growing community here. We just started building the Engineering team in July.<p>As a company, we have four main focuses.<p>Go international. We&#x27;re adapting what made us successful in the US abroad. This is harder than typical international plays since it requires translating our four major benefits to small merchants: 1. Shipping readers, 2. Card payments (physical world is much more complex than online), 3. Sending money quickly to our merchants, a.k.a. settlement: very localized and next-day is hard on a number of fronts), 4. Assessing risk of merchants as they sign up, aka underwriting: again, very localized most countries do have FICO scores, SSN, D&amp;B numbers and such.<p>Move up market. One of the biggest success of Square is to have enabled merchants who were &quot;non-consumers&quot; to start accepting credit cards. In classic disruptor fashion, we have essentially alonged the long tail. We haven&#x27;t been eating someone else&#x27;s lunch, we&#x27;ve created a whole new category! Now it&#x27;s time to move up to bigger merchants.<p>The other side of the counter. With Wallet, Square Market (<a href=\"http://squareup.com/market\" rel=\"nofollow\">http:&#x2F;&#x2F;squareup.com&#x2F;market</a>) and Square Cash (<a href=\"http://squareup.com/cash\" rel=\"nofollow\">http:&#x2F;&#x2F;squareup.com&#x2F;cash</a>), we&#x27;re going on the other side of the counter and interacting directly with consumers. We think that we can provide the best experience for consumer-to-merchant and consumer-to-consumer commerce. We&#x27;re at the infancy, but extremely well positioned to succeed.<p>Data as product. We&#x27;re leveraging our data. We know a lot about our merchants: daily sales, seasonality, growth of their business, correlation with other events (e.g. Mapping Square Payments During the Super Bowl). Lots of innovative products are in the making which will highlight the breadth of what we do.<p>In NYC, we&#x27;re starting with a focus on infrastructure, distributed systems, and money moving systems. We&#x27;re a small team, located in SoHo, and defining the culture of engineering for Square on the East Coast.<p>If you&#x27;re interested; I&#x27;d love to chat. Shoot me an e-mail with your resume! seantabor@squareup.com","time":1383312702,"type":"comment"}