{"by":"walcott","id":6654126,"parent":6653437,"text":"eCommHub (Atlanta, GA, USA) | <a href=\"http://www.ecommhub.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ecommhub.com&#x2F;</a><p>We&#x27;re an eCommerce automation platform looking for engineers to help us build our architecture out and scale a quickly growing SaaS product, and join our small team and new office in Atlanta, GA.<p>Our stack is Ruby on Rails and PostgresDB, with a bit of NodeJS. We also do a ton of different API integrations, so experience working with or writing APIs is a big plus.<p>We&#x27;ve got a laid back environment with free donuts and snacks, but work hard to fulfill aggressive goals. At the same time, we&#x27;re a close-knit crew. We also offer flexible working hours, competitive salary and equity packages&#x2F;stock options,\nhealthcare and insurance options, as well as an allowance for tech gear you might need.<p>We&#x27;re looking for two positions:<p>(1) Senior Tech Lead\nRequirements:<p>- Experience organizing and leading dev teams<p>- Extensive background in Ruby and Rails<p>- Comfortable collaborating with marketing, sales and management team.<p>- Experience supporting live production infrastructure, can put out fires under pressure when things go wrong<p>- Exposure to architectural patterns of a large, high-scale web application<p>- Experience migrating and scaling large amounts of data<p>- Experience designing, implementing, deploying, and maintaining complex online applications<p>- Strong database design experience<p>- Proficient in API Design or integration<p>(2) Backend Engineer\nRequirements:<p>- A love for solving complex problems with by combining tools from your diverse skill-set<p>- Experience building web applications<p>- Familiarity with relational databases<p>- Write tests<p>- Can balance scrappiness and long-term code maintainability<p>- A love for tinkering with new technologies and frameworks<p>- A personality that strives for self-improvement in every aspect<p>- A love for startup environments that would push us to move even faster<p>Send us an email with your resume (and Github if you have it) to careers@ecommhub.com.","time":1383317479,"type":"comment"}