{"by":"yannyu","id":6654563,"parent":6653437,"text":"LucidWorks ( <a href=\"http://www.lucidworks.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.lucidworks.com</a> ) - main office in Redwood Shores, CA with remote workers all over the place.<p>&quot;LucidWorks is the commercial company behind Apache&#x2F;Lucene Solr, the world’s leading open source search platform.LucidWorks is an Equal Opportunity Employer M&#x2F;F&#x2F;D&#x2F;V.These cutting edge technologies power critical search apps at thousands of websites and enterprise apps large and small – including Netflix, IBM, Twitter, LinkedIn, and dozens of other household names. Our team includes leading contributors and committers to the Lucene project, as well as experts in enterprise search, distributed computing and scalability. Be part of this exciting technology story and work with many of the Lucene&#x2F;Solr committers!&quot;<p>In other words, we do a lot of work with helping companies implement search as well as processing and analyzing &quot;big data&quot;, whatever that might mean to a customer.<p>Our engineering team consists of 15-20 of the committers to the Lucene&#x2F;Solr project, including our founders Erik Hatcher and Grant Ingersoll. Erik is known for writing one of the definitive books on Solr, as well as working with libraries all over the world to implement better search. Grant Ingersoll has written a few books himself and is a co-founder of the Mahout open source project, and an overall fount of knowledge relating to machine learning.<p>We&#x27;re looking for engineering types that would be interested in development or consultant roles, and have experience with enterprise search. Solr&#x2F;Lucene experience of course would be ideal. Experience with Java development is a huge plus, and even more bonus points if you already contribute to open source.<p>We&#x27;re also hiring for support and UI positions, again people with enterprise search backgrounds are preferred for those roles.<p>Please contact me at yann.yu@lucidworks.com if you have any questions, concerns, feedback, resumes, etc.","time":1383321039,"type":"comment"}