{"by":"amiramir","id":6654283,"parent":6653437,"text":"New York City - Thingi (working title)<p>Fulltime Hardware and Software Positions in NYC (Chelsea&#x2F;Flatiron)<p>Be the one of the first engineers at a Samsung-backed hardware startup<p>Thingi is a startup at The Samsung Accelerator in NYC and we are hiring full-time engineers. This is an opportunity to jump in at the start of a project and do influential, fun, and rewarding work, which will get noticed quickly.<p>You want this job if you are after a non-trivial technical challenge, a startup environment and the ability to help shape and deliver a new consumer product. You&#x27;ll be working with a small team of product designers and software engineers and hardware engineers to build a reliable, elegant and clever mobile accessory from scratch. As a team we need to prototype and take to production a system that involves consumer hardware, signal processing, data analytics and user interface. We don&#x27;t have any boring jobs and if I could clone myself and simultaneously become a tech genius, I would apply.<p>Samsung Accelerator is a place for entrepreneurs and inventors to do good work in an aesthetically pleasing, friendly and respectful environment. You will be around a lot of other bright people working on many other products. It&#x27;s a collaborative place to work where you&#x27;ll get exposed to all kinds of ideas.  And there are snacks.<p>On the software side, we like Python, Go, C and Clojure. We think that well-tested code is better code. We understand that Objective-C, Javascript and Java are the tools of the trade on certain platforms and do are best to create elegant and reliable high-performance software with them. On the hardware side we are likely using Bluetooth Low Energy and UWB in ultra-portable form factors. We are concerned with power consumption, size, wireless range and durability.<p>We’d prefer to hire you as a full-time employee (with benefits) but we can also hire you as a contractor if you’d prefer.<p>Specifically we are looking for first engineer in each of the following areas:<p>- Electrical Engineering&#x2F;Hardware Design and Prototyping\nYou&#x27;ll perform system architecture, specify parts, layout the circuits, work on firmware and oversee production.<p>- Mechanical Engineering&#x2F;Design and Prototyping\nYou&#x27;ll perform design for mechanical packaging, power and work with electrical engineers to oversee production.<p>- Software Engineering&#x2F;Signal Processing\nYou&#x27;ll perform software architecture, algorithm development, rapid prototyping and production code.<p>- Software Engineering&#x2F;UX Development\nYou&#x27;ll perform rapid prototyping, web development,  mobile app development and production code.<p>Please send inquiries to jobs@thingi.co and include a résumé, references and descriptions of any relevant projects.","time":1383318738,"type":"comment"}