{"by":"jdmargulici","id":6654448,"parent":6653437,"text":"Oakland, CA - Director of Engineering at Geospatial Startup<p>Vehicle Data Science Corporation is looking for a Director of Engineering to lead design and implementation of software that processes and analyzes big spatial data sets. The company is an early-stage startup located in Oakland’s Rockridge neighborhood with initial funding from a National Science Foundation grant and a major automobile client. We use location data from vehicles to derive driving behaviors which we capture in a proprietary database. This database feeds applications in the areas of driver safety, fuel economy and autonomous vehicles.<p>We are looking for a smart, adaptable individual with plenty of skills and breadth in computing to build products from our data streams. By joining us today, you get a unique chance to engineer new technology from the ground up. Working in tandem with the company’s CTO, you will tackle both back end infrastructure and a web front end. Initially, the position will primarily involve hands-on coding and systems administration, but it can evolve toward more supervision and&#x2F;or architectural work as we grow, based on your inclinations.<p>Our current systems are built 100% in Python, with a PostGIS database in the back end. Our roadmap includes two key tasks that the Director of Engineering must be equipped to lead:\n* Take the back end to the next level by splitting it into multiple databases that each fulfill a specific purpose, and shard our primary data warehouse so it can handle tens of terabytes. The choice of technologies is still to be determined, so a broad range of experience with distributed systems and nosql databases is desirable;\n* Build an interactive web front end that dynamically displays geospatial data, in the form of both maps and charts. We are looking for a track record delivering interactive web applications, experience with web maps, and good programming skills both server-side and client-side.<p>Individuals who are creative, honest, open-minded, enterprising, kind and attentionate to details will fit our team the best. The project is incredibly fun and innovative, addresses major societal challenges in the areas of public health and sustainable development, and eyes a huge market opportunity. Come help us grow the company you want to be a part of!<p>To reach us, e-mail: contact@VDS-corp.com","time":1383319935,"type":"comment"}