{"by":"mikeryan","id":6654693,"parent":6653437,"text":"<i>Technical Director - San Francisco</i><p>A Different Engine is looking for a Technical Director who will work with our design and development teams in building applications across a variety of platforms.  We&#x27;re looking for someone who can work directly for our Managing Director (and current Technical Director) and Founder who can mentor and manage a 5 - 10 person development team.  This role will work with our producers to keep projects on track as well as provide technical leadership.  While we do need candidates who can manage a team, we expect most of the TD&#x27;s time to be spent writing code.<p>A Different Engine is looking for a software craftsmen who take the vision from our design team and turns it into a reality for our clients.  We’re looking for folks comfortable across a variety of languages, platforms and frameworks, who can code, and get things done regardless of language. Our primary development work is done in JavaScript however we frequently need to build quick and dirty tools for our clients to host, or their existing CMS (Drupal a lot) so PHP is frequently used however we also have an affinity for frameworks such as Ruby on Rails, Django&#x2F;Python and Nodejs&#x2F;Express when we can choose the full stack.<p>We are an interactive agency which means we build applications for our clients. Unfortunately this frequently forces us into more of a &quot;Waterfall&quot; development methodology.   We&#x27;re trying to address this by using Agile and iterative methodologies as much as possible.  From a management perspective we&#x27;re looking for folks who have experience with using and adapating agile practices to less then agile projects.<p><i>Skills &amp; Requirements</i><p>Gets thing done. We need someone who can help get our applications built and QA&#x27;d and out the door for our clients.<p>Someone self-motivated with an eye towards getting applications over the finish line.<p>Smart and solves problems.   As a company our best asset is the ability to solve our clients problems. We’re known for this, you should be known for it too. Creative problem solvers are our best employees.<p>Not afraid, and knows how to learn new technologies and stacks.  Look we frequently get stuck with a development kit for a new platform, in a language which we don’t know with some bad docs which have been poorly translated from another language and a project that needs to be done.<p>Understand the art of programming.  Can you architect a solution that is scalable and clean?  Do you understand what makes a good library? Are your apps future proofed?<p>Understand the qualities that make for a good user experience and able to work closely with design teams on the usability of our apps.<p><i>About A Different Engine LLC</i><p>A Different Engine is a interactive agency with offices in San Francisco and Brooklyn. We specialize in developing for emerging platforms like Mobile Devices, Gaming Consoles, and Connected TVs for large media brands such as the UFC, Warner Brothers, Showtime and Starz.   Our San Francisco office is a cool brick and timber space right on the edge of SOMA and the Financial District on Mission between 3rd and New Montgomery.  Our Brooklyn office is in DUMBO in a spacious well lit loft.  We&#x27;re a small team and while we&#x27;re not a start up we try to foster that kind of atmosphere and team.  We provide a lot of room to grow as a developer and, we turn over projects quickly so you&#x27;ll get a lot of variety with respect to the scope and nature of projects and technologies.  We&#x27;ll set you up with the tools you need and you won&#x27;t get stuck iterating on the same code base over and over.  We like smart, creative and fun folks. Join Us!<p>You can email us at jobs@adifferentengine.com with any questions. My email if you want to reach me directly (I&#x27;m the founder) its in my profile.","time":1383323901,"type":"comment"}