{"by":"nlavezzo","id":6654824,"parent":6653437,"text":"Software Engineer - FoundationDB - Washington, DC or Boston Metro Area<p>FoundationDB is currently seeking exceptional developers to join our growing team. In this position you will help us continue to build the next generation of transactional database technology. You will work with a team of exceptional engineers with backgrounds from top CS programs, research fields, and successful startups. We don’t just write software, we build our own languages, simulations, and state of the art tools to write better software.<p>Desired Skills and Experience<p>Key Responsibilities:<p>Working closely with other development team members on core and layer development.<p>Thinking about high-level and long-term implications of design decisions<p>Taking significant ownership in projects<p>Doing a significant amount of actual coding each day<p>Contributing to our dynamic entrepreneurial environment<p>Required Skills:<p>A good attitude, friendly personality, and strong work ethic<p>Strong systems programming experience<p>A high level of interest in software engineering and computer science<p>located in the Washington DC or Boston Metro areas, or willingness to relocate<p>US citizenship or a green card<p>Beneficial, But Not Required Skills:<p>Experience working on large software development projects<p>Proficiency in C++<p>Experience with distributed systems development<p>An interesting portfolio of side projects that show you enjoy solving problems<p>Experience interacting with users<p>Strong verbal and written communication skills<p>Location:<p>We have positions available in the following locations:<p>Washington, DC &#x2F; Tysons Corner\nCambridge, MA<p>We are well-funded and offer a competitive salary. This position will also receive equity compensation in the form of employee options, so you can share in the company’s success as we grow. We provide a full medical and dental plan (BCBS PPO) and long and short term disability insurance.<p>How to Apply:<p>If you’re interested in this position, please send an email to developerjob@foundationdb.com.","time":1383324864,"type":"comment"}