{"by":"navneetloiwal","id":6654119,"parent":6653437,"text":"Shopular (shopular.com) - Palo Alto, CA<p>Shopular&#x27;s mission is to create the most delightful and effortless experience for saving money while shopping. The iOS and Android apps have over 11,000 reviews and widely loved. Time featured Shopular as one of the 50 Best iPhone Apps of 2013. Shopular is backed by Y Combinator and Sequoia Capital. We are a small, tight-knit team of four high-caliber engineers from Google, Shopkick, Ooyala and Loopt.<p>We are growing the engineering team and looking for experienced and eager individuals who share our passion for creating consumer experiences that just work. You will get to start at the ground floor at a startup that has received significant backing.<p>Our stack: iOS&#x2F;Android, Python, Postgres, Redis<p>* iOS Engineer\n  Master of iOS with significant prior experience building beautiful consumer-facing app(s) with a large number of users. You have built complex apps from scratch. When needed, you are comfortable jumping into the backend (python or ruby experience preferred) to build features to support the app.<p>* Android Engineer\n  Master of Android with significant prior experience building consumer-facing app(s) with a large number of users. You have built complex apps from scratch. When needed, you are comfortable jumping into the backend (python or ruby experience preferred) to build features to support the app.<p>* Backend Engineer\n  You can handle the entire backend stack including the DB, production app servers, web servers, caching. You have built systems with significant scale and low latency performance. You have deployed and maintained servers, built DB schemas to scale, used effective caching for performance, handled high throughput systems. You will lead the entire backend.<p>* Full-Stack Engineer\n  You are a go-getter, fast learner, get-work-done engineer. You love new challenges and find creative solutions for problems. You are comfortable building features in the backend, to creating web UI using JS&#x2F;HTML.<p>* Data Analyst\n  You love playing with data to squeeze the right insights from it. You are an expert at SQL and scripting languages to gather and massage the data.<p>* Product Designer\n  You have experience building mobile app interfaces. You are full-stack and can handle interface and UX design and also the visual design. You strive to build the most clean and delightful UIs that can improve lives of millions of users. You stress about every part of the UX and every pixel of the UI.<p>All roles require strong prior experience. If you have been looking for an early-stage startup opportunity where you can create a significant impact and be part of a stellar team, we may be the right fit. Lets talk more!<p>Join us in our quest to transform physical retail and create the most intuitive consumer experiences. See more at shopular.com and we look forward to hearing from you at join@shopular.com","time":1383317420,"type":"comment"}