{"by":"lightsidelabs","id":6654807,"parent":6653437,"text":"LightSide - Pittsburgh - Full-Time Frontend Developer<p>We&#x27;re hiring an experienced web developer for a full-time position building rich frontend applications, powered by our machine learning backend. The platform will aim to help teachers assess student work, such as essays or journals, and improve student writing through feedback during the revision and editing process.<p>Our web services are built in Python using the Django framework, and our backend is powered by state-of-the-art machine learning implemented in Java. Our team has a strong technical background and a history of work in education. In this position, you’ll be implementing a rich web application using client-side frontend frameworks. Your role will be to bridge the gap between our RESTful API for writing assessment and our wireframed user workflows for student and teacher access to these tools.<p>This job will be highly collaborative in an early-stage, self-funded and profitable startup. Your primary responsibilities will focus on frontend development, but you’ll occasionally dive into our Python web services and collaborate on defining our user workflows including UX and visual design. Dependent on interest and experience, you may be asked to contribute to the Java machine learning software that powers our platform.<p>No experience with machine learning or natural language processing is necessary or expected, but you need to be eager and interested in finding out how those tools work and how they can help students and teachers. You’ll be working under the guidance of experienced researchers from Carnegie Mellon’s Language Technologies Institute and Human-Computer Interaction Institute.<p>We prefer an on-site employee at our office in Pittsburgh, PA, but may make exceptions for an outstanding candidate. Compensation will be competitive and based on experience.<p>Skills and Requirements<p>Ideal candidates will have an active interest in educational technology, are interested in using machine learning for real-world benefit, and have prior experience including the following:<p>* Rich web application development using JavaScript frameworks like Angular, Ember, or Backbone.<p>* Web layout and implementation of frontend page design using HTML and CSS.<p>* Designing and working with RESTful APIs providing complex functionality to frontend applications.<p>* Agile development on a small, dynamic team.<p>You might also bring other wonderful things to the table, such as:<p>* Experience with deployment and continuous integration on Amazon Web Services or another cloud host.<p>* Live support and operations management for large-scale customer-facing web services.<p>* Development experience for web MVC frameworks, especially using Python with Django.<p>* A background in educational technology or enthusiasm about helping people improve their writing.<p>* Prior real-world experience with machine learning applications.","time":1383324759,"type":"comment"}