{"by":"petar","id":6654385,"parent":6653437,"text":"NYC and Washington, DC.\nFull-time and internship.<p>The Go Circuit (<a href=\"http://gocircuit.org\" rel=\"nofollow\">http:&#x2F;&#x2F;gocircuit.org</a>) is hiring Systems Engineers.<p>Original job posting: <a href=\"http://blog.gocircuit.org/job-system-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.gocircuit.org&#x2F;job-system-engineer</a><p>PROJECT<p>The Go Circuit is a development, distribution and execution environment for a new generation of self-sustained distributed applications. The circuit is built almost entirely in the Go language with occasional appearances of C and C++. It spans the entire lifecycle of an application, from development to execution and sustanance. It comprises technologies like compilers, interpreters, optimizers, low-level operating system management, distributed resource sharing, information flow, security, and many others. The Go Circuit is, by design, open source.<p>The goal of the circuit is to enable the possibility of encoding an entire Internet company&#x27;s infrastructure in a single executable, which can be revived with a single click on an ice-cold cluster of empty hardware and can sustain itself indefinitely, without human involvement, short of the requisite replacement of hardware now and again.<p>The demonstrated, over the past year, power of the circuit environment has compelled industry, academic and government institutions to sponsor the project and become involved with large-scale deployments. We are, henceforth, expanding.<p>RESPONSIBILITIES<p>Full-time and internship candidates have identical responsibilities.<p>Systems Engineers will work alongside the founding system architect on all aspects of the technology: design, implementation, testing, fixing bugs, writing integration drivers, documentation and research. All of their work will be open-sourced. Almost all code will be written in Go, however, other languages like Python, C, C++, Lua, JavaScript, etc. will make a presence.<p>System Engineers will be researchers as well. In designing the semantic and linguistic interfaces of the circuit, we investigate past and present, scientific and industrial, literature and software on a wide range of algorithmic topics to help us inform and verify our choices.<p>QUALIFICATIONS<p>The ideal candidate, full-time and internship, would meet the following criteria, or demonstrate an equivalent level of technical sophistication:<p>* Full-time candidates should have B.A.&#x2F;B.Sc., M.A.&#x2F;M.Sc. or Ph.D. in some hard science. Internship candidates, who are near the completion of their studies towards the mentioned degrees, are also elligible.<p>* Four or more years of experience with a low-level&#x2F;systems programming language like C, C++, or Java as well as some experience in building systems, small or big alike, is quite desirable. Altenratively, a serious involvement with a more exotic concurrent or research language, like Haskell or Erlang, would work as well.<p>* Having a non-trivial open-source project (in any language) would be highly valued.<p>* Some understanding of how UNIX operating kernels and systems work on the inside. (You don&#x27;t need to be a specialist.)<p>* Knowledge of current industrial open-source technologies is good albeit not a deal-breaker. However, interest and desire to learn and hack some of them will be needed.<p>* Ability to read academic publications in Computer Science<p>Most importantly, we are looking for individuals who are able and willing to learn fast and have open flexible minds. On that note, we do not expect that you have prior Go experience, however we do expect that<p>* Candidates will come prepared to carry out the interview in Go.<p>We are not going to test your Go-intricacies skills. We simply expect that you be able to implement your solutions to our programming riddles in Go.<p>COMPENSATION<p>Compensation will vary based on experience as we welcome both out-of-college engineers and seasoned industry scientists. That said, compensation and benefits will be on par with the standard amongst institutions like Google, IBM, Microsoft and such.\nLocation<p>To apply, please, send your vitae and anything else you want to say to Petar at p@gocircuit.org.","time":1383319501,"type":"comment"}