{"by":"veritas9","id":6654417,"parent":6653437,"text":"San Francisco Bay Area - Livefyre, Adroll, Chegg, Storm8<p>We just launched Coding Challenge Billboard AD on the 101 to make things a little more exciting:) <a href=\"http://blog.codeeval.com/codeevalblog/bridgeschallenge\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.codeeval.com&#x2F;codeevalblog&#x2F;bridgeschallenge</a><p>Solve the Bay Bridges challenge and apply to all four at once. \n<a href=\"http://www.codeeval.com/bridges\" rel=\"nofollow\">http:&#x2F;&#x2F;www.codeeval.com&#x2F;bridges</a><p>###<p>Some positions open:<p>Livefyre - Mobile iOS Engineer<p>Livefyre is looking for a seasoned Mobile Developer to bring our real-time conversation platform to the next level of amazing on Apple devices.  The Mobile Developer – iOS will lead the charge of Livefyre mobile development for Apple devices – starting with our iOS SDK.  We are working with big data, thousands of customers, exponential traffic growth, and are rapidly on our way to billions of monthly page views.  This is an incredible opportunity for you to join a growing team solving extremely challenging engineering issues.<p><pre><code>    Proven ability in iOS development with 2-3 years of shipping apps\n    Expert experience with Objective-C\n    Understands iOS performance techniques\n    Other strong OO programming experience\n    Experience building rich client-side applications against HTTP APIs\n    Experience with Java and Android development is a huge plus\n    Understands UX and design principles\n    Strong grasp of CS fundamentals, algorithms, data structures, and design patterns\n    Strong familiarity with Git or similar SCM\n    Troubleshooting (especially under fire)\n    Loves writing documentation\n\n\n</code></pre>\nAdroll - Back-end Engineer<p>For this key position, you must write solid code, understand complex systems, competently evaluate scalability trade-offs (eg, disk vs cpu vs memory), and quickly troubleshoot issues. You learn fast and are excited to dig into the latest technologies. Our stack includes Python, Erlang, RabbitMQ, PostgreSQL, HBase, Hadoop, Redis and our own open-sourced solutions. More than anything, you do your best work when you have lots of freedom and can take ownership of your projects from concept to finish.<p><pre><code>    BS or MS in computer science or related field\n    Has a genuine interest in Open Source and has personal projects\n    Experience with NoSQL technologies such as Redis, Cassandra, HBase, and&#x2F;or Hive\n    Knowledge of Amazon EC2 or other cloud-computing services\n    Knowledge of Python and its libraries\n    You know how to construct a traffic light build status sign\n    Humor\n\n</code></pre>\nChegg - Senior Software Engineer, Java<p><pre><code>    Create and support highly scalable and fault tolerant java based systems.  We deal with financial transactions, so mistakes are literally costly.  We highly value test driven development.  We’re not a TDD team… yet.  You will participate in improving our team to reach TDD nirvana.\n    Our systems are designed around a plug-in architecture.  At this time our team owns the plug-in development.   The goal is to provide a platform utilized by the other engineering teams.  We want to build the platform and then get out of the way. You will help build out the missing components to make this a truly self-serve platform.\n     We’re constantly looking for ways to improve application performance.  Our systems are indirectly customer facing.  When a customer adds an item to a cart they are using our systems.  Get it working, then make it fast.  When we mention tenured vs. nursery sizing you know we’re talking about GC tuning.  Via code reviews and other feedback you’ll guide junior engineers with your performance coding experience.\n\n </code></pre>\nRequirements<p><pre><code>    Experience at an ecommerce company or other 24x7 critical operation\n    Excellent hands-on experience with java (5+ years)\n    Know and love RESTful services\n    Experience with both RDBMS ( prefer MySQL ) and NoSQL\n    Experience working in a Linux&#x2F;Unix development environment\n    Excellent problem solving and troubleshooting skills\n    BS in Computer Science or related discipline\n\n</code></pre>\nStorm8 - Software Engineer<p>Storm8 is looking for world class Software Engineer Generalists to help us develop the next generation of mobile social games! We are looking for fun, energetic software engineers who have a passion for building great products and bringing our games to life.  So, if you think you have the chops to deliver something unique come talk to us!<p>Storm8 (www.storm8.com) is the leader in social mobile gaming with an ever-growing portfolio of 40+ games across 5 brands.  We have 400+ million installs across 200+ million devices and are self-funded, profitable and have recently been chosen by San Francisco Business Times as the winner of the “Tech &amp; Innovation Award” in the “Best Gaming&#x2F;Entertainment” category.<p>Qualifications<p><pre><code>    Software Engineers that have the ability to solve complex problems with simple and optimal solutions.\n    Jedi coding abilities; writing clean, maintainable, bug-free code\n    Engineers who have the ability to learn different technologies and programming languages quickly\n    Software Engineer Generalists with experience in iOS development, Android development, web 2.0, start-up, or social&#x2F;mobile gaming a plus.\n    Strong empathy for users\n    Excellent written and verbal communication skills\n    B.S. Computer Science or equivalent quantitative field preferred</code></pre>","time":1383319757,"type":"comment"}