{"by":"timtyrrell","id":6654683,"parent":6653437,"text":"REMOTE (US) Full-Time - WellMatch (a Healthagen Business)<p>We are looking for 1 Senior QA and 2 less Senior QA. We are a full-time remote (no office exists) company with developers like myself that pair full-time w&#x2F; tmux&#x2F;vim&#x2F;skype. We use outside-in development to write the cukes and get down to business. Official job description below, but we are basically looking for some QA folks that can write some cukes with us! Shoot me an email if interested: tim@wellmatchhealth.com<p>Senior QA Engineer\nWellMatch (a Healthagen Business)<p>Summary\nHealthagen is focusing on fundamental change in healthcare and empowering people to live healthier lives.  At WellMatch (a Healthagen business), we are developing new ways to solve for challenges in healthcare and deliver convenience to consumers.<p>Ready to take part in the Healthcare Revolution?  Ready to take your existing engineering, QA, automated test skills, and software engineering methods to another level?  Ready to tell your friends that you are far from bored and working with the latest&#x2F;greatest responsive web, native, and cloud technologies and building apps that actually add value to people’s lives?  You&#x27;ll be deeply engaged in our product’s full agile lifecycle, driving test automation into existing as well as new feature development, ensuring quality across all code, and part of road-mapping future initiatives.   We need a seasoned QA engineer that has “been there and done that” and wants to be our lead resource for driving QA across our entire agile lifecycle and product development.\nKey Responsibilities\n* Work directly with Product Teams and Product Development to ensure the delivery of \n   high quality experiences\n* Decide on and educate team in use of appropriate automated testing frameworks\n* Assist in development and implementation of QA standards and continual process  \n   improvement activities\n* Perform functional, compatibility, UI, and performance testing for Web, Mobile Web, \n   and smartphone applications to identify defects, and optimize customer experience\n* Lead a team of QA Engineers and their deliverables\n* Author and execute test plans<p>Personal Attributes\n* Highly organized and detail oriented; knows how to prioritize and re-prioritize to keep \n   lifecycle moving\n* Motivated to serving in leadership role within our technology team (both local and \n   nearshore)\n* Self-starter who takes responsibility for all actionable items relevant to feature progress<p>Desired Skills\n 5+ years of Web&#x2F;Mobile&#x2F;Smartphone based software and application testing\n* Expert level of experience in RoR and Javascript testing frameworks (RSpec, \n   Cucumber, Jasmine)\n* Experience with agile methodologies and support of paired programming\n* Experience in two or more testing tools  (browserstack, Selenium, JMeter)\n* Deep understanding of Web technologies (server and browser, IE&#x2F;Firefox&#x2F;Safari, \n   JavaScript and other scripting languages)\n* Understanding of load testing methodologies\n* Meticulous attention to detail (we&#x27;re obsessed with our UI being just right)\n* Attention to UI detail and experience analysis a must\n* Strong communication and problem solving skills<p>Degree and Positions Held\n* Minimum 5+ years experience in test automation and performance testing of \n   client-facing responsive web applications and smartphone apps.<p>Job Perks\n* Competitive salary, benefits (health, dental, and life), a relaxed and creative working environment, new Macbook Pro, 27” Thunderbolt Monitor, growth opportunities, and the chance to work alongside award winning talent as well as from home for the right candidate.  Remote opportunity for the right candidate.","time":1383323846,"type":"comment"}