{"by":"MattRogish","id":6654046,"parent":6653437,"text":"NYC Full-Time - SinglePlatform (a Constant Contact Company)<p><a href=\"http://www.singleplatform.com/careers/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.singleplatform.com&#x2F;careers&#x2F;</a><p>Frontend, backend, Ops, QA, etc.!<p>(Rated as a &quot;Crain&#x27;s NYC 2013 Best Places to Work&quot;! <a href=\"http://www.crainsnewyork.com/article/20131009/SMALLBIZ/131009884\" rel=\"nofollow\">http:&#x2F;&#x2F;www.crainsnewyork.com&#x2F;article&#x2F;20131009&#x2F;SMALLBIZ&#x2F;13100...</a>)<p>We&#x27;re a small-business data aggregator charged with getting the &quot;last mile&quot; SMB data (menus, services, hours of operation, address, etc.) for all businesses in the US (restaurants, spas, salons, etc.) and providing that in an API for our publisher network (YellowPages, Yelp, FourSquare, Seamless, #{Your App}, etc.) to distribute it far and wide.<p>Our customers (small and medium sized businesses) love us and we&#x27;re taking an active role bringing them more customers - and helping them stay in business. It&#x27;s a great mission, and I hope you&#x27;ll want to be a part of it.<p>We primarily work with Node.js&#x2F;Couch and Python&#x2F;Django for our merchant tools (what the SMBs use) and AWS&#x2F;Ansible on the Ops end.<p>We&#x27;re looking for both senior and mid-level frontend, backend, ops, and QA people. Although we&#x27;re a part of a bigger company (were acquired by ConstantContact almost two years ago), we&#x27;re still a startup at heart. You&#x27;ll be a member of a small but strong product team, doing fun things, working with great people. But you won&#x27;t have to worry about whether or not we&#x27;re broke next week, won&#x27;t have to take a below-market salary, forgo awesome health insurance -- and your stock options actually have value (<a href=\"https://www.google.com/finance?q=NASDAQ:CTCT\" rel=\"nofollow\">https:&#x2F;&#x2F;www.google.com&#x2F;finance?q=NASDAQ:CTCT</a>)!<p>Feel free to drop me a line at mrogish@singleplatform.com for more info!<p>Thanks!","time":1383316847,"type":"comment"}