{"by":"kdemarest","id":6654187,"parent":6653437,"text":"Austin, TX preferred; Remote possible<p>You have written a LOT of code in your life - but it&#x27;s still fun to dive into new stuff, like websockets, nosql or Hadoop, or explore an interesting language like nodejs or ruby&#x2F;rails. You find Heroku and Cloud9 intriguing. Even twenty years later, you like how the web continues to transform the way people work and live.<p>Coding is both art and science to you, and you&#x27;re willing to share knowledge with talented up-and-coming coders, yet welcome collaboration with veteran peers from whom you still learn every day.<p>Front end, back end, or classic app coding, you&#x27;ve done it all - in a web-centric context.<p>Join our talented team at appsoma.com and help build innovative systems augmenting the Appsoma platform.<p>Skills<p>Both back-end and front-end web coding feel natural to you\nStrength with a back-end language(s) like php, nodejs, python, ruby, etc.\nComfort with practices like unit testing, CI, git, etc.\nFamiliar with web front-end technologies and frameworks\nYou are appropriately wary of threads and forking, but can handle them\nComfort with Agile, product roadmaps, smart feature prioritization\nBonus: LXC &#x2F; Docker and general virtualization, or interest in learning\nBonus: Interest in distributed processing like SGE&#x2F;Slurm or Hadoop<p>Requirements<p>Seven plus years of experience, or equivalent talent\nSolid work ethic and the ability to work independently\nIntuitive sense of code architecture\nPerfect spoken and written English plus solid communication<p>About Appsoma<p>Founded with a vision to make online programming, management and computation of massive data sets easy for everyone, Appsoma is helping &#x27;omics companies become more agile.<p>Location<p>Our product development is based in Austin, Texas, but we all work virtually. No commute, flexible hours, and plenty of team contact over video and at occasional team lunches.","time":1383318027,"type":"comment"}