{"by":"pyrox420","id":6654527,"parent":6653437,"text":"Rockton, IL&#x2F;Beloit, WI&#x2F;REMOTE - Fulltime Senior&#x2F;Mid Software Engineers at AccuLynx (<a href=\"http://www.acculynx.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.acculynx.com</a>)<p>AccuLynx isn&#x27;t your typical startup company. For one, we&#x27;re profitable! Second, our primary product is a SaaS that caters to specialty trade contractors. Yup, software helping construction contractors.<p>We are looking for a “smart-and-gets-things-done” senior&#x2F;mid software engineers. We do not hire based on buzzwords or popular acronyms. We expect you to have mastered at least one language and be eager to master any technology or language in the future. Here is a detailed job description: <a href=\"http://careers.stackoverflow.com/jobs/31889/senior-c-sharp-engineer-acculynx\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;31889&#x2F;senior-c-sharp-e...</a><p>Here is our current stack: C#, ASP.NET MVC, Sql Server, AngularJS, jQuery, Redis, ElasticSearch, and Git. If you aren&#x27;t familiar with those technologies that is fine, just show me how good you are. :)<p>We have pretty awesome perks: Unlimited paid time off, free snacks&#x2F;drinks&#x2F;beer, flexible hours, sweet laptops, sit&#x2F;stand desks, super comfy chairs, dual monitors, casual dress, and cutting edge tech. We play boardgames for “team building”, have frequent team lunches, and monthly company outings. We might even develop video games and robots on the side.<p>Here are the other benefits are top notch: Highly competitive salary (80k-100k), stock options, unlimited paid time off, $5k&#x2F;year to spend on continuing education (conferences, classes, etc), sweet computer hardware, choice of cell phone, MSDN subscription, gym membership, competitive medical, dental, vision, 401K with matching &amp; safe harbor contributions, relocation reimbursement available, etc.<p>We are moving to an awesome new office in Beloit, WI within the next 4 months (each developer gets their own office!). We have toyed with creating a remote team. If you are an awesome remote dev let us know (I&#x27;ll be honest, you&#x27;ll have to be pretty awesome to get the remote gig). Email me if you are interested (mention HN to get my attention), my name is Paul: careers@acculynx.com<p>Seriously, this is the best job I&#x27;ve had and I want to bring the best onto my team. If you have any questions, let me know.","time":1383320613,"type":"comment"}