{"by":"ev-dev-dev","dead":true,"id":6655479,"parent":6653437,"text":"Afar Media | Full Time | San Francisco<p>Afar Media is a collaborative travel guide as well as a printed travel magazine. I&#x27;m the lead engineer for a three-person team, and we&#x27;re looking to add a front-end developer. We use Rails 3, Slim and all the attendant technologies (jQuery, CoffeeScript, drinking lots of coffee).<p>Lately, we&#x27;ve been using Ember.js, which is awesome. I&#x27;ll paste below our official post, but let me say up front why I think this is a great job. - We work reasonable hours and we&#x27;re paid well for our time. (No nebulous promises.)<p>We believe in travel so strongly that we pay you to do it. That is, each employee gets a yearly travel stipend and three weeks vacation to use it. The only caveat is it must be international travel and it must be to a city you&#x27;ve never visited before. (Note: this is an awesome caveat.)<p>Live somewhere else in the US? Maybe we could work something out about working remotely transition into working in the office. (Maybe. Tell us what&#x27;s up. I started working remotely from Chicago before moving to SF.)<p>--- Begin Official Description ----<p>AFAR Media is a well-funded travel media start-up spanning print and web. We have big monitors, stand-up desks, and fancy new laptops. Your coworkers will be be developers, designers, project mangers, and (this is the cool part) magazine editors, meaning you&#x27;ll work with a wider ranger of personalities than the standard developer scrum. This job is ideal for someone who loves to travel for fun (the position does not require travel, but a fulfilling life does, and one of our great perks is a yearly travel stipend). No arbitrary requirements here, if you are an expert or a least have a hacking willingness to learn and have a good attitude, we want you. Our team is small, and all opinions are considered (and frankly, needed) from product design through delivery.<p>Check out our site: <a href=\"http://www.afar.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.afar.com</a><p>If you are interested, please send an email to jobs@afar.com, including relevant experience and work.","time":1383332126,"type":"comment"}