{"by":"jakehow","id":6655549,"parent":6653437,"text":"Zipmark (<a href=\"https://zipmark.com\" rel=\"nofollow\">https:&#x2F;&#x2F;zipmark.com</a>) - New York, NY (Remote Possible)<p>We are looking for awesome people to come work with us and help build the next great alternative payment network.\nZipmark is a mobile and online payments company that enables people and businesses to pay each other using their real bank accounts through the digital checking infrastructure. You can read more about our business in this recent Entrepreneur Mag article (<a href=\"http://www.entrepreneur.com/article/227979\" rel=\"nofollow\">http:&#x2F;&#x2F;www.entrepreneur.com&#x2F;article&#x2F;227979</a>)<p>Come help us solve problems like:<p>* building the safest and fastest way to make or receive payments via checking account<p>* operationalizing and automating remaining manual processes to help manage our growth<p>* protecting our customers and company from financial and security risks<p>* increasing organizational transparency and fostering open communication<p>* building and supporting official API client libraries in languages we don&#x27;t use everyday<p>* supporting and troubleshooting with customers who are integrating with just about every other language&#x2F;platform<p>Using tools like:<p>* ember.js<p>* Ruby&#x2F;Rails<p>* Objective-C for our iPhone app<p>* postgresql, redis and memcached<p>* cloud and bare metal infrastructure<p>While learning and creating expertise around:<p>* advanced cryptography<p>* web and&#x2F;or mobile application security, threat modeling and pentesting<p>* risk analytics<p>* identity validation<p>You should care about creating and improving operational processes that contribute to high quality, low defect software, and you should want to learn more about and become an expert in automated testing, continuous integration, and monitoring everything. However, you still want to work with an organization that is agile enough to respond to change quickly when it is warranted.<p>If any of this sounds interesting, we would love to meet you. We offer a generous salary + benefits package, with the ability to offer generous equity grants for the right teammates.<p>Email me with your details: jake@zipmark.com","time":1383332643,"type":"comment"}