{"by":"hemantv","id":6655284,"parent":6653437,"text":"Optimizely - San Francisco, CA &#x2F; Amsterdam, NL - Fulltime, Permanant. Intern&#x2F;H1-B Transfer okay as well.<p>Intern - <a href=\"http://jobsco.re/1g27Jp8\" rel=\"nofollow\">http:&#x2F;&#x2F;jobsco.re&#x2F;1g27Jp8</a><p>Growth Engineer - <a href=\"http://jobsco.re/18r6N9L\" rel=\"nofollow\">http:&#x2F;&#x2F;jobsco.re&#x2F;18r6N9L</a><p>Software Engineer - <a href=\"http://jobsco.re/1g287Ea\" rel=\"nofollow\">http:&#x2F;&#x2F;jobsco.re&#x2F;1g287Ea</a><p>iOS Developer - <a href=\"http://jobsco.re/1hjBfoa\" rel=\"nofollow\">http:&#x2F;&#x2F;jobsco.re&#x2F;1hjBfoa</a><p>DevOps Engineer - <a href=\"http://jobsco.re/Hwr31e\" rel=\"nofollow\">http:&#x2F;&#x2F;jobsco.re&#x2F;Hwr31e</a><p>Product Manager -  <a href=\"http://jobsco.re/Hwretn\" rel=\"nofollow\">http:&#x2F;&#x2F;jobsco.re&#x2F;Hwretn</a><p>Optimizely is a website optimization platform. We enable businesses to show the right thing to the right person at the right time. Our first product makes A&#x2F;B Testing easy. In 2 years we’ve grown to become #1 in the category with 4,000+ paying customers including Starbucks, Disney, and Marketo. We&#x27;re profitable and our revenue is growing 400% year-over-year. Join us in our mission to empower businesses to make better data-driven decisions.<p>About the Job: We have scale: 4,000+ customers (including 100 of the top websites in the world); 15 billion server requests&#x2F;month You’ll work on our amazing visual editor - a cutting edge tool that is the core of our product - and will enable it to do even more awesome things for our customers Work in small teams, in a continuous integration environment; we’re fast and nimble: 1-2 deployments every day\nFree city-wide Gym membership at any Crunch Fitness. Free Clipper Card to pay for your commute from anywhere in the bay area. Catered in-office lunch and dinner on weekdays. Full medical insurance with very low co-pay and deductible. HMO, PPO, and HSA options available. Full dental coverage including orthodontics. Full vision coverage including contacts. Dependents 100% covered for medical, dental, and vision. Unlimited vacation policy. 401k benefit. Top-of-the-line MacBook Pro or MacBook Air and 30&quot; monitor. Working with a great team and having a huge impact!","time":1383329142,"type":"comment"}