{"by":"harryzhang","id":6655565,"parent":6653437,"text":"Lob (<a href=\"https://www.lob.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lob.com</a>) - San Francisco, CA (Full-time)<p>---------<p>Email us at jobs@lob.com with your Github link, resume, and any additional details you&#x27;d like to share with us.<p>---------<p><i>Company</i><p>Lob is creating a suite of API’s to revolutionize how companies operate. Our first API is a Cloud Printing API.  Our product enables developers to programmatically facilitate printing and fulfillment. If you are passionate about API’s come help create the next wave of great API’s at Lob. Lob is a graduate of the YC S13 class and backed by leading internet venture capital and angels.<p><i>Team</i><p>We are currently a 3-person team (from AWS and Microsoft) based in San Francisco. We are looking for other passionate people who share our vision that API’s will eat up the world.<p><i>Job</i><p>We are seeking a software engineer to build the best cloud printing platform on the planet. You will be the first engineer to join and as such will have an unprecedented opportunity to shape the future of Lob’s APIs.<p><pre><code>   Responsibilities:\n      • Own the framework of the API that is the core of Lob’s business.\n      • Work directly to define, architect and build new Lob APIs.\n      • Drive towards successful deliveries of scalable, maintainable \n      and secure code.\n      • Create and define engineering best practices.\n      • Tackle challenging problems in distributed computing, HTTP, API \n      design and more.\n      • Build and maintain client libraries for our API in a number of \n      languages including PHP, Ruby, and Python.\n\n   Requirements:\n      • Experience leading engineers in a technical leadership role.\n      • Experience working with API’s and HTTP, preferably in PHP and Ruby.\n      • Full-stack development skills.\n      • Hands on. Passionate. Persistent. Creative.\n      • Experience with AWS.\n\n   Perks:\n      • Health, dental, and vision benefits for you and your dependent(s).\n      • Open vacation policy.\n      • Commuter benefits.\n      • Free lunch, dinner snacks and stocked fridge.\n</code></pre>\nWant to stand out? Sign up and build an app using the Lob API. Include a link to it and brownie points for pointing out bugs or things that annoyed you or could better about the platform. Email jobs@lob.com if you are interested.","time":1383332796,"type":"comment"}