{"by":"zinxq","id":6655026,"parent":6653437,"text":"Refresh - Mountain View, CA - Fulltime - <a href=\"http://www.refresh.io\" rel=\"nofollow\">http:&#x2F;&#x2F;www.refresh.io</a>\nemail: jobs@refresh.io<p>Must be local or willing to relocate (paid)<p>A tagline of what we do is: Refresh helps connect people at a deeper level by providing realtime insights about them just as you&#x27;re about to meet them.<p>The best description however is found by simply installing the app (Iphone only at the moment - we&#x27;re in the app store, Android soon - see job description below!) and trying it yourself.<p>We&#x27;re super proud of the team we&#x27;ve built and we plan to keep the caliber high.<p>We have exactly one requirement for hiring an engineer - it&#x27;s someone we&#x27;d like to work with. That&#x27;s a simple statement, but if you dig deeper, there&#x27;s a lot to it. It says that we think they&#x27;re smart. And that we could learn from them. And that they could learn from us. And that we get along, and they fit our culture. And they&#x27;re passionate about our product like we are. And of course - that they also want to work with us.<p>Our interviews are fun - at least we think so. They&#x27;re largely modeled after largely after Google interviews (there&#x27;s a lot of Google interviewing experience in our team). Questions are either real problems we&#x27;ve had to solve (probably recently) or some abstractification of a bigger problem to see how you attack problems in general (with the &quot;getting the right answer&quot; not being the interesting part of the interview).<p>Specifically - We&#x27;re looking for:<p>Backend Developers:<p>You&#x27;re a crackshot in your backend language of choice. As I said, we&#x27;re building a system that does an incredible amount of work all while the user is waiting for it to complete - so needless to say, we&#x27;re looking for people who care about performance. A lot.<p>Our backend is a highly concurrent system written in Java using MongoDB. You might know Java or you might not, but either way you&#x27;re willing to learn. If you don&#x27;t know it - you can impress us in your language of choice. You understand algorithms matter. You also understand sloppy database access could make that ugly n^2 algorithm look absolutely blazing fast.<p>You love to code. You love to show off your results now and then to other engineers (as they&#x27;re probably the only folks around who might get the intracacies of what you&#x27;re excited about)<p>We&#x27;re looking for both Senior and Junior backend engineers. If you&#x27;re a Senior Engineer - you&#x27;ve worked in server-side code for a few years. You&#x27;ve scaled to thousands or millions of users.  You can talk to other Senior engineers with very few words because you both know the special cases, assumptions, and pitfalls cold.<p>If you&#x27;re a Junior engineer, you love to code and you&#x27;re good at it. But most importantly - Be smart. Be passionate. Be excited.  (New grads please apply!)<p>Android and IOS engineers:<p>You have apps in the store you can show us. You care about the user experience.  You have a few years under your belt in either Objective-C or Android-Java.","time":1383327077,"type":"comment"}