{"by":"jbarmash","dead":true,"id":6655679,"parent":6653437,"text":"Merchantry - New York, NY.-  Front End Lead Engineer<p>Funded eCommerce startup backed by great VCs, building the nucleus of a growing dev team in New York.<p>For UI Engineering Lead, we are looking for an experienced engineer to own user interface development and help scale the team as we grow. The senior engineer will also be a core founding member of our tech team and will work on product and our APIs.<p>Merchantry is a growing, fast-paced SaaS company with customers across the globe. In May, we raised our B round, and are funded by top NYC and Silicon Valley VCs (Greycroft, Kite and e.ventures). We were rated by Crain’s as one of the best places to work in New York in 2012.<p>Our Tech Team<p>* We are committed to doing things the right way, using the best technology available, and we want talented engineers who can bring these ideas to the browser. \n  * We started out as a Java shop, and are now adding other languages such as Groovy &#x2F; Grails and others. \n   * On the front end, we are moving to Single Page Apps in addition to some java frameworks. You will help make some of these choices. \n   * We are agile and continuously integrated. We want to be continuously deployed when we grow up, and also service-oriented. \n    * We use Puppet for our DevOps, TeamCity for Continuous Integration, Zabbix for monitoring, Solr for search, and many other technologies.<p>Our Product<p>We connect product and fulfillment data between online retailers and their vendors. The product has several APIs for integration, and two user interfaces, one for vendors, another for retailers. Our professional services team is responsible for integrating product with high-volume clients. To give you a sense of scale, we are currently hosted on 20 servers in a premium data center and we are just getting started.<p>Please email resume to: jobs@merchantry.com. If you have some publicly accessible work (github, portfolio, photos of drawings you did as a child), please include links…..<p>More info here: <a href=\"http://goo.gl/uVZP9U\" rel=\"nofollow\">http:&#x2F;&#x2F;goo.gl&#x2F;uVZP9U</a>","time":1383333518,"type":"comment"}