{"by":"iperdomo","id":6655910,"kids":[6667880],"parent":6653437,"text":"Akvo - <a href=\"http://akvo.org\" rel=\"nofollow\">http:&#x2F;&#x2F;akvo.org</a> - EU, half to full time, a few positions<p>Akvo creates and runs open source Internet and mobile services that make it easy to bring international development aid work online. We focus on project and programme dashboards, reporting, monitoring, evaluation and making data easier to share. Headquartered in Amsterdam, Akvo is a non-profit foundation that works with more than a thousand organisations around the world.<p>* Java developer - Amsterdam, EU.<p>We are hiring a Java developer to join the team for one of our core software products, Akvo FLOW. FLOW is an open source platform to collect, manage, analyse and display geographically-referenced monitoring and evaluation data.<p>We have some fun and hard problems to solve - how can we maintain and extend a complex tool with a lot of moving parts (a mobile app, a web platform, map displays) while keeping it simple and enjoyable for people to use? Double down when they need to be able to use it in areas of the world with low or scarce web and mobile connectivity.<p>You&#x27;ll be working with our international team, based out of our Amsterdam office You need experience with developing web applications with Java, and experience with JS frameworks like Ember is a plus. Ability to work in a distributed team in a self driven manner is expected.<p>For this position, please contact ivan@akvo.org \nYou must have a work permit already to work in Amsterdam.<p>* Python &#x2F; Django developer - Amsterdam, Stockholm; EU.<p>We are looking for an experienced web developer to work on our project visualisation and reporting system Akvo RSR. More than 1000 organisations use the around the world, everything from UN agencies, governments to small local NGOs.<p>You&#x27;ll be working with our international team, based out of our Amsterdam office or our Stockholm hub. You need experience with developing web applications with Python, and preferably Django. Ability to work in a distributed team in a self driven manner is expected.<p>For this position, please contact adrian@akvo.org \nYou must have a work permit already to work in one of these locations.<p>* UI designer &#x2F; developer - Helsinki, Stockholm, Amsterdam; EU.<p>If you are a UI designer &#x2F; developer with startup experience wanting to contribute to make the world better, please read on!<p>We are seeking a skilled, self-motivated, pro-active and energetic UI developer &#x2F; designer. Reporting to the lead designer, your primary responsibility will be to create and ensure a consistent and beautiful UI throughout our software platform, which includes web applications, desktop applications and mobile &#x2F; tablet applications.<p>You have to be able to adapt to a fast changing environment where multi-tasking is a must. You will be required to design and develop functional user interfaces as well as keeping the brand consistent across the organisation and a range of different products.<p>We are looking for someone to be based in Helsinki, Stockholm or Amsterdam. You must have a work permit already to work in one of these locations.<p>Please send your CV along with a cover letter to loic@akvo.org","time":1383335597,"type":"comment"}