{"by":"ritikm","id":6657774,"kids":[6658403],"parent":6653437,"text":"Streem (YC S12) - San Francisco - FULLTIME, INTERN<p><i>Contact:</i> jobs+HN@streem.com<p><i>Company:</i><p>Streem (<a href=\"https://www.streem.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.streem.com</a>) is a personal cloud storage and streaming solution for your videos. We automatically store, transcode, and organize your content for instant playback on any device. We participated in YC S12 and have raised venture funding from top-notch investors.<p><i>Team:</i><p>We are currently a young, 2-person, fully-technical team (Twitter, Microsoft, Berkeley EE&#x2F;CS) based in San Francisco (near the Montgomery Bart Station). We love to hack and build things fast.<p><i>Requirements:</i><p>+ You&#x27;re a hacker. It doesn&#x27;t matter what languages or platforms you&#x27;ve worked on before, all that matters is that, like us, you love to code to solve your own problems.<p><i>Our Tech Stack:</i><p>+ Meteor.js, MongoDB, Handlebars&#x2F;HTML, Javascript, CSS for the web application<p>+ Ruby and Python for the video transcoding system that automatically scales up on demand<p>+ Amazon stack: S3, CloudFront, Elastic Beanstalk, EC2, ELB, Auto Scaling<p>+ Java for the desktop application, and Java Swing for the single-codebase, cross-platform native UI<p>+ Objective C and Java for the native mobile apps<p><i>Benefits:</i><p>+ Full-time salary with extremely competitive, higher-than-market-rate equity<p>+ Bike&#x2F;scooter, relocation, gym, Exec&#x2F;Uber&#x2F;TaskRabbit&#x2F;etc. credits, Spotify Premium, unlimited storage on Streem<p>+ Health insurance (medical, dental, vision), 401(k), unlimited vacation days<p>+ Unlimited snacks, catered dinner<p>+ Whatever setup you want (laptop, monitors, mechanical keyboard, mouse, headphones, you name it)<p><i>Get In Touch:</i><p>If you like hacking, getting things out as fast as possible, and want to use Streem yourself, you&#x27;re exactly the person we want to work with. Never worked with Meteor.js before? No problem. Just graduated from college? No problem!<p>If you&#x27;re interested, email us at jobs+HN@streem.com with anything that tells us about you: it could be your Github, LinkedIn, resume, links to your previous projects, or surprise us!","time":1383357433,"type":"comment"}