{"by":"vfiles","id":6662357,"kids":[6662617],"parent":6653437,"text":"New York - Software Engineer (two positions open)<p>VFiles is the hippest and foulest-mouth fashion startup around. Our shop[1] is the most relevant fashion destination in New York today, our YouTube shows[2] are insanely popular, and we want you to help us bring our social media site to life.<p>We are looking to add two more engineers to join our team, doubling our current two (in a company of about twenty). Every engineer here will be full-stack, though we&#x27;re happy to have someone who leans to one side or the other and is eager to learn. Technologies we use include Ruby, Haskell, Angular, Coffeescript, Redis, and more. As part of our team, you will have both a strong voice in the vision and direction of our product and a good deal of autonomy and control in the specific projects you work on.<p>As for fringe benefits, we throw the most talked about parties in town (hosted by A$AP Mob and crashed by Kendrick Lamar), we have company trips to Montauk, we organize funky Soul Cycle rides with famous designers and models, and we&#x27;re invited to pretty much everything happening, culture-wise, in New York. You&#x27;ll work with a diverse group of people with a number of skillsets, all of whom - editorial, video, design - are at the very top of their game.<p>Candidates who live in NYC and are legally allowed to work in the US only, please.<p>You can write the Chief Engineer directly at tim (a) vfiles (dot) com to express your interest.<p>[1] <a href=\"https://www.vfiles.com/shop\" rel=\"nofollow\">https:&#x2F;&#x2F;www.vfiles.com&#x2F;shop</a> and <a href=\"http://www.nytimes.com/2013/05/02/fashion/building-blocks-all-in-a-row.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nytimes.com&#x2F;2013&#x2F;05&#x2F;02&#x2F;fashion&#x2F;building-blocks-al...</a>\n[2] <a href=\"https://www.vfiles.com/tv\" rel=\"nofollow\">https:&#x2F;&#x2F;www.vfiles.com&#x2F;tv</a> and <a href=\"http://www.newyorker.com/online/blogs/culture/2013/05/model-files-fashion-series.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.newyorker.com&#x2F;online&#x2F;blogs&#x2F;culture&#x2F;2013&#x2F;05&#x2F;model-...</a>\n[3] Our &quot;user-generated&quot; fashion show for fashion week <a href=\"http://www.thefader.com/2013/09/05/nyfw-vfiles-made-fashion\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thefader.com&#x2F;2013&#x2F;09&#x2F;05&#x2F;nyfw-vfiles-made-fashion</a> and <a href=\"https://www.youtube.com/watch?v=VJsRvjAQULc\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=VJsRvjAQULc</a>","time":1383457105,"type":"comment"}