{"by":"spire","id":6663369,"parent":6653437,"text":"Kenya - Spire<p><a href=\"http://spire.theresumator.com/apply/Vs2TjJ/Technology-Lead.html\" rel=\"nofollow\">http:&#x2F;&#x2F;spire.theresumator.com&#x2F;apply&#x2F;Vs2TjJ&#x2F;Technology-Lead.h...</a><p>Spire is hiring a solid developer and technology big-thinker excited about working on the ground in Kenya.<p>We’re a small team with a big vision: reinventing higher education from scratch. What would University look like if we scrapped our current model and started over? We think it will blend incredibly high-quality offline teaching and mentoring from real teachers (think the best charter schools in the country), not professors, with free but super high-quality flipped-classroom online learning (think EdX, Coursera), and a new model of apprenticeship so students leave school ready for anything. We’re launching in Kenya early next year and aim to quickly expand across Africa.<p>We’re looking for a versatile team member who can lead everything from our high-level technology strategy (When do we invest in building our own platform? Do our students use tablets or laptops?) to the nuts and bolts of our hardware decisions, front-end development and basic back-end (e.g., Rails + HTML&#x2F;CSS + very basic devops on top of Heroku or AWS). This hire will be the founding member of our technology team.<p>Our dream hire is creative and resourceful but also ambitious – we’d love this person to grow with us into a VP or CTO-type role over the next few years.<p>About us:<p>- We’re taking on what we think is one of the biggest problems in the world\n- We’re a social enterprise and are funded so far with $1M+ in non-dilutive seed grants with another $1M on the way\n- Our non-profit sister organization kepler.org, where we’re also part of the founding team, got more than 2,500 applications for our first 50 spots and has been written up in Scientific American, Fast Company, and The Chronicle of Higher Education, who thinks our work will be a model for the US.\n- We’re in Kenya but are open to discussing some remote work for the right candidate\n- Competitive salary, generous equity awards depending on experience and awesome, inspiring teammates<p>About you:<p>- At least a couple years of experience building things, ideally front-end and back-end\n- Agile generalist and resourceful problem solver\n- Excited about a tech role that goes beyond getting people to click on ads<p>Anything you&#x27;ve built or designed (Github profile, personal web apps, design portfolio, etc) that you can include in your application much appreciated!","time":1383490938,"type":"comment"}