{"by":"makerstudios","id":6665443,"parent":6653437,"text":"Maker Studios - Los Angeles, CA - Full-Stack Web Engineer - All Levels<p>Join the team at Maker Studios, a next-generation digital video studio&#x2F;network. &quot;Maker&quot; has rolled-up a set of the largest and most influential YouTube channels and talent into a new network model.  The Company currently represents 50,000+ channels, and delivers 1.5 billion video views per month. Maker has an established reputation for guiding content creators in maximizing views and courting brands. Additionally, the Technology group within Maker innovates with world-class web engineering and design practices to produce high-quality apps and tools that connect content with eyeballs and usher content creators to new levels of mastery.<p>What does Maker build? We develop talent-facing web applications at high scale that connect YouTube content creators with each other, with our channel-management pros, and with tech such as ad optimization and alternative distribution targets. We also build internal web apps, APIs, and a handful of public-facing video&#x2F;content sites for our top talent. Here are some of the technologies we use:<p><pre><code>  - Backend: Node&#x2F;Express, Python&#x2F;Django,, Ruby&#x2F;Rails, NginX\n  - Frontend: CoffeeScript, Jade&#x2F;Less&#x2F;Sass&#x2F;Stylus, Ember&#x2F;Angular&#x2F;Knockout, D3, WebGL\n  - Testing: CircleCI, Cucumber, Mocha\n  - Deployment: Capistrano, Fabric, Dotcloud, AWS, CloudFlare\n  - Virtual Machines: Vagrant, Docker\n  - SQL: Mysql, RedShift &#x2F; Postgres\n  - NoSQL: Redis, Memcache, MongoDB, Neo4j, Hive&#x2F;Hadoop, Cassandra&#x2F;Riak\n  - Linux: Bash&#x2F;Shell scripting\n</code></pre>\nWant more reasons to work at Maker? The engineering environment is exceptional. Maker&#x27;s CTO is a computer scientist himself who still codes regularly, and we have a very programmer-friendly workplace:<p><pre><code>  - You decide the technology.  The engineer who&#x27;s writing the code has\n    the final vote on which technologies get used. We use APIs to cross-\n    connect our projects with ease, which also enables us to use\n    different languages in different projects.\n  - Flexible work hours.  Come in as early or late as you want, as long\n    as your total hours are on par with your peers; what really matters\n    is the quality and quantity of your code commits.\n  - Code intelligently.  We hack, but we also care about sharing code\n    with each other, so we talk about readability and complexity, we\n    develop all modules as though they&#x27;ll one day be open-sourced, and\n    we believe in small tools used cleverly, at scale.\n  - Open Source friendly.  Besides using mostly open-source tools, we&#x27;ve\n    open-sourced several internally developed tools on\n    https:&#x2F;&#x2F;github.com&#x2F;MakerStudios&#x2F;, and more are coming.\n  - Great benefits.  We have amazing investors and we want healthy,\n    enthusiastic employees, so we offer our engineers a highly\n    competitive salary, top-notch health&#x2F;dental&#x2F;vision coverage,\n    401(k), and stock options.\n</code></pre>\nInquiries:  geoffrey.plitt@makerstudios.com","time":1383518048,"type":"comment"}