{"by":"bartonfink","id":6670616,"parent":6653437,"text":"MapQuest is hiring. We&#x27;re working on a variety of things besides getting people directions from A to B, and we are trying to do that with a minimum of drama and a maximum of excitement. Our headquarters is in downtown Denver, CO, but we have people working in NYC, Pennsylvania, Washington, DC and even England as well. We&#x27;re #2 in the maps and directions industry behind Google, and are amidst a pivot out of maps and directions and into travel. We try to combine a startup&#x27;s level of passion and creativity with bigco backing and an audience of 40M UV&#x27;s monthly. You can see products we&#x27;ve released recently at <a href=\"http://discover.mapquest.com\" rel=\"nofollow\">http:&#x2F;&#x2F;discover.mapquest.com</a> and <a href=\"http://travelblogs.mapquest.com\" rel=\"nofollow\">http:&#x2F;&#x2F;travelblogs.mapquest.com</a>, and there is more coming soon.<p>We have open reqs for Javascript developers, Rails developers and Mobile developers (Android, iOS and Windows). While experienced engineers are certainly welcome, we have a strong pairing culture in Denver and have had outstanding success with entry-level engineers over the past six months. If you&#x27;ve got some talent with web development, have a github profile and don&#x27;t mind booger jokes, we&#x27;d love to talk. We have an online coding test at <a href=\"http://www.interviewzen.com/apply/3QPLHn\" rel=\"nofollow\">http:&#x2F;&#x2F;www.interviewzen.com&#x2F;apply&#x2F;3QPLHn</a> that shouldn&#x27;t take much more than 10 minutes.<p>I could post the official reqs here, but essentially, we&#x27;re looking for people who are smart and comfortable doing a variety of things. We have web-based products written in Scala, Node.js, Rails, Java and even some C out there, and while we don&#x27;t expect anyone to be fluent in all of them, we look for people who are willing to be flexible and excited at the chance to stretch themselves.<p>If you&#x27;re interested, please give me a buzz - my e-mail is in my profile. I&#x27;d love to chat.","time":1383593471,"type":"comment"}