{"by":"mohoyt","id":6688668,"parent":6653437,"text":"We have recently moved our core development in-house and we are looking for an experienced Ruby on Rails developer to lead from London. You will be joining an agile team and supporting our outsourced developers. We care about clean code, quality user experience and best practices.<p>The project will be stabilising the development of the platform which is built on Ruby On Rails, Nginx, Postgres. This project will involve getting to know the platform, adding and innovating new features.<p>Responsibilities:<p><pre><code>  - Develop new features using a BDD approach\n  - Code Review\n  - Writing code whilst collaborating with the product owner and other team members\n  - Help the team with architecture decisions\n  - To ensure that all development has sufficient test coverage to maintain quality\n</code></pre>\nWhat we offer:<p><pre><code>  - We are an international, highly motivated and tech-enthusiastic team with flat hierarchies\n  - We offer an exciting and dynamic work environment combined with responsibility from the very beginning\n  - You will take a leading role in the development of the technical infrastructure of a fast growing international company\n  - We offer you an attractive salary and various opportunities to develop yourself professionally as well as personally\n  - We make sure that you have an enjoyable working environment and fun at work!\n  - £30,000 – £45,000 depending on experience plus Bonuses (up to £60k OTE) and sizeable Equity in the business\n</code></pre>\nSkills &amp; Requirements<p><pre><code>  - Ruby on Rails\n  - HTML\n  - CSS\n  - Javascript\n  - JQuery\n  - PostgreSQL\n</code></pre>\nAbout Yieldify<p><pre><code>  - Yieldify is already being used by some of the largest websites in the UK and is backed by top angel investors.\n  - We use algorithms to create engaging and personalised overlay messages to visitors depending on their mouse movements, speed and user behaviour.\n  - Yieldify allows websites to maximise their lead generation and sales from people leaving their website.\n  - The company is led by 2 Serial entrepreneurs and headquartered in Innovation Warehouse in Farringdon which is the home for UK’s leading startups.\n</code></pre>\nGet in touch: meelan@yieldify.com","time":1383820038,"type":"comment"}