{"by":"jwarrenreed","id":6699167,"parent":6653437,"text":"D3 Front-End and Data Visualization Consultant (Up to 3 Months) - New York<p><a href=\"http://www.gro-ventures.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.gro-ventures.com</a><p>At Gro Ventures, we are pioneering agricultural supercomputing as a means to transform Africa into a breadbasket for the world in a span of 20 years. African agriculture is riddled with inefficiencies rooted in the lack of free-flowing, real-time information—a necessary component for data-driven reform and the creation of a truly functional commodities market. Data visualization is at the heart of agricultural supercomputing, defined as the integration of various technologies widely used around the world today to create the first real-time agricultural data analytics platform for Africa. Through agroinformatics and state of the art data visualization, we will for the first time in Africa’s history allow real time data driven decision making.<p>The project will consist of building several customized web visualizations based off the results of an agricultural study of several countries. We are seeking individuals or teams who can develop a visualization application consisting of pricing, yield, weather and various other economic and commodities driven data. You will work directly with our Head Data Scientist and Research Analysts to design and implement a state-of-the-art web visualization.<p>We are looking for talented, experienced engineers to work out of NYC for a period of 4-12 weeks depending on agreed upon timelines and deliverables. Candidates must be proficient in the following areas:<p>-Extensive Javascript and CSS experience.\n-Experience with one or more SVG or Canvas-based visualization toolkits, i.e. D3.js, or a keen interest in learning. \n-Know the ins and outs of websockets and AJAX communications with various backend data services.\n-Understand data binding and have used MV* frameworks enough to be dangerous.\n-Prior data analysis experience (even at the Excel level) very useful.\n-Basic understanding of financial concepts, including pricing and returns<p>Interested candidates should submit a resume or LinkedIn profile by email to info@gro-ventures.com with the subject line D3 Front-End and Data Visualization Consultant.","time":1383944866,"type":"comment"}