{"by":"Placester","id":6705395,"parent":6653437,"text":"Placester is hiring:<p>UI&#x2F;UX Designer<p>Customer Support Engineer<p>Customer Success Coach<p>Senior PHP Engineer<p>Senior Software Engineer<p><a href=\"https://placester.com/careers/\" rel=\"nofollow\">https:&#x2F;&#x2F;placester.com&#x2F;careers&#x2F;</a><p>Our Mission: Make the web work for real estate. Bridging the gap between real estate professionals and their clients. Real estate is the largest industry in the world. It’s also one of the most important—after all, everyone needs a place to live. Millions of consumers are looking for their next home online, and they expect the same kind of browsing and buying experience they get on sites like Amazon and Facebook. Unfortunately, real estate agents are struggling to provide that experience. That’s where Placester comes in. We’re creating an industry where it&#x27;s quick and simple for real estate professionals to get their information on the web. Don’t let that simple description fool you. We’re addressing the hardest problem in the largest industry in the world. As you might have guessed, not everything is written on the home page yet.<p>Our Culture: Team. Join the team that makes a difference in a big, complex industry. Our culture is all about teamwork. That being said, we&#x27;re composed of folks who are their own brand of brilliant, focused, fun, intense, and friendly. If you&#x27;ve ever worked on a high performing team you&#x27;ve experienced this mix before. You’ll be expected to get things done and be responsible for making it happen, without any bureaucratical mess. You’ll be expected to identify problems and solve them on your own. But more importantly, you may need to rally a friend or team to overcome them. Both are key tools on your belt. You’ll be expected to have an opinion because it will matter when shaping the outcome of your company.<p>Opinions are about courage: to speak your mind and to change it. Everyone laughs a lot over lunch. Topics range from the standard technical, tactical and whos-doing-what in the start up world; but they also weave through topics like the proper structure for the US debt, that great restaurant down the street or how to Sous-vide the perfect piece of meat. Brilliance isn’t one-dimensional.","time":1384061842,"type":"comment"}