{"by":"JasonCEC","id":18807972,"parent":18807017,"text":"Analytical Flavor Systems | Manhattan - NYC | Full-Time | Onsite | <a href=\"http:&#x2F;&#x2F;www.Gastrograph.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.Gastrograph.com&#x2F;</a> Position: Full-Stack Engineer, Application Engineer, DevOps, Data Scientist Application &amp; Data Stack: Javascript, React &amp; React Native, GraphQL, Docker, Spark, R, postgres&#x2F;MySQL, AWS Team: we&#x27;re a diverse 6 person company (across Data, Engineering, Chemistry, and Biz). Everyone gets trained as a professional taster.\nGastrograph AI is an artificial intelligence platform for modeling human sensory perception to predict consumer preferences of food &amp; beverage products. We help food and beverage companies develop new products and optimize their existing brands by predicting the optimal flavor, aroma and texture for target consumer cohorts.<p>Our Services<p>_Innovation Management_: New product development, flavor profile optimization, &amp; portfolio management (multi-product optimization).<p>_Cognitive Marketing_: Product description optimization to prime consumers to like a product more by purposely engineering a perception bias.<p>_Deep Market Insights_: Predictions for emergent market preferences by region and demographic.<p>The Position(s)<p>_Engineering_: We&#x27;re currently looking in two specific areas: (1) full stack engineers with experience with React, GraphQL, and React Native to work on our web app for clients and our mobile app for tasters. (2) Streaming infrastructure focused engineers capable of integrating the data pipeline and outputs of machine learning models into an easy to use management platform.<p>_Data Science_: Data science is central to the value and insights we provide for our clients. We didn&#x27;t build a data science team to optimize our product&#x27;s marketing spend, sales funnel, or client retention – we built a data science team to build our product. We are a team of data scientists that understand our clients and turn nebulous business goal into quantitative decision metrics and predictive models to optimize those metrics. The extensive role of data scientists at Analytical Flavor Systems allows us to invest in their education across sensory perception (standard sensory science so they know what we&#x27;re improving and replacing), tasting experiences (so they appreciate the products we work on and understand how the data is collected), production knowledge, and data science tear-downs (a meeting where the team collaboratively attempts to find and fix problems, try new techniques, and debate the philosophical implications of a model&#x27;s construction).<p>Next Steps<p>Please contact Jason Cohen at JasonCEO@Gastrograph.com to apply.","time":1546450105,"type":"comment"}