{"by":"Khorimjin","id":18807321,"parent":18807017,"text":"Merantix | {Machine Intelligence, Software, Frontend, Clojure} Engineer | Berlin | Full-Time, Internship, Onsite, Visa assistance | <a href=\"https:&#x2F;&#x2F;www.merantix.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.merantix.com</a><p>Merantix conceptualizes, builds and scales AI ventures. Our team is made up of entrepreneurs, scientists, physicians and engineers from premier universities in Europe and North America. Many of us have PhDs and work experience at top tech companies. We’re based in Europe’s startup capital, Berlin, and are growing quickly!<p>We’re currently working on these problems:<p>Our Automotive Team is building safety and validation systems for self-driving cars. Currently hiring {Software, Frontend} Engineers, Technical Program Managers.<p><pre><code>  * Design and implement a large-scale testing engine for full stack autonomous vehicle (AV) software, that implements both log-based as well as simulated test scenarios\n\n  * Develop applications and tools for data integration, experimentation, quality &amp; modelling\n\n  * Conceptualize and build visualization environments to develop modular scenarios for AV testing, which is able to scale to millions of test cases\n</code></pre>\nIn Healthcare, we’re making breast cancer screening more efficient and safe with Machine Learning. Currently hiring Clojure Engineers.<p><pre><code>  * Develop an impactful and technically challenging medical application in ClojureScript and Clojure\n\n  * Join a team of experienced Clojurists who are happy to mentor you (@volrath, @countgizmo, @olieidel)\n\n  * Have a tight and efficient feedback-loop with physicians (we have two)\n\n  * Interface with our Machine Learning models.\n</code></pre>\nFurthermore, we are always looking for Machine Intelligence Engineers to join our core team.<p>Have a look at our job openings here: <a href=\"https:&#x2F;&#x2F;merantix.bamboohr.co.uk&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;merantix.bamboohr.co.uk&#x2F;jobs&#x2F;</a>","time":1546446436,"type":"comment"}