{"by":"ldervishi","id":18808135,"parent":18807017,"text":"Fluidity is hiring<p>Who we are<p>Fluidity is a way to see the world. With our flagship AirSwap, we are building a system that brings local assets online using blockchain technology and makes them available for trade on a global marketplace—directly among buyers and sellers. Fluidity is forming the foundation of a new system of tokenization and trade.<p>Fluidity is a team of product and financial technology experts from a variety of backgrounds, with world-class advisors including Michael Novogratz, Joe Lubin, Donna Redel, and legendary venture capitalist Bill Tai. AirSwap itself is a joint venture with ConsenSys, a global formation of technologists building critical infrastructure and applications for the Ethereum ecosystem. Fluidity is based in Brooklyn, New York.<p>Growing our team<p>We focus on growing our team exclusively with industry-defining talent. We invest in our people and prioritize merit over ego, while firmly setting and consistently achieving our goals. We seek those with proven track records of getting things done in high impact environments and industries across the board. Deep experience is good, but talent and drive matter most. As an early contributor, you&#x27;ll have the opportunity to impact key components of our software architecture.<p>Open Roles<p>We are hiring for several full-time roles in our Brooklyn, NY office.<p>Engineering Manager - <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;fluidity&#x2F;jobs&#x2F;4136211002?gh_jid=4136211002\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;fluidity&#x2F;jobs&#x2F;4136211002?gh_jid...</a><p>Smart Contract Engineer - <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;fluidity&#x2F;jobs&#x2F;4132571002?gh_jid=4132571002\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;fluidity&#x2F;jobs&#x2F;4132571002?gh_jid...</a><p>Software Engineer, Front End - <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;fluidity&#x2F;jobs&#x2F;4110677002?gh_jid=4110677002\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;fluidity&#x2F;jobs&#x2F;4110677002?gh_jid...</a><p>Software Engineer, Full Stack - <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;fluidity&#x2F;jobs&#x2F;4016807002?gh_jid=4016807002\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;fluidity&#x2F;jobs&#x2F;4016807002?gh_jid...</a><p>For more open roles, please visit <a href=\"https:&#x2F;&#x2F;www.fluidity.io&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fluidity.io&#x2F;careers</a>.<p>Fluidity is an equal opportunity employer. We value a diverse workforce and an inclusive culture. We encourage applications from all qualified individuals without regard to race, color, religion, gender, sexual orientation, gender identity or expression, age, national origin, marital status, disability, and veteran status.","time":1546450983,"type":"comment"}