{"by":"jaz46","id":18807936,"parent":18807017,"text":"Pachyderm -- San Francisco -- onsite preferred, but remote possible (within US) -- <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;pachyderm&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;pachyderm&#x2F;</a><p>Love Docker, Golang, and distributed systems?<p>Pachyderm is an enterprise data science platform.<p>Teams that find themselves struggling to maintain a growing mess of advance data science tasks such as machine learning or bioinformatics&#x2F;genomics research use Pachyderm to greatly simplify their system and reduce development time.  They rely on Pachyderm to do the heavy lifting so they can focus on the business logic in their data pipelines.<p>Check us out at:<p><a href=\"https:&#x2F;&#x2F;pachyderm.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;pachyderm.com&#x2F;</a><p><a href=\"http:&#x2F;&#x2F;github.com&#x2F;pachyderm&#x2F;pachyderm\" rel=\"nofollow\">http:&#x2F;&#x2F;github.com&#x2F;pachyderm&#x2F;pachyderm</a><p>What would data analytics infrastructure (namely Hadoop) look like if we rebuilt it from scratch today? We think it would be containerized, modular, and easy enough for a single person to use while still being scalable enough for a whole company. Tools like Docker and Kubernetes provide the perfect building blocks for us revolutionize data infrastructure!<p>Pachyderm just raised our Series A led by Benchmark (<a href=\"https:&#x2F;&#x2F;pachyderm.io&#x2F;2018&#x2F;11&#x2F;15&#x2F;Series-A.html\" rel=\"nofollow\">https:&#x2F;&#x2F;pachyderm.io&#x2F;2018&#x2F;11&#x2F;15&#x2F;Series-A.html</a>), so you&#x27;d be getting in right at the ground floor and have an enormous impact on the success and direction of the company as well as building the rest of the engineering team.<p>Positions:<p>* Core distributed systems&#x2F;infrastructure engineer (Golang)- You’ll be solving hard algorithmic and distributed systems problems every day and building a first-of-its-kind, containerized, data infrastructure platform.<p>* Front-end Engineer (Javascript) - Your work will be focused on developing the UI, perfecting the user experience, and pioneering new products such as a hosted version of Pachyderm&#x27;s data solution.<p>* Lead Data Science Evangelist -- be the face of Pachyderm and get OSS users excited! Build machine learning and data science examples, write blog posts, give conference talks, and generally just evangelize Go, Docker, and Kubernetes!","time":1546449853,"type":"comment"}