{"by":"beekay","id":18809623,"parent":18807017,"text":"Spring Discovery | Data Scientist &#x2F; Applied ML | Full-Time | SF Bay Area | ONSITE<p>Spring Discovery is applying machine learning to accelerate the discovery of therapies for aging and its many related diseases. Aging is the single greatest risk factor for the most detrimental diseases — by understanding and treating the biological damage accumulated as we age, we can find powerful new therapies for fighting disease and living healthier, longer lives.<p>Over the past few decades, an unignorable amount of evidence has piled up from the best labs in the world that this is possible [1]. But translating the science to real therapies has been challenging in a field that has historically struggled to experiment quickly. Here’s more on our mission and approach: <a href=\"https:&#x2F;&#x2F;medium.com&#x2F;spring-discovery&#x2F;accelerating-the-discovery-of-therapies-for-aging-and-its-related-diseases-7c6a2109189f\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;spring-discovery&#x2F;accelerating-the-discove...</a><p>We have deep support from top-notch investors, including General Catalyst, First Round, Laura Deming&#x27;s Longevity Fund, Felicis, Caffeinated Capital, Sam Altman, and more [2]. And our advisory board includes both world leaders in aging research and senior pharma execs.<p>We have the beginnings of a great data pipeline (already several TB of rich biological data collected specifically for ML purposes) and are in the process of building out our own automated lab to scale things up even more. We’re looking to add to our early team with experienced data scientists or applied ML engineers who would enjoy working on things ranging from data infrastructure to modelling to statistical analysis of large datasets. Yes, you belong even if you don&#x27;t have a bio background — we&#x27;re a cross-functional team. (Although of course biology experience is a plus).<p>If this sounds interesting to you, head on over to <a href=\"https:&#x2F;&#x2F;www.springdisc.com&#x2F;#careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.springdisc.com&#x2F;#careers</a> or email me directly at benkomalo+hn@springdisc.com.<p>[1] <a href=\"https:&#x2F;&#x2F;ldeming.com&#x2F;longevityfaq\" rel=\"nofollow\">https:&#x2F;&#x2F;ldeming.com&#x2F;longevityfaq</a><p>[2] <a href=\"https:&#x2F;&#x2F;www.businessinsider.com&#x2F;ben-kamens-anti-aging-spring-discovery-raises-18-million-2018-12\" rel=\"nofollow\">https:&#x2F;&#x2F;www.businessinsider.com&#x2F;ben-kamens-anti-aging-spring...</a>","time":1546459407,"type":"comment"}