{"by":"itsdrewmiller","id":18807796,"parent":18807017,"text":"NGP VAN - Washington, DC and Boston, MA<p>We are hiring for several technical positions, most of which can be filled in either our Washington, DC or Somerville, MA (near Boston) office:<p>* Software Engineer<p>* Senior Software Engineer<p>* Software Engineering Intern (spring and summer)<p>* DevOps Engineer<p>* Systems Engineer<p>* Security Administrator<p>* QA Analyst<p>You can apply directly on our careers website here: <a href=\"https:&#x2F;&#x2F;www.ngpvan.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ngpvan.com&#x2F;careers</a> or you can email me at dmiller at ngpvan dot com and I&#x27;ll get you to the right hiring manager.<p>NGP VAN is a technology company whose team members do exciting and meaningful work that has a significant impact on promoting civil rights, social justice, and environmental responsibility.<p>Employees enjoy an unusually generous set of benefits, including 12 weeks paid parental leave, profit sharing, 100% premium-paid health&#x2F;dental, and an ongoing education allowance. NGP VAN is one of only a handful of companies to be recognized as one of the fastest growing companies in America by Inc. Magazine for 10 years. Inc. Magazine also recognized us as one of the 50 Best Places to Work in 2016.<p>We were named one of the Coolest Companies of 2016 by DC Inno. We&#x27;ve also been named one of the top 50 fastest growing companies in the DC area by the Washington Business Journal and SmartCEO. The Wall Street Journal wrote “NGP VAN is something of a secret weapon for the Democratic Party and the labor unions and progressive groups that use it.” We have also won the AAPC award for Best Use of New Technology, and the Campaigns &amp; Elections Award for Most Innovative Product.<p>Join our team and work alongside more than 200 smart, passionate, and innovative co-workers, many of whom are industry recognized as experts in their fields.<p>NGP VAN believes a diverse, inclusive staff makes us a stronger company and better partner for our clients. We’re committed to hiring people of all races, ethnicities, ages, sex, genders, sexual orientation or gender identities, marital status, religions, and disabilities. Women, people of color, LGBTQ individuals, and members of other minority or marginalized groups are encouraged to apply.<p>Keywords: ONSITE","time":1546449135,"type":"comment"}