{"by":"certsafe","id":18808492,"parent":18807017,"text":"Cyient | FULL TIME | ONSITE (remote for the right candidate) | Melbourne, FL; Bangalore, India| <a href=\"http:&#x2F;&#x2F;certsafe.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;certsafe.com&#x2F;</a> CertSAFE is a software suite developed by Cyient for the design, development, simulation, verification, and validation of safety-critical systems. CertSAFE features a graphical development environment for a visual modeling language based on dataflow&#x2F;circuit diagram notation, a simulation engine and interactive testing interface, an automatic test generator based on Satisfiability Modulo Theories (SMT) solving, and more. As a member of the CertSAFE team, you will get to apply your software engineering and computer science knowledge in diverse areas, including programming language theory, graph theory, user interface design, concurrent and parallel software design, and software test automation. You will get to interact on a day-to-day basis with real-world users and customers working on safety-critical applications in aerospace, defense, transportation, medical devices, and other fields.\nCertSAFE is developed by a small team with a Lean Kanban development process. We use a variety of technologies including Java, Maven, Jenkins, Python, and AWS, and also especially appreciate experience with functional languages such as Haskell, F#, OCaml, Lisp, etc.<p>Positions available include Software Engineer (Bangalore, India), Software Quality Assurance Engineer (Bangalore, India), Product Specialist (Bangalore, India), and DevOps Engineer (Melbourne, FL). Visit <a href=\"http:&#x2F;&#x2F;certsafe.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;certsafe.com&#x2F;careers&#x2F;</a> for full position descriptions.<p>The roles outside of Melbourne, FL will require travel to Melbourne, FL for 90-180 days to undergo necessary training. Visa assistance is available.<p>Interested? Email your resume to careers@certsafe.com.","time":1546452948,"type":"comment"}