{"by":"silviogutierrez","id":18809480,"parent":18807017,"text":"Kettlebell Kitchen | <a href=\"https:&#x2F;&#x2F;www.kettlebellkitchen.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kettlebellkitchen.com</a> | New York, NY | Senior Software Engineer | ONSITE | Full-time<p>We are looking for quick learners who enjoy working with modern software development tools in the food and manufacturing space.<p>Knowledge of specific frameworks or libraries is less important than a broad knowledge of software development practices and an ability to learn.<p>At Kettlebell Kitchen, we&#x27;re building technology to empower and drive our food manufacturing business. We believe in tried and true business models, like buying raw materials and selling a value-added product. Explosive growth is nice, but not at any cost.<p>There are a ton of areas, including much of the ordering platform, that need re-thinking.<p>Must haves:<p>1. Significant experience developing web applications and web sites.<p>2. Very good grasp of Python 3.5+ or TypeScript. Both are a plus.<p>3. Some knowledge of the other language listed above.<p>4. Willingness to work with both ecosystems.<p>5. Relational database experience, ideally PostgreSQL and MySQL.<p>6. An understanding of automated testing and when it’s an asset and when it’s a liability.<p>7. Clear, concise coding skills. Your code is more often described as &quot;clean and elegant&quot; than &quot;clever.&quot;<p>Nice to haves:<p>1. Understanding of formal methods<p>2. Bash and vi fu.<p>3. Mypy and static typing experience in Python.<p>4. React experience.<p>5. Django experience.<p>6. LoopBack experience.<p>7. Angular experience.<p>8. Static typing experience in other languages: Java, C++<p>9. API design<p>10. Rust experience<p>11. A love of healthy food or fitness. Or both.<p>Shibboleths: <a href=\"https:&#x2F;&#x2F;gist.github.com&#x2F;silviogutierrez&#x2F;38996b3421ff946d6eb00d84fb8ed331\" rel=\"nofollow\">https:&#x2F;&#x2F;gist.github.com&#x2F;silviogutierrez&#x2F;38996b3421ff946d6eb0...</a><p>Interested? Email jobs AT kettlebellkitchen.com. Please put [Hacker News] in the subject line, <i>with</i> the brackets. Maybe take a look at the shibboleths in the link above and try answering a few.","time":1546458695,"type":"comment"}