{"by":"stavrospap","id":18809788,"parent":18807017,"text":"TileDB, Inc.  |  Full-Time | Cambridge, MA or REMOTE (US)  | <a href=\"https:&#x2F;&#x2F;tiledb.io\" rel=\"nofollow\">https:&#x2F;&#x2F;tiledb.io</a><p>TileDB is a disruptive technology for storing and managing enormous volumes of structured data, adopting the best ideas from columnar and spatial database research to support fast updates, compression, and interoperability with scalable cloud object storage backends. TileDB efficiently stores data generated from variety of domains (genomics, finance, imaging, geospatial, etc) in a novel unified format as sparse or dense multidimensional arrays.  Users can store their data in a unified namespace, while being able to efficiently access this data via a growing number of language APIs and interfaces (C&#x2F;C++, Python, R and SQL data engines).<p>TileDB, Inc. has raised $4M in seed funding over the past 18 months. We are looking to aggressively expand our team. The new members of TileDB will help us build out a solution to enhance cloud interoperability, bring scalable computations to data stored in TileDB more easily, and improve areas such as data consistency, access control and sharing on the cloud through a managed service.<p>We currently have open positions in the following areas:<p>- Backend &#x2F; frontend &#x2F; full-stack engineers (Vue.js &#x2F; Go &#x2F; K8s)<p>- Experts in databases &#x2F; database engines (C++ &#x2F; Java &#x2F; Scala)<p>- Scientific programmers (Python, R)<p>TileDB GitHub organization: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;TileDB-Inc\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;TileDB-Inc</a><p>TileDB has been featured on HN: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=15547749\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=15547749</a>.<p>Our headquarters are located in Cambridge, MA. The candidates must be US citizens or permanent residents located in the US.<p>Apply today at <a href=\"https:&#x2F;&#x2F;tiledb.workable.com\" rel=\"nofollow\">https:&#x2F;&#x2F;tiledb.workable.com</a> !","time":1546460378,"type":"comment"}