{"by":"mgr86","id":18807775,"parent":18807017,"text":"Human Relations Area Files (HRAF) | New Haven, Ct | Digital Services Associate | ONSITE | <a href=\"http:&#x2F;&#x2F;hraf.yale.edu\" rel=\"nofollow\">http:&#x2F;&#x2F;hraf.yale.edu</a><p>The Human Relations Area Files (HRAF) is non-profit membership\norganization affiliated with Yale University. Founded in 1949, HRAF is\ncooperative in nature and international in scope, collecting, organizing and\ndistributing information of significance to the natural and social sciences\nand the humanities. The mission of HRAF is to promote understanding of\ncultural diversity in the past and present. To accomplish this mission the\nHuman Relations Area Files produces and distributes scholarly resources for\nresearch and teaching, and supports the conduct of original research on\ncultural variation. HRAF has its own building about a mile from the main\ncampus and with a small staff we emphasize both flexibility and teamwork<p>We are seeking candidates to join our IT team for a full-time or part-time\nposition to participate in a team responsible for a range of activities\nrequired for producing, processing and distributing digital resources that\nrelate to understanding cultural and social life of people in the past and\npresent. Candidates must be flexible and learn skills as needed. At\napplication, candidates should have experience in some of the activities\nrequired in our overall digital operations, including coding in a number of\ncomputer languages, production support tasks related to document\ndevelopment in an XML environment, design and implementation of\nservices, implementing web interfaces on both the server and client side,\ndocumentation, creating unit tests for existing and new code, identifying,\ndocumenting and fixing bugs, and participating in team discussions\nrelating to production and design and implementation of new\ncapabilities.<p>More Information: <a href=\"http:&#x2F;&#x2F;hraf.yale.edu&#x2F;announcing-immediate-opening-at-hraf-for-digital-services-associate&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;hraf.yale.edu&#x2F;announcing-immediate-opening-at-hraf-fo...</a>","time":1546449046,"type":"comment"}