{"by":"qth10","id":18811325,"parent":18807017,"text":"Thanx | SF, DEN, Remote | Principal Engineer | ONSITE&#x2F;REMOTE, Full-time | $160-$200K | <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;thanx&#x2F;jobs&#x2F;903207\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;thanx&#x2F;jobs&#x2F;903207</a><p>Americans spend more than $5 trillion on restaurants, retail, and services each year. Nearly 90% of those transactions happen in a real-world store. Data is king and online it powers personalized customer experiences and product recommendations. Offline, however, it’s still 1999. Brands are blind to their customers, causing them to spend more and more money on “megaphone” marketing. No wonder brick-and-mortar stores are being left behind.<p>Thanx is fundamentally changing that. Thanx personalizes every interaction between a merchant and their best customers, resulting in measurable increases in revenue for merchants and far greater personalization for consumers. How?\n•\tThrough proprietary partnerships with credit card networks (e.g. Visa, Mastercard, Amex), Thanx can reward consumers for their purchases and deliver highly-customized promotions\n•\tThrough our interactive dashboard, Thanx makes even the smallest marketing team a data-science driven expert in personalization - right message to the right customer at the right time through the right channel.\n•\tBy measuring our success based on revenue generated (not opens and clicks of emails)<p>Think of us as Salesforce meets Google Adwords for offline retail. Thanx is backed by some of the best investors in the world — Sequoia Capital, Icon Ventures, and Andy Rachleff (CEO Wealthfront, cofounder Benchmark Capital).<p>Thanx Engineering\n•\tTeam: early engineers at AWS, Cloudera, Climate, Zenefits, Okta. Experience from successful product companies like Disney, Google, and Facebook. This is an elite engineering team, period.\n•\tGrowth: 10x YOY data growth; $100M+ delivered to merchants; 200% team growth; modern, rapidly-evolving platform -- adopted Golang, Elasticsearch, NLP, React, React Native, GraphQL, and added 5+ new microservices; all in the last 12 months. And we are just getting started.\n•\tCulture: data-driven decision-making, risk-taking, no hierarchy, collaboration &amp; shared responsibility, testing and continuous improvement. As a remote-friendly team, we have flexible work hours and PTO policy. We work and play hard -- be warned, when it comes to Mario Kart, we are super competitive!","time":1546471294,"type":"comment"}