{"by":"Kerrick","id":18810891,"parent":18807017,"text":"Second Street | Full-Time Senior Software Engineer | St. Louis | ONSITE, REMOTE (U.S.) for the right candidate<p>POSITION SUMMARY:<p>Are you looking to join a fast-paced team and help lead it to success? Are you a well-rounded team player with front-end development experience that can work with the team to find a great solution, write the logic to make it work, and then make it beautiful with CSS? Do you want the ability to impact meaningful change and develop a community where you work? Second Street could be exactly what you&#x27;ve been looking for!<p>You will be a member of our cross-functional product development team which is made up of designers, testers, and software engineers. You&#x27;ll enjoy a high level of autonomy while also working very collaboratively in-person and remotely using Slack, Trello, and GitHub. We work together to ship code every day and are constantly looking for ways to improve. We are responsible for a suite of long-lived products that receive constant innovation, feedback, iteration, maintenance, and new feature development.<p>Software engineers at Second Street are fully involved in every part of the process, from planning, to developing, to testing, to launch. We care deeply and we do things right: version control, automated testing, code reviews, and occasional pair programming. We also focus on work-life balance, including a flexible schedule and work-from-home opportunities, so you won’t be burning the midnight oil here. As a senior front-end software engineer you&#x27;ll help your teammates work through particularly vexing issues and guide them as they build larger projects, all while keeping an eye toward usability and user experience thanks to your front-end experience.<p>COMPANY SUMMARY:<p>We are an audience engagement software platform that is used by over 3,000 media companies and marketers. Some of our leading-edge products include online contests, ballots, polls, quizzes, sweepstakes, email, audience insights, and more. We are seeking tech-savvy professionals who are passionate about our industry, learn quickly, and are motivated to succeed.<p>TECH STACK:<p>We use Ember.js (including Ember Data and ember-cli) to build most of our applications, backed by a RESTful JSON API. We utilize the latest JavaScript features, including stable TC39 proposals supported by Babel. We use Sass and PostCSS for our stylesheets, and organize our components with BEM. We also have a few TypeScript projects, including some Node.js services.<p>MORE DETAILS:<p>Details &amp; How to Apply: <a href=\"http:&#x2F;&#x2F;info.secondstreet.com&#x2F;now-hiring-senior-front-end-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;info.secondstreet.com&#x2F;now-hiring-senior-front-end-dev...</a>\nOur Hiring Process (yay transparency!): <a href=\"https:&#x2F;&#x2F;drive.secondstreet.com&#x2F;our-hiring-process&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.secondstreet.com&#x2F;our-hiring-process&#x2F;</a>","time":1546467746,"type":"comment"}