{"by":"lexasullivan1","id":18810805,"parent":18807017,"text":"Bio-rad|Pleasanton, on-site|Fulltime|Backend Web Developer (Python)|<a href=\"https:&#x2F;&#x2F;careers-en-biorad.icims.com&#x2F;jobs&#x2F;8500&#x2F;python-backend-web-developer-%28software-developer-iii-non-it%29&#x2F;job\" rel=\"nofollow\">https:&#x2F;&#x2F;careers-en-biorad.icims.com&#x2F;jobs&#x2F;8500&#x2F;python-backend...</a><p>Who We Are and What We Do\nBio-Rad is an established Fortune 1000 biotech company that creates products that help people live longer, healthier lives. Bio-Rad’s Digital Biology Group (DBG) in Pleasanton makes products (including data products) that are helping to eradicate cancer (among other things).  We’ve worked hard at building a great culture here at the DBG that cultivates collaboration and innovation, and people are honestly really passionate about what they do here. Check Us Out<p>What We Are Looking For\nA solid backend developer who will develop and own our cloud-based applications and platform for all our data products at the DBG. Are you passionate about delivering highly scalable and reusable code? Does driving and influencing cloud strategy at a Fortune 1000 company excite you?<p>Responsibilities\nBe one of the founding members of our new cloud data platform.\nWork in a collaborative environment to apply well architected solutions within this space.\nArchitect complex business logic and features to add to our web based applications from concept to implementation.\nWork alongside Scientists, Marketing, and R&amp;D Engineers through the Product Development life cycle and beyond.\nDevelop &#x2F; Improve the core infrastructure for high scalability.\nWorking with an awesome group of humble, (super smart), hardworking team players that own their technical debt and slay it.\nQualifications\n5+ years’ experience as a Software Developer.\nHands-on development experience with Python, Flask and Java in Linux environments.\nHave successfully built scalable APIs according to best practices.\nExperience with MySql, NoSQL databases, familiarity with Spark or Redshift Data warehousing.\nExperience with Cloud Hosting (AWS preferred).\nQuick learner with the ability to understand complex workflows and develop and validate innovative solutions to solve difficult problems.\nExperienced with test automation: TDD, unit&#x2F;integration&#x2F;functional testing.\nExperienced implementation efforts following an Agile software development lifecycle approach.\nExcellent communication skills, both written and verbal.\nA team-oriented contributor that aims to enhance the effectiveness of their colleagues.","time":1546467209,"type":"comment"}