{"by":"randyburden","id":18810569,"parent":18807017,"text":"Lanvera | C# Senior Software Developer, C# Software Developer Intern | Coppell, TX | Onsite | <a href=\"https:&#x2F;&#x2F;www.lanvera.com&#x2F;careers.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lanvera.com&#x2F;careers.html</a><p>About Us:<p>Lanvera is a leading CCM (Customer Communications Management) outsourcing and technology company specializing in the design, production, and delivery of secure customer communications including invoices, statements, tax forms, collection letters, compliance notices and other business critical documents to any delivery channel including print, electronic and mobile platforms. Lanvera has a strong presence in the Financial Services industry and is expanding into other vertical markets. In short, we generate documents for our clients and serve those up via the web or deliver them via postal service, email, SMS, SFPT, etc.<p>We are an established, profitable company with hundreds of clients looking to significantly increase our software development team for designing and developing the next generation of our processing infrastructure, customer web portal, and electronic delivery platforms.<p>Technologies we work with: The modern Microsoft stack using .NET, Visual Studio, C#, ASP.NET Web API, ASP.NET MVC server side rendered using Razor, MS SQL Server, T-SQL, Azure DevOps&#x2F;VSTS&#x2F;TFS, Git, IIS, HTML, CSS, JavaScript, JSON<p>Positions:<p>Senior Software Developer - <a href=\"https:&#x2F;&#x2F;www.lanvera.com&#x2F;seniorsoftwaredeveloper.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lanvera.com&#x2F;seniorsoftwaredeveloper.html</a><p>The Senior Software Developer position is a hands-on role that emphasizes advanced skills in developing full-stack software solutions coded in C# on the Microsoft .NET Framework as well as system design, data modeling, mentorship, and team leadership skills. This role requires the ability to design complex systems from scratch and the ability to see the project through all layers of the SDLC including successful testing, production release, and hand-off with appropriate support and technical documentation to the operations team.<p>Software Developer Intern - <a href=\"https:&#x2F;&#x2F;www.lanvera.com&#x2F;softwaredeveloperintern.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lanvera.com&#x2F;softwaredeveloperintern.html</a><p>Are you a software engineering&#x2F;computer science&#x2F;information systems student looking for a company with cutting edge technology? Do you want to be a part of a business offering services that support a client’s digital transformation journey? As a Software Developer Intern in a nimble environment, you make real contributions to the team and the services we offer to clients. You will be provided opportunities to perform deep analysis, design, coding, configuration, documentation, support, and installation of software. We need interns that offer energy and innovation with new technology tools and ideas.<p>Contact Us:<p>Please email CoreDevHR@lanvera.com with HackerNews in the subject to have your resume prioritized.","time":1546465707,"type":"comment"}