{"by":"vldr","id":18813494,"parent":18807017,"text":"GUTS Tickets | Medior&#x2F;Senior frontend developer | Amsterdam, The Netherlands | ONSITE €40k-€65k p.a. depending on experience, part-time&#x2F;full-time, SARS plan available.<p>GUTS Tickets is a ticketing platform &amp; service that puts an end to disgraceful secondary ticket prices and ticket fraud. We prefer onsite team-members at the moment. We&#x27;re located at the top floor of Pakhuis de Zwijger, in Amsterdam with a beautiful view over the water and inner city.<p>GUTS is looking for a senior VueJS frontend developer to extend our frontend team.<p>Our (current) tech-stack:<p>Backend: Python &#x2F; Django &#x2F; REST API &#x2F; Golang<p>Blockchain: Ethereum &#x2F; Solidity &#x2F; Crypto<p>Frontend: Vue.js &#x2F; React Native<p>We&#x27;re looking for anyone who does &amp; loves any of the following. Overlapping skills or full-stack is a big plus:<p>Frontend JS development (senior): JavaScript, Vue.js, Tests, HTML, CSS&#x2F;SASS&#x2F;PostCSS<p>As a senior frontend developer your responsibility will be to guide junior&#x2F;medior frontenders, reviewing code, making architectural choices, writing efficient (fast, compact but above al correct) code and discussing&#x2F;planning new features&#x2F;functionalities for our ticket app, dashboard app and mobile apps.<p>Competitive salary based on experience: part-time or full-time is negotiable. ESOP (SARS) or token plan are negotiable. Employee-based conference, hardware and training budget is available.<p>Perks: PS4 Pro and 4K TV gaming-battles, ping-pong tournaments, Friday-afternoon bbq&#x2F;drinks on roof terrace (looking over Amsterdam), company-wide boardgame nights, an international, diverse and highly motivated team, meetups &amp; lightning talks, access to &quot;fill in whatever you want&quot; events &amp; conferences.<p>Got GUTS? Join our team and send your CV to jobs (at) guts.tickets (soliciting is NOT appreciated).<p>Check out <a href=\"https:&#x2F;&#x2F;guts.tickets&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;guts.tickets&#x2F;jobs</a> and <a href=\"https:&#x2F;&#x2F;guts.tickets\" rel=\"nofollow\">https:&#x2F;&#x2F;guts.tickets</a> for more info.","time":1546500566,"type":"comment"}