{"by":"sschaetz-bfly","id":18812972,"parent":18807017,"text":"Butterfly Network | <a href=\"https:&#x2F;&#x2F;www.butterflynetwork.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.butterflynetwork.com&#x2F;</a> | NYC, Data Engineer, Software Engineer (Ultrasound) | On Site | Full Time<p>Butterfly Network has developed the iQ - the worlds first inexpensive handheld ultrasound whole-body imaging device. Built upon novel semiconductor technology that miniaturizes the traditional ultrasound system onto a single handheld device, iQ is combined with a mobile-first, cloud-based software platform and artificial intelligence assistance. There has never been a more exciting time to join us in revolutionizing the medical imaging industry and saving the lives of people around the globe.<p>1. Data Engineer<p>Data Engineering we are fusing a diverse set of data streams such as manufacturing data, commercial data, real-time IoT data, mobile analytics data, logistics data to continuously improve our product design, guide feature development and optimize manufacturing and operations. We seek data engineers with a track record of rapidly implementing and maintaining elegant and robust data pipelines and creating self-service data analytics infrastructure that immediately create value for business owners.<p>Apply here: <a href=\"https:&#x2F;&#x2F;jobs.smartrecruiters.com&#x2F;4Catalyzer&#x2F;743999681341882-data-engineer?trid=072e48b8-7ff6-4a25-913c-d7c0c3259126\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.smartrecruiters.com&#x2F;4Catalyzer&#x2F;743999681341882-...</a><p>2. Software Engineer (Ultrasound)<p>We seek a talented Software Engineer with a background in Biomedical Engineering, specifically medical ultrasound. As part of a cross-functional team of manufacturing-, software-, embedded-, machine-learning-, and data engineers you will be in charge of implementing an automated image quality assessment of all Butterfly IQ products. Your work will have a distinct impact on Butterfly product design decisions and manufacturing processes. Furthermore, you will support reliability testing of Butterfly products by writing test programs, designing and manufacturing test fixtures, performing experiments, and collaborating with Butterfly Network regulatory engineers. You will also support acoustic safety measurement experiments to ensure all Butterfly Network products maintain patient safety while maximizing image quality.<p>Apply here: <a href=\"https:&#x2F;&#x2F;jobs.smartrecruiters.com&#x2F;4Catalyzer&#x2F;743999681341882-data-engineer?trid=072e48b8-7ff6-4a25-913c-d7c0c3259126\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.smartrecruiters.com&#x2F;4Catalyzer&#x2F;743999681341882-...</a>","time":1546492438,"type":"comment"}