{"by":"melonjobs","id":18820016,"parent":18807017,"text":"Casaba Security, LLC | Security Consultant | Seattle, WA | Full-time | ONSITE<p>Casaba Security is a cybersecurity consulting firm based in Seattle and in business for over a decade. The term cybersecurity encompasses the entire technology stack we all use on a daily basis, from the services and components to the raw data. From the mobile device in your pocket, to the desktop software and cloud services you use every day, to the mission-critical systems that power our lives, Casaba has been there to design and test security.<p>We have immediate openings for junior, senior, and principal security consultants. This is your opportunity to be as resourceful as you want, develop your skills, and learn from and contribute to leading software development and security testing efforts. Casaba offers competitive salaries, profit sharing, medical benefits, and a terrific work&#x2F;life balance. Casaba Security is an equal opportunity employer.<p>All positions are located in the Seattle metro area. Remote positions are not available, although we will provide relocation assistance for the right candidates.<p>You should have strong skills in some of the following areas:\n    Web application development and deployment\n    .NET framework, ASP.NET, AJAX, JSON, and web services\n    Application development\n    Mobile development (Android, iOS, etc.)\n    Debugging and disassembly\n    Operating system internals (Linux, Windows, etc.)\n    Cloud services (AWS, Azure, etc.)\n    Networking (protocols, routing, addressing, ACLs, etc.)\n    Pentesting, Security Assessments<p>If you have a development background you should know one or more programming languages.<p>Applicants must be U.S. citizens and be able to pass a criminal background check.<p>We pay regular bonuses to all employees and reward based on performance, whitepapers and tool development, speaking engagements, and helping us recruit new talent. We also offer all employees a Simplified Employee Pension (SEP) after a period of tenure. It is a unique opportunity to be afforded this type of retirement package over the more traditional 401k. We pay health insurance for employees and dependents and offer generous paid vacation and sick leave.<p>Check out <a href=\"https:&#x2F;&#x2F;www.casaba.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.casaba.com&#x2F;</a> for more information.<p>To apply, please email employment@casaba.com with contact information and résumé.","time":1546555018,"type":"comment"}