{"by":"legothief","id":18847215,"parent":18807017,"text":"If you have a soft spot for bootstrapped, profitable companies with a meaningful product, and you want to use your frontend development skills for good, you’ll like this.<p>About us:<p>Drops’ goal is to turn language learning into a delightful game while ensuring effective learning. We teach 31 languages, was featured by both the App Store and Play Store multiple times - and received the “Best of 2018” title this year! - and the company is still run by the founders. We are a small, super-capable remote team mainly spread across Europe. We’re working synchronously, so time zones matter for us. We communicate via Slack, Github and have releases multiple times a week. We want to be the #1 app for vocabulary learning and we are getting there quickly with our current user base of 9 million, a monthly active of &gt;1,000,000 and an average store rating of 4.7. You can find us here: <a href=\"https:&#x2F;&#x2F;languagedrops.com\" rel=\"nofollow\">https:&#x2F;&#x2F;languagedrops.com</a><p>About you:<p>You’ll be responsible for establishing Drops on the web, from a technical perspective. This means a lot of ownership, which we cultivate by having a flat structure.<p>You’re a no-nonsense person, who is comfortable taking on and managing multiple different projects at the same time, who has been working in working at a product company and has extensive front-end development experience.<p>You have been working with React for years, have deep knowledge of everything that’s happening in the browser and looking for challenges in growing a product from tens of thousands to millions of visitors per month.<p>You strongly prefer static typing over dynamic languages, and use every opportunity to transform code that doesn’t use types into code that does. You generally prefer to use a minimal set of simple tools to a diverse range of complex ones.<p>We’ve built our mobile app with react-native, so we can easily port it to the web and start sharing most of our code - and the challenges that this brings are of your interest.<p>You like to have a variety of projects - at this job, you’ll be developing a complex web app, a static site generator (gatsby), and even sometimes helping out on our marketing website, that’s being re-built with webflow.<p>We want everyone to see the big picture: this means you already pushed your boundaries outside of “being a developer” and are knowledgeable about web product growth frameworks, SEO, best practices regarding retention and monetization.<p>We’re building a small, but super capable team. You’re naturally more interested in the fate of the product &amp; driven to grow professionally, than in managing people.<p>We value clear and honest communication and transparency, it’s the linchpin of our culture and current success and freedom. You will be involved in both high and low level decision making and will be available during European working hours (9AM - 6PM GMT).<p>We are looking for a missionary rather than a mercenary.<p>Please apply through via the following link: <a href=\"https:&#x2F;&#x2F;drops.workable.com&#x2F;j&#x2F;6DC995B44D\" rel=\"nofollow\">https:&#x2F;&#x2F;drops.workable.com&#x2F;j&#x2F;6DC995B44D</a>","time":1546881337,"type":"comment"}