{"by":"simberg-cscs","id":18873384,"parent":18807017,"text":"Swiss National Supercomputing Centre (CSCS) | Scientific Software Developer | Zurich&#x2F;Lugano, Switzerland | Onsite | Full-time<p>The Swiss National Supercomputing Centre (CSCS) is operated by ETH Zurich and develops and provides key supercomputing capabilities required to solve important problems in science and society.<p>The Scientific Software and Libraries group at CSCS is looking for developers who love writing stable, performance-portable, scientific software for the latest HPC systems. We have multiple open positions at both the ETH Hönggerberg campus in Zurich, and at the CSCS headquarters in Lugano. Your work will involve long term projects of at least one year in duration. Projects involve either close collaboration with a scientific collaborator, or work in small internal team working on software for use across multiple projects. Some examples of projects you might work on are:<p>- Template meta-programming and domain specific languages to accelerate climate and weather codes on accelerated architectures<p>- Quantum chemical and material science applications used for the prediction of novel materials<p>- Optimising and wrapping sparse linear algebra and mesh codes for our finite element and finite volume users<p>- Combining low-level optimization with task-based parallelism at extreme scale to perform fast linear algebra on the world&#x27;s largest systems<p>- Communication-avoiding parallel algorithms<p>Our projects are open source whenever possible. Here are some of the projects we develop and contribute to: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;arbor-sim&#x2F;arbor\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;arbor-sim&#x2F;arbor</a>, <a href=\"https:&#x2F;&#x2F;github.com&#x2F;electronic-structure&#x2F;SIRIUS\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;electronic-structure&#x2F;SIRIUS</a>, <a href=\"https:&#x2F;&#x2F;github.com&#x2F;STEllAR-GROUP&#x2F;hpx\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;STEllAR-GROUP&#x2F;hpx</a>. Also have a look at the profiles of some of our team members: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;bcumming&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;bcumming&#x2F;</a>, <a href=\"https:&#x2F;&#x2F;github.com&#x2F;biddisco&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;biddisco&#x2F;</a>, <a href=\"https:&#x2F;&#x2F;github.com&#x2F;halfflat&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;halfflat&#x2F;</a>, <a href=\"https:&#x2F;&#x2F;github.com&#x2F;havogt&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;havogt&#x2F;</a>, <a href=\"https:&#x2F;&#x2F;github.com&#x2F;msimberg&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;msimberg&#x2F;</a>, <a href=\"https:&#x2F;&#x2F;github.com&#x2F;noraabiakar&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;noraabiakar&#x2F;</a>.<p>We require you to have great C++ skills and a master in computer science, computational science, mathematics or natural sciences. Ideally you would also have experience in one or more of the following: materials science, weather and climate, or linear algebra; development of numerical or scientific simulation software; development of GPU-accelerated applications using CUDA or ROCm; release management; or performance modeling.<p>Tell us what project catches your eye and and why you&#x27;d be the right candidate in your application: <a href=\"https:&#x2F;&#x2F;apply.refline.ch&#x2F;845721&#x2F;6509&#x2F;pub&#x2F;1&#x2F;index.html\" rel=\"nofollow\">https:&#x2F;&#x2F;apply.refline.ch&#x2F;845721&#x2F;6509&#x2F;pub&#x2F;1&#x2F;index.html</a>. <i>Due to the migration regulations in Switzerland the process for non-EU residents is more challenging.</i>","time":1547123767,"type":"comment"}