{"by":"flyttalent","id":18897237,"parent":18807017,"text":"Flyt ( Just launched US) |Node.JS API|Remote , Client site|Full Time<p>Calling all graduate engineers, are you looking for a company where you can work from home 2 out of 3 weeks, on client site anywhere in the US for the other and be part of an amazing company that is rapidly growing?<p>Flyt provides the API platform that connects restaurants to delivery partners, ordering platforms, point-of-sale systems and beyond. We enable concepts such as Pay at Table, Delivery, Bar Tabs, Order at Table, Order and Collect, Table Management, Digital Voucher Redemption and Food Ratings for well known brands such as Uber Eats, Postmates, DoorDash, Facebook and more.<p>The Role\nWe are looking for JavaScript&#x2F;Typescript engineers who will play an integral role in building out our integration platform and building the connective tissue (integrations) between hundreds of POS systems, booking systems, menu systems and more. You will be required to travel to site for at least 1 month out of every 3 months (team of 3, 1 person onsite for each integration), so if travelling around the USA and Canada for work sounds amazing then this is the job for you.<p>Responsibilities\nTo write integrations with 3rd party API’s and systems, tools and packages in NodeJS and TypeScript, and to dive-in deep where required to other technologies such as Go.\nTo help design and further extend our Google Protobufs which are a core part of how we communicate across our integration platform.<p>We’re confident you’ll love working here if:<p>You want to get into the trenches with a collaborative team.\nYou want to contribute to architecture and deliver innovative software products.\nYou like to get stuff done, and you love working your way through a problem.\nYou are a continuous improver, you constantly push outside of your comfort zone.\nYou like to openly communicate, and willing to listen to peers<p>Please apply directly to our US CEO, at \n<a href=\"https:&#x2F;&#x2F;workable.com&#x2F;j&#x2F;B4CD621647\" rel=\"nofollow\">https:&#x2F;&#x2F;workable.com&#x2F;j&#x2F;B4CD621647</a> or email your CV to B4CD621647@jobs.workablemail.com","time":1547396503,"type":"comment"}