{"by":"jasonrosenbaum","id":18914302,"parent":18807017,"text":"Worldwide, REMOTE (or in Washington, DC), full time, $95-120k (negotiable for the right person). Frontend designer with Action Network (<a href=\"https:&#x2F;&#x2F;actionnetwork.org\" rel=\"nofollow\">https:&#x2F;&#x2F;actionnetwork.org</a>)<p>We are Action Network. We build technology for the progressive movement in a unique not-for-profit model; we create SaaS solutions with a social mission. Fast Company called our platform “the backbone of the anti-Trump organizing efforts.” <a href=\"https:&#x2F;&#x2F;www.fastcompany.com&#x2F;3069132&#x2F;this-tech-platform-is-the-backbone-of-the-anti-trump-organizing-efforts\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fastcompany.com&#x2F;3069132&#x2F;this-tech-platform-is-th...</a><p>We are the technology behind the Women’s March, People’s Climate March, Swing Left, Indivisible groups around the country, the AFL-CIO, Daily Kos, and hundreds of other progressive organizations. Our platform creates new possibilities for collaboration and mobilization that is meeting a real need for the progressive movement. We are a small team that is growing rapidly, and we are expanding our technology significantly.<p>Action Network is hiring a frontend designer for our new organizing toolset. The person in this role will make crucial design choices within our existing design framework - ensuring an excellent user experience for movement activists and organizers. You will build the concept for a feature, be open to feedback from our partner organizations, and then take it from design through frontend development. The position reports to Action Builder’s Product Manager and plays a highly influential role in decisions surrounding the tool’s design and development.<p>We are looking for a CSS&#x2F;HTML developer with design skills. You should have a portfolio, and be comfortable bringing your designs to life.<p>We offer excellent benefits. Generous leave and vacation policies, health care, 401k grant, etc...<p><a href=\"https:&#x2F;&#x2F;action-network-1.workable.com&#x2F;j&#x2F;0D6110327D\" rel=\"nofollow\">https:&#x2F;&#x2F;action-network-1.workable.com&#x2F;j&#x2F;0D6110327D</a><p>Apply with a resume&#x2F;CV and a portfolio&#x2F;github account at the above link. Happy to answer any questions!","time":1547581729,"type":"comment"}