{"by":"mikenyc","id":3914416,"parent":3913997,"text":"New York, NY - Craft Coffee - Lead Rails Engineer\nFull-time\n<a href=\"http://craftcoffee.com/jobs\" rel=\"nofollow\">http://craftcoffee.com/jobs</a><p>We're looking for a kickass full-stack Rails developer.<p>TECHNICAL CHALLENGE<p>It's not a shopping cart.  We want to build a best-in-class integration of marketing and technology.  This is the new golden skill set.  You'll master it at Craft Coffee, and engage in very hard problems on the leading edge of online commerce.<p>See, for example: <a href=\"http://andrewchenblog.com/2012/04/27/how-to-be-a-growth-hacker-an-airbnbcraigslist-case-study/\" rel=\"nofollow\">http://andrewchenblog.com/2012/04/27/how-to-be-a-growth-hack...</a><p>ABOUT CRAFT COFFEE<p>We're seriously passionate about what we do.  Every team member receives tons of great coffee equipment on day 1. We live what we do, and we'd never sell anything to our customers that we didn't personally love.<p>We ship coffee to paying customers in 48 states and 9 countries.  Our subscribers LOVE us.  Coffee is an everyday ritual and we elevate that moment for people.<p>PEOPLE YOU RESPECT LOVE US\nTechnologists, entrepreneurs, food writers, chefs, designers, filmakers.<p>Alexis Ohanian, founder of Reddit.  He subscribed, fell in love, then invested because of our product execution: \"Continuing to be impressed by Craft Coffee. Is it wrong that I'm starting to tell NY tech startups by their attention to design?\"<p>Dave McClure, pirate at 500 Startups: \"For all you aspiring lawyer-entrepreneurs out there, I just want you to know that we invest in lawyers only if they know how to code like [Craft Coffee founder] Mike Horn!\"<p>Amanda Hesser, author of The Essential NYTimes Cookbook &#38; founder of Food52: \"New weekend ritual -- grinding @craftcoffee beans in manual grinder &#38; making coffee in a French press.\"\"They do an excellent job all around -- interesting sources, thoughtfully assembled -- and I really enjoy the element of surprise every month.\"<p>Ondi Timoner, filmmaker (Dig! and We Live in Public), winner of the Sundance Film Festival Grand Jury Prize (twice!): \"Thought I'd never tweet about food &#38; drink but this is really a public service announcement - go get @craftcoffee now!\"<p>Zach Klein, co-founder of Vimeo, CEO of DIY: \"My favorite of-the-month-club is @craftcoffee -- three packages of coffee beans delivered from different roasters each month.\"<p>PRESS LOVE US<p>Wall Street Journal: \"An artisanal greatest hits package.\"<p>Tasting Table: \"Your morning just found more glory\"<p>Sprudge (a leading coffee industry blog): Best New Product of 2012: \"The very act of opening your Craft Coffee box is a joy, the packaging artful, delicate and neat. The coffees selected therein are consistently surprising, unexpected, and splendid. There's some magic in the air at Craft Coffee.\"<p>Serious Eats: \"a chance to really compare and think differently about what's being done out there in coffee\"<p>Saveur: \"perfect gift for the coffee connoisseur in your life.\"<p>Martha Stewart Everyday Food: \"Barista in a box.\"<p>APPLY<p>See our full job post here: <a href=\"http://craftcoffee.com/jobs\" rel=\"nofollow\">http://craftcoffee.com/jobs</a>\nAfter you check us out and see what we're all about, email us at dev@craftcoffee.com.  It's a direct line to the CEO.","time":1335882019,"type":"comment"}