{"by":"proletarian","id":3914376,"parent":3913997,"text":"We're hiring devs at Adobe to work on social media marketing in San Francisco, Colorado Springs, an Orem, UT. Full-time only.\nWe use Rails, Mongo, Redis, and are doing amazing things with social APIs and big data analytics over social data.\n<a href=\"http://www.adobe.com/products/social.html\" rel=\"nofollow\">http://www.adobe.com/products/social.html</a><p>Position Summary<p>Architect and build new solutions for social marketing within Adobe's Digital Marketing Suite. This position involves working with complex and dynamic social APIs from Facebook and other social platforms. You'll work with large data sets and be involved with scaling a platform that handles millions of users interacting with the world's biggest brands. Our small, distributed team is located in San Francisco, Colorado Springs, and Orem, UT. We constantly get to work with new challenges as the social platforms evolve, and often find ourselves evaluating new technologies.<p>Responsibilities\nLead development for large, complex social marketing features.\nDefine APIs for internal and partner consumption.\nGain broad knowledge of our platform and fix bugs / refactor code throughout.\nMake intelligent engineering choices about product architecture and development approaches.\nLead conversations about our solutions, both internally with team members and externally with customers.\nDefine, develop, and innovate on our team processes.\nWork with team members to guide them to better solutions, review code, etc.\nRequirements\nBS or advanced degree in Computer Science or similar field.\nMinimum of 6 years experience working on complex systems, or equivalent.\nBroad technical knowledge and demonstrated track record of picking up new skills.\nExperience with, or genuine interest in, social media.\nKnowledge of at least one web programming language (Ruby/Rails, PHP, Java, etc.).<p>Here is the link: <a href=\"https://adobe.taleo.net/careersection/2/jobdetail.ftl\" rel=\"nofollow\">https://adobe.taleo.net/careersection/2/jobdetail.ftl</a><p>Adobe believes in hiring the very best. We are known for our vibrant, dynamic and rewarding workplace where personal and professional fulfillment and company success go hand in hand. We take pride in creating exceptional work experiences, encouraging innovation and being involved with our employees, customers and communities. We invite you to discover what makes Adobe a place where exceptional people thrive.<p>Click this link to experience A Day in the Life at Adobe: <a href=\"http://www.adobe.com/aboutadobe/careeropp/fma/dayinthelife\" rel=\"nofollow\">http://www.adobe.com/aboutadobe/careeropp/fma/dayinthelife</a>","time":1335881629,"type":"comment"}