{"by":"Peek","id":3914955,"parent":3913997,"text":"Peek (www.peek.ly) - Manhattan, NY (interns, part-time, full-time, H1B welcome)<p>Peek wants to make the Internet and data available globally via mobile devices. We want people in the most remote regions of the world to obtain $50 or even $25 devices to communicate and collect the data they need. This means that we need to make software that is affordable and uses as little data as possible. But is still incredibly powerful! It's a big challenge.<p>At Peek we are looking for software engineers who have a passion for the startup environment, and who want to develop skills on new and emerging technology while learn more about what it takes to start a successful company.<p>What we're looking for?<p>1. You love to create. You will code and build mobile apps on the hottest mobile platform in the world (and it's not iOS or Android... hmmm), it's an SDK used in 40% of the phones in the global market (and growing 50% year over year). You'll also work on our cloud systems, hosted in Amazon AWS and learn all about mobile to cloud applications, and handling scale on the order of millions of clients. We use C/C++, Java, .NET, Ruby, Javascript (including node.js), and many others.<p>2. You are eager to do it all and make an impact: product and feature planning, development, project management and of course, testing (we all do it!)<p>3. You are \"smart and gets things done\" (and can name the guy who coined that phrase)<p>4. You want to be part of a startup - this means a very small organization with a flat hierarchy where you can communicate freely and openly.<p>What's in it for you?<p>1. A very competitive salary, great health care (incl. vision and dental), stock options, group events (like ping pong nights) and a great working environment in Manhattan, New York.<p>2. The opportunity to work on every aspect of a mobile operation, including embedded (C/C++), back-end (Java, node.js), cloud systems (EC2), and more. You'll get a chance to work on all of these systems, not just one or two.<p>3. Our founders, who have raised over $100m in capital in their careers, will show you the start-up ropes, do sessions with you, and introduce you to folks in the startup community - entrepreneurs, VCs, etc. And when you want to start your next big startup, we'll be there to help you out.<p>Peek launched nation-wide in the US, in late 2008. Since then we’ve launched successfully across Europe and in India, and picked up many awards along the way including Time's Gadget of the Year, Wired Product of the Year, and GSMA nomination for Best Cloud Technology. Peek is backed by top-tier venture capital firms RRE Ventures and L Capital, and led by the founder of Virgin Mobile USA (IPO 2007; acquired by Sprint).<p>Send us an email to jobs@peek.ly","time":1335887862,"type":"comment"}