{"by":"donohoe","id":3914453,"parent":3913997,"text":"New York, Backend and Frontend Developers, PM, &#38; Design. Full-time.<p><pre><code>  UPDATE: Only job enquires please. \n  I'm not interested in your consulting company services \n  or recruitment agency at this time. Thanks.\n</code></pre>\nI'm hiring for a number of positions for a new global business site from Atlantic Media. We're based in NYC with an office in Soho. Each role is a hands-on position and you will be working closely with other developers on your team and editorial. There is the opportunity to work on a large number of fun and challenging problems as the site and team grow.<p><i>Backend Developer</i> - Expert level Django/Python or WordPress/PHP experience. You will work with other developers to build a solid backend and devise solutions for our unique set of editorial and application needs. Expertise optimizing code for high traffic sites a must (scalability, caching etc).<p><i>Frontend Developer</i> - We're not beholden to any JS framework (yet) but lets assume jQuery as a start point. Emphasis on building solid user experiences and web applications. Focus on new and emerging \"HTML5\" technologies and APIs (localStorage, geo, offline) and a view to mobile first.<p><i>Design</i> - Looking for a strong design lead to work with product and dev (we're all on the same team, literally). You'll be given wide creative voice and actively encouraged to push in new directions as opposed to traditional methods.<p>You’ll be working with other great minds from Atlantic Media, WSJ, NiemanLab, Gawker and many others. The cast is assembling.<p>Interested? You should be. I’m not leaving the West Coast just for the bagels.<p>Take a look at the postings linked below from Atlantic Media’s site.<p>Use those as a guide and feel free to contact me directly:\nmichael@donohoe.io<p><pre><code>  Project Manager\n  http://bit.ly/HT6BGB\n\n  Web Designer\n  http://bit.ly/IyjuA7\n\n  LAMP/Python Developer (refers to Django, Wordpress also good)\n  http://bit.ly/IyjX5r\n\n  Senior Developer\n  http://bit.ly/IyjBvC\n</code></pre>\nGet in touch. Traditional resume is fine but bonus points:<p>- Links to your work on GitHub or other public repos<p>- StackOverflow profile<p>- Links to websites or services where you've had a primary development role.<p>For Design, any work on Dribbble or other portfolio platform is great. Please draw attention to any mobile work or UI ideas you've explored.","time":1335882458,"type":"comment"}