{"by":"RichardPrice","id":3915474,"kids":[3962152],"parent":3913997,"text":"San Francisco, CA. Full time.<p>Academia.edu is a platform for academics to share research papers. The company's mission is to accelerate the world's research.<p>Almost every technological and medical innovation in the world has its roots in a scientific paper. Science drives much of the world’s innovation. The faster science moves, the faster the world moves.<p>It's widely held that science is too slow, and too closed. We are working on changing that, and re-inventing the way that scientists communicate. The stakes are high. If the inefficiencies in science can be removed, we may be able to accelerate science by a factor of 2, leading to a huge impact for humanity.<p>For more on the problem Academia.edu is solving, see the guest post on TechCrunch last Sunday on 'The Future of Science' by Academia.edu's founder, Richard Price <a href=\"http://techcrunch.com/2012/04/29/the-future-of-science/\" rel=\"nofollow\">http://techcrunch.com/2012/04/29/the-future-of-science/</a><p>Academia.edu has over 1.2 million registered users, and over 3.5 million monthly unique visitors. Both of these metrics tripled in 2011. Over 4,500 papers are added to the platform each day, and over 3,500 academics join each day.<p>We just raised $4.5 million from Spark Capital and True Ventures <a href=\"http://news.ycombinator.com/item?id=3297812\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3297812</a>. Some of our angel investors include Mark Shuttleworth (founder of Ubuntu) and Rupert Pennant-Rea (Chairman of The Economist).<p>We need talented engineers to come and help us with the mission. We have a strong engineering culture. We're an 11 person team based in downtown San Francisco. The site is in Rails, and other technologies we use include PostgreSQL, Redis, Varnish, Solr, Memcached, Mongodb, Beanstalkd.<p>Familiarity with our technologies is a plus, but it's not essential. It's far more important that you are a quick learner who can pick up new technologies quickly. There is more information about the company on our hiring page, at <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>.<p>The kinds of things you would be working on include:<p>★ tools for scientists to share their work faster and more openly<p>★ algorithms to mine our data, and to find out what research is trending in real time<p>★ back-end infrastructure to scale the site on AWS<p>What we're looking for are:<p>☀ 2+ years of web development experience<p>☀ Experience with the full engineering stack<p>☀ Passion for engineering<p>All the strategic decisions in the startup are made collaboratively, whether they are about hiring, new feature development, user growth, user retention, funding, or revenue. You can participate in those general startup decisions as much or as little as you want. We have found that our decisions are much better as a result of everyone contributing to them. If you like having an impact, you will enjoy the Academia.edu culture.<p>There is more information here <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>.\nH1B candidates are very welcome. We will take care of the visa process.<p>If you are interested to learn more, please email Ryan Jordan at ryanj [at] academia.edu","time":1335893672,"type":"comment"}