{"by":"KoryFerbet","id":3915638,"parent":3913997,"text":"Seattle, WA Fulltime<p>An already profitable Seattle based Startup is looking for mobile developers, both Android and iOS to join their team permanently. They have a fantastic advisory board and great team. Their leaders all have experience taking startups and turning them either public as well as negotiating acquisitions.<p>We are seeking a self-motivated, creative multi-platform mobile application developer with a passion for pushing the envelope of user experience to create intuitive, useful, and widely-adopted apps. This position is the first of its kind in our organization and as such, you will have an opportunity to make this job your own. Because my client is a startup you will have a chance to leave your thumbprint with a company that is revolutionizing mobile performance.<p>Key Responsibilities<p>Develop rich-UI applications for iPhone and/or Android platforms\nWork with graphics designers to design and implement a rich and intuitive mobile user experience\nWork collaboratively in a team environment that includes more senior application developers and/or architects\nSkills Required<p>Strong familiarity with cutting-edge UI implementations, including underlying threading models\nTrack record of bringing apps to mass market, either solo or in team settings\nKnowledge of Java on Android and/or Objective-C on iOS\nDisciplined coding style with an eye toward maintainability\nRelentlessly high quality standards and extreme attention to detail\nA history of positive teamwork and the ability to thrive in a fast-paced environment\nExperience with integrating multiple aspects of API.\nB.S. or B.A. in Computer Science, Computer Engineering, or similar, or equivalent experience<p>Bonus Points<p>Experience working on the NDK\nExperience with Amazon EC2<p>You can apply via <a href=\"http://www.bullhornreach.com/job/149588_mobile-application-developer-seattle-wa\" rel=\"nofollow\">http://www.bullhornreach.com/job/149588_mobile-application-d...</a><p>Or send me an email for more information Kory@imatch.com","time":1335895689,"type":"comment"}