{"by":"nscharhon","id":3916639,"parent":3913997,"text":"Seattle, WA - Pariveda Solutions (full-time)<p>At Pariveda Solutions we focus on The Business of IT®, helping our clients improve their bottom line through information technology strategy and solutions.  Our goal is to be the #1 privately held IT consulting firm in the world, striving to build long-term relationships with clients where partnership is a centerpiece.  Our mission is to incubate, develop and deploy world-class talent in service to our clients.<p>The Pariveda Opportunity:<p>As a Pariveda Associate, you will work on small project teams to deliver solutions to our customers:<p>•\tOn most of your projects you will work directly with our clients:\no\tTo understand and document their business and technology requirements.\no\tTo design, code and test technology solutions. \n•\tOn IT strategy or process projects, you will be a member of a team with more senior Pariveda consultants. You will work with many technologies and work as an IT visionary for the client.  \n•\tOn some projects, you may be a team lead for one or more consultants.\n•\tYou will be involved in building Pariveda by participating in intellectual capital development, training, recruiting, and business development.\n•\tYou will work mostly with local clients as a part of our geographic model, minimizing travel requirements.\n•\tYou will work alongside some of the sharpest developers to improve your technical and consulting skills.<p>This is an exciting opportunity to help build our fast growing national consulting company, your career, as well as the careers of others.<p>Candidates must meet the following requirements:<p>•\tThree to seven years of consulting or related experience\n•\tExperience as a team lead or senior developer\n•\tExperience  in one or more technologies:\no\t Java / J2EE\no\tMicrosoft.NET\no\t Business Intelligence Technologies\no\tASP.net\no\tSQL\no\tAJAX\no\tJavaScript\no\tHTML\no\tCSS\n•\tExperience working with clients or customers\n•\tExperience with multiple phases of the SDLC\n•\tAbility to read and understand technical documents written in English, with good communication skills on email and phone conferences\n•\tAbility to share knowledge and expertise with other Pariveda software developers\n•\tStrong analytical thinking and problem solving skills\n•\tStrong written and oral communication skills\n•\tBachelor’s Degree in MIS, Computer Science or Comparable major\n•\tLegally authorized to work for any company in the United States without sponsorship","time":1335911042,"type":"comment"}