{"by":"technology","id":3917887,"parent":3913997,"text":"VaynerMedia - 373 Park Avenue South, Floor 9, New York, NY 10016<p>Community &#38; Content Coordinator\nLocation: New York, NY<p>Location: New York, NY Type: Full Time Min. Experience: Mid Level\nThe Community &#38; Content Coordinator works hand-in-hand with the Account Executive and serves as their more analytics and community oriented counterpart.<p>Who are you?\nCreative, comforted by the numbers, and centered in an unwillingness to maintain the status quo.  We look for folks that are “good at the internet”.<p>The task at hand:<p>You will be assessing and solving complex brand challenges through a community and content lens relying on a sixth sense (and data) to encourage maximum engagement\nAs an ardent protector of our methodology and ethos, you will constantly be called upon to give your ideas on what works, what doesn’t and why\nWe’ll expect you to think like the brand, eat like the brand, and speak like the brand with a level of respect and dedication that is typically only found within a client organization\nInvest in popular culture and digital spaces to bring seemingly unrelated content ideas and concepts to bear (walking the walk is incredibly important to us)\nTranslating an understanding of, and respect for, good user experience into innovative content from ideation to creation to assessment\nAct as a mentor, teacher and/or sounding board for the community managers and multi disciplinary team surrounding you<p>The Ideal Candidate has:<p>A Bachelor’s degree and 2-4 years of interactive experience working on digital / social strategies + campaigns, including some client-facing experience\nA deep love and respect for communities and the power that can be housed within them supplemented by a commitment to listen and adapt as they change\nAn even temperament that will allow you to think clearly and communicate clearly in times when swift action (or the diffusing of potential issues) is imperative\nAn innate curiosity and desire to determine how something works and then be driven to improve upon the original concept\nThe ability to effectively collaborate with multidisciplinary project teams to enable all participants to feel equally invested in strategies and executions and keep everyone in the know and in a position to succeed\nA sparkling personality that will mesh well with the existing VaynerMedia family (we love smart people with a dash of quirkiness and humor)\nAn insatiable curiosity and knowledge about all things social, web, and mobile\nThe ability to write concisely and with a strong voice, without typo or delay with general editorial sensibilities\nAn interest and comfort level in standing in front of a client or a room full of peers and giving their opinion or a presentation\nThe uncanny ability to see opportunities and solutions in the face of a challenge\nAn interest in math, data and analytics (if you were the one asleep in math class, we have other roles that might be of more interest to you)<p><a href=\"http://careers.vaynermedia.com/apply/8WIzAX/Community-Content-Coordinator.html\" rel=\"nofollow\">http://careers.vaynermedia.com/apply/8WIzAX/Community-Conten...</a><p>===========================================================<p>Junior Designer<p>Location: New York, NY Department: Creative Type: Full Time Min. Experience: Entry Level<p>VaynerMedia is looking for a junior designer to join our in-house team full-time. We’re looking for someone who is passionate about design and social media and is comfortable working in a fast paced environment. You'll be working exclusively within the digital realm (no print work) and the portfolio you submit should reflect this.<p>Requirements:\n- Formal design schooling OR equivalent experience working professionally.\n- Strong typography skills and a ridiculous attention to detail. Also helpful to have experience with information and icon design.\n- Must know the ins-and-outs of Photoshop and the rest of the Adobe Creative Suite.\n- You'll be working with our clients and must be comfortable designing within the aesthetic and voice of their brands. You need to be good at taking in feedback and adapting accordingly.\n- Must have a startup mentality. We work hard and love every minute of it. You should also be comfortable working within an agency structure.\n- Must live in or near NYC or be willing to relocate.<p>Bonus points:\n- An understanding of UI/UX.\n- An understanding of the big social media platforms and their abilities/limitations (design-wise).\n- Experience working with developers and a basic understanding of the abilities/limitations of the major code languages.\n- Mild to major illustration skills.\n- An obsession with sports, music, or food.<p>Please include in your cover letter a link to your portfolio (if you do not have a link please attach with the cover letter). Please also include a few sentences on what you think is the best designed website or app out there, and why.<p><a href=\"http://careers.vaynermedia.com/apply/kWHDVB/Junior-Designer.html\" rel=\"nofollow\">http://careers.vaynermedia.com/apply/kWHDVB/Junior-Designer....</a>","time":1335941354,"type":"comment"}