{"by":"takecarex3","id":3921844,"parent":3913997,"text":"San Francisco, CA -<p>Venture backed stealth healthcare technology company seeks self-motivated Ruby on Rails Developer (RoR). We have just relocated to San Francisco and have already solidified partnerships with the biggest names in healthcare technology. We recently closed funding with Peter Thiel’s Founders Fund (Facebook, Yammer, Spotify, SpaceX, Practice Fusion, Path, RapLeaf). If you are looking for a ground-level opportunity with high growth potential this is it. You will be one of our founding engineers and work directly with our Product Manager. You will be directly responsible for coordinating, designing, building, and implementing features and workflows into our full product stack. We’d eventually like you to grow into managing our engineering team. Together, we can grow an exciting product that will undoubtedly become an integral part of the future of medical care, but we need your help.<p>Responsibilities:<p>-Work directly with offshore engineering team and report to product manager<p>-Implement product features via Ruby on Rails (RoR)<p>-Build and maintain existing infrastructure and systems<p>-Willingness to take on greater role as company grows and expands, including managing engineering team<p>Requirements:<p>-1-2 years of Ruby on Rails (RoR) development and willingness to vastly improve ability and learn<p>-Strong communication skills with CEO &#38; Product Manager to help design, spec, and build new features<p>-Strong work-ethic, self-motivated, work well in teams<p>Bonus:<p>-Experience with Test Driven Environemnt (TDD)<p>-Experience with agile development<p>-Startup experience<p>-Interest in healthcare<p>-VoIP (SIP/RTP) (OpenSIPS/Asterisk)<p>-iPhone Development<p>-Android Development<p>-Flash RTMP<p>More about the project:<p>The project relies heavily on VoiP Technologies for communication (both voice and video). We have an existing product written with endpoints in Ruby on Rails, iOS and Android. Experience with VoiP Technologies is strongly preferred, although not essential. Experience with Ruby on Rails projects and agile development is required.<p>This is a big opportunity to join a great team of individuals in a leadership role and be on the ground floor of changing healthcare. If you think you’re a good fit, please email sfhealthstartup [at] gmail.com with any relevant information (github, LinkedIn, Twitter, resume, etc.)<p>Competitive compensation, benefits, and equity participation","time":1336004953,"type":"comment"}