{"by":"napoleond","id":11612784,"kids":[11614866],"parent":11611867,"text":"SiteDocs is hiring junior and senior programmers to join our REMOTE team (North American time zones), working on web and mobile applications for the construction industry. (SiteDocs headquarters are near Vancouver, but our dev team is spread throughout Canada and North America.)<p>We&#x27;re a growing B2B start-up with dozens of employees, thousands of users, and real revenue. Our mobile applications are built with Xamarin, and our web app is built with React, but we don&#x27;t necessarily care if you&#x27;ve worked with either before as long as you&#x27;re a good programmer who&#x27;s interested in (and reasonably good at) learning new things.<p>A job at SiteDocs means:<p>* Being responsible for your own piece of the product. We&#x27;re a relatively small team, and our product is relatively young, so the features and components you build will have a meaningful impact on our users&#x27; experiences.<p>* The opportunity to teach (for senior developers) and to learn (for junior developers). Our company values continuous learning, and as a dev team we are more than happy to hire and train programmers right out of university (or self taught, etc).<p>* Market salary. However, we&#x27;re a Canadian company and our dollar is not doing very well these days, so it is currently difficult for us to pay in markets that demand more than $100k USD. I know that&#x27;s a completely reasonable salary, but we&#x27;re just not there at the moment and don&#x27;t want to waste your time :) As a remote team, it is more feasible for us to hire people in low cost-of-living areas and pay them slightly above-market for their location--note, however, that we&#x27;re limited to employees working in North American time zones at the moment.<p>Our hiring process is as follows:<p>1. Email application.<p>2. 15 minute screening call with me.<p>3. Online programming test at testdome.com. It&#x27;s a fairly tough test, with questions in a few different programming languages (the intent is not to bias our process towards experience with any particular language).<p>4. Short (one page) writing sample. We value written communication a lot.<p>5. Group conversation (over Google Hangouts) with some other members of the team. This is largely assessing oral communication.<p>Yes, there are several steps, but the entire process only adds up to about 5 hours of your time, and the plus side is you&#x27;ll be joining a remote team that truly values programming competence AND communication skill.<p>If you&#x27;d like to talk, please email dave.noel@sitedocs.com with &quot;HN Hiring&quot; in the subject line.","time":1462205979,"type":"comment"}