{"by":"jeffmellen","id":11613313,"parent":11611867,"text":"10x Genomics | Pleasanton &amp; San Francisco, CA | ONSITE | 10xgenomics.com | software.10xgenomics.com<p>Cutting-edge biotech company developing instruments and software to better understand the genome.<p>- Senior Software Engineer - $100-150k<p>- Senior UI Engineer - $100-150k<p>- Full benefits, 401(k), Netflix-style vacation policy<p>10x Genomics builds hardware and software that adds new capabilities to existing genetic sequencers.  We use molecular barcoding to uniquely tag DNA fragments from either the same molecule or strands from individual cells, and software to stitch them back together post-sequencing.  This process can resolve biologically relevant questions about large structural genetic mutations, and determine variations in gene expression between cells-- both vital in disease research.  The market for our platform is growing rapidly, and our instruments and software are used at some of the top research institutions and hospitals in the world.<p>We are particularly looking for systems engineers who have experience developing cloud architecture, and UI engineers who have developed dynamic web applications.  You will be developing software that will enable researchers to much more quickly get answers out of the hundreds of gigabytes of data generated by a single sequencing run.  You can view a demo of our existing software at <a href=\"http:&#x2F;&#x2F;loupe.10xgenomics.com\" rel=\"nofollow\">http:&#x2F;&#x2F;loupe.10xgenomics.com</a>, or read about our pipelines at <a href=\"http:&#x2F;&#x2F;software.10xgenomics.com\" rel=\"nofollow\">http:&#x2F;&#x2F;software.10xgenomics.com</a>.<p>We manage our pipelines with Go, develop analysis code using the NumPy stack, and drive our front-end applications with AngularJS, though we&#x27;re open to any technology that allows us to develop faster.  Our software team is small; four people are working exclusively on system architecture and visualization, with about a dozen computational biologists developing the analyses.  No previous biological experience is required; we have plenty of folks here to handle that, but there is a lot to learn about if you&#x27;re curious.<p>10x has most recently raised a $55M Series C from Fidelity and SoftBank, and has about 110 employees in Pleasanton, San Francisco, and in the field across the world.  The company has brought together a remarkable team of experts from across many domains, and developed an open, collaborative culture.<p>If you have an interest in something different, something futuristic, and something altruistic, feel free to reach out at jeff@10xgenomics.com.","time":1462209024,"type":"comment"}