{"by":"ashchristopher","id":11616053,"parent":11611867,"text":"Wave | Toronto, Canada | Fulltime\nWave is a top Toronto startup backed by amazing Silicon Valley investors ($42million USD raised). We build an ecosystem of back-office applications (like invoicing, payments, accounting, payroll, etc) for startups and small businesses.<p><pre><code>  At Wave you will:\n    * Build and maintain Wave’s hosting and data infrastructure, following infrastructure-as-code principles\n    * Develop and share expertise in the our products and platforms, and use that knowledge to increase performance, availability, and observability\n    * Work with delivery teams to understand their operational wants and needs\n    * Develop tooling to support continuous delivery, rapid deployment, and developer empowerment\n    * Take on both coding and system administration tasks\n    * Participate in an on-call rotation, including off-hours and holidays\n    * Show and live our team values of cooperation, continuous improvement, automation, cross-functional thinking, and empathy\n\n  What we&#x27;re looking for in you:\n    * Comfort working on the command line and using common Linux tools (incl. shell scripting)\n    * Experience with Linux system administration and configuration, especially on Ubuntu and&#x2F;or CentOS\n    * Familiarity with configuration management tools and concepts\n    * Knowledge of fundamental operating systems and networking concepts – HTTP, TCP, DNS, NTP, etc.\n    * Comfort working in at least one programming language\n    * Interesting experience, or a relevant academic degree\n\n  What we offer:\n    * Top tier compensation (including stock options)\n    * Mentorship and career development\n    * Unlimited snacks and beverages\n    * Fitness allowance\n    * Annual conference budget\n</code></pre>\nApply here: <a href=\"https:&#x2F;&#x2F;www.waveapps.com&#x2F;about-us&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.waveapps.com&#x2F;about-us&#x2F;jobs&#x2F;</a> and mention Hacker News in the submission!","time":1462226396,"type":"comment"}