{"by":"alexfogg","id":11616089,"kids":[11622701],"parent":11611867,"text":"Bauer Xcel Media | New York, NY | Full Time | Developer REMOTE OK, other positions ONSITE<p>Bauer Xcel Media is a &#x27;startup&#x27; division within the Bauer Media Group, a huge&#x2F;profitable&#x2F;long-standing&#x2F;German&#x2F;global publishing company. Bauer is one of the largest media companies you&#x27;ve never heard of. It owns some of the most popular magazines in the world, as well as radio stations, huge websites, startup investments, among many other things. Bauer traditionally did not have a strong digital presence, and Xcel is the team tasked with changing that. We build high-traffic magazine websites and are experimenting with ways to monetize sites, such as through a global sweepstakes platform.<p>While we have a large German parent-company, we operate as a separate &#x27;startup&#x27; and are growing like crazy. About our culture:<p><pre><code>  * We work out of a very nice and fun WeWork office.\n  * There is an _incredible_ emphasis on work-life balance.\n  * Late nights are extremely rare, vacation is very-much encouraged.\n  * There is a focus on results, not butt-in-seat hours.\n  * We have a remote-friendly culture, depending on your team and role.\n  * Everyone is super friendly.\n  * The company is extremely diverse in terms of age, race, and gender.\n  * We work on global problems with teams from other countries.\n  * Interesting technical and business problems!\n  * Lots of room for career growth as we scale the company up\n</code></pre>\nTech stack:<p><pre><code>  * Ruby&#x2F;Rails&#x2F;Heroku&#x2F;Javascript&#x2F;AWS&#x2F;Postgres&#x2F;MongoDB\n</code></pre>\nRoles:<p><pre><code>  * Product Manager, Editorial\n  * Product Manager, Sweepstakes\n  * DevOps\n  * Architectural Front-End Developer\n  * Developer (Backend, Frontend, or Full Stack Ruby on Rails)\n  * Business Intelligence Analyst&#x2F;Developer\n  * Director of Yield Management\n</code></pre>\nLook here for more info: <a href=\"http:&#x2F;&#x2F;bauerxcel.theresumator.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;bauerxcel.theresumator.com&#x2F;</a><p>Email me at afogg@bauerxcel for more info or to forward your info to the hiring manager. Or apply online and mention that I referred you.","time":1462226760,"type":"comment"}