{"by":"meonicorn","id":11613984,"parent":11611867,"text":"Tempo Automation | San Francisco | Product Designer<p>Tempo Automation is revolutionizing the electronics manufacturing field. We are creating the first ever electronics manufacturing solution  that helps established companies and entrepreneurs create hardware at the speed of software. We believe that creative people have outsized impact on society, and are passionate about building tools to unleash that potential.<p>We are looking to hire an exceptional and ambitious designer to lead design at Tempo. You will own and architect the seamless experience for our customers. You will direct the design of our products, brand, marketing channels, and guide our factory&#x2F;office space. You will push boundaries for what it means to interact with the company’s leadership, internal and external customers.<p>You will design a system that enables electronics engineers to focus on the creative and leveraged aspects of their work - not phone calls, emails, and logistics. At Tempo, we are inspired by the ease of compiling software, and hope to bring that same experience to building electronics. As lead designer, you will define that experience by working with a talented team of software engineers.<p><a href=\"https:&#x2F;&#x2F;secure.tempoautomation.com&#x2F;home&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;secure.tempoautomation.com&#x2F;home&#x2F;careers</a> or email directly to careers@tempoautomation.com<p>Requirements:\n-3+ years of commercial product design experience\n-Strong information design skills with a solid foundation in UX design heuristics\n-Voracious when it comes to acquiring knowledge\n-Excellent oral and written communication skills\n-Excellent graphic design skills (layout, typography, color)\n-Mastery of design tools: Sketch, Illustrator, and&#x2F;or Photoshop\n-Mastery of prototyping tools: Framer, Pixate, Origami, and&#x2F;or HTML&#x2F;CSS&#x2F;JS\n-Ability to generate pixel-perfect production assets\n-Ability to thrive in a fast-paced, dynamic startup environment\n-Superb attention to detail\n-Comfort collaborating with customers, sales and marketing, engineering, and operations\n-Ability to synthesize and analyze huge amounts of information\n-Ruthless prioritizer","time":1462213129,"type":"comment"}