{"by":"Willrc","id":11615599,"parent":11611867,"text":"Front End Developer - Mobile | <a href=\"https:&#x2F;&#x2F;www.roostermoney.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.roostermoney.com</a> | On-site |London<p>We are building a platform that takes children from their first steps in understanding the value of money to their first bank account - in any currency and country. We are passionate about building a product that helps families engage with saving and delights parents and children alike.<p>We shipped the first stage in our platform – a pocket money tracker in January.<p>This role offers you the opportunity to take a senior position in a small team at an exciting and early-stage; not only building our product but getting involved with how we shape our product strategy as a whole.<p>We are constantly experimenting with new technologies, at the moment we use .NET, Cordova, Javascript, Handlebars.JS, and Backbone. You will be mainly working in our mobile app and interfacing with both our own API and partner API’s.<p>RESPONSIBILITIES<p>* Play a critical role in designing and building our platform.\n* Ship and taking ownership of impactful new features and functionality\n* Develop robust deployment and testing processes\n* Working closely with a small group of determined, like-minded people to reshape the way families talk and engage with money.<p>REQUIREMENTS\n* You will have shipped single page web app’s or an app to the app store. \n* You enjoy building apps that delight users and focus on their needs, as well as business objectives. \n* Excellent pure javascript skills and experience with Backbone.\n* Appreciate good UX and UI. \n* Experience building elegant and responsive front end user interfaces for web apps.<p>Get in touch: jobs@roostermoney.com\nApply: <a href=\"https:&#x2F;&#x2F;roostermoney.workable.com&#x2F;jobs&#x2F;247642\" rel=\"nofollow\">https:&#x2F;&#x2F;roostermoney.workable.com&#x2F;jobs&#x2F;247642</a>","time":1462223129,"type":"comment"}