{"by":"twakefield","id":11615210,"parent":11611867,"text":"Gravitational.com (YC S2015) | San Francisco | Full-time | ONSITE &#x2F; REMOTE (US)<p>Positions: Backend Engineer (Go) &#x2F; Product Designer &#x2F; Head of Growth &#x2F; Solutions Engineer<p>Online Descriptions: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;gravitational&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;gravitational&#x2F;careers</a><p>Contact: jobs@gravitational.com<p>Engineering Interview Process: There is an informal meeting or phone conversation with the founders (may be together or separate depending on timing). If everyone (including you) agrees there is a fit, we create a small engineering project for you to work on with our CTO. It is something that is similar to what you would be building full time but is not something we actually use. This gives you an idea about the type of work you’ll be doing and how we work together. If that project is successful we may want to meet in person if we haven’t already to discuss what the future looks like for all of us. Then if we decide to extend an offer, we give you two weeks to respond.<p>## About us<p>Gravitational is an early stage systems &amp; cloud startup in San Francisco out of the YC S2015 batch.<p>* We are changing the way enterprise software is distributed and run.<p>* Our customers are people like us, engineers.<p>* We are well-funded by solid investors.<p>* We are an experienced team: we founded Mailgun (<a href=\"http:&#x2F;&#x2F;mailgun.com\" rel=\"nofollow\">http:&#x2F;&#x2F;mailgun.com</a>) which was acquired by Rackspace (<a href=\"http:&#x2F;&#x2F;rackspace.com\" rel=\"nofollow\">http:&#x2F;&#x2F;rackspace.com</a>), we created Vulcand (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;vulcand&#x2F;vulcand\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;vulcand&#x2F;vulcand</a>) and some other cool stuff (<a href=\"http:&#x2F;&#x2F;www.rackspace.com&#x2F;blog&#x2F;onmetal-the-right-way-to-scale&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.rackspace.com&#x2F;blog&#x2F;onmetal-the-right-way-to-scale...</a>) at Rackspace.<p>* We are hackers. We love Linux and low level systems programming and we love helping open source communities and other engineers to get things done.<p>* We are also dedicated to our families, friends, and hobbies outside of work. Our past experiences building companies taught us about the importance of life and work balance.<p>If this resonates, we&#x27;d like to talk to you.<p>Contact: jobs@gravitational.com","time":1462220444,"type":"comment"}