{"by":"lstamp","id":11613279,"parent":11611867,"text":"LiveRamp | Back​ ​End&#x2F;Full​ ​Stack Developers | Full-time in San Francisco | Competitive Tech Salary<p>About us: LiveRamp is the leader in data connectivity, helping the world’s largest brands use their data to improve customer interactions on any channel and device.​ ​We help marketers eliminate data silos and unlock greater value from the tools they use every day.<p>We are steadily growing (190 current employees) with plans to double in size over the next year. Our employees enjoy catered meals, unlimited PTO, ​an ​annual camping trip and lots of social gatherings. But the best job perk is our awesome team - we’ve got a staff of amazing people who just happen to be great engineers as well.<p>About you: Type S(tartup) personality is a must: smart, ethical, friendly, hard-working and proactive. You’re comfortable in multiple languages, frameworks, and environments. We are looking for full-time engineers and aspiring managers. If you think you’d be a good fit, consider joining our team!<p>We’re looking for smart and talented engineers for the following positions:<p>Senior Data Engineer\n(<a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;liveramp&#x2F;jobs&#x2F;14840?t=afx5wq#.V...\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;liveramp&#x2F;jobs&#x2F;14840?t=afx5wq#.V...</a>)<p>Senior Full Stack Engineer\n(<a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;liveramp&#x2F;jobs&#x2F;14843?t=f2la7b#.V...\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;liveramp&#x2F;jobs&#x2F;14843?t=f2la7b#.V...</a>)<p>Generalist Software Engineer&#x2F;New Grad\n(<a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;liveramp&#x2F;jobs&#x2F;59087?t=jmgo1f#.V...\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;liveramp&#x2F;jobs&#x2F;59087?t=jmgo1f#.V...</a>)<p>To apply: ​Use the links above to apply directly. We will aim to get back to you within a 24 hour window.","time":1462208846,"type":"comment"}