{"by":"jf22","id":11614255,"parent":11611867,"text":"BTE | Hartford, CT | Full-Time | Remote | $: &gt; Market<p>At BTE we’ve been collecting data across all business operations for years. We are ready to unlock the potential of all the data we’ve been collecting by starting a data science initiative that you’ll lead.  We’ve got data, servers, and technical talent to assist in this effort.  You’d be responsible for building a data science initiative from the ground up using whatever tools and techniques you need.<p>Work with fun, smart, and self-motivated people at a highly successful and growing company in the ticket broker industry. As a data scientist at our company, you&#x27;ll get to help build high-quality data scientist projects that provide tremendous value to the business.<p>Instead of being employee #938393938 like at a large corporation you’ll be a critical member of the team on a first name basis with the owner.  Our company and technology teams are small and nimble. You won&#x27;t be smothered by meetings and are mostly free to choose how you accomplish your goals.<p>We are a 100% remote work company but think it’s important to get together for a face to face once and awhile.  Our culture is very dynamic but this isn’t a startup.  There aren’t any weekend consuming death marches get things done but we all work hard in a balanced way.<p>Job Description:<p>* Manage, architect and analyze big data in order to build data-driven insights and high impact data models.<p>* Create a value chain to help address the challenges of acquiring data, evaluating its value, distilling &amp; analyzing.<p>* Examine data from multiple sources and share insights which provide a competitive advantage.<p>* Team with business stakeholders and developers to design, develop and deploy state-of-the-art, data-driven predictive&#x2F;descriptive models to solve business problems using the latest and most appropriate technologies in statistical modeling and machine learning.<p>Required Skills:\n* 3-5 years of experience with statistical computing and machine learning tools: R, Python, SAS, SQL<p>* Experience manipulating structured and unstructured data sources.<p>Desired Skills (nice to have):\n* Degree in a relevant field like statistics, computer science or applied math, etc.<p>* C#<p>* Microsoft Sql Server<p>Please send resume to johnefarrell@gmail.com","time":1462214755,"type":"comment"}