{"by":"Bluem00","id":11611981,"parent":11611867,"text":"Volantio (YCW09) | Full Stack Engineer | Atlanta | Full-time | ONSITE<p>Volantio is hiring an experienced full-stack developer to help us fix travel tech for airlines.<p>We make some of the world’s biggest travel sites suck less, by providing technology products to airlines and other travel companies (and drag them kicking and screaming into the 21st century). Everything we do improves the airfare search process for millions of people in at least some little way. One of our airline partners likes what we do so much that they made PriceWatch (one of our products) a core part of their brand identity. Here&#x27;s an ad spot they put together: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=RWn8-QbRUKU\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=RWn8-QbRUKU</a><p>We’re a close-knit team and have a variety of challenging work on our plates. A typical day can consist of everything from optimizing the Fare Prediction System in the morning to putting the finishing touches on a CSS animation in the afternoon. Our work spans multiple technologies, cultures, and languages (both programming and spoken!), so we value high quality communication and a continuous process of learning from each other.<p>We&#x27;re looking for someone with at least a few years of professional software development experience that wants to work with us. Most of our products are built on the Django framework, with Redis, a Postgres database, Coffeescript, and countless other technologies used as needed. You&#x27;re not expected to be familiar with everything - that&#x27;s what the &#x27;continuous learning&#x27; is for! You&#x27;ll be a core member of our team - able to develop the role and technology in a direction that you find exciting as we grow the company.<p>If this sounds interesting, we would love to hear from you. Please include whatever info you believe is relevant: resume, GitHub profile, code samples, links to personal projects, etc.<p>You can apply by emailing directly (jobs@volantio.com)","time":1462201893,"type":"comment"}