{"by":"browseatwork","id":11614877,"parent":11611867,"text":"San Francisco&#x2F; London&#x2F; Barcelona&#x2F; Madrid&#x2F; Sydney | TokBox | JavaScript Engineers, Head of HR, Product Marketing Manager, BizDev Managers in 1) Healthcare and 2) Education) | 98% Onsite, remote for the right fit<p><a href=\"https:&#x2F;&#x2F;tokbox.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;tokbox.com&#x2F;</a><p>TokBox does embedded communications powered by WebRTC. We make it easy for developers to embed real-time video, voice, and more into their applications and websites. We build a platform and SDKs, and have great clients from individual developers to massive players in tech, entertainment, education, and many other industries (customers include the Minerva Project, Chegg, esurance, Major League Baseball, Double Robotics, and Fox Sports). We&#x27;ve been doing real-time communications for over 8 years. We were acquired by Telefonica 3 years ago. It hasn&#x27;t changed the culture much, and has helped us reach more customers around the world.<p>The product is great but the people make this place where I work. It&#x27;s an awesome group of 70 or so people- nice, smart, skilled. We are laid back and have a sense of humor. Good salary and benefits, relaxed, enjoyable environment!<p>We&#x27;ve hired a ton in 2015 and are continuing to keep hiring in 2016. We&#x27;re looking for a JavaScript engineer in Australia who wants a challenge on a small fast moving team. Our head of HR is sadly leaving after 5 years, so we need a replacement. We’re looking for someone with product and&#x2F;or marketing experience to do product marketing. For business development, we&#x27;re looking for people with strong experience in either healthcare or education.<p><a href=\"https:&#x2F;&#x2F;tokbox.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;tokbox.com&#x2F;careers</a><p>or<p><a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3ZMiQhwF\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3ZMiQhwF</a><p>Come join us!","time":1462218335,"type":"comment"}