{"by":"cjrd","id":11613126,"parent":11611867,"text":"DotDashPay | Full Stack Engineer | $100,000 - $115,000 + A Nice Chunk of Equity | San Francisco | On-Site<p>DotDashPay (<a href=\"https:&#x2F;&#x2F;dotdashpay.com\" rel=\"nofollow\">https:&#x2F;&#x2F;dotdashpay.com</a>) is a hardware and software platform that makes it easy for machine builders and designers to connect their machines to payments. Our long-term goal is to enable a completely autonomous economy by providing companies with tools that make it simple to build machines that automate the transaction process. We’re a venture backed company with a strong founding team from UC Berkeley (our founders grew out of the CS PhD program).<p>We’re looking for a full stack developer who wants to develop extremely reliable, clean, well-tested, and downright beautiful systems. We’ve found that a very productive and powerful way to do this is to write code that writes our code for us: <i></i>autogeneration<i></i> is the foundation of DotDashPay, and in this paradigm you can become a 100x engineer (building on top of our autogenerators will allow you to ship new features in hours instead of weeks).<p>On top of our autogeneration framework, we write most of our complex features in a combination of C, C++, and Go (golang). We are currently using Node.js as our web backend language and are migrating our frontend to React. Strong experience in at least a couple of these languages, and the desire to learn the others, is important to us.<p>Desirable characteristics:<p>* Polyglot programmer: we have APIs in almost every major language that are autogenerated from our specification. The APIs require small glue code that is written in the target language and needs to conform to the standards &#x2F; conventions of that language.<p>* Experience building&#x2F;managing infrastructure: as a small team, everyone helps build and manage our infrastructure. We use many modern tools and services (Docker, Ansible, AWS) and strive to build things the Right Way™, so we’re always open to trying a new ideas and tools.<p>* Security experience: our payment systems must support some of the biggest names in retail, and our codebase undergoes rigorous security testing and certifications. A strong understanding of security best practices helps ensure that our products ship faster and our customers can rely on our software.<p>* Experience &#x2F; interest in payments: payments is a surprisingly fascinating and complex iceberg. Even if you know very little now, a desire to learn more is important as it pervades most of what we do.<p>Please email Sean Arietta via sean (at) dotdashpay (dot) com to set up a time for an initial chat.","time":1462208044,"type":"comment"}