{"by":"fgimenez","id":11612186,"kids":[11680014,11665730],"parent":11611867,"text":"Catenus Science | San Francisco | Full-time | On-site<p>What: Summer Data Science Fellowship<p>Program: \nThe Catenus Science Apprenticeship Program identifies top data scientists who will raise the bar when hired at a startup. To help meet this goal, the program will train qualified candidates to have immediate, meaningful impact as data scientists in some of the top data startups in the world. This program will hone their skills in statistics, machine-learning, programming, and product development by presenting them with real-world challenges put forth by startups in Silicon Valley and the Bay Area.<p>What We Offer: \nCatenus Science offers a fully-paid, 13-week apprenticeship during which we reinforce technical and business skills. We do this via a mix of formal instruction and hands-on application of data science in some of the best startups in the world.\nEvery startup is different, and each has its own unique culture and opportunities. That is why we want to give apprentices exposure to several places so they can find the right fit. Apprentices will have the opportunity to do rotations through three startups in a three month period while receiving training and mentorship the entire time. These startups will have well-scoped, immediately impactful data science problems for apprentices to solve.\nThe program is structured such that apprentices have four days a week of full-time employment at a startup and one day a week of instruction. Apprentices are expected to already be knowledgable in data science, so we view these instructions as a way to hone their skills. In addition, we will use this time for apprentices to present the problems they are working on to the group. This way they can teach about new insights and seek help when faced with obstacles.<p>Who We Are Looking For:\nWe are looking for candidates who posses technical virtuosity, communication skills, and business sense to use data in impactful ways.\nNecessary, but not sufficient, mathematical skills include a mastery of statistics and machine learning, and the ability to tell the difference between these two fields. Apprentices should have the hacking proficiency to code any idea regardless of programming language.\nNobody can understand those who cannot communicate. You should be able to clearly convey your thoughts, both in writing and orally. Communication does not end at expressing yourself, though. We expect apprentices who recognize the strengths of new ideas by listening to and understanding others.\nFinally, we have seen time and time again that the best data scientists are ruthlessly pragmatic. The ones creating state-of-the-art products understand the domain-problems they are solving and how to deliver those solutions efficiently. Apprentices should be able to formulate solutions to relevant business problems with data science tools. Furthermore, they should be able to identify new business opportunities by looking at data.<p>Learn more and apply:\n<a href=\"http:&#x2F;&#x2F;catenus.com\" rel=\"nofollow\">http:&#x2F;&#x2F;catenus.com</a><p>Contact us:\nfrancisco@catenus.com","time":1462202831,"type":"comment"}