{"by":"martinshen","id":11612154,"parent":11611867,"text":"Smartcar | SF Bay | Full-time | Backend Full Stack Developer<p>Posted this last month and got a lot of great response so I figure it was due for an update...<p>I joined Smartcar to head up business development at Smartcar. Previously, I founded an event discovery startup that raised $3M and brought it to a $1.5mm run rate. When I was looking for my next role, I was focused on industries that were certainly going to change in the next 5 years: VR, insurance, transportation and eSports. Smartcar falls under transportation and touches insurance; these are two massive industries ripe for disruption. Transportation is nearly 10% of US GDP.<p>Smartcar is building the open source standard for telematics in the car. We enable dorm room startups to Fortune 500 insurance companies to buid applications on the car. Developers using the platform can create a service that automatically fuels up a driver&#x27;s car without the driver even having to know by accessing the telematics in the vehicle.<p>We&#x27;re a well funded startup, have revenue and a great team hailing from Google and LinkedIn looking to add 3 more. Since last month, we&#x27;ve been moved quickly with customers (can talk about it over the phone) and need help with development.<p>Your voice will be heard and you will determine the company’s future technical roadmap. You will be an excellent generalist who is skilled at multitasking and performs a number of duties, including, but not limited to:\n- Designing&#x2F;architecting the foundational API for cars.\n- Building secure and scalable web and API backends.\n- Integrating with testing, coverage and deployment pipelines.\n- Designing SQL database schemas, as well as managing backups and migrations.\n- Instrumenting metrics for tracking API usage. - Working with Node.js, Postgres, Redis, Docker, AWS.<p>Interview process is:<p>1. Optional phone call to learn more about the company (415 404 5650).<p>2. Technical phone interview<p>3. Take-home coding challenge<p>4. 2 hour onsite interview with the whole team<p>As our company is small, if you prefer to interview in a different way, let us know. We just want to get a good understanding of who you are before making decisions.<p>$90K to $130K + up to 1.5% equity<p>Interested? email me at Martin@Smartcar.com or call me at 415 404 5650.<p>Do not contact if recruiters.","time":1462202697,"type":"comment"}