{"by":"bensummers","id":11611916,"parent":11611867,"text":"Haplo -- London, UK -- Full time, ONSITE<p><a href=\"http:&#x2F;&#x2F;www.haplo-services.com&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.haplo-services.com&#x2F;jobs</a><p>We&#x27;re looking for developers at all levels, from junior to senior, to help us build open source software which is making significant improvements to everything from the inception of research projects to publication of research results.<p>You&#x27;d love working with us if you think that:<p>* doing things the right way is just as important as getting them done.<p>* open sourcing your software allows your work to have a positive impact on as many people as possible, and makes great business sense.<p>* growing steadily through revenue is preferable to gambling with the rocket fuel of investment.<p>* working in an environment where everyone is learning together is essential to doing your best work.<p>Our open source information platform, Haplo, is a radically effective framework for building applications to manage information in complex organisations. On top, we&#x27;re building Haplo Research Manager, which provides a single integrated view of all research activity in a university.<p><a href=\"http:&#x2F;&#x2F;haplo.org\" rel=\"nofollow\">http:&#x2F;&#x2F;haplo.org</a><p>We&#x27;re a bootstrapped, mature and successful business, and are at an exciting time where we&#x27;ve won several large contracts, the team is growing, and our toolkit enables us to rapidly deploy new features.<p>Join us! <a href=\"http:&#x2F;&#x2F;www.haplo-services.com&#x2F;about&#x2F;who\" rel=\"nofollow\">http:&#x2F;&#x2F;www.haplo-services.com&#x2F;about&#x2F;who</a><p>Fast recruitment process: Email us your CV. 20 minute phone call. Spend a few hours on a short coding challenge.  Visit us for an in-depth code review and interview.<p><a href=\"http:&#x2F;&#x2F;www.haplo-services.com&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.haplo-services.com&#x2F;jobs</a>","time":1462201536,"type":"comment"}