{"by":"snewman","id":11613992,"kids":[11617688],"parent":11611867,"text":"Scalyr | SF Mid-Peninsula (ONSITE)<p>Frontend Engineer: $110-160K, &gt;=0.3% equity<p>DevOps Evangelist: $130-180K, &gt;=0.5% equity<p>At Scalyr, we&#x27;ve built a log analysis and ops visibility tool that our users rave about, because it smashes expectations for performance and ease of use. Now it&#x27;s time to spread the word. We offer the equity, influence, and fun of an early-stage company, with stability, great pay, and a low-stress culture. We have great backers, strong traction, and an 11-digit target market. I&#x27;ve built half a dozen startups, including Writely (aka Google Docs), and I can honestly say this is my favorite so far.<p>Frontend Engineer: we earn our keep by giving users unprecedentedly fast and easy tools for exploring vast amounts of operational data. That starts with our unique backend query engine, but it doesn&#x27;t mean anything without an equally amazing frontend. We&#x27;re building a brand-new web app that adds features while removing complexity, all with an eye to performance. As a ground-up rewrite, there&#x27;s lots of opportunity for you to have a significant impact. If you care about user experience, enjoy great engineering, and want to join an experienced team where you can really stretch yourself, we&#x27;d love to hear from you.<p>DevOps Evangelist: if you&#x27;re passionate about enlightened server operations, appreciate good tools, and would like the chance to bring a great tool to great customers, we should talk. We&#x27;ve had success with meaty posts like <a href=\"https:&#x2F;&#x2F;www.scalyr.com&#x2F;community&#x2F;guides&#x2F;zen-and-the-art-of-s...\" rel=\"nofollow\">https:&#x2F;&#x2F;www.scalyr.com&#x2F;community&#x2F;guides&#x2F;zen-and-the-art-of-s...</a>. and <a href=\"http:&#x2F;&#x2F;blog.scalyr.com&#x2F;2014&#x2F;08&#x2F;99-99-uptime-9-5-schedule&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.scalyr.com&#x2F;2014&#x2F;08&#x2F;99-99-uptime-9-5-schedule&#x2F;</a>. Join us and you&#x27;ll have the chance to write meaningful articles, engage with fellow engineers, and spread the word on a great product. If you have an engineering background, experience in operations, and a love of communicating, drop me a line!<p>If either of these roles sound interesting, please reach out to jobs@scalyr.com.","time":1462213195,"type":"comment"}