{"by":"jacques_chester","id":11611876,"parent":11611867,"text":"Pivotal | ONSITE at many locations worldwide | Engineers, Designers, Product Managers, Pre&#x2F;Post-Sales Engineers, Ops, Sales<p>We value aptitude over alma mater, empathy over APIs. It doesn&#x27;t matter whether your resumé says PHP or PhD: if you&#x27;re smart, empathetic and know some stuff, we want to work with you.<p>Pivotal&#x27;s goal is to change the way the world makes software and we kinda sorta <i>really mean it</i>. We&#x27;re broken into three basic divisions: Pivotal Labs (yes, <i>that</i> Pivotal Labs), Pivotal Cloud Foundry and Pivotal Big Data. Moving between divisions, temporarily or permanently, is possible.<p>We have offices in San Francisco, New York City, Santa Monica&#x2F;LA, Palo Alto, Seattle, Beaverton, Boulder, Denver, Chicago, Boston, Washington DC, Atlanta, Austin, Toronto, London, Dublin, Tokyo, Sydney, Berlin, Singapore and Beijing, with more coming.<p>We are constantly thinking about how we work and how we can work more sensibly, effectively and enjoyably.<p>-- <i>Pivotal Labs</i>, from which the company draws its name and cultural seed, helps clients to become better at development. For engineering we are religiously lean and agile. In practice that means we pair program and TDD every line of code from the outside. Our product managers are fantastic at keeping products sharply focused, our designers are masters from users to pixels.<p>-- <i>Cloud Foundry</i> solves application deployment and management. We&#x27;re the main contributors to the Cloud Foundry project. We&#x27;re constantly improving the leading opensource PaaS -- our distribution has the fastest-growing sales of any opensource product <i>ever</i>.<p>Except for integrated upstream code, every line is pair programmed and TDD&#x27;d. We dogfood the cutting edge of the technology on our own commercial public cloud (Pivotal Web Services). It works because we took the XP and Lean DNA of Pivotal Labs and scaled it up to build the best cloud platform available.<p>-- <i>Big Data</i> is our suite of battled-hardened products, now open sourced. Greenplum tackles massive datasets with the comfort of PostgreSQL. Apache HAWQ (incubating) brings Greenplum&#x27;s distributed query planner to Hadoop. Gemfire, donated as Apache Geode (incubating), is an in-memory distributed grid with years of high performance in high-stakes systems.<p>-- <i>Generally</i><p>At our offices we have free breakfast, weekly tech talks, good benefits and competitive pay. Ping pong isn&#x27;t mandatory, but it&#x27;s popular. I think west-coast ping pong is harder to beat, but east-coast style is more entertaining to watch. The beer fridge has more IPA than I prefer but I guess that&#x27;s life in paradise.<p>You can see the available jobs and apply through our website: <a href=\"https:&#x2F;&#x2F;pivotal.io&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;pivotal.io&#x2F;careers</a>. If you do, please mention my name. You can also email me at jchester+hn@pivotal.io to answer any questions you might have. Either of these helps me score one of our referral bonsues (did I mention our generous referral scheme?)<p>For what it&#x27;s worth, I&#x27;m just an engineer, so my replies might not be immediate. I hope that&#x27;s OK.","time":1462201354,"type":"comment"}