{"by":"csusowp","id":11615691,"parent":11611867,"text":"Water Programs, California State University, Sacramento | Web Application Developer | Full-Time | Onsite (Sacramento, CA)  \n$61,740 - $92,616 DOE<p>The Office of Water Programs is a non-profit organization built on delivering quality training materials for over 40 years to water system operators’ worldwide and addressing California water issues using applied research methods. Our small, effective team of diversely skilled professionals provides cost-effective solutions for protecting and enhancing water resources, public health, and the environment through training, scientific research, and public education.<p>This is a high quality of life job. Our excellent benefits package goes beyond the standard healthcare offerings to include:\n* Generous vacation accrual of 16 hours per month \n* A minimum of 5 paid days off between Christmas and New Years Day (Sac State is closed)\n* Participation in CalPERS retirement program<p>Working on the campus of Sacramento State, our employees have access to the natural beauty of the American River Parkway and its bike trail, a world-class gym (membership not included), and live events offered on campus. Sacramento is just over an hour away from Lake Tahoe and the city of San Francisco. The Sacramento area boasts a reasonable cost of living in comparison to the Bay Area.<p>You are: A developer comfortable working the full stack - from the database to the User Interface.<p>Our current toolbox: PHP, Javascript, and SQL Server. Additional experience with Python and C# is a huge bonus.<p>Join our team of approximately 50 environmental researchers, technical specialists, instructors, and other professionals and make a positive difference on the water quality of California and beyond.<p>Interview Process: Online application, phone screen, in-person (roughly 3-4 hours)<p>Apply at [ueijobs.com](<a href=\"http:&#x2F;&#x2F;ueijobs.com\" rel=\"nofollow\">http:&#x2F;&#x2F;ueijobs.com</a>)","time":1462223626,"type":"comment"}