{"by":"jjirsa","id":11612540,"kids":[11612607],"parent":11611867,"text":"Crowdstrike | Full-time | SF, Irvine, Seattle, DC, or Remote (US) | www.crowdstrike.com<p>CrowdStrike (www.crowdstrike.com) is looking to hire a Sr. Software Engineer - Data Services in the Seattle or Irvine area, to help us take our internal automation to the next level. We’re looking for a highly-technical, hands-on Engineer, who loves to work with data plane services like Cassandra, ElasticSearch, Kafka and Hadoop, and is comfortable building self-service APIs and automation around large-scale critical systems. We’ll be looking at candidate CVs with an eye on achievement -- what you’ve accomplished in the past tells us the most about what you can do for us in the future.<p>This position allows primarily remote work, but strong preference is given to candidates within commuting distance of Kirkland, WA, Sunnyvale, CA and Irvine, CA.<p>Responsibilities<p>* Maintain a deep understanding of the data components - including Cassandra, ElasticSearch, Kafka, Zookeeper, Hadoop, and Spark, and use that understanding to operate and automate properly configured clusters.<p>* Work with Engineering to roll out new products and features.  <p>* Develop infrastructure services to support the Crowdstrike engineering team’s pursuit of a full devops model.<p>* Work closely with Engineering and Customer Support to troubleshoot time-sensitive production issues, regardless of when they happen.  <p>* Keep petabytes of critical business data safe, secure, and available.  <p>Desired Skills &amp; Experience<p>* Experience automating maintenance and creation of large scale datastores.<p>* Experience building, securing and supporting internal service APIs<p>* Experience with large-scale, business-critical Linux environments  <p>* High level of proficiency with Python  <p>* Experience operating within the cloud, preferably Amazon Web Services<p>* Proven ability to work effectively with both local and remote teams  <p>* Track record of making great decisions, particularly when it matters most<p>* Rock solid communication skills, verbal and written<p>* A combination of confidence and independence... with the prudence to know when to  ask for help from the rest of the team<p>* Experience in the information security industry preferred, but not required<p>* Bachelor’s degree in an applicable field, such as CS, CIS or Engineering<p>Please email me directly (my HN username)@crowdstrike.com if interested.","time":1462204758,"type":"comment"}