{"by":"KrisLew","id":11615671,"kids":[11634077,11624312],"parent":11611867,"text":"BOSTON, MA | ONSITE W&#x2F; REMOTE FLEXIBILITY<p>Java Developer w&#x2F; .NET Experience<p>We are the new Boston Globe Media and we are growing -- fast. With a foundation in leading-edge technology and data-driven product development, we are rapidly building a team that is as obsessed as we are with innovation and change. The decision to join this team is thus the choice to be at the start of something bigger, something scarier, than the work any of us has done before. But that is how everything great begins.<p>The Core Team within our Media Lab is looking for an engineer to help bring us to the next level.  We find fulfillment through our code, solving tough technical challenges and creating next generation products that are at the center of all of The Globe’s media publications.  If this interests you then please apply.<p>Here is what we’re offering:<p>Backend: We use Java, Jersey, Groovy, Postgres and Jenkins for all newer applications that drive our circulation and other core products.  Some of our core products are written in .Net Web Forms and SQL.  You’ll play a big part in migrating these to Java.  Our publications are written in PHP - Wordpress and Methode (Java).  \nFrontend: Our circulation and payment applications are web applications written in Javascript, JQuery and CSS. We use Angular, JQuery, React and REST services.   \nThe Team: We value our customers and each other above all.  The impact we create is immediate and seen across the company.  We most care about coming together and doing great work to evolutionize this iconic brand<p>Here’s what you’ll bring to the table:<p>Strong technical skills: Specifically in modern Java and .Net web environments.  We aren’t overly concerned with the other accompanying technologies.  If you’re interested in learning we are interested in teaching them to you.  \nA passion for your craft: Caring deeply about the quality of your code.  Our culture is defined by the impact we create through our work.  If this is you too, let&#x27;s talk!\nA desire to own something big.<p>Boston Globe Media is an equal employment opportunity employer, and does not discriminate on the basis of race, color, religion, gender, sexual orientation, marital status, age, disability, national origin, citizenship or any other protected characteristic. Boston Globe Media is committed to diversity in its most inclusive sense.","time":1462223474,"type":"comment"}