{"by":"jedberg","id":11612174,"parent":11611867,"text":"Junior Engineer or Summer Intern | <a href=\"https:&#x2F;&#x2F;cloudnative.io&#x2F;yeobot\" rel=\"nofollow\">https:&#x2F;&#x2F;cloudnative.io&#x2F;yeobot</a> | Cupertino, CA, USA | Full-time, Part-time, Intern, Remote | $60K to 84K &#x2F; yr<p>Our mission is to make DevOps easier for everyone, so they don’t have to waste resources on writing code <i>to run</i> their applications, instead of writing code <i>for</i> their applications.<p>If you’re interested in any or all of the following you should apply:  cloud computing &#x2F; AWS, conversational UI, chat bots, machine learning, Python, ElasticSearch, DevOps, distributed computing, or fully remote teams.<p>* What you will be doing:  We have a long list of features we want to add to our chatbot, Yeobot, so you’ll be writing Python code (and maybe a little bit of Javascript) to implement those features in our chat bot.  Since we’re building a fully serverless stack, which is a fairly new thing, there are a lot of opportunities to solve new problems around development and deployment too, like how do we automate deployment to AWS Lambda, how do we do tests, how do we manage code, etc, so you’ll be helping us figure out how to do that too.<p>We’re a fairly new company, so there will be a lot of freedom but also plenty of guidance if wanted.  Code reviews are usually a pleasant learning experience.<p>* To apply:  Send an email to {anything}@jedberg.net (be creative!) with the subject &quot;job application&quot;.  In the email tell us why we should hire you over any other applicant.  What makes you better or more driven?  How will contribute in a way that no one else can?  How will you increase our diversity (and by diversity we don’t mean gender and race, we mean diversity in life experience and culture and opinions).<p>Then please attach a code sample of code you wrote the majority of, the more substantive the better.  If it’s public, just send the link, and if it’s private, add it as an attachment or add github.com&#x2F;jedberg as a reader, as long as you have permission to share from the owner (no secret corporate code please!).<p>We don’t care much about resumes — if you have one send it along, or just a link to your LinkedIn or equivalent is fine too.<p>If we like what you wrote, we’ll offer you an interview, which will be a video chat where we’ll talk about what you wrote in your email, and then ask you questions about the code you submitted.<p>Why CloudNative:<p>* We’re just starting out so you get to play a big part in the direction of our product and company culture<p>* Our founder (me) is an AWS Hero, as well as one of our advisors, and our other advisor wrote boto and the AWS command line.<p>* We’re building on a totally serverless stack with AWS Lambda, DynamDB, ElasticSearch and GitHub.","time":1462202772,"type":"comment"}