{"by":"braythwayt","id":11614259,"parent":11611867,"text":"PagerDuty - San Francisco and Toronto, ONSITE<p>If you&#x27;re looking for a start up that&#x27;s growing quickly by solving a real problem, we&#x27;re making the process of fixing technology problems better. PagerDuty is used by thousands of customers globally, from startups like Github, Instagram, Airbnb, Box, and Rackspace, to Fortune 500 companies like HP, Intel, Microsoft, and Nike. We&#x27;ve got ambitious plans to grow and are seeking passionate people to join our crusade against downtime. We provide a competitive salary, comprehensive benefits and opportunities for career growth.<p>* We&#x27;re hiring smart devs regardless of language in Toronto and San Francisco.<p>* We&#x27;re looking for a PM to own and grow our API and extensibility story: <a href=\"http:&#x2F;&#x2F;pduty.me&#x2F;beanapipm\" rel=\"nofollow\">http:&#x2F;&#x2F;pduty.me&#x2F;beanapipm</a>.<p>* We&#x27;re also hiring for our internal IT team if you&#x27;re looking to work on an IT team that&#x27;s loved and respected.<p>* And a dozen others on <a href=\"https:&#x2F;&#x2F;www.pagerduty.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.pagerduty.com&#x2F;careers&#x2F;</a>.<p>Benefits<p>* Competitive salaries and company equity.<p>* Generous paid vacation (3 weeks your first year, 4 weeks afterwards), unlimited sick days, regular holidays.<p>* Comprehensive medical, dental, and vision plan options for you and your spouse&#x2F;family.<p>* Daily catered lunches and free snacks, drinks and beer.<p>* Weekly game nights, monthly hack days and impromptu ping-pong battles.<p>* Convenient office location, close to major public transit.<p>More about us:<p>PagerDuty is &quot;9-1-1 dispatch&quot; for IT, helping operations engineers and devops resolve problems with their IT systems as quickly as possible. We’re backed by some of the Valley’s best investors, including Y Combinator and Andreessen Horowitz. We&#x27;re based in San Francisco, California with a presence in Toronto, Canada. We&#x27;re obsessive about reliability and ensuring that when your systems are down, the right people get notified every time.","time":1462214782,"type":"comment"}