{"by":"shuttlerock","id":11613101,"parent":11611867,"text":"Android developer | On-site | Full-time | Tokyo, Japan<p>Shuttlerock is a world-leading visual marketing platform that allows companies to collect, curate and re-purpose content from a variety of sources. We have a global team, with offices in Los Angeles, Tokyo, Christchurch, Auckland and Sydney.<p>We are looking for an experienced Android developer in our Tokyo office who want to work on interesting problems, and help us take our existing mobile app to the next level.<p>The Role:\nYou will be working on our Android application in our Shinjuku office. We&#x27;re looking for people passionate about UI&#x2F;UX interaction and performance, who thrive on working with a fast-moving team that&#x27;s changing the way large companies think about content marketing. In this role, you will have the opportunity to help shape and execute our mobile strategy, while working with a group of talented developers. You’ll work alongside our product and design teams to implement highly interactive and branded interfaces.<p>Our Ideal Candidate:\n- Must be fluent in either English or Japanese.\n- Deep knowledge of Android app development.\n- A track record of shipping mobile software.\n- Experience working with third-party APIs.\n- Understanding of multithreaded application development.\n- Experience writing maintainable, testable code.\n- Outstanding problem-solving skills.\n- Excited to work closely with an extremely talented, distributed team.<p>Bonus points if you:\n- Are multilingual.\n- Have GitHub &#x2F; Dribbble &#x2F; other portfolios demonstrating your work.\n- Have an interest in functional programming and testing.\n- Have experience with iOS, Ruby, Clojure, or JavaScript (Angular or React).\n- Have experience with DevOps, automated deployment, AWS, edge caching etc.<p>Location: Nishi-Shinjuku, Tokyo\nSalary: 4.5 ~ 8.5 million yen, depending on experience.\nVisa status: Unfortunately due to the urgency of this placement, a valid engineering visa for Japan is required, and the applicant must be already located in Japan. We are open to sponsoring visa renewals in the future for successful applicants.","time":1462207931,"type":"comment"}