{"by":"talentgary","id":11619218,"parent":11611867,"text":"Zoomer (YC S14) | www.zoomerdelivery.com | Product Manager | San Francisco, Philadelphia or REMOTE<p>The Company: Zoomer is a venture backed, technology and logistics startup focused on helping high volume delivery restaurants wow their customers and grow their business. We&#x27;ve taken a unique approach to changing the food delivery space and it&#x27;s starting to pay off. Zoomer has stayed out of the spotlight so you won&#x27;t find much about us online, but our charts are going up and to the right in impressive fashion and more importantly, we are growing and working with more and more restaurant partners, driver partners &amp; hungry diners each day. We are backed by some of the best investors in the world including Foundation Capital, Y Combinator (S14), First Round Capital, SV Angel, Eric Ries and others.<p>The Role: We’re seeking an entrepreneurial-minded product manager to help innovate and execute product initiatives across the company. This position is full time, based from either our San Francisco office, Philadelphia HQ or remote.<p>Responsibilities: * Drive product development with a team of world-class engineers and designers, move projects forward and ‘join-the-dots’ across several timezones. * Work closely with the head of product, product designers and engineering leads  to understand our users needs, and translate them into product requirements. * Manage project timelines, track project status and work to keep everyone aligned throughout all project phases. * Work to prioritize and collate feedback from numerous disparate sources and translate the feedback into our product roadmap. * Work with product leaders to define and analyze metrics that inform the success of products. * Integrate usability studies and research into product requirements to enhance user satisfaction and meet the goals of the business. * Become an expert in our products, the needs of our users, and how they relate to organizational and business goals. * Communicate product plans, benefits and results to all audiences - within teams, the broader organization, and with our users. * Gather feedback on products, and work with design &amp; engineering to validate and prioritize backlogs. * Help educate &amp; train teams on product capabilities.<p>Skills &amp; Experience Required: * 3+ years of experience in product management, engineering or product design. * Excited for the potential to own products, influence product strategy and have a direct impact on the business. * An effective communicator, able to write succinct, clear, unambiguous terms to define requirements. Comfortable writing presentations, documents, blogs, email, Slack etc. * Excellent organizational skills in a fast paced, constantly changing environment. * Able to easily switch between thinking creatively and analytically. * Have an understanding of the technical architecture of complex web and mobile applications.  Able to contribute substantively to technical decisions led by our engineering team. * Strong communication and collaboration skills. Our team is distributed and highly collaborative, so open dialog and a positive attitude is crucial. <p>On Offer: * Competitive Compensation * Meaningful Stock Plans * Get in on the ground floor of an experienced startup product team, with the potential for a huge impact on real people’s lives. * Extremely flexible work schedule * Unlimited vacation time<p>Product and engineering for Zoomer is headquartered in San Francisco but we have talented developers &amp; designers working remotely to help tackle very unique and extremely complex problems.  We place a big emphasis on using the best tools and processes so that the entire company can collaborate from wherever we are - Zoomer has teams in each geography that we’re delivering in.<p>Apply by email directly to gary@zoomer.io ","time":1462270078,"type":"comment"}