{"by":"jobs-at-OEM","id":11618739,"parent":11611867,"text":"Open Energy Market - Surbiton (UK) - Full Time - Remote OK<p>Open Energy Market is a small, innovative, company building technology that is re-defining the commercial energy buying space.  Since our launch in 2013 we have built an impressive portfolio of clients and partners including some of the largest household names in the United Kingdom.<p>For more information about us and what we do, head to <a href=\"https:&#x2F;&#x2F;openenergymarket.com\" rel=\"nofollow\">https:&#x2F;&#x2F;openenergymarket.com</a>.<p>We are looking for a self-organised and motivated individual to join our team as a Full Stack Web Developer.  Our development team is cross functional and is currently fully remote however, we do have an office in Surbiton just outside of London.<p>You will be given a high level of autonomy in how to approach delivering requirements and will report directly to the Chief Technology Officer.  From day one you will be responsible for the development and support of our core applications and deploying them to the Azure hosted environment.<p>Our current platform is built using .Net&#x2F;C# with the MVC framework and SQL Server.  Experience of these tools is preferred but we are keen to talk with individuals from any Object Oriented, web based background.  Additionally, you will have a good working knowledge of web development standards including Html, JavaScript and CSS.<p>We host the platform on Azure and we would expect you to have demonstrable experience of using Azure or a comparable hosting environment such as AWS or Heroku.<p>About You<p>- You will be the kind of person that programs for fun as well as profit.  \n- You will be able to talk effortlessly about the various merits of one software design vs another and why you use your preferred development tools.  \n- You will have a SOLID knowledge of core programming skills, Clean Code, TDD and automation. \n- You will be a confident developer who is at ease discussing requirements with the rest of the business and who is passionate about the design and testing of new features and changes.<p>To find out more and see if we are the kind of company that would interest you email jobs at openenergymarket dot com and we&#x27;ll get straight back to you.","time":1462262270,"type":"comment"}