{"by":"hnatmpd","id":11612045,"parent":11611867,"text":"MPD Group |  Manchester, UK | Full time, ONSITE<p>We are looking for developers who enjoy solving problems, find coding fun, like being part of an agile team, are not afraid to try new approaches, yet easily abandon &#x27;false-starts&#x27;, like clean code, have strongly developed common sense, and take pride in things they build.<p>You would be working on Electio - our newly built and constantly evolving SaaS fulfillment management platform (more about Electio - <a href=\"http:&#x2F;&#x2F;electiodelivers.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;electiodelivers.com&#x2F;</a>). Electio already does some great things which won us major clients, but that&#x27;s just a start. We&#x27;re excited to see what else we can make it do, how we can innovate in a challenging market, and delight our customers.<p>Electio has to comply with very strict response SLAs and at the same time handle large, &#x27;spiky&#x27; volumes of data, therefore designing for performance, reviewing and optimising your code would be essential.<p>We believe you should test your own code. We&#x27;re not particular if you cover it with meaningful tests before or after you&#x27;ve written it - as long as you do.<p>You should also be ok with deploying your own code in a controlled manner.<p>We use relatively new technology stack (.Net 4.6.1, C#, MVC 4.5, Nancy, SQL Server 2014, Redis, Dapper, ELK, and Azure Service Bus).<p>We keep our code in BitBucket, for continuous integration we use TeamCity, we adopted Gitflow as our branching strategy, and we manage our deployments via Octopus. All our environments are deployed in Azure.<p>Our interview process is single-stage 2-2.5 hours interview, which involves a coding task.  For candidates considering a relocation, we offer an alternative, slightly longer technical test which you can do in your own time.<p>If you would like to become part of our team, please drop me a quick email to hn@mpd-group.com.","time":1462202235,"type":"comment"}