{"by":"rhowell","id":11613123,"parent":11611867,"text":"Pet Partners | Saratoga, NY | Fulltime Software Engineer | ONSITE<p>About Us:\nCome help us build world class software that&#x27;s fundamentally changing veterinary medicine.   Pet Partners, located in Saratoga Springs, NY, owns and operates veterinary hospitals across the United States and we’re growing fast!  We are looking for a Software Engineer with strong coding and SQL experience. Your responsibilities will include working on our RESTful API, flash reporting pipeline, enterprise integrations, and intranet site.   This position reports directly to the Chief Information Officer.<p>We support several different electronic medical records applications based on MS Windows and SQL Server for our practices and reporting.   In addition we rely on an open source, Linux-based stack for internal development that includes Elixir and Phoenix, Postgres, and continuous integration via Team City.  We have servers on premises, collocated, as well as on AWS.  The ideal candidate for this position is a great developer who is also comfortable writing and optimizing SQL.<p>Responsibilities:\n* Contribute stories to our agile backlog, contribute to sprints, and collaborate with users to validate solutions\n* Write code against stories that relate to our internal API, flash reporting pipeline, enterprise integrations, and intranet site, including solid test coverage\n* Design and develop solutions that extend our Kofax and Microsoft Dynamics platforms\n* Contribute to the DevOps process for your code\n* Thrive in a dynamic, collaborative culture with minimal supervision.  You&#x27;ll be a big part of a small team and your contributions will have a major impact on Pet Partners&#x27; success.<p>Skills and Qualifications:\n* Experience with Elixir is desirable but not required, but you’ll need to be an expert with at least one relevant language, such as Python, Java, Go, or a functional language like Clojure, Haskell, Scala, Erlang, F#, or LISP\n* Significant SQL experience\n* Agile, unit testing, continuous integration, and dev&#x2F;ops experience are helpful\n* Previous working experience with Git\n* Hands on experience with common data structures like XML and JSON\n* Experience with REST API’s<p>Interviewing Process:\nPhone screen, followed by two in person interviews.  We&#x27;ll need to see some code.<p>Apply by email to: software.engineer@petpartnersusa.com","time":1462208023,"type":"comment"}