{"by":"apbp","id":11613217,"parent":11611867,"text":"Transcriptic | Full Time | ONSITE (Menlo Park, CA) | www.transcriptic.com<p>All job listings: <a href=\"https:&#x2F;&#x2F;www.transcriptic.com&#x2F;hiring\" rel=\"nofollow\">https:&#x2F;&#x2F;www.transcriptic.com&#x2F;hiring</a><p>Transcriptic is setting new standards for basic research by making life science discoveries cheaper, faster, and more accessible than anyone thought possible. We enable scientists to run experiments on our automated work cells via our web application from anywhere in the world. Rather than carry out wet-lab experiments by hand, researchers can code up (or visually configure) their experimental protocols and then run them in Transcriptic&#x27;s central, highly automated &#x27;biocenter&#x27; in an on-demand way. Customers have no upfront capital costs and pay for only what they use. Life science research today is incredibly slow, error-prone, monotonous, and expensive with researchers spending many hours a day every day just moving small volumes of liquids from one place to another. We&#x27;re building a long-term company to completely change the way life science research and development is done.<p>On top of our robotic work cells is a slew of internal services as well as a Rails app that acts as our lab information management system and customer-facing UI. Challenges for our web devs range from building rich, interactive interfaces for composing protocols to presenting analytical data generated by the lab back to the user. We use d3, React, and CoffeeScript today, but you&#x27;d be free to choose your own tools and libraries.<p>We&#x27;re a rapidly growing startup, now 30-something people, well funded ($15M) and have customers at places like Harvard, MIT, Caltech, UCSF, and Stanford. You&#x27;d be able to work on interesting science and hard technology in a small, all technical team with lots of freedom and resources.<p>We&#x27;re looking for talented people to join our team. You&#x27;ll have competitive salary and benefits, subsidized commuting, free caffeine and food, and great teammates.<p>Our process takes 2-4 weeks, and includes 2 30-minute phone calls, a take-home exercise, and an onsite interview. During the first call, we&#x27;ll go more into what you can expect during the process.<p>Recent coverage: <a href=\"http:&#x2F;&#x2F;learn.transcriptic.com&#x2F;news\" rel=\"nofollow\">http:&#x2F;&#x2F;learn.transcriptic.com&#x2F;news</a>\nAll job listings: <a href=\"https:&#x2F;&#x2F;www.transcriptic.com&#x2F;hiring\" rel=\"nofollow\">https:&#x2F;&#x2F;www.transcriptic.com&#x2F;hiring</a>\nteam at transcriptic.com","time":1462208518,"type":"comment"}