{"by":"erydo","id":11622080,"parent":11611867,"text":"Preo Mobile Ordering | New York, NY | ONSITE | Full-Time | Multiple Roles | $50-150k (role- and experience-dependent) + bonus&#x2F;benefits.<p>Preo has built the most advanced mobile ordering app and venue integration in the world: Order and pay for food and drinks from your phone, get an alert when it&#x27;s ready, and never deal with a tab again. You never have to flag down the bartender at the club, waitress at the pub. We&#x27;re rolling out in international markets with some very exciting new technologies and extremely powerful partnerships.<p>We&#x27;re hiring to fill several roles, detailed in the postings on our AngelList page <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;preo&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;preo&#x2F;jobs</a>. The salaries listed are base, on top of which we also offer an annual bonus based on personal targets, in addition to a longer term company target bonus pool. And benefits, of course.<p>We have several native Android products on both the customer and staff&#x2F;operations side of things. We also have a fully native iPhone customer app in Swift, and mobile web app using React&#x2F;React Router&#x2F;Flux. Although we&#x27;re willing to hire specialists, senior engineers who can contribute in multiple ways are always a plus. Specifically, if you&#x27;re an Android or iOS developer who also has mobile web experience, you should apply.<p>Our backend is built out on AWS with Linux, Python, Flask, PostgreSQL, and other things. We&#x27;re exploring some JVM-based technologies, Haskell, JavaScript, Haxe, etc. Someone with a combination of backend development&#x2F;devops experience would be a great fit.<p>We&#x27;re also looking for a more junior, full stack support role. Someone who would benefit from experience and exposure to a wide variety of things, and can help pick off the smaller-but-valuable engineering tasks that pop up. Small bug-fixes, intermediate feature work, and operations support. A little experience is helpful to show that you can learn, orient, and execute quickly, but this is expected to be more of a train-up role.<p>Finally, we&#x27;re looking for a great project manager: someone who can help coordinate and track engineering, design, and operations scheduling. Previous experience, especially in software engineering, is required.<p><pre><code>  * Android Engineer $80-150k: https:&#x2F;&#x2F;angel.co&#x2F;preo&#x2F;jobs&#x2F;136209-senior-mobile-android-engineer\n  * iOS Engineer $80-150k: https:&#x2F;&#x2F;angel.co&#x2F;preo&#x2F;jobs&#x2F;136202-senior-mobile-ios-engineer\n  * Mobile Web Developer $80-110k: https:&#x2F;&#x2F;angel.co&#x2F;preo&#x2F;jobs&#x2F;136254-mobile-web-developer\n  * Senior Backend and Infrastructure Engineer 100-150k: https:&#x2F;&#x2F;angel.co&#x2F;preo&#x2F;jobs&#x2F;136248-senior-backend-infrastructure-engineer\n  * Full Stack Support Engineer $70-110k: https:&#x2F;&#x2F;angel.co&#x2F;preo&#x2F;jobs&#x2F;136268-full-stack-support-engineer\n  * Project Manager $50-100k: https:&#x2F;&#x2F;angel.co&#x2F;preo&#x2F;jobs&#x2F;136444-software-project-manager\n</code></pre>\nTo apply, contact me directly at robert+hn@getpreo.com or through AngelList.","time":1462292979,"type":"comment"}