{"by":"bastih","id":11624338,"parent":11611867,"text":"Artory | Berlin, Germany | Full Time | ONSITE<p>(Senior) Developer<p>We are looking for developers interested in fine and contemporary arts (our focus is not in the buying&#x2F;selling portion of the market process).\nWe have a small team of designers and developers, and would like to add more developers to further drive our development efforts. We are putting a lot of user research into our product, in the hope of allowing developers to guess less about what our users want. Technological and architectural decisions are still in the making and you can be part of these discussions, too. Development efforts are organized as scrum, so you should be comfortable with that.<p>Current interview process (no guarantees on deviation, we&#x27;re still figuring it out):<p>* Short anonymous programming test, shouldn&#x27;t take long and you&#x27;ll always receive a reviewed version back, regardless of our decision to take hiring further<p>* short call on getting to know each other, figure out open questions from CV etc<p>* 1h skype call&#x2F;coffee&#x2F;onsite casual&#x2F;technical conversation, we&#x27;ll send you a rough set of topics beforehand when we&#x27;re interested in specific knowledge&#x2F;topics<p>* potentially another conversation on team fit<p>* 1-2 paid work day(s)<p>Our stack: python (django), postgres, elastic, angular2, typescript, docker + (what you might add in the future)<p>Some benefits: Market pay rates for Berlin, Apple-y hardware to work, awesome office, (maybe) stock options.<p>Specializations&#x2F;topics we are specifically interested in (non-exhaustive) and if you like any of these, please get in contact:<p>* Full stack security<p>* Data extraction from semi-structured data<p>* Data deduplication&#x2F;cleanup<p>* Image processing&#x2F;content analysis<p>If you are interested in other topics which you think might be relevant to startups in the art world, please don&#x27;t hesitate to still inquire.<p>If you are interested to hear more, get in touch through sebastian.hillig -- @ -- artory.com. Or directly apply through: <a href=\"https:&#x2F;&#x2F;artory-gmbh.workable.com&#x2F;j&#x2F;DBF103A447\" rel=\"nofollow\">https:&#x2F;&#x2F;artory-gmbh.workable.com&#x2F;j&#x2F;DBF103A447</a><p>Edit: formatting","time":1462310508,"type":"comment"}