{"by":"numo16","id":11623692,"parent":11611867,"text":"Plex Systems, Inc. | Software Engineer – API’s | Troy, MI ONSITE<p>We’re on a mission.  As a fast-growing software company on the cutting-edge of technology, Plex is revolutionizing global manufacturing in the same way cloud solutions have transformed sales, marketing, and human capital management.  We want manufactures to succeed.  That’s why we’re on a mission to replace underperforming, on-premise enterprise resource planning (ERP) systems with the Plex Manufacturing Cloud – ERP built for today’s model of manufacturing.  If you want to see the future of business, we’re what’s next.<p>In support of our ongoing growth, we are looking for a Software Engineer – API Designer to help guide the development of our next generation API platform.  Position will be located in our Troy, MI headquarters.<p>Responsibilities include the following:<p>* Provide input on the design and contribute to the development of new platform and API features for middleware and partner applications using C# handling XML, JSON data formats<p>* Provide stewardship of the design, development and maintenance of scalable RESTful services and Web APIs.<p>* Ensure the implementation of industry best practices for API security, policies and versioning strategy.<p>* Work with product management to translate end-user requirements into working products<p>* Collaborate with other teams including Product Management, Product Developers, Data Center, and Dev Ops on successful delivery of systems enhancements<p>* Facilitate reviews of technical specifications and program code with other members of the technical team, communicating design, requirements, feature set, functionality and limitations of systems&#x2F;applications to team and development lead<p>More info here: <a href=\"http:&#x2F;&#x2F;www.plex.com&#x2F;about-plex&#x2F;careers.html?p=job%2FoTy12fwe\" rel=\"nofollow\">http:&#x2F;&#x2F;www.plex.com&#x2F;about-plex&#x2F;careers.html?p=job%2FoTy12fwe</a>","time":1462305354,"type":"comment"}