{"by":"sshrinivasan","dead":true,"id":11663933,"parent":11611867,"text":"Zymeworks Inc. | ONSITE (Vancouver, Canada)<p>Zymeworks is a leading protein engineering company making drugs for curing cancer and autoimmune diseases using computational technologies. We develop molecular simulation algorithms, data visualization and analysis pipelines, bioinformatics and machine learning applications as well as high performance computing infrastructure for running the above mentioned scientific software in a cloud-computing environment. We are looking for a Full-Stack Software Developer to work with our team of scientists and software developers to expand and improve our scientific computing stack.<p>It would be great if you had:\n• A Bachelor’s degree in Computer Science, Computer Engineering or a related discipline, and minimum 2 years industry experience in web application development\n• Demonstrated ability to design, implement and maintain medium-to-large scale web applications, their supporting back-end services and associated infrastructure through entire life cycle from initial idea to final deployment\n• Ability to deliver rapid, iterative prototypes from initial ideas, and a drive for software development excellence through peer code reviews, automated testing, and systematic deployments\n• Proficiency in English, spoken and written<p>It would be even better if you had:\n• Experience with Python based web frameworks like Django or Pyramid\n• Experience developing servers and other infrastructure using Go\n• Experience building UX front ends and interactive data visualizations<p>Our Platform:\n• JavaScript, including React, AngularJS, D3\n• Python\n• PostgreSQL\n• Go (for server development)<p>Duties:\n• Developing our data acquisition, processing, analysis, and visualization capabilities.\n• Creating and evolving front-end web applications and their supporting back-end APIs and operational infrastructure.\n• Actively coordinating with our R&amp;D teams to find areas of inefficiencies in data processes, and designing and implementing solutions in conjunction with the software development team.\n• Integrating and maintaining the developed software as part of the entire computational platform.\n• Experimenting with new technologies and practices that can be integrated within our organization<p>Please apply for this position at <a href=\"http:&#x2F;&#x2F;zymeworks.mytribehr.com&#x2F;vancouver&#x2F;careers&#x2F;view&#x2F;43\" rel=\"nofollow\">http:&#x2F;&#x2F;zymeworks.mytribehr.com&#x2F;vancouver&#x2F;careers&#x2F;view&#x2F;43</a>","time":1462834859,"type":"comment"}