{"by":"veyron","id":2831973,"parent":2831646,"text":"This was posted by rush-tea on the imposter thread from yesterday:<p><a href=\"http://news.ycombinator.com/item?id=2830424\" rel=\"nofollow\">http://news.ycombinator.com/item?id=2830424</a><p>People should be warned about making hiring posts like <a href=\"http://news.ycombinator.com/item?id=2829174\" rel=\"nofollow\">http://news.ycombinator.com/item?id=2829174</a><p>--<p>Looking for a technical co founder who is an avid web application Developer (front and back end) to join our effort in building social networking site.\nWe are currently looking to start a social networking site that has potentials to excel in a market where Facebook dominates, and would like a technical co founder to join this effort.<p>We have a step-by-step plan to launch this site. We have sets of minimum requirement needed to launch and we also need to develop more customized features onto it. That’s where you come in, to customized these features and put the finishing touch on the site. Once the minimum requirements are done, we will launch the site in beta mode. We are hoping to launch the site within couple months after you are on board (the launching time is depending on full time/part time work you are doing as the technical co founder). Then when the YC Winter 2012 program application starts, we are going to apply for the program. Our goal is if we can have few hundreds (or thousands) users base before going into the program, that would be a great achievement.<p>What we need is someone who is strong in web engineering to help us in technical areas and take it to the next level while we are going to do the testing development of the site, business development, funding, user base, marketing, and opportunities. We are looking for help from the following candidate<p>- Can-do attitude, never give up, and love to solve problems (there is always a solution to every problem)<p>- You will be one of the co founder, we are partners. We move forward, fall backward and work together to achieve great things.<p>- software development experience as an web/internet engineer and experience in building back end web engine.<p>- Strong knowledge and proven hands-on experience with PHP, MySQL, Javascript, AJAX, CSS<p>- Desire and ability to learn, excel, and 100% commitment to success.<p>- Must be located in Bay Area (or willingness to relocate) as we will work together day and night to make it happen<p>- Prefer that you are available for full time to develop (as you will be working with one of the co founders on daily basis as he puts his effort full time on this), but we can discuss what you need and required in discussion. What's really important is that you want to work with us, we want to work with you, and we are in it together.\nNice to have (but not required)<p>- Developed a production worthy SaaS application<p>- Experience building large scale applications is desired<p>- Strong desire to work in a startup, prior experience gets bonus points<p>- Knowledge of software development processes (Agile, Scrum) is desired but not necessary<p>All in all, we are looking for a passionate and genius web developer who likes social interaction, build sites, and is always challenged to make something better for the world. When we combine your coding prowess with the vision on where we are going, we can only move forward.<p>A little bit about us.<p>One is a second time entreprenuer, worked at a fortune 50 company prior to this. His educational background is MSc in Electrical Engineering. Expert in creating intuitive user experience, user interaction, and user values. Understand the market and eyeballing opportunities. Passionate about UI, startups, technology. Several years of experience in the wireless engineering and product management domain in wireless and mobile space. He loves to solve problems, creates opportunities, and love challenges. He will devote his time 100% day and night for this effort.<p>One is recent Cal graduate currently working at a startup company. His educational background is BSc in Chemical Engineering.<p>You &#60;insert your profile&#62; :)<p>Why diving in social networking market with Facebook domination?<p>Because we believe that the social networking site has a lot of potential to grow because as of now, it has only Facebook in it, and the market will give us the chance the grow (considering what Google+ has achieve in its first month of its launch, there will be huge growth to make). It's a great task and huge challenge ahead, but hey, if we are looking forward to it, then you must be too (no die attitude).<p>If you are interested in joining us and build a social networking site that offers values, please email us your experience at<p>rush.tea@gmail.com<p>We are going to look at all candidates regardless of background.<p>We are looking forward to great success together. We are open to any suggestions or ideas. :)","time":1312204910,"type":"comment"}