{"by":"jqueryin","id":2832544,"parent":2831646,"text":"Skookum Digital Works: Charlotte, NC<p>--- WHO WE ARE ---<p>Skookum Digital Works is a custom mobile and web applications development company. We love working with startups and entrepreneurs; using agile methodologies and the lean startup movement to deliver minimal viable products. Delivery is key, so we look for performers who love taking control of projects and require minimal management.<p><a href=\"http://skookum.com\" rel=\"nofollow\">http://skookum.com</a><p>--- WHO WE WANT ---<p>Skookum Digital Works is hiring both seasoned developers (mid to senior) as well as a junior dev.<p>We do not target specific languages per say, as great programmers have the ability to add tools to their belt as they go. With that being said, we currently seek individuals with any of the following skills:<p><pre><code>  * LAMP/LEMP developers (familiarity with Zend, Kohana, Wordpress, or Drupal preferable)\n  * Node.JS developers (we have live projects and products)\n  * Frontend developers (jQuery/JS/Sass/LESS/CSS/HTML5)\n  * Mobile developers (iOS, iPhone, Android, Blackberry, phonegap)\n  * Familiarity with a VCS (git preferable)\n</code></pre>\nIf you have a skill set outside of the above, don't fret. We're still interested in hearing what you bring to the table. All we ask is that you leave your ego at the door.<p>--- WHAT WE OFFER ---<p><pre><code>  * Competitive salaries\n  * Three weeks paid vacation\n  * Health insurance\n  * Catered Friday lunches (Pizza/Techtalk Fridays)\n  * Once-a-month group outings\n  * Paid continual learning (conferences, classes, etc)\n  * People like you\n  * A growing company\n  * A great location and view (smack dab in the heart of Charlotte, 19 floors up)\n</code></pre>\n--- STILL INTERESTED? ---<p>If interested, contact me directly at corey@skookum.com with your resume and any online links or open source stuff you may have. We love developers who are active in the community.","time":1312211927,"type":"comment"}