{"by":"RyanGWU82","id":2833508,"parent":2831646,"text":"San Mateo, CA<p>PBworks is hiring a VP of Engineering!<p>PBworks is looking to hire a world-class VP of Engineering to direct, manage, and grow our engineering team at PBworks and join a great management team. Candidates should have knowledge and experience with Software-as-a-Service best practices and methodologies, such as frequent deploys, functional testing, and automated rollbacks. Candidates should have at least five years of management experience but still be active programmers with code-review and prototyping level strengths in a modern scripting language (such as Ruby, Python, or PHP) as well as fluency in modern HTML, CSS, and Javascript. Strong preference will be given for LAMP stack proficiency. Extra consideration will be given to candidates with experience hosting software for very large clients and candidates with UX skills.<p>Candidate should have experience building and executing effective agile product development and project management strategies, and continuing to build a top-notch, highly, innovative team. Experience with workspaces and team collaboration software in general and PBworks in particular is a strong plus. Master's in Computer Science preferred.<p>You'll be in charge of one of the most powerful, scalable, popular, and sophisticated hosted collaboration tools in existence: with over 4m users a month, hundreds of terabytes of user data, billions of recorded actions, and a million and a half groups. Our team is small but highly effective; every engineer in the group is capable of working on a wide diversity of projects - from low level systems debugging to SQL optimization, to best practices in modern Javascript and CSS. You'll be redefining the future of how our customers get their work done - everything from collaborative medicine to treat cancer patients to innovative creative teams shaping the next great TV commercial or videogame to university research labs, and even a few un-stodgy law firms.<p>We'd love to have you come help our team win and grow!<p>To apply, email jobs-vpeng+hn@pbworks.com.","time":1312221417,"type":"comment"}