{"by":"baycitizen","id":2834868,"parent":2831646,"text":"San Francisco, CA<p>Do you want to help build one of the world's most innovative news projects? Do you want to become a key member of a small, high-caliber team and work toward a great cause? The Bay Citizen team is redefining the model for journalism and is made up of a talented team of area experts. We need you to join our technology team to help build the future of online journalism with Armstrong - a new, open source platform for news.<p>We are looking for a Senior Python Developer who will play a critical role in developing a robust and flexible publishing platform that powers our 24x7 editorial organization. We will develop new journalism tools and innovative ways for people to interact with news and data from the web, mobile and other distribution platforms.<p>Responsibilities:\n1.  Develop and maintain the publishing platform with a small team\n2.  Take ownership and drive data/visualization projects to conclusion\n3.  Code primarily in Python, HTML, Javascript, and CSS\n4.  Make decisions independently and iterate rapidly\n5.  Be creative and self-motivated<p>Requirements:\n1.  You’re a hacker that gets thing done.\n2.  Strong working knowledge of Django and Python (at least 2 years experience)\n3.  Significant experience with databases (MySQL, PostgreSQL)\n4.  Familiarity with jQuery and/or other Javascript frameworks\n5.  Demonstrated ability to build impressive, non-trivial web applications.<p>Nice-to-haves:\n1.  Experience with Amazon Web Services running Apache, Nginx and memcached\n2.  Development experience consuming or providing web service APIs\n3.  Experience with distributed version control systems (Git, Mercurial)\n4.  Interest in Mobile Application Development (iOS, Android) \n5.  Prior start-up experience.<p>Also, if you’ve built anything interesting outside of work/school, we want to see it. Links to web apps, git repos, portfolios, etc are greatly appreciated.<p>To apply for this position, email brian_kelley@baycitizen.org with your resume and cover letter.<p>Company Description<p>The Bay Citizen is a nonprofit, nonpartisan, member-supported news organization. In collaboration with the UC Berkeley Graduate School of Journalism, The New York Times, and other media organizations serving the Bay Area, our mission is to enhance civic and community news coverage in the Bay Area, stimulate innovation in journalism, and foster civic engagement.","time":1312238842,"type":"comment"}