{"by":"bkudria","id":2607880,"kids":[2610249,2608621],"parent":2607052,"text":"Yammer is hiring in San Francisco. We're one block away from the Caltrain station.<p>What do we do? Yammer helps turn the mayhem of the corporate world into return-on-investment butterflies and leveraged-employee-engagement unicorns. Really, we make a product that enables companies to have a private social network. It helps people do their jobs, and our users legitimately love our product.<p>We are a medium sized start-up that is battling several big enterprise software companies in this space. So yes, our target customers are in the enterprise space but we are turning this space upside down with our viral approach and how we build solutions for the user (which doesn’t include an army of salesmen). We are solving consumer type problems but also monetize like enterprise software. (i.e. real revenues with fewer users)<p>What's in it for you?<p>- Amazing group of smart engineers to work with. (Sounds cliche, but we really do have smart people here :D)<p>- Ability to have influence without authority. Yammer is a product-focused and user-focused organization. Everything we do revolves around that. - We hack in Ruby/Rails, Scala/Java, JS/JQuery/Node.js/Adobe AIR, Obj-C for iOS, and some MSFT stuff for Sharepoint I don't know too much about. You'll probably find something you want to work on.<p>- Good catered lunch and dinner daily, with a 3PM snack cart. (Really.)<p>- Fancy Apple hardware of your choice (you can have a PC if you really want one.)<p>- Our engineers can outdrink anyone.<p>- Top of the market compensation.<p>Check out this blog post written by another one of our engineers: <a href=\"http://eng.yammer.com/blog/2011/5/31/shameless-recruiting.html\" rel=\"nofollow\">http://eng.yammer.com/blog/2011/5/31/shameless-recruiting.ht...</a><p>All our open positions (engineering and otherwise) are here: <a href=\"https://www.yammer.com/about/jobs\" rel=\"nofollow\">https://www.yammer.com/about/jobs</a>.<p>If you send me your resume, I'll make sure the correct person sees it. bkudria@yammer-inc.com<p>(Note: we also offer generous referral fees. Sell your friends today!)","time":1306944212,"type":"comment"}