{"by":"andrew93101","id":2608180,"parent":2607052,"text":"Santa Barbara, CA: AppFolio inc. (Applicants must be willing to relocate to Santa Barbara, CA)<p>Hiring for two positions: A front-end Javascript/CSS specialist, and for smart and versatile software engineer generalists comfortable working in many languages (today primarily Rails)<p>About AppFolio: AppFolio is the fastest growing provider of online property management software. Our company was founded by a team of technology leaders with many years of experience developing Software-as-a-Service applications (previously created the GoToMyPC and GoToMeeting family of SaaS applications). We believe that a small group of passionate people can deliver extraordinary results. We believe in focus and know we can only do a few things really, really well. Our company is experienced, well-funded and built to last.<p>About the front-end specialist position: You are someone who paints in structured DOMs and succinct CSS and who can appreciate the beauty of well engineered unobtrusive Javascript. You will work directly with our engineering team to build out user interfaces that are used millions of times each month and help to make people's lives a little bit better.<p>We are looking for people who are expert with: HTML 5, CSS 3, Javascript (and libraries like jQuery and Prototype), AJAX, Cross-browser testing of all the above, Firebug and related web development tools. If you have one or more of the skills below, even better: Experience with Ext JS, Experience with Ruby on Rails templates (ERB, HAML, etc), Experience with SASS<p>About the Software Engineer positions: AppFolio software engineers work to build scalable, robust and easy to use solutions to complex business problems. Delivering intuitive and responsive applications over the web requires us to solve both difficult engineering and product design problems.<p>AppFolio wants creative and independent engineers who are comfortable with a high degree of autonomy and an agile, collaborative work environment. If you are a smart, versatile software engineer with a desire to work with the following technologies, we'd love to hear from you:\nRuby on Rails, MySQL, Javascript/AJAX/jQuery, HTML/CSS, iPhone (iOS) and Android development, SOA/REST/JSON/XML, Apache Solr/Lucene search technology\nTo apply, please submit your resume to tech.jobs@appfolio.com.","time":1306947830,"type":"comment"}