{"by":"jfarmer","id":2608452,"parent":2607052,"text":"Everlane FULL TIME San Francisco, CA<p>Hey HN!<p>I'm Jesse, one of the co-founders of Everlane, and we're hiring engineers.<p>Check out our website at <a href=\"http://www.everlane.com\" rel=\"nofollow\">http://www.everlane.com</a>, and my personal blog at <a href=\"http://20bits.com\" rel=\"nofollow\">http://20bits.com</a><p>We're trying to re-imagine retail online and make it easy to find products that match your taste and style. Right now we're focused on mens fashion, but our ambitions are much larger.<p>We're gearing up for our first sale, but our customers already love us.<p>pg did a good job of explaining the opportunity, here: <a href=\"http://ycombinator.com/rfs2.html\" rel=\"nofollow\">http://ycombinator.com/rfs2.html</a><p>Here's a sample of some of the user feedback we get daily:<p>* I can't wait until you open a store.<p>* When are you going to start selling things? I want to spend all my money with you.<p>* It's like you entered my brain and turned it into a store.<p>* I want to buy all my husband's clothes from you -- please start selling!<p>Oh, and someone wrote us a love poem yesterday: <a href=\"http://tumblr.everlane.com/post/6046682577/oh-everlane-everlane-everlane-i-dont-really-know\" rel=\"nofollow\">http://tumblr.everlane.com/post/6046682577/oh-everlane-everl...</a><p>We're well-funded by really awesome investors and need engineers who are interested in building the next big online retail destination.  Imagine we're a storefront with tens of thousands of people banging on the doors outside, begging us to open.  That's when you'd be joining.<p>Our current stack is Ruby, Rails, MySQL, and Heroku, but smart and hungry beats knowledge of specific languages.<p>If you're interested send me an email at jesse@everlane.com and mention this post. The most important thing is for you to be excited by the opportunity, so make it clear.<p>Bonus points for including a solution to this exercise in the language of your choice: <a href=\"http://static.everlane.com/everlane_exercise.pdf\" rel=\"nofollow\">http://static.everlane.com/everlane_exercise.pdf</a>","time":1306951084,"type":"comment"}