{"by":"grabs","id":2650147,"parent":2607052,"text":"CivicSponsor is a new, funded startup that aims to change the way governments raise revenue and engage with their citizens.  We’re building a brand-new concept--an online marketplace for local governments to crowdfund public projects--that’s at the center of massive global trends.  If you believe in open government, engaged communities, green spaces and children’s education, then we want to talk to you.<p>We’re a small, agile team working out of SoMa, two blocks from CalTrain and across from the ball park.  Our office environment is pure startup: laid-back but super productive, moving forward at breakneck speed to change the way government works.<p>We are looking for an enthusiastic designer who:<p>- Has a passion for web design and can present a portfolio of past projects.\n- Can turn a wireframe into a web masterpiece -- loves designing with pixels, developing icons and creating clean interfaces.\n- Understands UI/UX principles and can translate that knowledge into solid user-centered design.\n- Has a strong understanding of web development and HTML / CSS (Javascript is a nice to have as well).\n- Can work independently and takes pride and ownership in work product.<p>Responsibilities include:<p>- Define user flows and best practice UI/UX. \n- Convert wireframes/prototypes into compelling visual user experiences.\n- Create design mockups to demonstrate how dynamic content will function.\n- Develop buttons, user interface elements, icons, etc.\n- Develop web/application style guide.\n- Front-end development -- convert designs to HTML/CSS.\n- Have fun, be friendly, work well in a small team.<p>Knowledge, Abilities and Skills<p>- Understanding of CSS3, HTML5 and how they can be used to improve the user experience.\n- Solid understanding of design, typography and UI/UX.\n- Knowledge of web standards, cross-browser compatibility issues and page optimization. \n- Javacript experience a plus.\n- Mobile experience a plus.\n- Putt-putt skills highly respected.<p>To apply, send your resume, a link to your portfolio, and a cover letter sharing the (short!) story of why you became a designer to:\n jobs [at] civicsponsor.org","time":1307989981,"type":"comment"}