{"by":"ri_hutch","id":18355609,"parent":18354503,"text":"BitMEX | San Francisco | On-Site | Full-Time | Visa<p>The Bitcoin Mercantile Exchange (BitMEX) is the world’s most advanced Bitcoin derivatives platform and the 26th largest exchange, of any type, on Earth. We have a hundred thousand active customers across the globe, particularly in Asia.<p>Developed by ex-bankers well-versed in computer science, financial engineering, and traditional finance, BitMEX launched in 2014. We’re new (but so is everybody in this industry) and we’ve been humbled by our success so far.<p>Our innovative, secure, and very liquid platform currently trades between $2 and $5 billion USD a day of crypto derivatives (futures and options only; we are not a spot exchange where you can buy Bitcoin with USD or other fiat currencies).<p>By offering the crypto-sphere’s greatest price discovery marketplace, BitMEX also expects, over the long term, to spur Bitcoin adoption by consumers and merchants.<p>Culturally, BitMEX defies the stereotypes of both the old-fashioned, testosterone-drenched Wall Street “boys club” type of firm, as well as the politically correct, “snowflake-coddling” Silicon Valley tech outfit. In truth, we are pioneering a new model of corporate culture, and learning as we go.<p>For example, as Angelina Kwan, chief operating officer of BitMEX, put it: “In addition to being a true market leader among trading platforms, BitMEX shares my values of gender inclusion, particularly in STEM fields. Cryptocurrency markets present an exciting new opportunity for women to get involved in the intersection of finance and technology.”<p>All BitMEX employees have at least three things in common: they buy into our core values unequivocally, they are effective in their roles, and they own up to their actions. No workplace is free of internal politics, but we are as much of a meritocracy as you’ll find in this cruel world. And you can be almost anything you want to be at BitMEX as long as you make your mark with your work.<p>If you like what you&#x27;ve read, visit bitmex.com&#x2F;careers or email people@bitmex.com. We are hiring across all departments but our most pressing needs right now are for Node&#x2F;API Engineers, Senior SREs and Kubernetes Engineers.<p>We look forward to hearing from you!","time":1541089571,"type":"comment"}