{"by":"TaekLD","id":18355663,"parent":18354503,"text":"LaunchDarkly | ONSITE | Oakland, CA | SDK Engineer + Mobile SDK Developer + DevOps Engineer | Full-time | Cannot sponsor new visas at the moment\nLaunchDarkly is a rapidly growing software company with a strong mission and vision carried out by a talented and diverse team of employees. Our goal is to help teams build better software, faster. You&#x27;ll join a small team from companies like Atlassian, Google, and GitHub, and you&#x27;ll have an immediate impact with our product and customers. Our platform serves over 30 billion feature flags daily.<p>We&#x27;re looking for SDK Engineers + Mobile SDK Developers with at least 2+ years experience working on production level software. You should have experience developing in at least 2 different coding languages such as Java and GO or one of the deeper level backend languages. Experience with Open Source as well. Ideally you&#x27;re someone who dabbles in a wide variety of programming languages.<p>We are also looking for a DevOps Engineer who has experience with large scale production systems on Linux servers in AWS as well as experience with configuration management tools such as Ansible, Chef, Puppet, Salt or Terraform.<p>If you&#x27;re interested please apply here for the SDK Engineer: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;launchdarkly&#x2F;c39b6015-99a4-495a-abcc-bcd7548138c1\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;launchdarkly&#x2F;c39b6015-99a4-495a-abcc-b...</a><p>Here for the Mobile SDK Developer: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;launchdarkly&#x2F;41e8881f-0d83-4175-bf7c-260534d7c61f\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;launchdarkly&#x2F;41e8881f-0d83-4175-bf7c-2...</a><p>Here for the DevOps Engineer: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;launchdarkly&#x2F;aa5b3b23-5f10-4682-83c0-79be5aec0114\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;launchdarkly&#x2F;aa5b3b23-5f10-4682-83c0-7...</a>","time":1541089809,"type":"comment"}