{"by":"msolo","id":18354969,"parent":18354503,"text":"Broad Institute of MIT and Harvard | Cambridge&#x2F;Boston, MA | Software Engineer | INTERNS, ONSITE, VISA<p>We&#x27;re a small team of software engineers, computational biologists, clinicians, and geneticists building cutting-edge tools and methods for interpreting some of the largest genomic datasets in the world (~500,000,000 genetic variants in ~200,000 human genomes&#x2F;exomes). We aim to determine how genetic variation alters our proteins, biochemical pathways, cells, tissues, physiology, and traits&#x2F;susceptibility to disease.<p>This position involves developing a React component library for visualizing genomic data. We are looking for friendly people with demonstrated experience in web tech, an eye for design, and genuine excitement to learn new things. Experience building performant React web applications preferred. In your email, please link to an online portfolio&#x2F;github repo, and bonus points if you&#x27;ve built a nontrivial data visualization app. Technologies we use: React, Redux, D3, SVG, Python, GraphQL, nodejs, Docker, Kubernetes, Google Cloud Platform.<p>In this role, you&#x27;ll receive domain-specific training at a world-class research institute. We&#x27;re supportive of candidates interested in transitioning to graduate school. Your work will be 100% open source and highly visible in the genetics&#x2F;genomics community. Our tools are used by tens of thousands of researchers and physicians around the world who cure disease and make biological discoveries. Come help shape the future of human genetic data visualization and discovery!<p>email: msolomon@broadinstitute.org<p>---<p>Broad Institute of MIT and Harvard | Cambridge, MA | Principal Software Engineer | ONSITE<p>We are looking for a senior-level full-stack but frontend-focused engineer, ideally with React experience, to provide technical leadership for a project supporting the largest research study in the world. We have a progressive, maturing engineering culture with people who care about the world and how we can positively impact it. We believe the treatment of human disease deserves world-class software engineering.<p>Experience in biology or medicine is not required. A background in Lisps or functional programming will be a good philosophical fit even though we use more mainstream technologies (JavaScript and Java) for most of our work. You can check out my LinkedIn profile [1] for more engineering philosophy.<p>[1] <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;davidmohs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;davidmohs&#x2F;</a><p>Email: dmohs@broadinstitute.org","time":1541086692,"type":"comment"}