{"by":"hexagontech","id":18355095,"parent":18354503,"text":"Hexagon Technologies | Senior Software Engineer - Full time or Part time &#x2F; Software Development Interns &#x2F; Co-ops | Remote &#x2F; Boston, MA<p>Hexagon Technologies is an early-stage start-up focused on developing software for the financial services industry and is looking for a self-driven, full-stack JavaScript engineer to join our team. This position provides the candidate the opportunity to work in a fast-paced environment with a firm that values a work-life balance (and no commute!), as well as a chance to work with modern toolsets and technologies. We are seeking someone with the following skills:\nFront end JavaScript skillset and a handle on contemporary (ES2015) language features are a must. Back end &#x2F; Node.js history is not necessarily mandatory if you have similar experience with other comparable web backends from different language ecosystems.\nExperience with modern web technologies like grid layouts, reactive frameworks, and graphql is preferred.\nRelevant degree or minimum 2-4 years’ work experience ideal for full time applicants.\nAlthough we are primarily focused on JavaScript, experience across a variety of programming paradigms and different levels of abstraction is highly valued.\nAs this is a remote position, being a self-driven self-learner is essential. Position will require comfortability with picking up new technologies and an ability to work on the command line in a Linux environment.\nResponsibilities will not only include working on core application code but also on infrastructure and independent research of new topics as is needed. Day-to-day projects may include working with relational or non-relational data, consuming and developing web APIs, UX design, containers and VMs, shell scripts, realtime web services and backend system services.\nA highly organized and motivated approach to membership of a remote development team and ability to communicate, collaborate, and meet deadlines in a flexible environment.<p>Market compensation and benefits - submit resumes and inquiries to hncareers@hexagontech.com","time":1541087206,"type":"comment"}