{"by":"skadamat","id":18357089,"parent":18354503,"text":"Dataquest Labs | Senior Infrastructure Engineer | Remote | www.dataquest.io<p>At Dataquest Labs, we teach data science interactively online to hundreds of thousands of students worldwide. We&#x27;re focused on teaching skills and building intuition from the ground up with our project based curriculum. Unlike most educational options, we focus on motivating students to learn, not just content delivery. We have students go from little programming or data science knowledge to jobs at companies like SpaceX, Amazon, and Microsoft. You can read about some of the success stories here -- <a href=\"https:&#x2F;&#x2F;www.dataquest.io&#x2F;stories\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dataquest.io&#x2F;stories</a> -- and reviews rom our students here -- <a href=\"https:&#x2F;&#x2F;www.switchup.org&#x2F;bootcamps&#x2F;dataquest\" rel=\"nofollow\">https:&#x2F;&#x2F;www.switchup.org&#x2F;bootcamps&#x2F;dataquest</a><p>A key part of our vertically integrated approach to teaching data science is providing a rich environment for learning. Students are always writing code on our platform as they learn new concepts in programming, databases, statistics, data visualization, and machine learning. We&#x27;re one of a few online learning companies where maintaining and improving our own code running infrastructure is a core competency.<p>We&#x27;re looking to hire a Senior Infrastructure Engineer to help us take our infrastructure to the next level. This person will work to empower other backend engineers, help us build a better devops culture, and will have the opportunity to work on deep technical problems at the intersection of backend, devops, and tooling.<p>On the company side, we&#x27;re a fully distributed team with people in 5 time zones (4 in the US and 1 in Europe). We&#x27;re also a profitable, mostly bootstrapped company that prides itself on growing deliberately and empowering students. We hold company offsites 2 to 3 times a year and even enjoy meeting with our students in person at these events.<p>Here&#x27;s a preview of the requirements for this position:<p>* 5+ years of backend infrastructure experience<p>* 3+ years of Python experience<p>* Experience with Docker &amp; Kubernetes<p>* Experience creating on-call rotations<p>* Experience working on a team with strong devops culture<p>* A generalist with experience contributing to both backend and infrastructure systems<p>If you have any questions, you can reach out to me (srini at dataquest.io), the Director of Engineering at Dataquest.<p>If you want to learn more about or apply to this position, head to our job listing at -- <a href=\"https:&#x2F;&#x2F;dataquest.breezy.hr&#x2F;p&#x2F;ddf6ad7c92e5-senior-infrastructure-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;dataquest.breezy.hr&#x2F;p&#x2F;ddf6ad7c92e5-senior-infrastruc...</a><p>You can learn more about your team here -- <a href=\"https:&#x2F;&#x2F;www.dataquest.io&#x2F;about-us\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dataquest.io&#x2F;about-us</a>","time":1541097892,"type":"comment"}