{"by":"jcdavison","id":18365316,"parent":18354503,"text":"Want to help end ticket-scalping and ticket-fraud ?<p>Want to watch the software you build immediately get put to use at the highest levels of the music industry?<p>Want to join a team of hard working, fun loving people who are still a little weird and know how to both ship rock solid code and not take life too seriously?<p>We at Lyte.com are searching for skilled senior level API&#x2F;Server engineers who can help us continue to build out our platform.<p>Lyte has particularly strong deals across the music industry, these deals have allowed us to build fan to fan exchanges for sold out events. For example, you want to purchase a ticket to an event that is sold out, maybe you don&#x27;t want to get scammed or pay inflated prices on known secondary markets (craigstlist, SH, etc.), you visit a Lyte exchange and request a ticket, as people who don&#x27;t want to go to the show return tickets, you will be offered the ability to buy their ticket without having to get involved with them or pay crazy prices.  We have direct integrations that allow us to re-register&#x2F;transfer&#x2F;remix tickets between primary issuing agencies so that fans have a cost-friendly, scam free ticketing experience.<p>To date, we have done numerous exchanges and have significant business traction from many top players in the music industry.  We are gearing up for a very big 2019.<p>If this sounds interesting to you and you have very, very solid chops with Python&#x2F;Django please send an email to john@lyte.com with supporting information.  We have a seasoned engineer who handles all recruiting so you will deal directly with the team and if things click, you could join our team in under a week.  We pay well and have a reasonable amount of perks for a pre-A startup that is punching way above its weight.<p>For more information, <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;lyte\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;lyte</a> or <a href=\"http:&#x2F;&#x2F;lyte.com\" rel=\"nofollow\">http:&#x2F;&#x2F;lyte.com</a>","time":1541182472,"type":"comment"}