{"by":"JoeMorrison","id":18366287,"parent":18354503,"text":"Healthfirst | Senior Data Wrangler, Data Engineer and Senior Clinical Analysts | New York NY | ONSITE \n<a href=\"https:&#x2F;&#x2F;hfjobs.org\" rel=\"nofollow\">https:&#x2F;&#x2F;hfjobs.org</a><p>Healthfirst is a not-for-profit managed care organization sponsored by some of the most prestigious and nationally recognized hospitals and medical centers in New York. We are one of the fastest growing health plans in our area with more than a million members and a network of more than 24,000 providers and 3,400 employees.   Our mission is to ensure that our members have superior healthcare and satisfaction; we significantly improve the health and wellness of the New York metropolitan area, all while driving down the costs<p>The Data Wrangler will create best-in-class data principles for analytic data systems along with high-value models to standardize interactions between data systems. They will describe data structures used by data consumers to improve management insights for growth and to improve quality and effectiveness of analytics. They will author artifacts defining standards and definitions for storing, processing and moving data, including associated data structures, classifications and individual data elements. Additionally, they will map the details within these their artifacts to business processes, non-functional characteristics, QA criteria and technical enablement.<p>The Data Engineer will be responsible for data acquisition strategies and integration scripting and tools, data migrations, conversions, purging and back-ups; fulfills data acquisition strategy requirements. They work with product, financial control, analysts, users and other stakeholders to understand business requirements and supports data architecture to translate into data acquisition strategies.  They will author artifacts defining standards and definitions for storing, processing and moving data, including associated processes and business rules.<p>Senior Clinical Analyst will champion the analytic and reporting needs and build effective working relationships with business partners and taking ownership of strategic vision.  They will be responsible for delivery of data driven analytical work products ranging from reporting and dashboards to exploratory analysis and data storytelling.<p>Apply at:\n<a href=\"https:&#x2F;&#x2F;healthfirst.wd1.myworkdayjobs.com&#x2F;en-US&#x2F;healthfirst&#x2F;job&#x2F;New-York-NY&#x2F;Sr-Data-Wrangler_R002505\" rel=\"nofollow\">https:&#x2F;&#x2F;healthfirst.wd1.myworkdayjobs.com&#x2F;en-US&#x2F;healthfirst&#x2F;...</a>\n<a href=\"https:&#x2F;&#x2F;healthfirst.wd1.myworkdayjobs.com&#x2F;en-US&#x2F;healthfirst&#x2F;job&#x2F;New-York-NY&#x2F;Data-Engineer_R002499\" rel=\"nofollow\">https:&#x2F;&#x2F;healthfirst.wd1.myworkdayjobs.com&#x2F;en-US&#x2F;healthfirst&#x2F;...</a>\n<a href=\"https:&#x2F;&#x2F;healthfirst.wd1.myworkdayjobs.com&#x2F;en-US&#x2F;healthfirst&#x2F;job&#x2F;New-York-NY&#x2F;Sr-Clinical-Analyst---Relationship-Mgr_R002562-1\" rel=\"nofollow\">https:&#x2F;&#x2F;healthfirst.wd1.myworkdayjobs.com&#x2F;en-US&#x2F;healthfirst&#x2F;...</a>","time":1541189336,"type":"comment"}