{"by":"edwardmp","id":18382526,"parent":18354503,"text":"Felyx | Amsterdam, The Netherlands | ONSITE | Full-Time | EUR 40-80k + equity (depending on experience &amp; role)<p>We are felyx, an innovative scale-up with ambitious plans for sustainable and shared urban transport. The coming years we are facing hyper-growth in The Netherlands and the rest of Europe. Therefore, we are looking for ambitious Full Stack Developers to build our new technological architecture, the foundation of the company. \nWe are a young and driven scale-up, with our innovative and sustainable tech platform, we are making swift door-to-door transportation the new status quo. Working together with an ambitious team of entrepreneurs, operators and engineers, we are looking to grow as we scale the business throughout Europe.<p>We are currently hiring full-stack software engineers to work on our new back-end system from scratch. This will be a greenfield project in which we will be primarily using Go. Our back-end system will need to handle millions of requests a day so if you have past experience in designing systems with scalability in mind you might be a good fit for these positions. No experience with Go is required, although it is slightly preferred. We care about code quality. A lot. We don’t ship code without sufficient test coverage. Does that sound like you and do you want to make social impact on urban mobility and drive change? Great! We want you! Please check the job descriptions for more information and use our API to apply. We look forward to hear from you!<p><pre><code>  - Full-stack developer: https:&#x2F;&#x2F;careers.felyx.nl&#x2F;o&#x2F;full-stack-developer\n  - Lead developer: https:&#x2F;&#x2F;careers.felyx.nl&#x2F;o&#x2F;lead-developer\n</code></pre>\nUnfortunately, at this time can only hire EU&#x2F;Dutch citizens, but be sure to check our careers page (<a href=\"http:&#x2F;&#x2F;careers.felyx.nl\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.felyx.nl</a>) in ~3 months when we do expect to have that ability. If you have any questions feel free to email us at jobs@felyx.nl at any time.","time":1541428264,"type":"comment"}