{"by":"ddtruong17","id":8252864,"parent":8252715,"text":"Kaggle, Inc (<a href=\"https://www.kaggle.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kaggle.com&#x2F;</a>) - San Francisco, CA + various<p>------- About Kaggle -------<p>Kaggle is best known as the world’s largest community of data scientists.  Our community of around 200,000 data scientists compete to solve complex data problems.  We’re changing the way the most important data-driven problems are solved.  \nWe have branched out beyond our core business of machine learning competitions, to build end-to-end solutions in specific industries. Our first focus industry is energy, where we are working with Global 10 companies to make better decisions on where and how to drill for oil &amp; gas. Our solutions take detailed geological and engineering data and help predict well performance. These solutions can minimize capital and environmental destruction by helping operators drill fewer uneconomic wells.\nKaggle is located in the heart of the SOMA. We are well-funded (Khosla Ventures, Index Ventures and Max Levchin). Our team includes coffee, beer wine and whisky connoisseurs, pastry chefs, ping pong players, kiteboarders and rollerbladers.<p>For all Kaggle career opportunities, please visit <a href=\"https://www.kaggle.com/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kaggle.com&#x2F;careers</a><p>---------- Who We&#x27;re Looking For -----------<p>Head of Product:<p>We’re looking for a Product Manager with an interest in hard science and data science. Somebody who can learn a complex and technical industry and empathize with customers who are not always data science savvy.<p>What you will be doing<p><pre><code>   * Create and refine the company’s product strategy\n   * Work with our customers to understand their economics, buying process and decision making process\n   * Develop an understanding of how Kaggle&#x27;s products impact our customer&#x27;s economics and decision making process\n   * Collaborate with sales to develop pricing models and identify target customers\n   * Colloborate with engineering to prioritizing requirements, scoping feature &amp; set expectations\n   * Develop an understanding of our competition and how their impact our roadmap and positioning \n   * Identify new opportunities based on customer interactions\n\n</code></pre>\nStatisticians &amp; Data Scientists to Focus on the Energy Industry:<p>We have branched out behind our core data mining competititons, to build end-to-end solutions on an industry by industry basis. Our first industry is energy, where we&#x27;re building solutions that can transform the world&#x27;s largest industry.\nIn the energy sector, we&#x27;ve started with two basic solutions:<p><pre><code>   * using detailed geological data to pick the best place to lease and drill for oil &amp; gas; \n   * using detailed data on drilling practices to help operators produce efficiently.\n</code></pre>\nThe machine learning and statistical challenges in energy have some interesting properties:<p><pre><code>   * geospatial data\n   * mix of deep science and machine learning\n   * sample sizes are small and samples are highly correlated\n   * we care about explainability and insights\n</code></pre>\nAddressing these challenges requires layers upon layers of statistical machine learning models\nWe want to fully capture the uncertainties in our modeling at each layer, not just the point estimates.<p>Software Engineer:<p>Help us combine software and machine learning to transform industries.\nBy leveraging insights we’ve learned from running challenging machine learning competitions that attracted best-in-class talent, we’re now building out end-to-end solutions on an industry by industry basis. We’re currently focused on energy, the world’s largest industry.\nAs a software developer at Kaggle, you’ll work with our team of developers and data scientists to build solutions that consumes vast amounts of raw data to produce insights that help companies make strategic decisions.<p>Client Relationship Manager:<p>We’re looking for an experienced, multi-talented Client Relationship Manager with aptitude and interest in supporting the inbound sales pipeline for new projects. This role will: (1) onboard potential new clients through a process of email and phone conversations to understand those customers’ needs; and (2) support existing and new projects by providing excellent project coordination and customer service. The CRM role is a cornerstone member of our team who is responsible for connecting the client to Kaggle’s crowd community and enabling the best possible outcomes for each project, start to end.<p>Product Designer&#x2F;Developer:<p>As the product designer at Kaggle, you will work closely with the data scientists and developers on the Competitions team as well as supporting the creative needs of the energy solutions business. The competition platform is Kaggle’s primary presence on the Internet with an active user base that visits our web page to enter new competitions, interacts with each other on the forums, and learns data science through hands-on experience. As our first full-time product designer, you will have the rare and exciting opportunity to be the lead architect of the Kaggle web experience, as well as guiding our visual identity in marketing and other customer facing materials.<p>For questions, please contact us at recruiting@kaggle.com or visit our career page at <a href=\"https://www.kaggle.com/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kaggle.com&#x2F;careers</a>","time":1409580473,"type":"comment"}