{"by":"whost49","id":8252839,"parent":8252715,"text":"Aclima - <a href=\"http://www.aclima.io\" rel=\"nofollow\">http:&#x2F;&#x2F;www.aclima.io</a> - San Francisco, CA<p>==========<p>Aclima is an early-stage company based in San Francisco that designs and deploys distributed, large-scale sensor networks to empower people with actionable environmental quality data. Our end-to-end solutions collect, process and analyze real-time streaming data from thousands of sensors, enabling a level of environmental awareness that has never been possible before. We believe our technologies can redefine the way we imagine and manage our buildings, communities, and cities, helping us improve our collective well-being.\nWe are looking for passionate engineers to help build, scale, and improve our platform.<p>We have no required list of skills or years of experience. Instead, we’re looking for engineers who are smart and get things done. Our engineering culture values rapid iteration, continuous improvement, and as much automation as is sensible. We work in a relaxed, purpose-driven atmosphere with flexible hours and competitive perks.<p>Positions open:<p>* Full-time Backend Engineer<p>Our stack includes: Python, Git, MariaDB, Cassandra, Nginx, NSQ, Redis, Ansible<p>- solid understanding of functional programming languages, distributed systems<p>* Full-time Frontend Developer<p>- solid understanding of core JavaScript, HTML5 and CSS3<p>- experience building well-structured web applications<p>- a passion for user-driven interaction design and delightful user experiences<p>- excitement about data visualization, mobile design, and responsive design<p>* Full-time UI&#x2F;UX Designer<p>- At least 2-3 years of experience who has heavy UX chops and expertise in CSS-based design, peppered with JavaScript-based interaction design&#x2F;development.<p>- Someone who is excited and passionate about data visualization, mobile design, and responsive design and has strong opinions about all three.<p>* Full-time DevOps Engineer<p>- some experience writing shell and Python scripts<p>- Debian&#x2F;Ubuntu, Jenkins, Locust, JMeter, Google Cloud&#x2F;AWS, Ansible experience a plus<p>==========<p>If you’re up for the challenge, contact us: jobs@aclima.io<p>Apply directly: <a href=\"http://boards.greenhouse.io/aclima\" rel=\"nofollow\">http:&#x2F;&#x2F;boards.greenhouse.io&#x2F;aclima</a>","time":1409580179,"type":"comment"}