{"by":"brandonthejames","id":8253936,"parent":8252715,"text":"99Gamers.com  (San Francisco, CA) – <a href=\"https://www.99gamers.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.99gamers.com</a><p>Two positions: CTO&#x2F;Possible Co-founder  || Full Stack Engineer (PHP) - Full-time or contract<p>----------------------------------------------------<p>ABOUT 99GAMERS<p>Born off a Reddit post, 99Gamers is a fast growing community-driven marketplace for gamers to buy and sell video games. So far we’ve had over $800,000 worth of games sold, 80,000 members and 36,000 games listed. Recently we’ve been experiencing higher growth (10,000+ members in last week) and have a clear path to continue and increase this growth.<p>----------------------------------------------------<p>CTO&#x2F;POSSIBLE CO-FOUNDER POSITION<p>Join a small, quickly growing startup working to push the marketplace space forward. You’ll help us get there. We’re looking for an engineer&#x2F;hacker who can head up the technical end and learn&#x2F;grow with the company on the go. As the technical lead, you will have ownership and responsibility for product development.<p>You should place a very high personal value on culture. We’re looking for a mellow coder with an insane work ethic. Open to students working towards their degree in CS (or related) if you have real-world experience with products shipped. The right candidate would become 99Gamers CTO and possibly a co-founder and will receive startup equity.<p>Experience with PHP is a big plus but not required if you have strong experience with mobile app development (iOS, Android).<p>----------------------------------------------------<p>FULL STACK ENGINEER (PHP) POSITION<p>Should have:<p>* Solid experience with PHP and MySQL<p>* Experience working on personal&#x2F;or open source projects<p>* Experience with HTML&#x2F;CSS&#x2F;Javascript a plus<p>* Mobile app development a plus (iOS, Android)<p>----------------------------------------------------<p>If interested, send a resume along with a brief note about why you think you’d be a good fit at 99Gamers to brandon@99gamers.com. If you have any questions, feel free to ask.","time":1409593243,"type":"comment"}