{"by":"sshrinivasan","id":8253615,"parent":8252715,"text":"Vancouver, BC, Canada (Full stack software developer)<p>Zymeworks Inc. is a Canadian computational biotechnology company that is developing predictive computational technology for optimizing protein therapeutics. We combine high performance computing, visualization and data exploration tools with leading edge molecular simulation algorithms to build a \ncomplete suite of molecular modeling applications geared towards engineering better drugs for cancer and autoimmune diseases. We are looking for a talented full-stack software developer to join our team of developers and scientists to design, build and expand ZymeVault, our in-house laboratory information \nmanagement suite.<p>Responsibilities<p><pre><code>  • Developing our data acquisition, processing, analysis, and visualization capabilities.  \n  • Creating and evolving front-end web applications and their supporting back-end APIs and operational infrastructure.\n  • Actively coordinating with our R&amp;D teams to find areas of inefficiencies in data processes, and designing and implementing solutions in conjunction with the software development team.\n  • Integrating and maintaining the developed software as part of the entire computational platform.\n  • Experimenting with new technologies and practices that can be integrated within our organization.\n</code></pre>\nRequired Qualifications<p><pre><code>  • A Bachelor’s degree in Computing Science, Engineering, or equivalent. \n  • Proven experience developing and maintaining web applications, their supporting back-end services and associated infrastructure.\n  • Ability to deliver rapid, iterative prototypes from initial ideas, and a drive for software development  excellence through peer code reviews, automated testing, and systematic deployments.\n  • Fluency in English, spoken and written.\n</code></pre>\nOur Platform<p>Our software platform is built upon the following technologies:<p><pre><code>  • JavaScript, including AngularJS, D3 etc.\n  • Python\n  • PostgreSQL\n  • Go (for server development)\n</code></pre>\nCandidates should have an interest in working with some of them, and are encouraged to bring in their own insights and experiences to improve our software platform.<p>To discover more about Zymeworks Inc, please visit our website at www.zymeworks.com. If you are interested in applying for this position, please email your curriculum vitae and cover letter to careers.1287@zymeworks.com.","time":1409588710,"type":"comment"}