{"by":"browarnik","id":8253643,"kids":[8254144],"parent":8252715,"text":"Manhattan, New York<p>-------------<p>ABOUT TheTake<p>TheTake allows you to identify products and locations seen in movies. The mobile app has been described as a “Shazam for movies,” and syncs with a movie to display the products you see on screen. The website is a destination for browsing, shopping and discussing products and locations from movies. After winning crowd favorite at LAUNCH Festival 2014, TheTake is looking to expand its team and hire the best of the best. TheTake is located in NYC’s hip SoHo neighborhood.<p>------------------------<p>FULL STACK WEB DEVELOPER<p>We are looking for a full stack web engineer to work on the team developing TheTake’s website and internal web applications. As an engineer at TheTake, you will be joining a quickly growing team, working on an exciting new product that is changing the way people watch movies.<p>Requirements<p>* Strong Java web application experience<p>* Experience with front end development (HTML, CSS, JavaScript)<p>* Disciplined approach to testing and quality assurance<p>* BS or MS in Computer Science or equivalent work experience<p>Desired<p>* Experience building apps with the Java Play framework<p>* Experience defining web based APIs<p>* Demonstrated sense of design and UX<p>* Strong communication skills and willingness to take initiative<p>* Passion for watching movies<p>-----------------<p>ANDROID DEVELOPER<p>We are looking for an engineer to build, launch and maintain our Android application. As an engineer at TheTake, you will be joining a quickly growing team, working on an exciting new product that is changing the way people watch movies.<p>Requirements<p>* Experience building, shipping and maintaining native Java Android Applications<p>* Deep understanding of the Android SDK<p>* BS or MS in Computer Science or equivalent work experience<p>Desired<p>* Strong portfolio of apps on Google Play<p>* Experience building ecommerce, video or fashion applications<p>* Experience with web technologies (JavaScript, CSS, HTML5, etc.)<p>* Demonstrated sense of design and UX<p>* Strong communication skills and willingness to take initiative<p>* Passion for watching movies","time":1409589157,"type":"comment"}