{"by":"involans","id":8253307,"parent":8252715,"text":"InterMine - Cambridge, UK or remote.<p>---------------------------------------<p><a href=\"http://www.gen.cam.ac.uk/jobs/software-developer-intermine\" rel=\"nofollow\">http:&#x2F;&#x2F;www.gen.cam.ac.uk&#x2F;jobs&#x2F;software-developer-intermine</a><p>InterMine (<a href=\"http://www.intermine.org\" rel=\"nofollow\">http:&#x2F;&#x2F;www.intermine.org</a>) is the leading open-source data-warehouse for the life-sciences.<p>Do you want to create open-source software that makes a difference, using cutting-edge tools? InterMine is looking for a software developer to help create powerful, attractive, user friendly data mining tools to search and display biological data.<p>InterMine is a major life-sciences data-warehouse project, dealing with interesting, data-centred problems. We bring the mass of data generated by genomics researchers together and make it accessible to researchers. We aren&#x27;t all scientists ourselves, but we work closely with them. We need you to help us develop a great user experience for interacting with complex and dynamic data models.<p>You:<p>* Have a track record of getting things done with the web.<p>* Are enthusiastic about open-source development<p>* Care about visual design and user experience<p>* Care equally about code quality and test coverage.<p>* Ideally can show us something you are proud of (on\n    GitHub if possible)<p>We:<p>* Use the best tools for the job - we have code written\n  in Java, Clojure, Python, CoffeeScript, and we are always able\n  to decide on our tech stack.<p>* Develop in the open on GitHub - all our code is open source:\n  <a href=\"http://www.github.com/intermine\" rel=\"nofollow\">http:&#x2F;&#x2F;www.github.com&#x2F;intermine</a><p>* Use modern dev-ops tools including Travis and Dokku.<p>* Are writing a new, extremely flexible data-analysis platform\n  in Clojure, Coffeescript, Angular and React.<p>* Are a small, friendly team, working closely with a network of\n  collaborators and research partners.<p>Cambridge is a great place to live, and the University of Cambridge\nis a great place to work. You will get a competitive salary,\nvery generous leave and pension, as well as other benefits such\nas flexible working and tax-relief on bikes and child-care. If you\ncan&#x27;t relocate, we can discuss remote working.<p>For more information see: \n  <a href=\"http://www.gen.cam.ac.uk/jobs/software-developer-intermine\" rel=\"nofollow\">http:&#x2F;&#x2F;www.gen.cam.ac.uk&#x2F;jobs&#x2F;software-developer-intermine</a>","time":1409585428,"type":"comment"}