{"by":"CaveTech","id":8253260,"parent":8252715,"text":"# Jumbleberry<p>Toronto, Canada<p>Junior &amp; Intermediate PHP&#x2F;Javascript Developers (Full Time)<p>or 8-12 month Internships<p># About<p>At Jumbleberry, we have set out to a build a remarkable workplace. We recognize that to build a great workplace, you must first start with remarkable people. We pride ourselves in attracting and retaining highly talented people who demonstrate performance excellence and share the values that we work and play by every day. After all, we are a performance marketing company.<p>To support this philosophy, we have an array of benefits and creative perks to ensure our team performs at the highest level while staying engaged, energized, and fulfilled. In addition to full health and dental benefits, we offer a stocked kitchen full of great snacks, frequent team social events, dual monitor set-up on the platform of your choice, newly renovated and designed office environment in the heart of Liberty Village, subsidized continuing education and support for personal development, and numerous other exciting perks. We believe in the continuous development of our team, and in turn each member contributes to the building of a remarkable workplace.<p># Position<p>The Application Developer will be an integral member of the Jumbleberry team, driving towards the creation of technology solutions that powers and accelerates all aspects of our business. We are seeking highly motivated individuals with a passion for  learning and a keen attention for detail. You will have the opportunity on a regular basis to work with any number of the following: PHP, MySQL, Javascript, NodeJS, Selenium, and various other libraries and frameworks. Your work will help drive the business forward by building innovating solutions that provide automation and insight for both Jumbleberry and its customers.<p># Contact<p>ian@jumbleberry.com<p><a href=\"http://jumbleberry.com\" rel=\"nofollow\">http:&#x2F;&#x2F;jumbleberry.com</a>","time":1409584835,"type":"comment"}