{"by":"jetsnoc","id":8253562,"kids":[8253602],"parent":8252715,"text":"KickBack Rewards Systems, Remote (Idaho)<p><pre><code>  KickBack Rewards Systems\n  http:&#x2F;&#x2F;www.kickbacksystems.com\n  http:&#x2F;&#x2F;careers.kickbacksystems.com\n</code></pre>\nKickBack Rewards Systems is a privately held company founded in 1999 that specializes in customer specific marketing and payments for over 1000 US clients. Our clients include a half-dozen Fortune 50 companies, one of them is an anchor partner in our national coalition loyalty program. As the CTO and Director of Software Development I need some help! You will be joining a medium sized team of 13 developers who all commit to their projects as a labor of love and their lives work. If you are interested in any of these positions my contact information is located under my profile.<p>-<p>Back-end engineer<p>I am looking for that elusive 10x engineer polyglot that can create scalable back-ends. The right person is on-board with microservices and has been implementing them since before they were a fad. Message queues, concurrency and fault tolerance should be second-nature to you. Our current stack is Python, Celery, and Docker.<p>-<p>Front-end engineer<p>Our front-end tools are all built in AngularJS with a half dozen other JavaScript libraries like D3. We have some interesting UI&#x2F;UX challenges in graphing metrics and representing data that our current front-end team describe as nothing less than &quot;the most exciting and challenging work they&#x27;ve had for awhile.&quot; You&#x27;re supported by an incredible UX team to perform the heavy lifting as far as design and deciding which A&#x2F;B testing should occur.<p>-<p>Mobile Developer<p>KickBack uses Xamarin (C#) to build a native and compiled mobile application for iOS and Android.  We have an amazing contractor building our app who is acting as the lead, architect and senior engineer. You&#x27;ll be working with the best. We&#x27;re looking to add a little redundancy and augment the team with additional resources if we can.<p>-<p>Security engineer<p>Last but not least, I am looking for an Information Systems Security expert. KRS works in a live transaction processing environment and identifying fraud, patterns and preventing information breaches and transaction fraud is second nature to the right candidate. I&#x27;m looking for that type-a engineer who cannot sleep if he or she believes an attack vector exist. He or she has an extreme sense of responsibility and can execute on delivering best-practice prevention methods. \nThis role is both advisory (&quot;Team, implement  this best practice&quot;) and execution (&quot;Team, I implemented this best practice..&quot;) We&#x27;re lean and mean so you should have no problem at all hacking on Ruby one day to deploy a new &#x27;hids&#x27; through Chef or drafting a Cisco IOS access-list the next.<p>-<p>To apply:<p>Email me, my contact information is located under my profile, or, visit <a href=\"http://careers.kickbacksystems.com\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.kickbacksystems.com</a>","time":1409588150,"type":"comment"}