{"by":"rickychang","id":8253381,"parent":8252715,"text":"Switch - <a href=\"http://switchapp.com\" rel=\"nofollow\">http:&#x2F;&#x2F;switchapp.com</a> - New York, NY<p>Looking front-end and full-stack engineers.<p>We’re building a data-driven platform for job discovery. Our goal is to fundamentally change the way people find their next job. We&#x27;re focused on making it easy for people with jobs to discretely explore new opportunities and connect directly with employers looking to hire.<p>Our engineering team is small and passionate about combining data and design to build the best product. We&#x27;re looking to grow our engineering team by adding a front-end engineer and a full-stack engineer. Both folks will have a opportunity to have a huge impact on a very small team and will be working closely with our founders and CTO (that&#x27;s me). Our team loves wearing many hats, and we’re looking for folks that feel the same way. In addition to shaping and building iOS and web apps, you will also have the opportunity to scale our Python API backend, perform data-analysis on our behavioral data, improve our matching algorithms, and generate product ideas.<p>Front-end Engineer:<p>We’re looking for someone to help us expand Switch beyond iOS, building web apps that connect with our platform. The ideal candidate is a Javascript &#x2F; CSS whiz with a portfolio of great web apps they’ve built. Web design experience is a huge plus.<p>Skills:<p><pre><code>  * Excellent knowledge of HTML, Javascript, CSS (LESS &#x2F; Sass), and Git\n  * Working knowledge of Python and SQL\n  * Experience with MVC Javascript frameworks like AngularJS\n  * Experience building apps powered by REST APIs\n  * Strong desire to learn and grow as a developer\n  * Great sense of design and product\n  * iOS &#x2F; Android experience is huge plus\n</code></pre>\nFull-stack Engineer:<p>We&#x27;re looking for a full-stack developer who loves implementing ideas end-to-end.  Our current team will start with a product idea, come up with a data model, implement a new API endpoint, write unit tests, optimize query performance, and add new features to our iOS app that call that endpoint. We&#x27;re constantly growing as developers each day and are looking for folks that are eager to leverage their previous experience, but also want to grow and learn new technologies &#x2F; languages. Our ideal candidate has built web apps &#x2F; mobile apps implementing both front-end and back-end features. Our current API is built using Python (Django). We also use Scala for some data science applications.<p>Skills:<p><pre><code>  * Strong backend skills implementing APIs for web apps\n  * Experience building front-end features (web &#x2F; mobile)\n  * Familiarity with some of technologies we use: Python (Django), Obj-C, Scala\n  * Strong desire to learn and grow as a developer\n  * iOS &#x2F; Android experience is huge plus\n</code></pre>\nIf you&#x27;re interested, please email jobs@switchapp.com","time":1409586326,"type":"comment"}