{"by":"twog","id":8253088,"parent":8252715,"text":"FanJam - <a href=\"http://fanjam.com\" rel=\"nofollow\">http:&#x2F;&#x2F;fanjam.com</a> - Frontend Engineer Ember.js<p>Remote OR in Chattanooga, TN<p>Do you love sports &amp; javascript? At FanJam (fanjam.com), we&#x27;re building a new kind of fantasy basketball game on web and mobile. We&#x27;re a small team with backgrounds in startups, consulting, and venture capital. Our team shares a love for either sports or programming, but we all share a common love for building a winning culture.<p>In this role, you will be working with mostly client-side javascript. We&#x27;re still in the early stages of development, so we’re looking for someone comfortable in architecting front end code using a modular approach &amp; capable of making good design decisions. An ideal candidate is keeping up to date with the rapidly changing javascript landscape and has experience working with realtime applications. You’re aware of the challenges of DOM implementations between browsers and can write clean code to deal with them.<p>We invest in our people, and team build through whiskey, basketball games, and hack weeks. We keep the fridge stocked, stay as transparent as possible, and will buy whatever resources you need to keep learning (books, screencasts, etc) We&#x27;re still a small team, so this is a great opportunity to have a big impact on the product and our culture. We&#x27;re looking for people with a passion for their work with high standards. Ideal candidates have a demonstrated experience hacking stuff; code samples are best (GitHub, a personal website&#x2F;blog, previous projects are all great).<p>You can work remotely or at our offices in Chattanooga, TN<p>Skills we&#x27;re looking for<p>* Proven experience working with Javascript on client-side (ember.js&#x2F;or angular&#x2F;react)<p>* Experience working with web sockets &amp; realtime technology<p>* Comfort on the front end html5, compass, and css&#x2F;sass<p>* Being able to get things done and to ship code.<p>* Experience with large code bases and structuring code in a modular way.<p>* Affinity with the web, browsers and new web technologies.<p>* Familiarity with basic development tools: you know your way around git, bash, grep and sed. You&#x27;re not afraid to write a shell script to automate some stuff.<p>* Experience with data visualizations is a big plus<p>* Have a good sense of humor and leave your ego at the door<p>* A desire to get better every day<p>Interested? Contact me toni (at) fanjam.com","time":1409582903,"type":"comment"}