{"by":"samchop","id":8254251,"kids":[8254346],"parent":8252715,"text":"MediaFire is hiring!<p>Developer&#x2F;Designer Positions | The Woodlands, TX\n(We&#x27;re located just north of Houston.)<p><a href=\"http://www.mediafire.com/about/jobs.php\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mediafire.com&#x2F;about&#x2F;jobs.php</a><p>If you apply, say you heard about the position from Samantha. :) I&#x27;m a ux designer trying to rally up some new members for our crew, and we&#x27;re trying see which outlets are most effective. For more info, you&#x27;re welcome to email me: samantha.gobert(at)mediafire.com<p>We&#x27;re looking for the following:<p><pre><code>  * Android App Engineer\n\n  * iOS App Engineer\n\n  * Backend PHP Developer\n\n  * Multi-platform Debug Engineer\n</code></pre>\nMediaFire provides cloud storage solutions across web, mobile, and desktop platforms. Our small Texas team of 30-something is responsible for products that reach a userbase of almost 40 million. Come join us as we work on new products that revolutionize the way people use the cloud!<p>Our office is very laid back, with free food, weekly Friday lunch outings around town, and pingpong tournaments. Most employees work in an open office environment where we strive to keep communication transparent and free-flowing, with plenty of &quot;break-out&quot; rooms available if you wish to work in private for a while.<p>A few of our perks:<p><pre><code>  * Flexible schedule (you can work 4 days a week if you want!)\n\n  * State of the art dual-monitor setup with OS platform of your choosing\n\n  * Competitive pay\n\n  * 401K, dental, medical, personal insurance, etc\n\n  * Did I mention free food? \n</code></pre>\n<a href=\"http://www.mediafire.com/about/jobs.php\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mediafire.com&#x2F;about&#x2F;jobs.php</a><p>We&#x27;re currently on the lookout for a UX Designer as well, though the job posting isn&#x27;t online yet. Feel free to email me at samantha.gobert(at)mediafire.com for more info about the designer position or any of the others listed above.","time":1409598371,"type":"comment"}