{"by":"sb_ba","id":8254984,"parent":8252715,"text":"Blue Apron (New York, NY) - Fulltime<p>Blue Apron (<a href=\"http://www.blueapron.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.blueapron.com</a>) is an NYC-based startup delivering original recipes and premium, seasonal ingredients needed to prepare them, in exactly the right proportions. We&#x27;ve raised $58M from First Round Capital, Bessemer Venture Partners, and Stripes Group [1]. Last year, Forbes named us one of the hottest startups of 2013 and we&#x27;ve only continued our rapid growth in 2014 [2].<p>After just 24 months, we now deliver over 750,000 meals each month nationwide.<p>Our engineering team is designing and building software to manage the forecasting, purchasing, preparation, and shipment of 60 to 80 different fresh ingredients each week at a massive scale. The nature of our business carries with it unique supply chain and logistical challenges that require purpose-built solutions and data analysis.<p>Our (current) stack: Ruby, Rails, RSpec, Ember, PostgreSQL, Haml, Bootstrap, Sass, JQuery, Git, Heroku<p>Looking to hire:<p>- UX&#x2F;Frontend Developer: HTML, CSS, JavaScript (Ember would be awesome but not required) - <a href=\"http://www.blueapron.com/pages/jobs?gh_jid=14848\" rel=\"nofollow\">http:&#x2F;&#x2F;www.blueapron.com&#x2F;pages&#x2F;jobs?gh_jid=14848</a>\n- Software Engineer: Ruby, Rails, Ember - <a href=\"http://www.blueapron.com/pages/jobs?gh_jid=11091\" rel=\"nofollow\">http:&#x2F;&#x2F;www.blueapron.com&#x2F;pages&#x2F;jobs?gh_jid=11091</a>\n- DevOps Engineer: We&#x27;re building from scratch a high availability, distributed AWS architecture to serve our customers, multiple fulfillment centers, and e-commerce operation. (Worked with high-traffic production web applications, AWS, Chef, Ruby or Python exp. is a plus) - <a href=\"http://www.blueapron.com/pages/jobs?gh_jid=25367\" rel=\"nofollow\">http:&#x2F;&#x2F;www.blueapron.com&#x2F;pages&#x2F;jobs?gh_jid=25367</a><p>About you:<p>- You&#x27;ve taken features or products from concept to completion and have experience working with production web applications.\n- You communicate your ideas clearly, and are capable of designing and implementing complex, scalable solutions.\n- You are always learning and are excited at the prospect of mastering new technologies and techniques.\n- You help teammates improve by reviewing their work and appreciate feedback when they reciprocate.<p>These roles comes with health&#x2F;dental insurance, a flexible vacation policy, and competitive salary and equity. To apply, visit our site (blueapron.com&#x2F;jobs) and drop an application; it only takes about 60 seconds.<p>[1] <a href=\"http://blogs.wsj.com/venturecapital/2014/04/30/blue-apron-raises-50m-to-deliver-do-it-yourself-meal-kits-recipes/\" rel=\"nofollow\">http:&#x2F;&#x2F;blogs.wsj.com&#x2F;venturecapital&#x2F;2014&#x2F;04&#x2F;30&#x2F;blue-apron-ra...</a>\n[2] <a href=\"http://www.forbes.com/pictures/emjl45himd/blue-apron-4/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.forbes.com&#x2F;pictures&#x2F;emjl45himd&#x2F;blue-apron-4&#x2F;</a>","time":1409611276,"type":"comment"}