{"by":"matm","id":8254603,"parent":8252715,"text":"Heap (YC W13) - Software Engineer - San Francisco or Remote<p><a href=\"https://heapanalytics.com/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;heapanalytics.com&#x2F;jobs</a><p>=== What&#x27;s Heap? ===<p>Heap is taking a new approach to web and iOS analytics: just capture everything. Whereas other analytics tools require you to define events upfront, Heap lets you run instant, retroactive analytics without writing code.<p>=== The Role ===<p>Your creativity and intelligence are much more important to us than your experience with our stack. We&#x27;re eager to meet all types of engineers, regardless of where you live or what tools you use day-to-day.<p>We’d like to get to know you if:<p>* You enjoy teaching yourself whatever is necessary to build something.<p>* You plow through obstacles.<p>* You’ve written 10,000 lines of code that look really embarrassing in retrospect.<p>* You’ve written 10,000 lines of good code since then.<p>* You communicate ideas with clarity and precision.<p>* You make decisions with a preference for empiricism and measurement.<p>* You like fruit, sunshine, and bad jokes.<p>Our stack is Node + Redis + Postgres + Backbone + D3. Some things we&#x27;re working on:<p>* Data capture. We’re integrating with more clients and frameworks, including Android, AngularJS, and Backbone.js, all with virtually no performance overhead or integration cost.<p>* Real-time infrastructure. We support an expressive set of queries that allow our users to slice and dice the data in arbitrary ways. The results need to come back with sub-second latencies and reflect up-to-the-minute data.<p>* Data visualization. Simple pre-generated graphs just don&#x27;t cut it. There&#x27;s an enormous number of ways to organize the data. Existing tools only scratch the surface.<p>Heap was in Y Combinator’s W13 batch. Soon after, we raised a $2M seed round from Ron Conway, Ram Shriram, Sam Altman, Garry Tan, Alexis Ohanian, Harj Taggar, and others.<p>We work in SF but are absolutely open to remote engineers. Email us at jobs@heapanalytics.com with reasons as to why you&#x27;d make a great fit.","time":1409604037,"type":"comment"}