{"by":"jsbloom1","id":8255249,"parent":8252715,"text":"Wise.io (Berkeley, CA) is looking for an amazing Full-Stack Developer to join our world-class team of engineers and data scientists in building a disruptive application framework for the enterprise.<p>Wise&#x27;s innovative machine-learning driven application framework combines the latest virtualization and distributed systems solutions with leading web and visualization technologies in order to provide production-ready machine-learning insights to the enterprise.<p>You will play a central role in the development team which engineers and supports the application framework and solutions built on top of it. You will work with leading machine-learning computer scientists, statisticians, and data scientists to develop distributed processing and visualization platform technologies and will be responsible for projects spanning the full stack. As an early employee (we&#x27;re less than 15 people now), you will participate in lean and fast paced development cycles driven by challenging problems and new customers.<p>This is a full-time position based in Berkeley, California.<p>=== Requirements ===<p>- An advanced degree in computer science, applied mathematics, or another data-intensive discipline.\n- Proven expertise in Python and advanced javascript programming.\n- 3+ years experience with linux and networking.\n- Have demonstrated expert level skills in developing multiple full-stack solutions, preferably for analytics problems.\n- Have developed for commercial, business driven, set deadline projects, ideally in a startup environment.\n- Experience with Git, version control, testing practices, working on multi-developer projects.\n- Experience with SQL and NoSQL database and storage engines.\n- Ability to work in a collaborative environment<p>=== Bonus points ===<p>- A background in cloud computing, virtualization, networking &#x2F; infrastructure, deployment.\n- Experience with developing and interfacing with data and visualization API’s.\n- Experience with Hadoop &#x2F; HDFS, Apache Spark.\n- Experience with D3 and data visualizations\n- Experience with JSON &#x2F; XML &#x2F; HDF5 data formats.\n- Experience with C&#x2F;C++, Go or Scala\n- Experience with machine learning and data science tasks.<p>=== About Wise.io, Inc. ===<p>Wise.io&#x27;s mission is to empower better data-driven decision making for the enterprise. We sell software applications spanning the entire customer lifecycle that apply the power of machine learning to help companies optimize how they acquire, monetize, and retain customers. This VC-backed company was founded by leading experts in astrophysics, statistics, computer science, and machine learning as well as business executives who built innovative and disruptive businesses that brought advanced analytics to the enterprise software market. Our team includes published authors, serial entrepreneurs, Fulbright and Hertz Scholars, and prolific inventors. Wise.io’s solutions are running in production at companies that range from Silicon Valley startups to the largest Fortune 500 corporations.","time":1409618997,"type":"comment"}