{"by":"jik","id":8255324,"parent":8252715,"text":"Quantopian (<a href=\"https://www.quantopian.com/about\" rel=\"nofollow\">https:&#x2F;&#x2F;www.quantopian.com&#x2F;about</a>), Boston, MA<p>Quantopian is hiring software and operations engineers to help us disrupt the world of finance. We&#x27;ve built the world&#x27;s first web-based algorithmic trading platform, and we&#x27;re growing our team to support our rapidly expanding user base and to build everything on our ambitious product roadmap.<p>We&#x27;re well-financed by some of the savviest investors in the business (Spark Capital, Khosla Ventures, GETCO, and various individuals).<p>We work on interesting problems, such as:<p>* Running arbitrary user code on our own servers, with all the associated security implications<p>* Designing and building intuitive and powerful research and development tools and APIs for our users\nDesigning data stores to model real-world financial data and optimizing them for high throughput when running trading simulations<p>* Communicating with broker APIs to trade real money on our users&#x27; behalf<p>* Metering and autoscaling our cloud infrastructure to respond to varying load<p>* Designing and building an amazing user experience, both on desktop and mobile<p>So far, we&#x27;ve built Quantopian with Python and Ruby on Rails (and a little Node.js) on AWS and Heroku. We depend heavily on Redis, and our Docker usage is rapidly growing. However, we are very pragmatic and our highest priority is shipping user-delighting features built with the most sensible technologies.  Be sure to check out Zipline (<a href=\"https://github.com/quantopian/zipline\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;quantopian&#x2F;zipline</a>), our open-source backtester.  We have several other projects that we plan on open-sourcing as well.<p>We&#x27;ve assembled a top-notch product and engineering team here in Boston, and we&#x27;re growing fast. We&#x27;re open to all levels of experience, from still-in-college to seasoned veteran. A financial background is not necessary at all (but is always nice to have).<p>We&#x27;re still small enough that you will have a material impact on our company&#x27;s trajectory.  Our small size and ambitious goals dictate our approach to talent acquisition and retention: we believe in hiring the best engineers and giving them hard problems to solve and the autonomy to solve them.<p>Ideally, you:<p>* have a solid background in computer science fundamentals<p>* have good communication skills<p>* thrive on designing, building, and shipping mind-blowing features that delight our users<p>We provide:<p>* All the standard stuff (fully paid health and dental for you and your family, 5% 401(k) matching, gym and phone reimbursement, pretax transit, weekly catered lunch).<p>* Your choice of computer equipment<p>* A beautiful new office (in October) in downtown Boston<p>* Fun and intellectually stimulating work environment.  We ship early and often. We have lives outside of work. We like each other.","time":1409620462,"type":"comment"}