{"by":"rangayar","id":8255648,"parent":8252715,"text":"BeanGenius - Los Angeles, CA <a href=\"http://beangenius.com\" rel=\"nofollow\">http:&#x2F;&#x2F;beangenius.com</a><p>1. Marketing and Customer Manager\n2. Operations and Business Development Manager<p>Who Are We?<p>We&#x27;re a one-of-a-kind, specialty coffee subscription service with a unique approach to helping customers discover great coffee! We&#x27;ve been testing and refining our service in private beta with a handful of devoted customers who love what we do, and now we&#x27;e bringing ourselves to the masses with a re-launch. We&#x27;re a small team, so we work hard, but we make up for it and have fun balancing the scales. If you&#x27;re ready to be part of this amazing journey with us - then read on!<p>We are currently looking to fill two roles - one in Marketing and one in Operations&#x2F;Biz Dev<p>#####################Marketing Role Begin#####################<p>Who Are You?<p>You have a way with words and communicating with our customers - whether it&#x27;s telling our story or making our customers feel special, you know how to do it. \nYou are empathetic and can put yourself in people&#x27;s shoes. You can think like a customer, figure out where they hang out online and off, and know how to talk to them. \nYou are a natural people person. People love talking to you, and you love talking to people. . .even when they get a little grouchy. \nYou look at companies you love and think, &quot;they should really market themselves like this, it would be really cool&quot;. \nYou understand and use social media -- Facebook, Twitter, Pinterest, Instagram, Google+. \nYou understand technology and are comfortable with Skype, Office and learning new apps. \nYou have excellent writing and oral communication skills; remember, grammar counts! \nWhile you get to be really creative in this job, you need to be comfortable with numbers since we love data-driven decisions. \nYou&#x27;re creative and have fun coming up with unique solutions to boring problems. \nYou have some college experience. \nYou love and need good coffee!<p>What Will You Do? \nAs an early employee of a startup, you&#x27;ll learn we all wear multiple hats, but your main focus will be two-fold.<p>Marketing \nWork side by side with a co-founder to develop and execute marketing strategies on social, print, online and offline outlets. \nCreate PR pitches and reach out to media outlets.<p>Customer Support \nAnswer and engage with customers via email, social media and ZenDesk as needed.<p>#####################Marketing Role End#######################<p>#######################Operations Role Begin##################<p>Who Are You?<p>• You have a knack for identifying and CLOSING deals (what you have done in the past?) \n• You set a blistering pace at work and DO what you say you will do before anyone ever asks for it \n• You hate inefficiencies and more importantly have an unending urge to FIX them (what have you fixed?) \n• You love developing SOPs, creating work-flow requirements, and developing best practices that stand the test of time \n• You have to love coffee and ideally worked in the coffee industry in the past (Barista? Home roaster? Coffee blogger? Any coffee experience and we are ALL EARS)<p>What Will You Be Doing? \nYou will be our &quot;go-to&quot; person, working to establish and maintain fantastic relationships with our exclusive list of roasters -\n• Identify and target top roasters across the country \n• Develop customized &quot;target&quot; and outreach plans for each roaster   \n• Outreach to include phone, email, in-person and t-con meetings \n• Negotiate and execute wholesaler&#x2F;re-seller contracts with price and other discounts \n• Track the rise of new and upcoming roasters   <p>You will handle all in-bound and out-bound enquiries that our roasters have including -\n• Liaise and coordinate with each roaster for ensuring timely delivery of shipments to our customers \n• Manage and build processes for seamless order fulfillment \n• Ensure monthly voices are paid and provide any ongoing roaster support as needed<p>You will handle all our coffee related inventory and databases -\n• Keep track of current and future roaster offerings to update BG database on a weekly basis \n• Collect and maintain BG brand assets for coffees (pictures, bags, text, etc) \n• Work with our marketing and tech teams to ensure our latest offerings are appropriately highlighted and promoted<p>#######################Operations Role End####################<p>Why Us?<p>• Be part of a startup at the early stages and have a significant impact on the growth and direction of a company. \n• Amazing learning experience. It&#x27;s not every day you get to be part of the birth of a company. \n• We&#x27;ll be opening a dog-friendly office near W. Hollywood -- bring your dog to work! \n• All the amazing coffee you can drink at work! \n• Possibility of flexible hours -- we&#x27;re more concerned with you getting your work done than when you do it. \n• Possibility of some remote work hours. \n• Growth potential - we want you to grow with us. If you&#x27;re brilliant, as we progress so will your responsibilities and position.<p>How To Apply<p>Please email the following to joinus@beangenius.com<p>* Cover letter \n* Resume \n* Any social networks, website and blogs (LinkedIn, Twitter, Instagram, Pinterest, etc) \n* When you can start \n* Any other relevant information<p>How you heard of the job \nDepending on the role this could either be a full-time or a part-time position. We&#x27;re excited to hear from you!","time":1409627188,"type":"comment"}