{"by":"itsdrewmiller","id":8255229,"parent":8252715,"text":"NGP VAN - Boston, MA and Washington, DC - Engineering Team Lead, Software Engineer, DevOps Engineer<p>NGP VAN (<a href=\"https://coderwall.com/team/ngp-van\" rel=\"nofollow\">https:&#x2F;&#x2F;coderwall.com&#x2F;team&#x2F;ngp-van</a>) is the world’s leading political technology firm, providing campaign and organizing technology to Democrats, progressives, and non-partisan organizations. We offer an integrated platform that combines the best fundraising, compliance, organizing, and new media products available.<p>We are a rapidly growing company that built the voter contact and volunteer management tools used by Obama for America. Nearly every State Democratic Party in the country distributes our VoteBuilder tools to Democrats up and down the ticket, and we provide industry-leading organizing tools for labor unions, environmental groups, pro-choice advocates, civil rights activists, and international political parties across the world. Our fundraising and compliance software is used by the vast majority of Democratic candidates from the Presidential level on down, and our fast-growing new media platform has recently become the most-used platform by Democratic campaigns as well.<p>We have a few spots currently open:<p>We&#x27;re looking for an engineering team lead in our Boston office, for our mostly-.NET fundraising product.  This person will work with a 100% co-located scrum team, but most of the management for the product itself is out of our DC office.  It&#x27;s a position where you get a fair amount of autonomy due to that setup, but you also need to be able to keep lines of communication open across offices.  I know that&#x27;s not for everyone, but if you&#x27;ve ever experienced the sweet life that is regional manager of anything, you might realize the advantages to the situation:<p><a href=\"https://github.com/NGPVAN/job-descriptions/blob/master/software%20team%20lead%2C%20fundraising.md\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;NGPVAN&#x2F;job-descriptions&#x2F;blob&#x2F;master&#x2F;softw...</a><p>We also have a software engineer position open in our DC office, working mostly in node with some .NET here and there (and a touch of Ruby or PHP for some open source projects):<p><a href=\"https://github.com/NGPVAN/job-descriptions/blob/master/software%20engineer%2C%20digital.md\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;NGPVAN&#x2F;job-descriptions&#x2F;blob&#x2F;master&#x2F;softw...</a><p>We have a DevOps Engineer position open, which we could hire in either Boston or DC:<p><a href=\"https://github.com/NGPVAN/job-descriptions/blob/master/devops%20engineer.md\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;NGPVAN&#x2F;job-descriptions&#x2F;blob&#x2F;master&#x2F;devop...</a><p>The positions offers competitive compensation and a strong benefits package. NGP VAN prides itself on being a progressive workplace; we have a fun and inclusive company culture, including blowing off steam on a softball field, drinking in the office on Fridays while watching team demo videos, shooting at each other during Friday Fragfest, enjoying periodic company retreats to warm places with beaches (including Puerto Rico this November), and casual Friday every day.<p>Company Site: <a href=\"http://ngpvan.com\" rel=\"nofollow\">http:&#x2F;&#x2F;ngpvan.com</a><p>Hit me up at dmiller at ngpvan dot com for more info or to apply.","time":1409618474,"type":"comment"}