{"by":"sankarravi","id":8255222,"parent":8252715,"text":"ElationEMR - <a href=\"https://www.elationemr.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.elationemr.com&#x2F;</a> - San Francisco, CA or REMOTE<p>(Hiring Developers, QA Engineers, Designers, Sales Folks, and a Marketing Lead)\n<a href=\"https://www.elationemr.com/jobs/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.elationemr.com&#x2F;jobs&#x2F;</a><p>====About Elation====<p>We want to help people live happier, healthier lives by building fantastic tools at the center of the physician-patient relationship. We’ve iterated on our product with working physicians, and each one of us has spent hours shadowing in a physician practice to understand the physician’s and patient’s real needs. Elation helps doctors quickly find, digest, act upon, and share clinical information to care for their patients, and it helps patients get access to their clinical information wherever they are. Now we&#x27;re scaling our customer base fast. You can read more about our goals and philosophy on Quora (<a href=\"https://www.quora.com/What-product-is-ElationEMR-building\" rel=\"nofollow\">https:&#x2F;&#x2F;www.quora.com&#x2F;What-product-is-ElationEMR-building</a>) and on our blog (<a href=\"https://blog.elationemr.com/uncategorized/emr-ehr-phr-why-acronyms-on-the-front-line-of-care/\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.elationemr.com&#x2F;uncategorized&#x2F;emr-ehr-phr-why-ac...</a>).<p>====About the Developer Role====<p>Elation’s development team is a small group of really talented engineers who are passionate about our product and our users. As a member of the team you’ll be involved in product design and development, work on all parts of the stack, and deploy your changes to production weekly.<p>Here are some other things that we think make building software at Elation awesome:<p>* Communal code-ownership<p>* Frequent deployments (once or twice a week, on average)<p>* “Right tool for the job” approach to technology (current stack is primarily Python, Django, MySQL, Javascript, AWS, Elasticsearch, Redis)<p>* Remote friendly, work from anywhere<p>* Take-as-you-need vacation<p>* Competitive salary and equity<p>If you think we might be a fit for each other, drop us a line at jobs+hn@elationemr.com and tell us about what you’ve built and why what we’re doing resonates with you!","time":1409618234,"type":"comment"}