{"by":"sdevani","id":8256456,"parent":8252715,"text":"Director of Curriculum<p>MakerSquare - San Francisco (www.makersquare.com)<p>--------------------<p>Technologies:<p>* Ruby on Rails<p>* Angular.js<p>* HTML&#x2F;CSS, SASS<p>--------------------<p>About MakerSquare:<p>MakerSquare is an immersive, 12 week full-time, software developer training program. Our program is based off of real employers’ needs around proficiency in Ruby, Rails, JavaScript, OOP, data structures and algorithmic thinking. (more details below)<p>--------------------<p>About the position:<p>At MakerSquare, we highly value our curriculum and always seek to improve it. We’re looking for an engineer to push our curriculum to new heights as a director within the company.<p>Ultimately, we want you to do anything and everything necessary to push our curriculum to be the absolute best. The end goal is to ensure MakerSquare students have a bright future in software development, and you will the ability to impact how that is achieved.<p>You will be responsible for the following:<p>* Along with the founders, determine business goals of MakerSquare curriculum and create roadmap to achieve this.<p>* Architect a curriculum outline that determines the order of lessons, the methodology in which it’s introduced, and projects that accompany them.<p>* Lead teams of engineers to execute on the creation of the curriculum.<p>* Gather industry information about highly coveted skills to select viable topics to teach students.<p>* Give recommendations for other courses and products such as our Part-time course or online course.<p>* Write and teach custom curriculum to be used in the classroom. You cannot effectively manage curriculum without being immersed in its creation.<p>--------------------About our curriculum--------------------<p>* Our current curriculum is architected by a combination of one of MakerSquare’s technical founders and a few great instructors. We constantly scrutinize it to keep improving.<p>* Our curriculum never stays the same for multiple classes. We change in order to constantly improve and to keep up with the industry.<p>* Our curriculum doesn’t simply teach web development, but software engineering in general. The idea is to have them understand software architecture and design as well as the details of web development.<p>--------------------<p>Requirements:<p>* Full Stack Web developer with 3+ years of industry experience\n* 2+ years of experience with JavaScript frameworks\n* 2+ years of experience with a backend MVC framework (preferably Ruby on Rails)\n* Expertise with CSS is preferred\n* Thorough knowledge of software design principles such as SOLID\n* Deep knowledge of decoupled software architectures for web development\n* Great communication skills is a must<p>--------------------<p>More about MakerSquare:<p>We focus on every single step of becoming a developer and beyond. Our goal is to place students in jobs following the completion of the program that will allow them to utilize the knowledge and skills they have learned. We have a professional yet relaxed, collaborative office culture and a hardworking team that cares deeply about our students and program. We offer excellent support tools and a supportive management team. This position is a great fit for anyone interested in joining an early-stage profitable growth startup.<p>--------------------<p>To Apply:<p>Directly email me at shehzan@makersquare.com with your resume and github username. This is a fulltime position.","time":1409648439,"type":"comment"}