{"by":"eli","id":8257657,"parent":8252715,"text":"Industry Dive - Jr. Python&#x2F;Django Developer - Washington, DC - Full Time\n----------------------------------<p>We are a rapidly expanding mobile-focused B2B media startup. We have a staff of writers and editors who cover breaking news, curate interesting content and write original analysis for executives in industries like Education, Marketing, Energy, and Retail. See <a href=\"http://www.retaildive.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.retaildive.com</a> for an example and <a href=\"http://www.industrydive.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.industrydive.com&#x2F;</a> for more about us.<p>We use a variety of mostly open-source technology to create our products, but the core infrastructure is written in Django. You will be responsible for working with other developers to add features and fix bugs on our websites, especially adding features to the CMS that writers &amp; editors rely on. Prior experience with Django&#x2F;Python is desirable but not required.<p>The ideal candidate:\n    + Has 1-2 years of relevant experience OR otherwise demonstrates\n      an aptitude for software development.<p><pre><code>    + Thrives in a fast-paced environment. Is good at multitasking. \n      Has great communication skills.\n\n    + Is self-motivated and entrepreneurial.\n</code></pre>\nCSS&#x2F;HTML&#x2F;JS web design experience is a plus. An interest in mobile (iOS&#x2F;Android) app development is a plus.<p>Why working at Industry Dive is great:<p><pre><code>    + Short development cycle - When we have a good idea, we like to \n      move quickly and then iterate once it&#x27;s live.\n\n    + Not the same thing every day - We&#x27;re still a small company and\n      you&#x27;ll have the opportunity to work on many projects outside\n      your core job description.\n\n    + Great team - Work with a diverse team of people who are very\n      good at what they do.\n\n    + We work hard, but we also have a lot of fun. And we definitely\n      believe in healthy work&#x2F;life balance. If you&#x27;re looking for\n      lots of crazy all-nighters, this is the wrong place.\n\n    + It&#x27;s a very exciting time for the company. At 2.5 years old,\n      we&#x27;re exceeding all our targets and reinvesting everything back\n      into the company.\n</code></pre>\nIf interested, send a resume along with a brief note about why you think you&#x27;d be a good fit to eli-at-industrydive.com. If you have any question, feel free to ask.<p>----------------------------------<p>OTHER OPENINGS: We are seeking a full-time front-end designer, a design&#x2F;UX intern, freelance business writers&#x2F;reporters, and people interested in media sales. I&#x27;m also generally open to mobile app or web developer internships. Email me to details: eli-at-industrydive.com<p>----------------------------------","time":1409667225,"type":"comment"}