{"by":"Sproutworx","id":8261074,"parent":8252715,"text":"Notion - Portland, OR - Full-stack Developer <a href=\"http://usenotion.com\" rel=\"nofollow\">http:&#x2F;&#x2F;usenotion.com</a><p>Notion is a new company focused on simplifying business intelligence tools to help teams and companies make data-driven decisions.<p>You’re ready to be a key player at a startup using the latest in backend and front-end technologies to provide better insights for workers like us to make better data-driven decisions when building products, systems, and businesses. We think there is a huge opportunity for teams to leverage the data they already have and we’re ready to provide the fast-paced, forward-thinking environment you’ve been dreaming of.<p>Come join our startup team with a track record of success to create your perfect future.<p>Here’s what we’re looking for:<p>Be a leader of product development. You should be able to work independently, as well as mentor more junior developers. You’ll play a critical role in defining timelines and development approaches.<p>Act as a voice of the customer and product. We believe design and engineering coexist side-by-side, so you’ll work closely with us on user experience, design, and technology – not just on technical feasibility, but creative possibilities. This is your opportunity to create an amazing product and see it grow beyond even what we can imagine.<p>A generalist that loves the details. You believe in writing maintainable backend and front-end performant code that is well organized. You believe in tests and testing. You see the web as just another client and want to push the limits on what’s possible.<p>Love a challenge. Embrace risk. We know startups aren’t for everyone, and so do you. We don’t have to put in 80hr work weeks, but you know fixing that last bug matters; adding that key feature means a huge win for our latest customer; that we’ll try a lot of new things and some will work, some will not; that we’re building the best team you’ve ever been a member of.<p>Requirements:<p>* Strong command of core backend (Ruby, Java, Scala, Python, Go) and front-end (HTML5, Javascript, JSON) technologies<p>* Confidence in designing APIs and interfaces<p>* Worked with REST APIs and comfortable with the whole request &#x2F; response lifecycle.<p>* Strong understanding of JQuery and DOM manipulation techniques<p>* Experience developing complex applications<p>* Experience integrating data from third-party APIs<p>* Expert debugging skills<p>Here are some “nice-to-haves”:<p>* Exposure to true agile methodologies<p>* Familiarity with automated build tools and Continuous Integration<p>* Understanding of what it takes to implement an application with cross-browser support<p>Email us at jobs@usenotion.com","time":1409706806,"type":"comment"}