{"by":"Jabaluck","id":8264362,"parent":8252715,"text":"Location: We are in New Haven, CT, but you can work remotely.<p>======Position=======<p>Co-founder CTO to collaborate with us and build out our existing prototype of the online platform described below. We are looking first for general competency and energy, a deeply inquisitive nature, and an appetite for the risk and rewards of start-ups. We are looking second for experience in full-stack development and knowledge of a range of frontend and backend technologies.\nWe are open to various arrangements, including covering your living expenses for a trial period while all parties work toward progress on website development and determining partnership feasibility.<p>======Company=======<p>We are building a website that anyone, anywhere can use to conduct and participate in randomized experiments about simple life choices.  We will capture the same curiosity, desire for answers, and need to connect that makes Q&amp;A, social media, and wiki websites successful. We will do this by facilitating the free exchange of experiment design, participation, conversation, and results. Users will benefit from instant data analysis and highly simplified experiment execution through mobile apps that maximize participation.<p>======Co-founders======<p>Jason Abaluck is a assistant professor of economics at the Yale School of Management. He has an extensive background in econometrics, including the administration of large randomized experiments.  Jason holds a Phd in Economics from M.I.T. and a B.A. from Harvard University.<p>Cara Mae Cirignano is a trained environmental economist with a background in architecture and green building. Her work includes low-income housing design and development and systems analysis. Cara Mae holds a Masters of Environmental Science in Economics from Yale University and a B.A. from Wellesley College.<p>contact: jason.abaluck@yale.edu<p>We look forward to hearing from you. And playing ping pong with you.","time":1409767311,"type":"comment"}