{"by":"amitt","id":8267498,"parent":8252715,"text":"Red Hot Labs | <a href=\"http://www.redhotlabs.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.redhotlabs.com&#x2F;jobs</a> | SF, ONSITE ONLY<p>FULL-TIME ENGINEERS and a FULL-TIME LEAD ACCOUNT MANAGER<p>We&#x27;re on a mission to revolutionize how mobile developers acquire users for their apps. Our product, Toro, makes it super easy to split test and optimize mobile marketing campaigns. We’re solving one of the necessary, but tedious, parts of launching great mobile apps. We  believe in creating delightful experiences that are easy to use, save people time, and, most importantly, save our customers money by improving campaign performance.<p>This isn&#x27;t our first trip around the block.  Our previous startup was acquired by Zynga and our core technology turned into FarmVille and the rest of Zynga’s most successful games.  It was a wild ride and now we’re full steam ahead on a new adventure. We&#x27;re well backed by folks such as A16Z, Greylock, SVAngel, Data Collective, and more.<p>We&#x27;re looking for passionate, energetic, highly talented individuals to join our team.  By becoming a foundational member of our team you will help shape the direction of our product, company and culture.  We’re believe in constantly challenging ourselves to learn new things and would love to teach you what we know and learn from you as well.<p>==================================<p>ENGINEERS<p>We want all engineering members of the team to be full-stack engineers and well-rounded individuals.  But, we&#x27;re especially excited about the following engineering profiles:<p><pre><code>  - Senior Product Engineer: You&#x27;ve built products from  concept all the way to \n  maturity.  You&#x27;re as opinionated and influential about product as you are about coding.  \n  You&#x27;re a master at JS&#x2F;CSS&#x2F;HTML and customer facing technologies. \n  Bonus points if you’re on-top of your front-end frameworks like Angular \n  (which we use!), Ember, or Meteor.\n\n  - Senior Systems Engineer: You&#x27;ve architected and scaled backend systems to \n  millions of users.  You&#x27;ve put out every kind of fire and learned a lot in the \n  process. You understand the tradeoffs of different data stores, server \n  architectures, and low-level services. \n</code></pre>\nOUR STACK:<p><pre><code>  - Redshift, Redis, MySQL, Rails for our backend API.\n  - AWS-suite: EC2, S3, RedShift, EBS, ElasticCache, RDS\n  - AngularJS, jQuery, Underscore, Node.JS with D3 for our dashboard and web apps.\n  - 3rd party services: Facebook, Mixpanel, Stripe, Mailgun\n</code></pre>\n==================================<p>LEAD ACCOUNT MANAGER<p>We&#x27;re hiring for our FIRST account manager position.<p>Our customer list is growing fast so we&#x27;re looking for someone that is eager to work directly with our founders to build a process to ensure all of our customers are successful at using our product. Ideal candidates would have prior account management experience and a strong desire to define and implement account management best practices.<p>==================================<p>Do any of the above profiles sound like you? Send us an email at: jobs@redhotlabs.com or apply directly at <a href=\"http://www.redhotlabs.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.redhotlabs.com&#x2F;jobs</a><p>Or, learn a little more about us here: <a href=\"https://www.torometrics.com/company\" rel=\"nofollow\">https:&#x2F;&#x2F;www.torometrics.com&#x2F;company</a>","time":1409827933,"type":"comment"}