{"by":"Stealx","id":8269976,"parent":8252715,"text":"Chicago - Review Trackers<p>CTO - Chief Technology Officer (Ruby on Rails)<p>We are a Chicago based, VC funded startup (<a href=\"http://bit.ly/ReviewTrackers\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;ReviewTrackers</a>). Review Trackers focuses on simplicity, and usability to provide location based businesses an easy way to monitor what is being said about them in online reviews. We have thousands of paying locations already and are growing every month.<p>What experience should I have?<p>- Be a full stack Rails developer with strong knowledge and experience of designing and developing consumer facing, data heavy applications employing SQL and NoSQL databases.<p>- Strong experience in open API, web services and integration (REST, SOAP, JSON, XML, OAUTH)<p>- Strong skills on cloud architecture and application development with Amazon AWS and Heroku.<p>- Must be skilled with database design and comfortable in writing efficient SQL and using ActiveRecord. Along with experience working with Postgres&#x2F;MySql and MongoDB.<p>- Experience working in an agile and a distributed environment.<p>- A lot of Experience writing modular and maintainable front end code using custom and libraries like JQuery. Comfortable with HTML, CSS and DOM and MVVM frameworks such as Angular.js and Backbone.js<p>- Prior work experience at a highly trafficked consumer-facing site with multiple external points of integration is a plus.<p>- Experience using Ruby Gems for background jobs processing: content search, email communication, SQL database, JavaScript adapters such as pg and UJS, version management, report generation, payment processing, continuous integration, unit testing, content parsing and scraping would be a plus.<p>- Experience building, growing and managing a development team<p>Apply: <a href=\"https://www.smartrecruiters.com/ReviewTrackers/78844164-chief-technology-officer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.smartrecruiters.com&#x2F;ReviewTrackers&#x2F;78844164-chie...</a><p>Questions? Contact me directly at iman@reviewtrackers.com<p>We’ll relocate the right candidate to Chicago.","time":1409856674,"type":"comment"}