{"by":"fh2210","id":8272711,"parent":8252715,"text":"<a href=\"http://3QAYJ.com\" rel=\"nofollow\">http:&#x2F;&#x2F;3QAYJ.com</a> looking for 1-2 REMOTE WEB DEV - Full time<p>- 1) What’s the best thing about your current job?<p>- 2) What’s the worst thing about your current job?<p>- 3) What things could you wish for to make your current work better?<p>These were the questions I asked my team in an email in June 2014. The intention was to use their answers to better understand and prepare a job posting in order to attract similar minded people to our company.<p><i></i>Their response however surprised me:<i></i><p>- &quot;The best thing in my current job is free of implementation ways and time limits...&quot;<p>- &quot;Flexible work hours (and even days!). Ability to move to another place any time. Good team.&quot;<p>- &quot;The best thing is freedom in ways to resolve the tasks. When I&#x27;m choosing tools, libraries or approaches I&#x27;m free to pick whatever will be the best for task. And not limited by some company policies as it was on previous jobs...&quot;<p>- &quot;The working flow standards... Company trusted politic... Team voice... The happy team... Strict and smart team lead...&quot;<p>- &quot;No hierarchy. Almost :) I feel we work not only for one person but for the company, moving this business forward - that&#x27;s really inspiring.&quot;<p>Please review full answers here <a href=\"http://3QAYJ.com\" rel=\"nofollow\">http:&#x2F;&#x2F;3QAYJ.com</a><p>In my opinion their answers were better than any job posting I could have done. It inspired me to rethink the whole way we normally post a job. When looking for skilled likeminded people to join our team we shouldn’t make a job post; rather we should make a “company pitch”.\nMost job posts are dictating who you are and what you should do – a common sentence in a job post often goes like this: “you got a master degree in computer science and like to...” or “you will develop solution concepts by using...”. We don’t believe in such requirements. We don’t think of you as a work unit in a production line. Rather we seek talents and personalities whom we would want to invest in a relationship with. We firmly believe modern companies need to rethink the way in which they attract similar minded people. We must open our door and introduce our values; as this is the first step towards creating a bond. After all we are the team that want you to join us.<p>With that being said welcome to 3QAYJ.com (www.3QAYJ.com) – our company pitch project to attract you!<p><i></i>Our workflow is managed via<i></i><p>JIRA,CONFLUENCE<p>and all code submitting is handled through Github, pull request.\nOn a daily basis we communicate via hipchat and each Monday we have a weekly meeting via skype to touch base. One of the outcomes from the 3QAYJ is our team summit. Starting from 2015 we will have a real life team summit meeting some place around the world financed by the company.<p>We are currently looking at expanding our development team with 1-2 backend developers.<p><i></i>Job description<i></i><p>Here is a list of some of the tools and technologize we currently use:<p>- Nginx<p>- git<p>- Capistrano<p>- compass (scss)<p>- coffeescript (a little bit)<p>We&#x27;d appreciate if you have experience with the above or you can study how to use it.<p>We appreciate if you have:<p>- skills in Magento development<p>- skills in web development in general<p>- skills or at least wants to get skills in mobile applications development (Android&#x2F;iOS)<p><i></i>Good confirmations of your professionalism could be:<i></i><p>- your github account with contributions to open source projects<p>- any certificates (Magento MCD&#x2F;MCDP, ZCE and so on)<p>- your stackoverflow account<p>If applying we would ask you to send us an example of code written by you and make a short pair programming session with one of our developers.<p><i></i>What we offer<i></i><p>- Long term full employment<p>- Flexible working hours<p>- Remote job - Work from your home<p>- Influence in all aspect of your work – freedom in ways to resolve tasks<p>- Respect your opinion&#x2F; support your own projects<p>- Stability and personal relationship<p>- Fully paid Team summit meeting each year.<p><i></i>Your Application<i></i><p>We hope you wish to join our team. Besides to technical ability we value personality a great deal. For that reason we would love from you to make a personal introduction in which you:<p>- Let us know what your passionate about (does not have to be relevant to programing);<p>- How, why and when you first started programming;<p>- Share some of your personal goals in life in general (in case you know).<p>Please submit your application with any links and code example to the following email info@3QAYJ.com and please visit our site <a href=\"http://3QAYJ.com\" rel=\"nofollow\">http:&#x2F;&#x2F;3QAYJ.com</a> to learn more.<p>Thank you in advance","time":1409902174,"type":"comment"}