{"by":"veverkap","id":8273672,"parent":8252715,"text":"REMOTE Senior Ruby Developer Needed!<p>Hi. We&#x27;re looking for an awesome Senior Ruby Developer to join our growing team. If you&#x27;ve ever wanted to work for a interesting security startup with great people this is your chance. We&#x27;re a little different than your average startup so we put together this FAQ.<p>Q: Ok who are you guys?\nA: ThreatSim is comprised of some really smart security hackers who were tired of working for large companies. There are people here from Mitre, HP, Fortify, RSA, Verizon Business, Cybertrust, and others. We wanted to do the small company thing and it&#x27;s worked well for us.<p>Q: What would I be working on?\nA: You&#x27;d be working on our SaaS service, ThreatSim. It lets our customers send simulated phishing campaigns against themselves. When the user clicks on the simulated phishing link they are immediately shown training. It&#x27;s an unconventional approach to changing user behavior and it works (hint: we have data).<p>Essentially we get to think like bad guys and help our customers improve their security. It&#x27;s an interesting space to say the least. If you ever wanted to learn more about security and cutting-edge attacks, this is the place. We simulate evil AND give our customers data that they can use to protect their organization. You will spend a lot of time thinking &quot;if I was a bad guy I&#x27;d...&quot; then have to pivot and think &quot;if I was a security engineer I&#x27;d...&quot;.<p>Q: Where is this position located?\nA: This is a remote position that is open to US residents only located within the US. We understand that not every developer wants to move to SF, NYC, or DC so we let you work wherever you are productive.<p>Q: What technology to you use?\nA: ThreatSim is built entirely within Amazon Web Services. Linux, load balancers, auto-scaling, sidekiq, redis, ansible, git, Splunk, HIDS, two-factor auth, disk encryption, and a lot of cool security stuff that you probably aren&#x27;t used to seeing in a startup.<p>Q: What skills and qualities are you looking for in a candidate?\nA: Here&#x27;s a bullet list:<p>Ruby on Rails 3.0+\nRelational and non-relational databases: MySQL, Redis\nBackground job processors (e.g. Sidekiq)\nJavascript frameworks (e.g. jQuery, pure JS)\nClient-side and server side MVC\nComfortable with git for version control\nContinuous integration\nMS Office (hah right, could you imagine?)<p>If you are interested, send along a resume to jobs@threatsim.com","time":1409923036,"type":"comment"}