{"by":"carve","id":8288882,"parent":8252715,"text":"Data&#x2F;Vis&#x2F;Web Hackers - Institute for Systems Biology - Seattle, WA<p><a href=\"http://www.systemsbiology.org\" rel=\"nofollow\">http:&#x2F;&#x2F;www.systemsbiology.org</a><p>We build tools that enable researchers in systems biology to understand, explore, query and communicate about analysis and underlying datasets. Come write software at the forefront of genomic research. We analyze complex datasets, spanning over 10,000 samples with millions of features. The Shmulevich group at the Institute for Systems Biology tackles the ever-increasing challenge of deriving insight from genomics, histology, clinical history and a variety of other data sources.<p>======  Our group is great because we ======<p>* write open source software hosted publicly on github<p>* are technologically flexible to support the science in the fastest, most efficient way possible.<p>* work on a wide range of projects: bioinformatic analysis, full-stack web, data visualization, distributed query, and machine learning.<p>* have experience in genomics, bioinformatics, computation, and software development.<p>====== You will love working here because you ======<p>* will work with fascinating, meaningful data.<p>* will make a difference in cutting edge scientific research.<p>* will harness your tangential interests in math, genomics, visualization, or distributed systems to build something that Systems Biology didn’t know it needed.<p>It all makes for an engaging, challenging experience. With the job comes personal flexibility, an enthusiastic mindset, academic curiosity, and as much knowledge about the latest discoveries in biology as you care to learn.<p>===== We are hiring ====<p>Interactive Analysis Web Developer: Create tools and applications to elevate scientific reasoning.<p>-----------<p>Distributed Systems&#x2F;Services Developer for Genomics: Apply modern solutions to push the boundaries of modern genomic analysis.<p>-----------<p>Genomics Data Hacker: Collaborate with experts in computational biology to implement cutting-edge analysis on challenging new datasets.<p>-----------<p>More job info at: <a href=\"http://goo.gl/jJU4pp\" rel=\"nofollow\">http:&#x2F;&#x2F;goo.gl&#x2F;jJU4pp</a><p>If interested, send resumes&#x2F;github repos&#x2F;past work to: ilyalab_jobs@systemsbiology.org","time":1410240609,"type":"comment"}