{"by":"mikeearley2001","id":8297678,"parent":8252715,"text":"Shoe Lovers&#x2F;Burlingame, CA&#x2F;Full-Stack Engineer<p>Shoe Lovers is hiring a Full-Stack Engineer to join it&#x27;s growing team of 8!<p>Shoe Lovers (<a href=\"https://angel.co/shoe-lovers\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;shoe-lovers</a>) is the world’s largest online community for shoe fashionistas, curated with love. We have grown to 20+M Facebook fans in a little over a year by offering a unique mobile social commerce platform to help passionate women who love shoes to find offers, discover trends around the world, and share their passion with others.<p>Do you want to be part of a team riding hyper-growth customer acquisition?  We are scaling the company to meet demand and offer a continuing array of exciting additional products. We are a small team who are as passionate about our market as our fans are, tackling the challenges of creating a large-scale platform that handles millions of customer interactions daily. We have raised $650k of seed funding and are now looking for key team members who are excited by this challenge of creating the world’s largest fashion social market, initially in Spanish-speaking geographies and later the world. If you thrive in a collaborative high growth environment and can add tremendous value to the team, we’d like to talk to you.<p>As our Full-Stack Engineer, you will work up and down the entire technology stack to build new features and products to drive our continued success, reaching millions of users. You will have a major impact on how the world perceives and interacts with our products. We hope that you&#x27;ll bring your passion for full-stack development to help us build truly world-class technology and products!<p>Our stack is a broad SOA platform with Javascript on the front and mostly PHP and Python on the back. We move quickly, strive to release several times a week and believe strongly in automated testing to help maintain our quality and velocity.<p>If you are interested in this position, please send your resume to: jobs@shoelovers.co","time":1410369579,"type":"comment"}