{"by":"believeinUK","id":8309427,"parent":8252715,"text":"Believe.in (<a href=\"https://uk.believe.in/\" rel=\"nofollow\">https:&#x2F;&#x2F;uk.believe.in&#x2F;</a>), London UK - Frontend Engineers<p>Believe.in is one of London’s hottest start-ups and leading the charge to disrupt the world of non-profits through beautiful, effective and innovative technology. We are at an inflection point in our growth and are looking for an ambitious and hard-working Front-end Developer to join our London office. This is a great opportunity for someone looking to build a career in the fast-growing start-up world.<p>About the company<p>Co-founded by Matthias Metternich (CEO) and Will Cookson (CPO), who worked together at the world’s leading digital design and development agency AKQA, Believe.in offers non-profits all the essential online tools they need to kick their fundraising efforts into gear. From donation processing technology, through to peer-to-peer fundraising, campaign and event tools, charities can now easily customise and integrate Believe.in social and device friendly technology directly into their own websites. Non-profits use our donation management tools to make data-driven fundraising decisions and manage relationships with donors effectively.<p>Believe.in’s investors include some of the world’s leading venture capitalists and our advisory board is made up of experienced successful entrepreneurs. The business has developed an outstanding suite of products and tested these in the market and is now ready to grow its customer base exponentially.<p>Your role<p>This is a full-time position based in our offices in Silicon Roundabout. You&#x27;ll have 3+ years worth of experience and an insatiable desire to create the best products and product experiences. In your role you will grapple with exciting and complex challenges, gain experience in Agile development practices and work alongside the Founders. You&#x27;ll bring the following skills to the party<p>Rock solid HTML5&#x2F;CSS3 skills\nExperience with JavaScript, including jquery\nDeveloped software using test driven development\nHave used single page app frameworks such as Backbone, Angular or Ember\nWorked with build tools ie grunt.js, gulp.js\nExperience developing UI that works across all major browsers and degrades gracefully.\nExperience working in an agile workflow\nExperience optimizing sites for performance, especially on mobile devices\nPassionate about user experience and accessibility\nAbout you<p>You’re someone who becomes passionate about creating the best possible product. You believe in and are excited by the idea of taking a company from a start-up to a global powerhouse and understand the opportunities that come with being there from the start! You&#x27;ll thrive in the face of challenge and want to get shit done and shipped as quickly as you can to get feedback from real people. You enjoy thinking laterally and can conceptualise and solve problems quickly. You&#x27;re an entrepreneur and hacker at heart and have various side projects that keep your brain humming and your skills sharp. Most of all you are excited about the idea of working at a start-up where things move quickly, where you will make close friends and where late nights, beers and good banter have you operating at your best!<p>Details<p>This is a full-time position and comes with a competitive salary. The position will be based at our offices in Shoreditch, London. To apply, please email Will Cookson (will@believe.in) with a copy of your CV.","time":1410545004,"type":"comment"}