{"by":"kedargj","id":8309363,"parent":8252715,"text":"Sencha (<a href=\"http://www.sencha.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sencha.com</a>), Redwood City, CA\n<i></i>Software Engineers - Frameworks and Tools<i></i><p>We are looking for software engineers to join our Frameworks and Tools teams.<p>As a Sencha Framework Engineer, you will help define, lead and deliver future releases of our JavaScript frameworks ( Sencha Ext JS, Sencha Touch, …) Sencha frameworks are object-oriented JavaScript frameworks for building complex, cross-browser web applications for desktop and mobile. They feature rich interface capabilities, a clean, extensible component model and are highly optimized for size and performance.<p>Do you like to: \n- Work in a collaborative environment with product management, QA and documentation to create easy to use, efficient and powerful features?  \n- Push your javascript, HTML &amp; CSS capabilities to the max building industry leading frameworks?\n- Use your imagination to build the next generation of components that simplify building world class web applications?<p>If yes, then we would like to hear from you at sencha@gapjumpers.me or take a technical challenge for an immediate interview call at <a href=\"https://www.gapjumpers.me/questions/sencha-inc/qs-128/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gapjumpers.me&#x2F;questions&#x2F;sencha-inc&#x2F;qs-128&#x2F;</a><p>--------------------\nWe are also seeking a talented build and tools engineer to help us create high quality products that will delight our developer community.<p>As a Tools Engineer, you&#x27;ll be building advanced modern web applications requires powerful yet simple tools. Helping Sencha define the future of web application development and the tools that developers use to build those applications. Sencha is developing SDKs that are being used by hundreds of thousands of developers to build state-of-the art web applications across the complete range of desktop and mobile devices.<p>Are you excited about the challenges faced by our developer community? Then we want you to tell us what you think about it at <a href=\"https://www.gapjumpers.me/questions/sencha-inc/qs-127/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gapjumpers.me&#x2F;questions&#x2F;sencha-inc&#x2F;qs-127&#x2F;</a><p>Send in your applications to sencha@gapjumpers.me or answer technical challenges for our open roles at <a href=\"https://www.gapjumpers.me/questions/sencha-inc/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gapjumpers.me&#x2F;questions&#x2F;sencha-inc&#x2F;</a> if you want to jump the CV queue and directly interview with our engineering leads.","time":1410544327,"type":"comment"}