{"by":"sophie-g","id":8310598,"parent":8252715,"text":"Ginger.io - Mobile Engineer - Downtown San Francisco - Full Time<p>Ginger.io is a small team on a big mission to drive better health outcomes. Our pioneering platform combines a mobile app that uses smartphone sensors to passively collect information about an individual’s daily behaviors with an analytics engine (based on research from MIT’s Media Lab) that turns that raw data into health insights. We provide that information back to clinicians or loved ones who can act on it to ensure that at-risk patients receive the right care at the right time.\nAs we’ve grown, we’ve become part of the care solution at institutions such as Kaiser Permanente, Novant Health, UCSF, Duke Medical and Cincinnati Children&#x27;s. In addition, Ginger.io has emerged as a leading voice in the conversation around bringing technology to behavioral health. Ginger.io is part of the Techstars network and is VC-backed by Khosla Ventures and True Ventures.<p>We come to work each day to revolutionize the way that care is delivered, and we&#x27;d love to have you join us.\nGinger.io is looking for a mobile developer to help drive the consumer and patient experience on Android. Your core responsibility would be to work with the rest of the Product team to craft the user experience to enhance the patient’s connection with their doctor. Patient experience is at the core of Ginger.io, and you will be working directly within the Product team to conceptualize, build, test, release and maintain the Ginger.io Android applications.<p>Responsibilities:<p>- Own full lifecycle of Android applications: prototyping, developing, testing, deploying, and debugging<p>- Work with the iOS team to ensure that the Android app experience is consistent<p>- Make architectural decisions that balance the trade-off between the level of customization and complexity<p>- Interact with API team and Design team for resources required to build a solid, slick and performant Android Application<p>- Write well-structured, maintainable, idiomatic code. Incorporate appropriate level of automated testing and documentation, depending on whether you’re prototyping or writing production code<p>Essential Skills:<p>- Solid understanding of Android Framework<p>- Experience developing and deploying production Android apps<p>Desirable skills:<p>- Experience leading development of an Android app that has scaled beyond 100k users<p>- Experience with background data collection, battery-life optimization, local data processing preferred<p>- Python, Django, Javascript<p>Ginger.io offers a competitive salary and benefits in San Francisco’s Financial District. Our mission-driven culture combines a love of learning with a strong belief that everyone has a voice to contribute if we are to succeed and make a difference. We believe in empowering our team with the tools and transparent culture that we all need to perform and grow.<p>Apply here: <a href=\"http://ginger.io/jobs/signup/15547/mobile-engineer/\" rel=\"nofollow\">http:&#x2F;&#x2F;ginger.io&#x2F;jobs&#x2F;signup&#x2F;15547&#x2F;mobile-engineer&#x2F;</a>","time":1410557978,"type":"comment"}