{"by":"nv2156","id":15604291,"parent":15601729,"text":"AppDirect | Software Engineers | San Francisco | Full Time | Onsite<p>AppDirect is the leading cloud service marketplace company. We offer a cloud service marketplace and management platform that enables companies to distribute web-based services. The global network of AppDirect-powered marketplaces allows businesses to find, buy, and manage the best applications the cloud has to offer.<p>With our platform, service providers can launch a state-of-the-art online application store within a matter of weeks, while developers can integrate once and make their software available across multiple marketplaces worldwide. Our products offer more advanced features and tools than any other competitive solution, putting AppDirect at the forefront of the rapidly evolving market for cloud services delivery.<p>As a member of the team, you will create, grow, and manage a distributed network of marketplaces and applications. We love entrepreneurial spirit and those who bring experience from established organizations.  You are a highly technical, hands-on developer with a passion for producing maintainable and robust code. You will design and develop well-tested software, build mission critical services, and APIs that scale with our increasingly elegant set of features.<p>Our stack: Java, Spring, MySql, React, Backbone.js, AWS, Chef, Docker+Kubernetes.<p>Roles<p>- Senior Backend Engineer: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;appdirect&#x2F;cefc7ae6-fe2a-4153-a931-8051ec282377\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;appdirect&#x2F;cefc7ae6-fe2a-4153-a931-8051...</a><p>- Staff Backend Engineer: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;appdirect&#x2F;529182cd-ccac-4a5f-b362-59525087b3d9\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;appdirect&#x2F;529182cd-ccac-4a5f-b362-5952...</a><p>- Staff Frontend Engineer: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;appdirect&#x2F;0799401b-2a89-432c-a16d-37a65535770d\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;appdirect&#x2F;0799401b-2a89-432c-a16d-37a6...</a><p>- DevOps Engineer: System Administrator: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;appdirect&#x2F;1db6ec86-8b23-4f5e-bb76-447c0dc94b98\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;appdirect&#x2F;1db6ec86-8b23-4f5e-bb76-447c...</a>","time":1509561960,"type":"comment"}