{"by":"Infosourcer","id":15603049,"parent":15601729,"text":"CLOUDERA| US &amp; Global | Engineering, G&amp;A, Sales &amp; More| Onsite | Full-time | <a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;5zCuS2\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;5zCuS2</a><p>CLOUDERA BACKGROUND:\nWe generate vastly more data today than ever before. There are, by IDC estimates, 4.4 zettabytes, or 4,400,000,000 terabytes, of data in the world today. That number is so big, it’s hard to comprehend. It’s the equivalent of 600 million years of high-definition video, for example. And 90% of that data has been created in just the past two years. Four years from now, experts predict there will be ten times as much -- 44 zettabytes.<p>This explosion of data comes from the 6.4 billion devices connected to the internet, and that number will grow nearly five-fold in the next four years. Some of those devices are computers, of course, handling sales at supermarkets, trading stocks on Wall Street, or reading DNA sequences for researchers at pharmaceutical companies. Some, though, are sensors in elevators, cars, on factory lines and in oil wells. Some are connected to people, tracking temperature and heart rate and more.<p>Computing is so cheap, and networks are so ubiquitous, that it’s possible now to instrument and measure almost anything we care about.<p>Cloudera was founded in 2008 to help businesses capture, store and analyze that data. Half of our original founders are still at the helm. We built a software platform that can handle the huge amounts of data now available. We developed a powerful collection of processing and analytic capabilities. Our customers are able to ask very deep questions of their data, and get their answers quickly.<p>WHY CLOUDERA?\n<i>Cloudera is the largest single contributor to the Apache Hadoop project and we have trained more Hadoop engineers than any other organization on Earth.<p></i>Amazing people - We are a fun &amp; smart team,including many of the top luminaries in Hadoop and related open source communities. We frequently interact with the research community, collaborate with engineers at other top companies &amp; host cutting edge researchers for tech talks.<p><i>Innovative work - Cloudera pushes the frontier of big data &amp; distributed computing, as our track record shows. We work on high-profile open source projects, interacting daily with engineers at other exciting companies, speaking at meet-ups, etc.<p></i>Great culture - Transparent and open meritocracy. Everybody is always thinking of better ways to do things, and coming up with ideas that make a difference. We build our culture to be the best workplace in our careers.<p>*Experience - be part of the exhilarating ride at a fast-growing post-IPO startup<p>Ready to learn more and be a part of an amazing company and career? ALL ARE WELCOME HERE!!!!Check out our jobs here: <a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;5zCuS2\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;5zCuS2</a>","time":1509554637,"type":"comment"}