{"by":"alfo_","id":15604135,"parent":15601729,"text":"Ahrefs | OCaml developer &#x2F; DevOps | Singapore + San Francisco, CA | REMOTE ok, VISA ok (SG only)<p>Ahrefs runs an internet-scale bot that crawls the whole Web 24&#x2F;7, storing huge volumes of information to be indexed and structured in a timely fashion. Backend system is powered by a custom petabyte-scale distributed key-value storage to accommodate all that data coming in at high speed. The storage system is implemented in OCaml with thin performance-critical low-level part implemented in C++ and Rust. On top of that Ahrefs is building various analytical services for end-users.<p>We are a small team and strongly believe in better technology leading to better solutions for real-world problems. We worship functional languages and static typing, extensively employ code generation and meta-programming, value code clarity and predictability, and are constantly seeking to automate repetitive tasks and eliminate boilerplate, guided by DRY and following KISS. If there is any new technology that will make our life easier - no doubt, we&#x27;ll give it a try. We rely heavily on opensource code (as the only viable way to build maintainable system) and contribute back [1]. Occasionally we track down CPU bugs [2].<p>We are looking for a backend developer [3] with a deep understanding of networks, distributed systems, OS fundamentals and taste for simple and efficient architectural designs. Our backend is implemented in OCaml (and some C++), as such proficiency in OCaml is very much appreciated, otherwise a strong inclination to intensively learn OCaml in a short term will be required. Understanding of functional programming in general and&#x2F;or experience with other FP languages (F#,Haskell,Scala,Scheme,etc) will help a lot. Knowledge of C++ and&#x2F;or Rust is a plus.<p>Ahrefs is also looking for a oncall&#x2F;devops [4] to help take care of its distributed backend systems powered by 2000+ servers and ensure all systems are up and running 24&#x2F;7. We require deep understanding of operating systems and networks fundamentals, practical knowledge of Linux and a healthy desire to automate everything while being able to quickly resolve urgent issues manually.<p>Our motto is &quot;first do it, then do it right, then do it better&quot;. Drop an email to connect@ahrefs.com<p>[1] <a href=\"https:&#x2F;&#x2F;github.com&#x2F;ahrefs\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;ahrefs</a>\n[2] <a href=\"https:&#x2F;&#x2F;tech.ahrefs.com&#x2F;skylake-bug-a-detective-story-ab1ad2beddcd\" rel=\"nofollow\">https:&#x2F;&#x2F;tech.ahrefs.com&#x2F;skylake-bug-a-detective-story-ab1ad2...</a>\n[3] <a href=\"https:&#x2F;&#x2F;ahrefs.com&#x2F;jobs&#x2F;ocaml-server-side-developer\" rel=\"nofollow\">https:&#x2F;&#x2F;ahrefs.com&#x2F;jobs&#x2F;ocaml-server-side-developer</a>\n[4] <a href=\"https:&#x2F;&#x2F;ahrefs.com&#x2F;jobs&#x2F;oncall-devops\" rel=\"nofollow\">https:&#x2F;&#x2F;ahrefs.com&#x2F;jobs&#x2F;oncall-devops</a>","time":1509561121,"type":"comment"}