{"by":"msolo","id":15602772,"parent":15601729,"text":"Broad Institute of MIT and Harvard | Cambridge&#x2F;Boston, MA | Associate Software Engineer | ONSITE, VISA<p>We are a small team of software engineers, computational biologists, mathematicians, clinicians, and geneticists building cutting-edge tools and methods for interpreting massive genomic datasets.<p>We are looking for friendly people with demonstrated experience in web tech, an eye for design, and genuine excitement to learn new things.<p>Your primary technical responsibilities would include developing well-engineered web components with a focus on data vizualization, using these components to bootstrap new projects, processing data with our distributed&#x2F;Spark framework, and deploying applications on Google Cloud Platform. We&#x27;re not joking about the amount of data! The Broad sequences a new genome every 10 minutes. This is the most genomic data that has ever existed anywhere in the world. Our technology stack: React, Redux, D3, SVG, GraphQL, node, Elasticsearch, Docker, Kubernetes, Google Cloud&#x2F;Container Engine, Python, Scala, Apache Spark.<p>In just a few years, our tools have had a significant impact on the medical community. Our in-house sequence analysis efforts have helped over a thousand families receive rare disease diagnoses. Our public resources used by clinicians and researchers around the world have helped well over 10,000 rare disease patients. Alongside diagnosing rare diseases, we are starting to build tools to understand complex diseases such as schizophrenia and other psychiatric illnesses.<p>Here are a few videos that describe our work in more detail:<p>Using big data to understand rare disease, Daniel MacArthur (<a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=GFNn7z7OWU8&amp;index=5&amp;list=PL2237C7855EC54B7C\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=GFNn7z7OWU8&amp;index=5&amp;list=PL2...</a>)<p>Scaling genetic data analysis with Apache Spark, Spark Summit East, Cotton Seed (<a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=6WoPZ3_nIXc\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=6WoPZ3_nIXc</a>)<p>Regarding our software team&#x27;s culture, we have a pretty flexible schedule, including opportunities to work remotely. We communicate frequently through Slack&#x2F;Google Hangouts. We place a strong emphasis on mentorship and we do whatever we can to help you achieve your career goals. If this includes getting into a top graduate school, we are fully supportive; we&#x27;ve had two people in the group transition into graduate programs at Harvard, and another to the University of Washington. We are 100% committed to open source software and publicly recognizing project contributors.<p>Come help shape the future of human genetic data visualization and discovery!<p>email: msolomon@broadinstitute.org","time":1509553304,"type":"comment"}