{"by":"pacoisenberg","id":15603174,"parent":15601729,"text":"Carbon Lighthouse | San Francisco | Senior Software Engineer | Full Time | ONSITE<p>About Carbon Lighthouse:\n<a href=\"https:&#x2F;&#x2F;www.carbonlighthouse.com&#x2F;about-us&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.carbonlighthouse.com&#x2F;about-us&#x2F;</a> | <a href=\"https:&#x2F;&#x2F;www.carbonlighthouse.com&#x2F;about-us&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.carbonlighthouse.com&#x2F;about-us&#x2F;careers&#x2F;</a>\nCarbon Lighthouse is on a mission to stop climate change by making it easy and profitable for building owners to eliminate carbon emissions caused by wasted energy. The company’s unique approach to Efficiency Production goes deep into buildings to uncover and continuously correct hidden inefficiencies that add up to meaningful financial value and carbon elimination that lasts.<p>We have been around since 2010 and are a team of 55 people spread over SF and NYC. However, the software team is currently only four people. We have had great success proving out our process and tech and are now looking to grow the software team to help us scale and have a global impact.<p>We use our software to ingest data from hundreds of sensors we deploy in buildings, analyze that data to understand how the building is operating and using energy, and create thermodynamic models to quantify the energy use and savings we can achieve. After we implement the projects we use our platform again to provide ongoing monitoring of a building to ensure we are getting the energy savings we guarantee over the next 10 years.<p>About the position and to apply:\n<a href=\"https:&#x2F;&#x2F;www.carbonlighthouse.com&#x2F;seniorsoftwaredeveloper&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.carbonlighthouse.com&#x2F;seniorsoftwaredeveloper&#x2F;</a>\nWe are looking to hire two senior software developers to not only write code, but help us brainstorm and architect our analytics and modeling software platform. This person will have a great ability to influence the direction of the software and the stack, and have ownership over large portions of our platform. This person will also have the opportunity to be a leader on the team and mentor or manage people as we continue to hire.<p>Our stack is a mix of Node and Python on the backend, React on the frontend, and encourage anyone interested in the position to apply, regardless of what languages they have most experience with.<p>The position will be onsite at our SF office, which is a 2 minute walk from the Montgomery St BART station.","time":1509555287,"type":"comment"}