{"by":"makmanalp","id":15602951,"parent":15601729,"text":"Center for International Development at Harvard University | Backend &#x2F; Data Specialist | Cambridge, MA (Boston) | Full Time ONSITE<p>You: Want to make a positive impact in the world. You are interested in the intersection of data science and software engineering. You enjoy tinkering, working on and learning a wide variety of new things. Junior applicants encouraged, you&#x27;ll have plenty of opportunity to learn on the job.<p>Us: A research center (<a href=\"https:&#x2F;&#x2F;growthlab.cid.harvard.edu&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;growthlab.cid.harvard.edu&#x2F;</a>) that focuses on the question: “Why do some countries grow while others don’t?”, and studies issues of economic development and poverty in developing countries. We have people from a wide set of backgrounds, including economics, public policy, computer science, mathematics. My team is a is a small software team within the larger organization.<p>Yesterday we just re-launched our free tool that helps people explore detailed world trade data and the productive capabilities of countries: (<a href=\"http:&#x2F;&#x2F;atlas.cid.harvard.edu&#x2F;explore&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;atlas.cid.harvard.edu&#x2F;explore&#x2F;</a>). We&#x27;ve also worked with many country governments, bringing in our policy and software expertise to assist them in their efforts (e.g. Colombia: <a href=\"http:&#x2F;&#x2F;www.datlascolombia.com&#x2F;#&#x2F;?locale=en-col\" rel=\"nofollow\">http:&#x2F;&#x2F;www.datlascolombia.com&#x2F;#&#x2F;?locale=en-col</a> but also Mexico, Peru). We also occasionally do more experimental projects, like the 3D globe (<a href=\"http:&#x2F;&#x2F;globe.cid.harvard.edu&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;globe.cid.harvard.edu&#x2F;</a>).<p>Responsibilities:<p>- Learn and work alongside our backend&#x2F;data engineer and our frontend engineer to build and improve backend APIs that query and deliver data quickly and efficiently for our data visualization tools<p>- Help deploy and manage server systems that host our data visualization tools<p>- Contribute to the build of data pipelines to clean, process and analyze large and varied datasets<p>- Help solve a wide variety of everyday technology issues, encountered by researchers (i.e. scraping data, extracting text from images, visualizing large datasets)<p>- Work with our product manager, developers, designer and users across the full software lifecycle: requirements, design, development, releasing and maintenance<p>---<p>Basic Qualifications:<p>- Bachelor&#x27;s degree and 1 year of demonstrated hands-on experience OR a high school diploma and 2 years of demonstrated hands-on experience. (Experience through previous employment positions, internships, or practicums, with the following (in order of preference):<p>- Web backend development (flask &#x2F; Django &#x2F; similar preferred)<p>- Data cleaning and analysis tools (pandas preferred)<p>- Experience with the linux command line<p>- Familiar with git and workflows for collaboration (GitFlow, Github Flow or similar)<p>- Experience working within an agile software development cycle<p>Here are the full details: <a href=\"https:&#x2F;&#x2F;gist.github.com&#x2F;makmanalp&#x2F;d95292bfd68842fbaad995ef53901cc2\" rel=\"nofollow\">https:&#x2F;&#x2F;gist.github.com&#x2F;makmanalp&#x2F;d95292bfd68842fbaad995ef53...</a><p>Contact: cidatlas [at] hks [dot] harvard [dot] edu , preferably with work samples that demonstrate best practices","time":1509554171,"type":"comment"}