{"by":"cosenal","id":15601932,"parent":15601729,"text":"Yieldify | Software Engineer, Data Engineer, SDET | London | Onsite | Full-time | <a href=\"https:&#x2F;&#x2F;www.yieldify.com&#x2F;careers-at-yieldify&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.yieldify.com&#x2F;careers-at-yieldify&#x2F;</a><p>Yieldify is a MarTech company that helps e-commerce marketers generate more sales by making it easy for them to optimise their customer journeys.<p>We launched our new Yieldify Conversion Platform one year ago and to date, we&#x27;ve delivered over 50,000 campaigns for over 500 brands on more than 1,000 websites globally, which include some of the  world&#x27;s most recognisable brands, including Marks and Spencer, Domino’s Pizza, Omni Hotels and Anthropologie.<p>We work on weekly sprints and we ship code into production on a weekly basis; As the engineer team works very closely with the product team, you will be encouraged to influence the product roadmap. We work with a dedicated DevOps team to manage infrastructure, deployments and CI systems.<p>Among fun perks, we host biweekly tech talks on a wide variety of subjects (recent examples: Ethereum, SimHash) and some of us have started a Category Theory study group. Did I mention we are trying to bootstrap our own football team? :)<p>We are looking for engineers with experience in relevant industries and a versatile knowledge of languages used in data-intensive applications. We aim at producing a very stable and high quality platform, so passion with testing of all kind is a big plus for the ideal candidate.<p>The main stack and the newest services are in Typescript, most of the frontend is in Angular 4, whereas the data pipeline is written in Go&#x2F;Python and Hadoop&#x2F;Spark. Almost everything here is Docker-ized and the deployment of all the services is fully on AWS.<p>For more details on the data engineer position, feel free to DM me on Twitter. For all other positions you can email Cerian at cerian.thomas@yieldify.com (please mention HN).","time":1509549313,"type":"comment"}