{"by":"perf_aficionado","id":15601853,"parent":15601729,"text":"Varnish Software | Software Engineer | NYC, London, Oslo (remote possible) | www.varnish-software.com<p>Varnish Software is the company behind Varnish Cache, a widely recognized open source HTTP proxy that significantly enhances web performance and enables digital content delivery. Varnish Cache has experienced tremendous growth since its inception and currently powers more than 2.8 million websites globally.<p>Varnish Software works with top global enterprises helping them use Varnish Cache to increase web performance and to build private CDNs, consumer CDNs, and advanced edge platforms. Over 100 top global brands and enterprises trust Varnish Software in helping them meet their application performance and content delivery needs. Varnish Software maintains its own proprietary branch of Varnish Cache and a line of Varnish based products and solutions.<p>At Varnish Software, we take pride in our software and products and we value innovation. We strive to hire team members who share these values. We offer an open, honest, and international culture in a laid back and stimulating work environment. You will be working with some of the most brightest and talented people in the industry. We offer competitive salaries, full benefits, generous vacation time, and company equity.<p>We are currently looking for a Software Engineer to join our teams in NYC, London, and Oslo. Remote will also be considered.<p>Job description:<p>* Create, develop and maintain Varnish products and solutions<p>* Provide technical guidance and industry best practices to customers<p>* Interact with prospects during the sales process<p>* Hacking on various projects (side projects encouraged)<p>* International travel for customer meetings, conferences, and office workshops<p>Desired skills and experience:<p>* Experience with Varnish Cache and VCL<p>* Experience with C, scripting languages, Linux programming<p>* Good understanding of TCP and HTTP protocols and \ntroubleshooting tools<p>* Comfortable explaining technical solutions and details to a non-technical audience<p>* Public speaking or writing experience is a plus<p>To apply, please send your resume or questions to jobs@varnish-software.com","time":1509548987,"type":"comment"}