{"by":"boomkat","id":15601774,"parent":15601729,"text":"Boomkat | Freelance | Manchester, UK or REMOTE | Full Stack Developer<p>We are an established online music store (<a href=\"https:&#x2F;&#x2F;boomkat.com\" rel=\"nofollow\">https:&#x2F;&#x2F;boomkat.com</a>) specialising in experimental music. We’re currently in the process of building a new platform in order to deliver the best possible experience for our customers.<p>Encompassing a download store and ecommerce functionality for our physical sales, it’s a sizeable project. With over 100,000 customers and millions of releases, we operate at a scale which represents some unique challenges and opportunities. Our goal for the new platform development is to enhance our customer experience; making full use of data we house to help customers discover new music through an interface that’s beautiful and engaging. This will lay the foundations for an exciting second phase where we plan to break new ground in delivering novel and unexpected interactions with our music.<p>The new website is built in Ruby on Rails, and uses React.js and Redux heavily on the front end. The process of ingesting, analysing and preparing content is handled by a series of Node.js based micro-services.<p>We’re a small, fast moving team with a wide range of skills. We’re based in Manchester, with a number of team members working remotely. We’re looking for a skilled, detail oriented Javascript developer to join us.<p>Someone who would enjoy this role will have:<p>- A thorough understanding of React and Redux, and working knowledge of Ruby on Rails.<p>- Good working knowledge of responsive design processes and techniques and common tools such as Bootstrap 4<p>- Experience delivering cross-platform applications for the web; particularly in a mobile environment.<p>- Plenty of experience writing well structured and tested code, in a continuous delivery process.<p>- An ability to work quickly, whilst still maintaining a robust and stable codebase.<p>This is a freelance position with an optional retainer agreement.<p>How to Apply<p>If you’re interested please get in touch with us at bang@boomkat.com - please include your CV, Github link, average day rate, etc.<p>thanks!","time":1509548653,"type":"comment"}