{"by":"dwolfand","id":15602381,"parent":15601729,"text":"United Income | FinTech Startup | Full Stack Engineer - Node and&#x2F;or Python background | Onsite in Washington, DC | Full Time<p>We’re hiring! United Income is a fintech startup looking to add engineering talent to our team. Email us at <i>engineering@unitedincome.com</i> if this describes you.<p>• Do you care about delivering quality product to your users?<p>• Is providing maintainable, tested code to your fellow engineers (and future self) important to you?<p>• Do you have a deep understanding of Javascript or Python?<p>• When you encounter a problem that isn&#x27;t neatly packaged and fully defined, are you passionate about digging into it and refining a solution?<p>If you can answer yes to these questions, you&#x27;ll find working here exciting and engaging.<p>At United Income, we value collaboration. We encourage one another to build phenomenal things, and individually we’re all passionate about doing our best work. You&#x27;ll be responsible for solving some hard problems in consumer finance. As you tackle these problems head on, you&#x27;ll work with others across the company to make sure you have all the information you need.<p>Some of our engineering roles involve cool mathematical modeling. If you can engineer and you also have fun thinking about math, we have some opportunities for you that can be difficult to find in standard engineering jobs.<p>We are committed to equal opportunity and diverse hiring. Even more important than hiring is supporting our diverse team, and we are dedicated to equitable pay and transparency.<p>As you know, this industry moves FAST. If you have 10 years of Node.js experience...well we think you’re lying ;) We don&#x27;t expect you to be familiar with our entire tech stack (buzzwords: Javascript&#x2F;Python&#x2F;React&#x2F;AWS&#x2F;CI&#x2F;CD&#x2F;Git). What’s important is your willingness and ability to learn. We want to see your curiosity and passion for what’s out there.<p>At United Income, you&#x27;ll have access to a great benefits package:\n• 100% employee coverage and 60% dependent coverage for our reference plan on DC Health Link, dental insurance, and vision insurance<p>• HSA contributions ($500 individual&#x2F;$1000 family) - high deductible plan required (this is included in our reference plan)<p>• Short Term Disability and Life insurance<p>• 21 days&#x2F;4 weeks paid vacation per year<p>• 401k plan with matching<p>• Gym, rooftop terrace, in-building showers, bike storage<p>• Up to 4 weeks annual paid parental&#x2F;family leave<p>• Close to DC’s Red&#x2F;Blue&#x2F;Silver&#x2F;Orange lines","time":1509551347,"type":"comment"}