{"by":"muchbetterguy","id":15601865,"parent":15601729,"text":"Much Better Adventures | Fullstack + Frontend + UX + PM jobs | Full-time REMOTE (EU only) or ONSITE (London, UK.) \n| <a href=\"https:&#x2F;&#x2F;www.muchbetteradventures.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.muchbetteradventures.com</a><p>We&#x27;re a curated adventure travel marketplace looking to expand the team after investment.<p>We are looking for fullstack and frontend engineers to work on our current [Python&#x2F;Django&#x2F;React stack][1]<p>We are also looking for a lead product manager and lead product designer&#x2F;UXer (first PM + UX hires) to whip us into shape.<p>Pay will be in the region of £40-60k for all roles, with 25 days holiday, plus the terrible task of testing out a few of our adventure trips each year.<p>On top of the job specific skills, We&#x27;re looking for people who are into adventure travel and the outdoors: We all ski&#x2F;snowboard&#x2F;surf&#x2F;cycle&#x2F;run&#x2F;paddle&#x2F;hike in our spare time. We also understand if the surf&#x27;s up or it&#x27;s dumping and you might be late to work that day ;-)<p>Full job descriptions&#x2F;application forms are in the works, the November &quot;Who is Hiring&quot; came round too fast to get them done in time.<p>If you&#x27;d like to be considered, please send me an email: guy+novwhoishiring@mbad.co with your linkedin&#x2F;cv&#x2F;website attached.<p>Subject line should be &quot;Frontend job&quot; &#x2F; &quot;Fullstack job&quot; &#x2F; &quot;PM job&quot; &#x2F; &quot;UX job&quot;<p>Please ensure you tick the following boxes before emailing:<p>- Can live &amp; work within the EU &amp; can get to London once per month pretty easily (within half a day!)\n- If not UK based, can work as an independant contractor in your country.\n- Fluent level of English.\n- Love adventure travel.\n- At least 3 years experience in the relevant field.<p>[1]: <a href=\"https:&#x2F;&#x2F;stackshare.io&#x2F;much-better-adventures&#x2F;much-better-adventures\" rel=\"nofollow\">https:&#x2F;&#x2F;stackshare.io&#x2F;much-better-adventures&#x2F;much-better-adv...</a>","time":1509549052,"type":"comment"}