{"by":"pierre","id":15609015,"parent":15601729,"text":"AXA Tech Lab | Generalist Software Developer | Lausanne | Switzerland<p>AXA Technology Services Advanced Engineering Lab (AEL) is located on the EPFL campus in Lausanne (Switzerland). AEL was created in 2014 to contribute to a global strategic program of digital transformation at AXA Group level. AEL is not only an innovation lab but also, and above all, an engineering team helping AXA entities to “test and learn” their digital “ideas”. We respect the “learning by doing” rule and believe we have the right to fail: we can make mistakes and learn from them in order to capitalize knowledge for the next try. Our projects span from IT related topics, to Internet of things, robotics, drones and many other web&#x2F;mobile initiatives. Our mission is to transform an idea into a first stage of execution. Once the feasibility and the value for users is confirmed, we transfer the project to industrialization teams.<p>To reinforce our software engineering team, we are looking for an experienced software engineer, highly motivated and very aware of trends and groundbreaking startups.  Years of experience is not what matters. We will value passion, openness, curiosity, respect, engagement, a “big picture vision” and for sure, someone who loves coding! We don’t intend to “play” with technology, but we do really seek for impact.<p>The ideal candidate will have previous startup (or intrapreneurship) experience, a wide and good understanding of technologies but also of a sense of business impacts and strategy.\nWe expect you to be autonomous and able to learn. The projects duration spans from 1 week to 4-5 months. Be ready to switch regularly: new field, new technology, new methodology, … and adapt to the new situation.<p>Skills\n• Excited about building software prototypes.\n• Excited about learning new technologies on short notice.\n• Passionate about technology.\n• Visionary about new technology applications\n• Nice to have: experience with drones, robots, IoT, security, blockchains, crypto, VR or AR<p>Soft skills\n• Excellent written and verbal English communication. You will do most of your writing in English. Speaking will be English (mandatory) or French.\n• Nice to have: fluent in Hindu or Mandarin or German.\n• Ability to challenge others and challenge him or herself\n• Ability to work in an international and cross functional team\n• Demonstrating openness and curiosity\n• Considering new challenges as an opportunity\n• See solutions before problems\n• Startup experience<p>In general, we are looking for someone with raw smarts who can easily learn the specific skills needed to do his&#x2F;her job.<p>Send your CV, or inquiries to alexandre.delidais@axa-tech.com","time":1509616354,"type":"comment"}