{"by":"dhairya","id":15614583,"parent":15601729,"text":"Allen Institute for Brain Science | Seattle, WA | Full-time | ONSITE | <a href=\"https:&#x2F;&#x2F;www.alleninstitute.org&#x2F;what-we-do&#x2F;brain-science\" rel=\"nofollow\">https:&#x2F;&#x2F;www.alleninstitute.org&#x2F;what-we-do&#x2F;brain-science</a><p>Director - Knowledge Engineering<p>The Allen Institute for Brain Science is launching an exciting knowledge engineering initiative to re-structure and map our vast quantities of data into a unified schema and develop a knowledge graph. This initiative will lay the technical foundation to support supervised and unsupervised content discovery, enable data mining, and facilitate interactive modes of engagement with our data corpus. A new team, Knowledge Networks, is being established to spearhead the implementation of this initiative. This is a unique opportunity to partner with world-class researchers in the creation of unprecedented knowledge discovery tools.<p>We are seeking an exceptional person to lead the Knowledge Networks team. Our ideal candidate will have a proven track record of leading the implementation of data engineering initiatives, a solid understanding of data modeling and schema design, and a record of on-time delivery of technology products. This person should have a passion for innovation, a willingness to get their hands dirty, and the enthusiasm and ability to plan and realize a long-term strategy. The Director will be responsible for building and leading a small implementation team that will collaborate with an interdisciplinary group of technologists and neuroscientists to mature the knowledge engineering initiative at the Allen Institute for Brain Science.<p>Apply here: <a href=\"https:&#x2F;&#x2F;alleninstitute.hrmdirect.com&#x2F;employment&#x2F;job-opening.php?req=619943&amp;&amp;cust_sort1=29268&amp;&amp;nohd#job\" rel=\"nofollow\">https:&#x2F;&#x2F;alleninstitute.hrmdirect.com&#x2F;employment&#x2F;job-opening....</a><p>I&#x27;m providing consultation support to launch the Knowledge Engineering initiative and director search. My email is in my profile. Feel free to reach out if you have questions!","time":1509659263,"type":"comment"}