{"by":"wjt","id":15611547,"parent":15601729,"text":"Endless | Full-time | ONSITE or REMOTE (depends on role) | San Francisco, CA; Taipei, Taiwan; anywhere (depends on role)<p>See all roles and apply here: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;endless\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;endless</a><p>More info here: <a href=\"https:&#x2F;&#x2F;endlessos.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;endlessos.com&#x2F;careers&#x2F;</a><p>We did a Reddit AMA recently: <a href=\"https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;IAmA&#x2F;comments&#x2F;75pu2j&#x2F;we_are_endless_and_we_are_building_an_open_source&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;IAmA&#x2F;comments&#x2F;75pu2j&#x2F;we_are_endless...</a><p>Endless develops Endless OS, a Debian-based operating system that brings a powerful desktop experience to all. Designed for emerging markets, where access to computers and the internet are limited, it combines ease of use with a wide variety of free, powerful software for learning, productivity and recreation, making it the perfect fit for families everywhere.<p>We don’t just ship a comprehensive set of standard desktop apps (web browsing, office productivity, media production, games etc), but also what we call “knowledge apps”, which provide offline guidance for all manner of areas including cooking, water sanitation, health, exercise, and more. It&#x27;s easy to support and relatively resistant to malware because the base OS is released as a read-only atomic snapshot using OSTree with sandboxed applications distributed with Flatpak. <a href=\"https:&#x2F;&#x2F;ostree.readthedocs.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;ostree.readthedocs.io&#x2F;</a> <a href=\"http:&#x2F;&#x2F;flatpak.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;flatpak.org&#x2F;</a><p>We&#x27;re hiring in a few areas: design; distributed systems (the offline content pipeline); DevOps; Linux distro tooling; Linux kernel; QA; and more. The team is itself distributed around the globe; some of these roles are based in our San Francisco or Taiwan offices, while others are elsewhere or remote.","time":1509638346,"type":"comment"}