{"by":"afej","id":15641458,"parent":15601729,"text":"Culver City, Los Angeles, CA - Onsite - Sr. Frontend Engineer<p><a href=\"https:&#x2F;&#x2F;www.jsco.re&#x2F;1lg0x\" rel=\"nofollow\">https:&#x2F;&#x2F;www.jsco.re&#x2F;1lg0x</a><p>Senior Frontend Engineer<p>At SnackNation, we take snacking seriously. We’ve partnered with many of the most innovative brands in snacking, inspired by their drive to create healthier options for everyone. We also take technology seriously, and we’re looking for experienced individuals to help our growing, talented team of technologists build the future of SnackNation and bring that same level of innovation to help us deliver these snacks across the country. As a subscription company shipping snacks to thousands of companies throughout the US (from startups to Fortune 100 and everywhere in between), we have many moving parts that all work together so each office receives the best snacks at the best time. The Technology team at SnackNation is the glue that brings everything together. We’re a service oriented team aimed at driving the success of our members and our employees with thoughtful, robust, reliable solutions that save them time and simplify their workday.<p>---<p>Engineering @ SnackNation<p>You’ll join SnackNation as a member of the Engineering discipline of the Technology team. Technology is a multi-discipline team with diverse goals. We work together to share knowledge and provide inter-discipline support to ensure the team collectively crushes their goals. We recognize individual achievement and we celebrate as a team.<p>As a member of Engineering, you’ll work closely with your Product Manager and fellow engineers to understand requirements and design well thought-out solutions. You’ll also foster relationships throughout the company to have direct contact with your internal users and those closest to our external users. We primarily work in Ruby, Python, and Node and host our systems in Heroku and AWS. Engineering operates on nine day sprints, with the expectation that all commitments are consistently completed during those nine days. On the tenth day, we demo our work and then you’re left to fill the rest of the day with whatever you feel is most important. Code is managed and reviewed in GitHub, work is managed in JIRA, documentation is in Confluence, communication is through Slack, and we’re big fans of JetBrains tools. TeamCity is the best continuous integration software, so we lovingly use that to keep us honest. We also love open source and encourage contributing back.<p>We believe in the right tool for the job, so we have closed source systems that keep our business running smoothly such as Salesforce, Zuora, NetSuite, and ZenDesk. You’ll work alongside the administrators of these systems and integrate with them via the SnackNation API.","time":1510036639,"type":"comment"}