{"by":"dougzor","id":15644544,"parent":15601729,"text":"TetraScience | Lead Backend Engineer, Lead DevOps Engineer, Full-Stack Engineer | $100k - $160k + equity | Boston | ONSITE | <a href=\"http:&#x2F;&#x2F;tetrascience.com\" rel=\"nofollow\">http:&#x2F;&#x2F;tetrascience.com</a><p>TetraScience is a Boston-based SaaS company and rapidly growing startup that is applying the Internet of Things (IoT) playbook to lab research. We build both hardware and software components that allow research organizations to connect their existing lab instruments to a single online dashboard where they can coordinate experiments, monitor equipment parameters, and manage experimental data. With the insights and extra control provided by TetraScience, research organizations can more intelligently plan for future research cycles thereby alleviating equipment and process bottlenecks. In short, our goal at TetraScience is to use IoT to reduce the cost of doing science and while simultaneously increasing researcher efficiency overall.<p>Because our goal at TetraScience is to effect industry-wide change, we have intentionally built a team of passionately curious engineers of diverse backgrounds who support science and value scientific advancement. As a result, our team is an excellent counter-example to the claim made by Jeffery Hammerbacher the founder of Cloudera when he said “The best minds of [our] generation are thinking about how to make people click ads.” In a time when aspects of common consumer technology has created problems like filter bubbles and fake news, TetraScience empowers researchers to seek truth from fact.<p>We looking for a several roles in engineering: a Lead Backend Engineer, a Lead DevOps Engineer and a Full-Stack engineer to join team who love to build, who share our interest in facilitating scientific advancement, and who want to be an early and significant contributor to such an ambitious and impactful venture. See these and all of our available roles here: <a href=\"https:&#x2F;&#x2F;tetrascience.workable.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;tetrascience.workable.com&#x2F;</a> or email me directly dmorgan[at]tetrascience[dot]com.","time":1510071025,"type":"comment"}