{"by":"u0112358132134","id":15699786,"parent":15601729,"text":"Stylindex | Full Time | ONSITE | London, UK | £40k - £55k | <a href=\"https:&#x2F;&#x2F;stylindex.com\" rel=\"nofollow\">https:&#x2F;&#x2F;stylindex.com</a> | Front End Developer<p>Stylindex is a funded startup that&#x27;s just graduated from Techstars London. We are building a premium-talent discovery platform focused on the fashion industry - however our plans stretch well beyond this. We&#x27;ve got great connections, some awesome first clients and a heck of a lot to keep you busy!<p>We are keen to hire an experienced, curious, and enthusiastic team member to build something beautiful and functional.<p><i></i><i>This may be your dream job if you:</i><i></i><p>* Have a sense of what is &#x2F; isn&#x27;t good design and know how to go from one to the other<p>* Value beauty and delightful interactions in design.<p>* Have a strong background in front-end development environments (bonus points for full-stack exposure though you don&#x27;t need to be a full stack engineer)<p>* Love to learn new technologies fast and to pivot as our team evolves our projects<p>* Are passionate about subtle interactions that lead to delightful, memorable experiences.<p>* Pride yourself in building reusable assets that can be used in the future<p>* Love to work with open source software<p>* Are self-led but highly aligned with your team; we develop fast, and align daily.<p>* Desire to be constantly learning new things and can make impactful decisions about new technology.<p>* Love to geek out and has opinions on things like npm vs bower<p><i></i><i>Hopefully you’re comfortable with these:</i><i></i><p>- Javascript (and have dabbled in any of Vue, Angular, React)<p>- HTML5 and CSS.<p>- Cloud computing platforms, e.g. AWS, Google Compute Engine.<p>- Git for source control.<p>- The right technologies for the problem at hand. We&#x27;re flexible and open to change.<p>Please note we cannot sponsor visas to work in the UK.<p><i></i><i>Apply</i><i></i><p>If this is you, please reach out to me (Aaron) at hnjobs@stylindex.com with a link to your portfolio and a little bit about you.","time":1510698416,"type":"comment"}