{"by":"browseatwork","id":12206273,"kids":[12250666],"parent":12202865,"text":"TokBox | San Francisco, CA &#x2F; London, UK | Onsite | Engineering, Business Development, Product, Marketing - DevOps, Media Communications Software Engineer, BizDev Managers in 1) Healthcare and 2) EdTech, Product Managers for 1) the Platform, 2) Vertical Solutions, and 3) Developer Experience, and a Product Marketing Manager<p><a href=\"https:&#x2F;&#x2F;tokbox.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;tokbox.com&#x2F;</a><p>TokBox does embedded communications powered by WebRTC. We make it easy for developers to embed real-time video, voice, and more into their applications and websites. Want to build the functionality of Google Hangouts, Skype, or Facebook Live? Use us! We build a platform and SDKs, and have great clients from individual developers to massive players in tech, entertainment, education, and many other industries (customers include Mozilla, the Minerva Project, Chegg, esurance, Major League Baseball, Double Robotics, and Fox Sports). We were acquired by Telefonica 4 years ago. It hasn&#x27;t changed the culture much, and has helped us reach more customers around the world.<p>The product is industry leading, but the people make this place where I work. It&#x27;s an awesome group of 100 or so people- nice, smart, skilled. We are laid back and have a sense of humor. Minimal politics. Good salary and benefits in a relaxed, enjoyable environment.<p>We&#x27;re looking for someone with product and&#x2F;or marketing experience to be a product marketing manager. In engineering, we’re looking for experienced DevOps and media focused backend engineers to keep things up and running and build our robust, low-latency media server. In product, we’re looking for someone to head the platform, a product manager who wants to identify and build the right things for specific industries, and a PM to bolster our developer experience. In BD, we’re looking for people with experience in either healthcare or education for business development.<p><a href=\"https:&#x2F;&#x2F;tokbox.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;tokbox.com&#x2F;careers</a><p>or<p><a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3ZMiQhwF\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3ZMiQhwF</a><p>Come join us!","time":1470087735,"type":"comment"}