{"by":"ltrecruit1","id":12203286,"parent":12202865,"text":"​Lending Tree, Inc. | Charlotte, NC | ONSITE | <a href=\"https:&#x2F;&#x2F;www.lendingtree.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lendingtree.com</a> Email us at: jobs@lendingtree.com<p>Must be local or willing to relocate<p>Who we are: LendingTree, Inc. empowers consumers with information, tools, advice, products and services for critical transactions and financial decisions in their lives.<p>Specifically - We&#x27;re looking for:<p>Back-end Developers:<p>You&#x27;re a crack-shot in your back-end language of choice. Our system matches users with hundreds of possible opportunities in real-time. Needless to say, we&#x27;re looking for people who care about performance. A lot. Our back-end systems are written in C#, Java using Redis, Mongo, and SQLServer. You might know C# or Java or you might not, but either way you&#x27;re willing to learn. Regardless, you can impress us in your language of choice. You understand algorithms matter. You also understand sloppy database access could make that ugly n^2 algorithm look absolutely blazing fast.<p>You love to code. You&#x27;ve built stuff. Stuff you can show us. Stuff you can&#x27;t wait to show us. You know the right technology implemented the right way matters.<p>We&#x27;re looking for both Senior and Junior back-end engineers. If you&#x27;re a Senior Engineer - you&#x27;ve worked in server-side code for a few years. You&#x27;ve scaled to thousands or maybe millions of users.<p>If you&#x27;re a Junior engineer, you love to code and you&#x27;re good at it. You&#x27;re smart, You&#x27;re passionate, and most of all you can&#x27;t wait to get started. (New grads please apply!)<p>Where we are:<p>Charlotte, NC. If you&#x27;re into great weather and a central location (our airport is an American hub) you should check us out. You can pick great urban living (Uptown&#x27;s 4th ward is the place to be) or get yourself a huge house (at reasonable prices) in the burbs. The standard of living for an engineer doesn&#x27;t get any better than this.","time":1470066254,"type":"comment"}