{"by":"joshmaker","id":12203373,"parent":12202865,"text":"The Atlantic | Washington DC | Full time onsite | \n<a href=\"http:&#x2F;&#x2F;www.theatlantic.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.theatlantic.com&#x2F;</a> | <a href=\"http:&#x2F;&#x2F;www.citylab.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.citylab.com&#x2F;</a><p>The Atlantic is a digital-first media company with over 150 years of history and millions of online visitors a month. Founded in 1857 and today one of the fastest-growing media platforms in the industry, The Atlantic has throughout its history championed the power of big ideas and continues to shape global debate. We work in a fast-paced, team-oriented environment out of our office in the historic Watergate complex in Washington DC.<p><i>Our tech stack includes</i>: - Django - GitHub - Jenkins - NewRelic - Nginx - Percona - SCSS - Slack - uWSGI<p>-<p><i>DevOps Engineer</i><p><a href=\"http:&#x2F;&#x2F;atlanticmedia.applytojob.com&#x2F;apply&#x2F;y5d1GQ&#x2F;DevOps-Engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;atlanticmedia.applytojob.com&#x2F;apply&#x2F;y5d1GQ&#x2F;DevOps-Engi...</a><p>We are looking for a talented and knowledgeable DevOps engineer who is passionate about infrastructure and automation. We’re looking for a fast learner who can figure things out independently and show us a better way of continuously deploying complex systems to the web. The DevOps engineer would also work with the corporate IT team as we move to automate server provisioning and configuration management using Puppet.<p><pre><code>  * Experience deploying high volume Python applications; knowledge of Nginx and uWSGI configuration is a definite plus\n  * Familiarity with automation tools such as Puppet and Ansible\n  * Deep knowledge of Linux internals, tuning, and troubleshooting\n  * Experience mitigating and preventing DDOS and other attacks\n  * Familiarity with Git and version control\n</code></pre>\n-<p><i>Backend Python &#x2F; Django Web Developer</i><p><a href=\"http:&#x2F;&#x2F;atlanticmedia.applytojob.com&#x2F;apply&#x2F;7yGH9y&#x2F;Backend-Python-Web-Developer\" rel=\"nofollow\">http:&#x2F;&#x2F;atlanticmedia.applytojob.com&#x2F;apply&#x2F;7yGH9y&#x2F;Backend-Pyt...</a><p>We&#x27;re looking for a developer who is passionate about clean code and great journalism, to work with our product team to implement and deploy new features to TheAtlantic.com and CityLab.com where they will be viewed by millions of people.<p><pre><code>  * Able to communicate well with both a technical or non-technical audience\n  * Has developed and deployed into production a non-trivial Django application\n  * Has written Python code on a team in a professional setting\n  * Knowledgeable about Python best practices including PEP8, unit testing, and documentation\n</code></pre>\n-<p><i>Benefits</i>: Employees at The Atlantic are entitled to benefits including: 401(k) savings plan with employer match, health care with domestic partner coverage, flexible vacation and sick leave policy, commuter benefits, and rooftop happy hours with one of the best views in DC.","time":1470066781,"type":"comment"}