{"by":"chrisbrookins","id":12207293,"parent":12202865,"text":"Help Scout | Site Reliability Engineer | REMOTE | helpscout.com\nApply at <a href=\"https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;171036\" rel=\"nofollow\">https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;171036</a><p>YOUR IMPACT\nAs Help Scout&#x27;s first dedicated Site Reliability Engineer you will own and define the best practices, tools and automation to ensure our fast growing SaaS provides high availability while increasing engineering velocity. Your work will empower more than 6,000 businesses around the world to deliver a great customer support experience. This is a critical role that will influence every engineer in the company and directly impact our customer&#x27;s satisfaction.<p>ABOUT THE ROLE\nWe are looking for an experienced Site Reliability Engineer to build sophisticated continuous delivery and test automation to keep our AWS-based services highly available and fast while increasing the engineering team&#x27;s velocity.\nHelp Scout engineering is 24 full time engineers organized into 6 teams. You will be a member of a small team with one engineer focused on continuous delivery (CD) pipelines, and 3 engineers focused on our AWS infrastructure and operations. Working with your team, you will partner with our feature delivery teams to build any automation they need to improve site reliability and velocity.\nYou will be responsible for working on our three biggest site reliability priorities: four 9s high availability, continuous delivery and test automation. You will own the implementation and roadmap planning for improvements to our automation, tools and tests to support these priorities. The majority of your time will be spent building or implementing continuous delivery, test and self-healing automation and supporting tools. You will be a key internal champion for any and all changes to make our production environments more resilient, scalable, and performant.\nYour potential projects will include expanding our CI pipeline across all teams, testing and implementing auto-scaling groups, expanding our test automation (smoke, stress, chaos monkey, etc), and enhancing the velocity of our CI pipeline (parallel tasks, containers, etc).\nThis is not a primary on-call position. However you should expect to be called upon if services you own such as CD pipelines or test automation fail and primary on-call team members can&#x27;t resolve the issue.\nOur 100% remote engineering team spends most of their time in Slack and Github. Engineers can focus for long stretches with typically only 2 scheduled meetings a week (one with your team and one with your manager). Engineers write their own automated unit and integration tests, and use our CI pipeline to release code to production several times a day. You can read more about our culture and how our remote team stays agile at <a href=\"https:&#x2F;&#x2F;www.helpscout.net&#x2F;blog&#x2F;agile-remote-teams&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.helpscout.net&#x2F;blog&#x2F;agile-remote-teams&#x2F;</a><p>Apply at <a href=\"https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;171036\" rel=\"nofollow\">https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;171036</a>","time":1470101232,"type":"comment"}