{"by":"maxwell","id":12203103,"parent":12202865,"text":"Crater (<a href=\"https:&#x2F;&#x2F;crater.co\" rel=\"nofollow\">https:&#x2F;&#x2F;crater.co</a>, <a href=\"https:&#x2F;&#x2F;gosurveybot.com\" rel=\"nofollow\">https:&#x2F;&#x2F;gosurveybot.com</a>) | Rohnert Park, California; Belgrade, Serbia; REMOTE U.S. or Serbia | Front End Software Engineer and Mobile Software Engineer<p>We&#x27;re bringing video chat and image recognition to business-to-consumer communication. We have major traction in our first vertical, working with some of the biggest moving&#x2F;storage&#x2F;relocation companies in the world.<p>We&#x27;re seeking 1) a creative, collaborative front-end software engineer experienced with complex animation to lead development of our user-facing web sites and contribute to the client-side portion of our web apps. You&#x27;ll be working closely with our lead designer, crafting elegant, responsive web experiences.<p>Relevant experience:<p>* HTML, CSS, and JS<p>* Web animation and data visualization<p>* JS libraries, such as jQuery, Lo-Dash, and React<p>* Bootstrap<p>* PHP &#x2F; WordPress<p>And 2) a creative, collaborative mobile software engineer to lead development of the next version of our main iOS app, as we transition off our MVP. We have a solid foundation of the video chat core, but are looking to extend the iOS app to include more functionality in parity with our web app. We&#x27;ll be starting development of our first Android app later this year; currently we have a web app for Chrome for Android. Bringing some of your own ideas to the table is very much encouraged: we do have solid, clear requirements and use cases, but we move very quickly.<p>Relevant experience:<p>* Swift, Objective-C, Java<p>* WebRTC<p>* Twilio &amp; TokBox APIs<p>You&#x27;ll have freedom to decide which tools to use and to learn new things, but you must be able to work in a team setting and respond well to constructive criticism. We move fast, and expect world-class work from everyone on our team.<p>We&#x27;re currently only able to consider candidates authorized to work in the United States or Republic of Serbia.<p>Send a short note about what interests you about the position, along with a resume&#x2F;CV and links to projects you&#x27;ve worked on, to max@crater.co.","time":1470065210,"type":"comment"}