{"by":"stunder","id":12204910,"kids":[12205240,12205492,12205287,12220120],"parent":12202865,"text":"Hart (<a href=\"http:&#x2F;&#x2F;hart.com\" rel=\"nofollow\">http:&#x2F;&#x2F;hart.com</a>) | Application Support Engineer | Anaheim, CA | Full-time, onsite<p>OK its Eric from Hart.  I post in the HN forum every month and have found some great people.  Here is the deal our hiring process is to have a phone interview, a culture fit, and a code challenge.  We require everyone do a challenge no matter what the position is (even the chef).   Here are some of the perks we offer.<p>* 100% Medical, Dental and Vision coverage for you and your family\n* Unlimited Vacation Policy\n* Paid Paternity and Maternity Leave\n* 401k Match up to 7% of annual salary\n* Life Insurance\n* AD&amp;D Insurance\n* Educational Reimbursement\n* Gym Membership\n* Advancement Program - Hart University\n* 15” MacBook Pro, Thunderbolt Display, Magic Mouse and Keyboard\n* Noise cancelling Headphones\n* Stocked kitchen with coffee, drinks, and snacks\n* Daily catered team lunches<p>Thats just the stuff off of the website.  I there are so many more that you really only get to witness by working here.   Listen I am just a DevOps guy if you would like to work here feel free to send me your resume eric@hart.com. or you can check the job link <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;gkdm0r\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;gkdm0r</a><p>We are looking for a Application Support Engineer to assist in supporting external clients. The support engineer will be responsible for working directly with external clients and internal teams to report and troubleshoot technical issues.  This person must have great communication skills and be able to work in a timely manner under urgent situations that require immediate solutions. The support engineer needs to have a solid understanding of development principles and languages, including both front and back end technologies. This job will require somebody who is able to work outside of standard business hours as well as on call hours.","time":1470077506,"type":"comment"}