{"by":"xfiler","id":12204057,"parent":12202865,"text":"Kontena, Inc. | Multiple positions | Full Time | New York, Silicon Valley, Helsinki<p>Want to join a fast-paced, rapidly growing startup that’s disrupting a multi-billion-dollar industry? \nThat’s what we’re doing here each day at Kontena. We are creating the leading open source container and \nmicroservices platform, delivering the most developer friendly solution to organizations all around \nthe world. We thrive on providing products that help software developers, IT Operations, DevOps teams, \nand application owners to build, ship and run software on any cloud platform without hassle.<p>Roles we’re hiring for include:<p>- Product Marketing Manager: We are looking for an extraordinary Product Marketing Manager for Kontena. In this role you will own product &amp; competitive positioning, sales enablement, market &amp; competitive analysis, product launches, customer development, community engagement and more.<p>- Community Manager: We are looking for an enthusiastic Community Manager for Kontena. The primary objective for this role is to create a great community experience with programs and processes that scale as the community grows. We’re looking for a dynamic, broadly-connected, high-energy face for the Kontena community, who can help the community get answers to a breadth of questions, encourage community activity and diversity, and build a program for recognizing the rockstars. You are a fearless relationship builder and technically proficient enough to be credible in the eyes of our technical community members.<p>- Solution Architect: Solution Architect works as a member of Kontena’s Professional Services Team and engage with existing and prospective customers. As the Kontena Solutions Architect, you will consult and engage with our clients and partners. The typical engagements range from setup assistance, configuration, and troubleshooting to technical training workshops. We have multiple positions open to support our clients throughout the USA and Europe. We are seeking exceptional individuals with strong client consulting experience.<p>- Software Developer - Platform: We are looking for a skilled developer with a passion to container technologies and make-it-happen mindset. You will be part of Kontena’s core development team creating a platform that will be a foundation for organizations to run their containerized workloads around the world. You will participate in all phases of our product development: designing, prototyping, implementing, testing, and documenting. The ideal candidate has experience with container technologies, various cloud platforms, APIs and high availability solutions development.<p>- Software Developer - Frontend: Since we work with all the latest tools, most advanced frameworks and wide array of cutting-edge web technologies, we want someone who is excited to try new things and enjoy technical challenges. The tools and technology we create should be as beautiful and easy to use as the world&#x27;s best designed websites. With a world-class design team, we&#x27;re able to create astonishing interfaces. Our frontend developers and designers take pride in their craft and ship UIs that are pixel perfect and expertly engineered.<p>Check more details at <a href=\"https:&#x2F;&#x2F;www.kontena.io&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kontena.io&#x2F;jobs</a><p>CONTACT: jobs@kontena.io","time":1470071080,"type":"comment"}