{"by":"ardenpm","id":12206383,"kids":[12222422],"parent":12202865,"text":"migenius | <a href=\"http:&#x2F;&#x2F;www.migenius.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.migenius.com</a> | New York, NY | ONSITE, Full-time<p>migenius specialises in photorealistic 3D rendering for the cloud and web applications. Our main product, RealityServer, provides a simple web services based API to the NVIDIA Iray rendering engine. We both license software and build custom solutions for our users. We are based in Melbourne, Australia with offices in London and Tokyo and are establishing a presence in the US. We are looking for a developer to work embedded with one of our key customers. Midtown Manhattan location.<p>Ideally we are looking for something of a generalist since the demands of the role will evolve over time (sometimes in short spaces of time). The successful applicant should have strong software development skills and be able to quickly work through helping determine feasibility and mock up of potential ideas but will also potentially be working on production development as well.<p>Flexibility in working hours is important since there is a need to overlap some of the working day with the team in Australia. Initially after starting there would also be a requirement to spend 2-3 months in Australia working directly with our team to get oriented and obtain a good overview of our technologies. Good communication skills are essential as customer interaction is required.<p>The role will require working with high end 3D technologies both developed internally and licensed from third-parties. The visual nature of the results achieved working on our projects is extremely rewarding and there are also lots of interesting toys to play with such as servers crammed with GPUs and remote GPU clusters. We have a close partnership with NVIDIA and their advanced rendering team (our CEO, that&#x27;s me, is a former NVIDIA and mental images employee).<p>No specific technologies listed here since we have flexible requirements and are more looking for the right fit with someone who is interested in what we are doing and can work on multiple ideas and projects at once. If you are interested in 3D graphics, particularly photorealistic rendering as well as web development, CAD, architecture or design we cut across all of these types of areas.<p>Interview if conducted prior to early-September would be in person with me and our customer in New York, if after that interview would be remote. We don&#x27;t generally do coding exercises in the interview but we will be looking for an ability to talk in detail about your previous project and experiences and ideally you should have something you can actually show of your past work. Email jobs@migenius.com if the position sounds interesting, please mention Hacker News when contacting us so we know it was from here.","time":1470088730,"type":"comment"}