{"by":"thetable","id":12205360,"kids":[12208787],"parent":12202865,"text":"NewStore | Berlin | <a href=\"http:&#x2F;&#x2F;www.newstore.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.newstore.com</a> | full-time | (VISA)<p>At NewStore, we’re building a mobile retail platform that allows enables rapid order fulfillment and boosts mobile conversion. We orchestrate a variety of actors and systems to enable things like same-day-delivery for our customers.<p>The platform runs on a variety of microservices, written in Python and Go. We build and maintain two mobile apps, one native (Swift&#x2F;ObjC), one based on React Native (ES6, Redux), as well as an Angular-based web app.<p>We have several engineering teams whose skills usually span all of the above areas to be able to work on entire features independently. We care a lot about QA, TDD and writing meaningful and effective tests. We aim to empower individuals and give them responsibility and the ability to make technical decisions.<p>In addition to pure engineering roles, we&#x27;re looking for scrum masters, technical writers and more.\nOur founder is Stephan Schambach, founder of Intershop and Demandware (both of which he led to IPO). We’re well-funded and newly launched, so it’s a great time to join. We’ve got a good agile dev process and engineering infrastructure established, but there’s still lots of opportunity to make a difference!<p>Our office is in a beautiful historic power plant right by the Spree river in downtown Berlin. We foster continuing education, travel between the NewStore offices (including the one in the US), and we offer tasty, catered lunches three days a week.<p>Our interview process typically consists of a phone screen, a technical phone interview, and an extended on-site technical interview.<p>If you&#x27;re already in Berlin, check out our regular Tech Talks: <a href=\"http:&#x2F;&#x2F;www.meetup.com&#x2F;de-DE&#x2F;NewStore&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.meetup.com&#x2F;de-DE&#x2F;NewStore&#x2F;</a><p>See all our job listings here: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;gmynw3\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;gmynw3</a>","time":1470081132,"type":"comment"}