{"by":"gametimeunited","id":12203560,"parent":12202865,"text":"Gametime | San Francisco | Full-time | On-Site<p>Searching for high-performing Machine Learning Engineers, Backend Engineers and an experienced Product Designer!<p>Gametime connects communities through frictionless and beautiful mobile applications. We believe communities get closer when people get off the couch and have fun at a live event. Backed by Accel Partners as well as team owners Jeff Mallett (Giants &#x2F; Whitecaps &#x2F; Derby FC), Vivek Ranadive (Kings), and David Blitzer (76ers &#x2F; Devils) we&#x27;ve raised $13mm.<p>Built for iOS and Android, Gametime makes getting into an event as amazing as being there. Inside gametime.co&#x2F;app we provide high-res panoramic photos from every section, curated listings as we decrease a universe of 5,000 options to the 50 best, with ultra fast two-tap checkout and no printing. With our mobile-only approach, we&#x27;ve reduced a 30-minute process to 30 seconds. After purchase, fans can text tickets to friends or sell (via patent-pending Snap &amp; Sell technology) if they can’t make it. This experience has led to rapid, 300% annual growth. Gametime apps have been featured in both the Apple App Store and Google Play Store!<p>New Gametimers join for the community of high-performers (known as the Gameteam). New employees also love the environment as we aspire to build the best place to work in SF ...<p>We offer market rate salary (even though we’re small) and real equity (meaning you come out way ahead). Everyone here does meaningful work. There’s free catered lunch Monday through Thursday, with Friday lunch outside the office reimbursed by the company! We offer a robust insurance package including a Kaiser HMO medical plan and Cigna for medical (OAP or HSA), dental, and vision plans (100% coverage for employees!). We also have monthly $75 cell phone reimbursement and $80 commuter benefit. We love going to games and we&#x27;re right by AT&amp;T Park so (if you&#x27;re into it) you&#x27;ll hit a bunch of them with us (and your friends via a $100 monthly credit). Go Giants!<p>Machine Learning Engineer: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;gametime&#x2F;e0595a55-a40a-40e9-bc50-7f12023e99ad\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;gametime&#x2F;e0595a55-a40a-40e9-bc50-7f120...</a><p>Backend Engineer: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;gametime&#x2F;4bf6040a-2b00-49e7-a77a-69346844bfdd\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;gametime&#x2F;4bf6040a-2b00-49e7-a77a-69346...</a><p>Product Designer: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;gametime&#x2F;c6660a81-cc90-4f30-8b59-4124d34be94c\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;gametime&#x2F;c6660a81-cc90-4f30-8b59-4124d...</a>","time":1470067955,"type":"comment"}