{"by":"benweissmann","id":12203173,"parent":12202865,"text":"Tulip | <a href=\"https:&#x2F;&#x2F;tulip.co&#x2F;careers.html\" rel=\"nofollow\">https:&#x2F;&#x2F;tulip.co&#x2F;careers.html</a> | Boston, MA | Full time, interns | Onsite<p>Do you want to help realize the next industrial revolution?<p>Tulip is transforming manufacturing processes by bringing the latest technological advances from the lab to the shop floor. We have multiple Fortune 500 customers and are already enabling production lines building the things you interact with everyday.<p>Whereas most factories are still using state of the art technology from the mid 20th century, we come from the future to bring them a rich, realtime web app, modern tablets, IoT systems, in-depth analytics, and more. Our products are already (measurably!) helping our customers, so we&#x27;re rapidly expanding our number of customers and size of deployments.<p>We&#x27;re looking for software engineers to join our core team to work on data engineering, technical operations, and computer vision.<p>Data Engineering: We&#x27;re looking for a software engineer who&#x27;s excited about designing and building a scalable, flexible analytics pipline for the data we collect. While you&#x27;ll spend most of your time on the backend, you should be comfortable working on our entire data stack, from databases, to backend APIs, to customer-facing frontend analytics tools.<p>Technical Operations &#x2F; DevOps &#x2F; SRE: You might or might not have experience with technical operations, but you&#x27;re excited about applying your software engineering skills to solve our complex operational problems. You&#x27;re comfortable diving into complex codebases and large distributed systems, and equally excited about applying the same technical principles you&#x27;d use to build these system to take them to production.<p>Computer Vision: We&#x27;re looking for a computer vision &quot;research-ineer&quot; with demonstrable experience in algorithm development and productization of in-the-wild vision solutions. Working knowledge of computation and optimization, algebras, statistics, machine learning is required. Experience in the following environments is highly recommended: C++11, Boost, OpenCV, OpenCL&#x2F;CUDA, DNN&#x2F;CNN.<p>Email us at jobs@tulip.co","time":1470065643,"type":"comment"}