{"by":"blocher","id":12209881,"parent":12202865,"text":"Engage (<a href=\"http:&#x2F;&#x2F;enga.ge\" rel=\"nofollow\">http:&#x2F;&#x2F;enga.ge</a>) | Washington DC Metro Area (Alexandria, VA) | Linux Systems Administrator | On-site or Remote | Direct Hire, Contract, or Hourly<p>Apply at: <a href=\"http:&#x2F;&#x2F;engagedc.theresumator.com&#x2F;apply&#x2F;e2IBA2&#x2F;Linux-System-Administrator\" rel=\"nofollow\">http:&#x2F;&#x2F;engagedc.theresumator.com&#x2F;apply&#x2F;e2IBA2&#x2F;Linux-System-A...</a><p>Engage, LLC, a full-service digital agency based in Alexandria, VA (Washington, DC metro area), is looking for a Systems Administrator with a strong Linux background. The position is part-time and available as a direct-hire or hourly&#x2F;contract basis as negotiated. It may be remote or on-site. The ideal candidate will be able to manage multiple servers, provision new environments, manage U.S. House of Representatives virtual servers, and interact with additional outside clients and vendors.<p>Job Requirements<p>* Strong Linux background (RHEL, CentOS, and Ubuntu preferred); SELinux; BASH scripting, LAMP stack, especially the Apache web server, Experience with both Apache and NGINX web servers preferred; EMySQL, MariaDB, or PostgreSQL, including diagnosing configuration and slow query issues; Networking, Linux routing, firewalls, protocols (NFS, DNS, etc...); Backup and restore procedures; monitoring services; SSL certificates; Sharp ability to diagnose problems and prevent and identify causes of outages, Ability to quickly provision and configure new web servers; Ability to respond quickly to outages and situations as they occur; Strong communications skills and the ability to work with outside clients and vendors professionally; Must pass background screening for House of Representatives<p>Bonus points for:<p>* Previous work with the United States House of Representatives (major plus); Amazon Web Services, Elastic Beanstalk, S3, and EC2; Laravel Forge for server provisioning; VMWare or other virtualized environments; Vagrant and creating or provisioning Vagrant boxes; experience with WPEngine or similar managed hosting provider; PHP, Python, or Perl scripting; CHEF-based provisioning<p>About Engage:<p>We are a full-service digital agency that is dedicated to impacting the world around us through bold strategy and innovative technology. With clients ranging from political campaigns to top level associations and advocacy groups, we use cutting-edge technology to tell the most compelling story for every project.<p>About Our Work Culture:<p>We love seeing our employees engage in challenging work, gain hands-on experience, and continuously improve their skills. We take pride in producing high quality and award winning work, but we always find time for Nerf gun fights and team lunches. We love coming to work and think that you will too!","time":1470145686,"type":"comment"}