{"by":"TedDev","id":12210317,"parent":12202865,"text":"Level 1 Systems&#x2F;Network Engineer &amp; Consultant | Promenet, Inc. | New York, NY ONSITE | Full-Time | <a href=\"http:&#x2F;&#x2F;www.promenet.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.promenet.com</a><p>We specialize in High Level IT Services for the Mid-Size Market (25-5000 users).\nWe seek to add valuable new full-time members to our Networking &amp; Systems teams. Our employees constantly push themselves to improve their skills--every individual at Promenet works to grow for the company, but most importantly for themselves. We work with customers in all industries to provide them peace of mind by offering hands-on expertise. We&#x27;re largely responsible for the integrity of each of our client&#x27;s networks, and subsequently their business operations. Our employees pride themselves on playing such an important role.<p>Responsibilities:<p>- Support customer networks end users.<p>- Daily hands-on interaction with network and systems troubleshooting.<p>- Serve as an integral resource (or leader) in projects, adhering to committed deliverables, and regular communication of progress to management.<p>- Fulfill certification and training roadmap as set forth by senior staff and management.<p>- Shadow experienced personnel and acquire knowledge.<p>- Thoroughly document all activity and keep senior staff and management informed.<p>- Work outside of standard business hours as needed.<p>To see more about this job opening, and all current openings, visit <a href=\"http:&#x2F;&#x2F;www.promenet.com&#x2F;promenetcareers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.promenet.com&#x2F;promenetcareers</a><p>Apply by emailing a copy of your resume to itjobs (at) promenet (dot) com along with a brief description of your talents and ambitions. Give us an idea of what you want to achieve and what kind of company you want to be a part of. Simply submitting your resume is not enough: you must demonstrate your aptitude and your motivation.\nHiring Process: Phone Interview --&gt; Series of 3 separate in-person interviews in our office (New York City)","time":1470149205,"type":"comment"}