{"by":"hectormalot","id":12216528,"parent":12202865,"text":"IPsoft | Full Time | Cognitive Implementation engineer | New York or Amsterdam or Bangalore | ONSITE<p>The implementation engineering team is responsible for aligning our breakthrough cognitive solution (Amelia) with client requirements and expectations. You will implement functionality in Amelia&#x27;s Cognitive modules as well as integrate and automate backend business processes.<p>The cognitive division is growing fast and we&#x27;re looking for someone who loves to rapidly create new functionality for our clients. Skills we are looking for is experience with scripting (JS, Python, or Groovy), working with APIs and the ability to design client facing processes.<p>IPsoft | Full Time | R&amp;D engineer | NYC | ONSITE<p>We are looking for developers to help bring us to the next iteration of our cognitive agent, Amelia. As an R&amp;D engineer you will work on a variety of topics related to conversational and cognitive technologies. It’s a unique opportunity to work alongside our senior developers and linguistic scientists as they build the next generation of language understanding automation. Our junior developers are eager to take on assignments and relish the opportunity to learn from senior staff.<p>You will be a part of an artificial intelligence team working on intelligent virtual agents. You will participate the development of algorithms to allow our virtual agent to learn and execute natural language driven processes and tasks. R&amp;D engineers in BPN are expected to handle full-stack development on Java 8, JEE, Redis, JavaScript&#x2F;ExtJS, MySQL, JSON, etc. As Java is the primary programming language used in the project, excellent Java, JEE, and object-oriented design are a must. Since our projects include graph search and manipulation algorithms, natural language processing (NLP) and machine learning (ML), a good understanding of these is considered a plus.<p>We have had some great profiles from HN. When replying to this opportunity, please do mention why you are interested in IPsoft and Amelia. For more information, feel free to contact me directly: dennis.dereus (at) ipsoft.com.<p>The interview process is a CV screen followed by a first round of 2 interviews and then a second round of 2 interviews.<p>Example of the work we do with Amelia:<p><a href=\"http:&#x2F;&#x2F;www.businesswire.com&#x2F;news&#x2F;home&#x2F;20160615006592&#x2F;en&#x2F;Publ\" rel=\"nofollow\">http:&#x2F;&#x2F;www.businesswire.com&#x2F;news&#x2F;home&#x2F;20160615006592&#x2F;en&#x2F;Publ</a>","time":1470213502,"type":"comment"}