{"by":"november84","id":12232381,"parent":12202865,"text":"Front-end engineers OR Back-end engineers | Alar Software | Chicago, IL | Full-Time ONSITE | 80K+ &amp; options based on experience, medical&#x2F;dental, paid parking<p>Please email resumes to hiring@alar.net<p>We are looking for experienced front-end or back-end focused engineers to help design and build out our platform. We’re aiming to aggregate logistics data to enable customers to operate more efficiently and connect them with other logistics companies. We’re taking an unconventional approach (event sourcing with a twist and a touch of farmville) and dealing with big data to boot.<p><i>Front-end position</i>:<p><pre><code>  Logistics software is notorious for overloading users with information, which\n  requires a masters in spaghetti science to understand. Complexity in enterprise\n  software is unavoidable, but we believe the end user shouldn’t have to jump\n  through hoops to manage it. This may seem simple, but logistics is filled with\n  antiquated processes and users.\n\n  If you consider yourself an experienced designer magician who can bring fun to\n  a traditionally boring domain, or someone who can make up for lack of experience\n  with passion, we’re looking for you.\n\n  Stack: Built using a combination of AngularJS, Twitter Bootstrap and ASP.NET \n  MVC, but in no way are you limited to these solutions.\n</code></pre>\n<i>Back-end position</i>:<p><pre><code>  This isn’t a run of the mill MVC app and requires solving performance and\n  scalability problems in distributed systems using combined data from many\n  sources.\n\n  We need either experienced engineers who can bring structure to the chaos as \n  we grow, or someone who can supplement experior with passion and creativity.\n\n  Stack: Primarily C#. Working towards akka.net, also considering Scala as we \n  gain more experience with akka. Also a bit of postgres, some simple mongo for\n  non-critical functions, and ASP.NET.\n</code></pre>\n<i>What you&#x27;ll do</i>:<p><pre><code>  Help design the core architecture that will drive our platform\n  Tackle problems unique to integrating big data\n</code></pre>\n<i>What you&#x27;ll need</i>:<p><pre><code>  Backend C# experience, Big data (optional)\n  Talent for creative and functional solutions to difficult problems\n  Strong computer science fundamentals\n  A stomach for working in a fast-paced and uncertain problem domain\n  Ability to ship quality code quickly</code></pre>","time":1470405823,"type":"comment"}