{"by":"cynkin","id":12251012,"parent":12202865,"text":"Washington, DC | Onsite | Lead Front End&#x2F;Full Stack Engineer<p>There is this magical recent invention called the &quot;video game.&quot; It&#x27;s really fun. Kids spend hours playing these things at home. Really!  There&#x27;s also this terribly boring historical artifact called &quot;the textbook&quot; which hasn&#x27;t been updated since Prussia was still a thing. It&#x27;s still the way teachers cram knowledge into little kids. Barbaric.<p>We plan to combine the two and get those kiddos learning better. We ran a real academic study with the good folks at Vanderbilt to see if our prototype would work. It did. Awesomely.<p>We&#x27;ve assembled the equivalent of the A-TEAM to turn this into a billion dollar company. We&#x27;re tired of building $50 and $60 million dollar companies (that&#x27;s what our last two companies we started turned into).<p>Company is funded. Team is committed. Time to roll.  One problem: I (the CTO) need 2-3 developers to build it. Help us solve this problem and you get a bunch of equity. Also, we get to revolutionize education together.<p>------------------------------\n The regular blah blah:<p>We&#x27;re looking for an experienced full stack or front end developer to join our veteran founding team. This is an opportunity to build an application from the ground up, so you must already have expert knowledge of patterns and best practices used for developing large, consumer-facing web applications. Additional requirements include:<p>- In-depth knowledge of modern JavaScript frameworks, ideally React and Node.\n- Experience with HTML5, CSS3, and common CSS preprocessors and frameworks.\n- Solid understanding of the full web technology stack (HTTP, cookies, asset caching, etc.). Bonus points for expertise developing REST APIs.\n- Ability to quickly define, develop, test, and deploy well-crafted, high-performing code.\n- Familiarity with modern software process including agile methodology, version control, and CI&#x2F;CD.\n- Minimum 3 years commercial consumer software development experience.\n- An entrepreneur&#x27;s enthusiasm, versatility, collaborative approach, and burning desire to solve any problem big or small.<p>Email your resume and&#x2F;or questions to edtechgamingplatform@gmail.com<p>P.S. We’re still in stealth mode, still testing company names, no URL yet.  You can check out the LinkedIn profiles of our CEO <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;vadim-polikov-6b2bba1\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;vadim-polikov-6b2bba1</a> and CTO (me) <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;larrycynkin\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;larrycynkin</a>","time":1470691747,"type":"comment"}