{"by":"naelmusleh","id":12264356,"parent":12202865,"text":"Senior Full Stack Software Engineer | Chalk Talk Solutions | Boston, MA | ONSITE | Full Time | <a href=\"https:&#x2F;&#x2F;chalktalk.academy\" rel=\"nofollow\">https:&#x2F;&#x2F;chalktalk.academy</a><p>ABOUT CHALK TALK:\nChalk Talk is a Boston-based startup that recently graduated from LearnLaunch Breakthrough Accelerator Program, the leading accelerator program in the US for growth stage Education Technology startups. Since our launch last year, we have accumulated numerous clients across 3 countries and expanding. We recently raised a $2MM seed round from renowned international investors. We have an 8-person superstar team, 2 global offices, and a distinguished network of advisors, board members, and trustees.<p>POSITION OVERVIEW:\nChalk Talk is looking for an experienced full-stack software engineer to join our team in a full-time capacity and build the future of K-12 online education.<p>You will work in a fast-paced environment using modern web development tools like Django, AngularJS, Github and Phabricator to build software that is scalable, reliable, and easy to use. Your projects will be diverse and meaningful: these will include building adaptive algorithms and dynamic study plans for top high schools around the world and enhancing user experience with new designs and data-driven learning.<p>REQUIRED:<p><pre><code>  - 2-5 years of experience with dynamic development languages like Python or Ruby.\n  - Track record of successfully building end-to-end products.\n  - Demonstrated teamwork experience.\n  - Experience with full stack web development including HTML, CSS, Javascript, and back ends like Django&#x2F;Rails and Python&#x2F;Ruby.\n  - Experience with modern web technologies such as D3, Bootstrap, AngularJS.\n  - Demonstrated skills in building service based architectures.\n  - Committed to documentation of best practices in various layers of the stack.\n  - Get-shit-done attitude.\n</code></pre>\nOther Details:<p><pre><code>  - Health and dental benefits.\n  - Flexible work times and vacations.\n</code></pre>\n<i></i>Chalk Talk does not offer visa sponsorship for non-US residents and nationals.<p>If you are interested, you can either check out our open positions at <a href=\"https:&#x2F;&#x2F;chalktalk.academy&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;chalktalk.academy&#x2F;careers</a> or email us at apply@chalktalk.academy. Please include the position in the subject.","time":1470858546,"type":"comment"}