{"by":"funsi","id":11015658,"parent":11012044,"text":"PhD position at Simula Research Laboratory | Oslo, Norway | Full-time<p>Simula Research Laboratory AS is a publicly owned research institute located outside Oslo, Norway. It is a multi-cultural organization, employing about 150 individuals from 30 countries. Simula is conducting ICT research in the fields of communication technology, scientific computing and software engineering. Simula&#x27;s main objective is to generate new understanding and create vital knowledge about fundamental scientific challenges that are of genuine value for society. This is achieved through high quality research, education of graduate students, industry collaboration, technology transfer and commercialization.<p>We are seeking a 3 year full time PhD student at Simula Research Laboratory to work on PDE-constrained optimisation with dynamic domains using the finite element methods. The work will be performed in the context of the FEniCS Project (<a href=\"http:&#x2F;&#x2F;fenicsproject.org\" rel=\"nofollow\">http:&#x2F;&#x2F;fenicsproject.org</a>) and dolfin-adjoint (<a href=\"http:&#x2F;&#x2F;www.dolfin-adjoint.org\" rel=\"nofollow\">http:&#x2F;&#x2F;www.dolfin-adjoint.org</a>), winner of the 2015 Wilkinson Prize for Numerical Software. The successful candidate will work on numerical methods for solving PDEs on multiple meshes, computing sensitivities using automatic differentiation, and implementing these methods with a focus on a high degree of automation and high performance. These techniques will then be applied to optimise the design of blood flow stents and tidal stream turbines in collaboration with academic and industrial partners.<p>The application deadline is the 1. March &#x27;16 with a starting date early this year (any time after March). The details of the position can be found here<p><a href=\"https:&#x2F;&#x2F;emea3.recruitmentplatform.com&#x2F;syndicated&#x2F;lay&#x2F;jsoutputinitrapido.cfm?component=lay9999_jdesc100a&amp;nPostingID=138&amp;nPostingTargetID=228&amp;option=52&amp;sort=DESC&amp;respnr=1&amp;ID=QL5FK026203F3VBQBV779QWAD&amp;Resultsperpage=10&amp;lg=UK&amp;mask=simulaweb\" rel=\"nofollow\">https:&#x2F;&#x2F;emea3.recruitmentplatform.com&#x2F;syndicated&#x2F;lay&#x2F;jsoutpu...</a><p>A more detailed description of the project can be found here:<p><a href=\"https:&#x2F;&#x2F;www.simula.no&#x2F;research&#x2F;projects&#x2F;simulation-based-optimisation-dynamic-domains-optcutcell\" rel=\"nofollow\">https:&#x2F;&#x2F;www.simula.no&#x2F;research&#x2F;projects&#x2F;simulation-based-opt...</a><p>Simula offers:<p>- A highly dynamic and motivated team of international researchers and engineers.<p>- Offices 15 minutes drive or boat trip from the centre of Oslo.<p>- An informal and inclusive international working environment.\n- Professional courses and workshops led by international experts on topics such as \nCommunication of Scientific Research, Innovation and Entrepreneurship, and Writing Effective\nResearch Proposals.<p>- A competitive salary.<p>Simula strives to achieve a good balance between male and female employees, and women are particularly encouraged to apply.","time":1454362497,"type":"comment"}