{"by":"empaone","id":11014422,"parent":11012044,"text":"Pro Financial | <a href=\"https:&#x2F;&#x2F;www.profinancial.bc.ca&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.profinancial.bc.ca&#x2F;</a> | North Vancouver, BC, Canada | Junior Developer looking to gain Full-Stack experience | Full-Time | some On-site time will be required, but we are flexible about some work-from-home<p>If you are a programmer with first-class raw talent, are eager to learn, and want make a positive impact on the people around you, we want to meet you.<p>The financial industry is built on scale and technology, and so are we. Founded in 2000, we are a small, highly skilled team focused on helping banks and credit unions understand their businesses in a way they simply can&#x27;t do themselves.<p>You&#x27;ll be working closely with our tech lead in all areas of our stack and you will interact directly with everyone in the company and our clients, transforming data into meaningful information. If you&#x27;re into micromanagement, rigid structure, and never getting to see the big picture, this isn&#x27;t the place for you. Your work schedule and location are highly flexible (many of us work from home part-time), but some regular on-site time at our  North Vancouver office will be required.<p>Skills in Python, JavaScript, C#, .NET, and PostgreSQL are a must. Beyond that, your experience with IronPython, HTML, and CSS is a bonus, along with any administration of Windows and Linux servers. This is intended to be a junior role, evolving into a broad based senior role over time, and compensation will be commensurate with experience. But regardless, if you&#x27;re a team player, a quick learner, and you&#x27;d like to know more, please respond with your resume and cover letter.<p>Please email info@profinancial.bc.ca with your resume.<p>We apologize, but time does not permit responding to all inquiries. We will do our best to notify possible candidates within 48 hours.","time":1454353830,"type":"comment"}