{"by":"chucknb","id":11015786,"parent":11012044,"text":"NationBuilder - Los Angeles, CA &amp; Remote - Full Time - Senior Database Engineer, Software Engineer, Senior Software Engineer, Web Designer<p>NationBuilder is an online Community Organizing System built by a world-class team dedicated to empowering a new generation of leaders and creators with the tools they need to create a new world. If you&#x27;re seeking to build something truly important - a genre-defining new product that is already changing people’s lives. Check out what we build: <a href=\"http:&#x2F;&#x2F;nationbuilder.com&#x2F;mission\" rel=\"nofollow\">http:&#x2F;&#x2F;nationbuilder.com&#x2F;mission</a><p>Senior Database Engineer (Los Angeles): Come join our LA team to take ownership of our database systems, with a strong focus on our core PostgreSQL databases, and take our databases to a new level of scalability and performance. <a href=\"http:&#x2F;&#x2F;nationbuilder.com&#x2F;senior_database_engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;nationbuilder.com&#x2F;senior_database_engineer</a><p>Software Engineer (Los Angeles): As a developer you’ll help us architect, build and maintain our main codebase as well as ancillary services. <a href=\"http:&#x2F;&#x2F;nationbuilder.com&#x2F;software_engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;nationbuilder.com&#x2F;software_engineer</a><p>Senior Software Engineer (Los Angeles&#x2F;Remote): As a senior developer you’ll help us architect, build and maintain our main codebase as well as ancillary services. You’ll recommend and implement system-wide improvements, new technologies, and contribute to our technological direction. <a href=\"http:&#x2F;&#x2F;nationbuilder.com&#x2F;senior_software_engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;nationbuilder.com&#x2F;senior_software_engineer</a><p>Web Designer (Los Angeles): We&#x27;re seeking a web designer to contribute to the limitless scope of design needs at NationBuilder, software for leaders. Your responsibilities will include maintaining the NationBuilder brand, crafting delightful web experiences to help tell the NationBuilder story, and taking a central role in the evolution of design at the company. <a href=\"http:&#x2F;&#x2F;nationbuilder.com&#x2F;designer\" rel=\"nofollow\">http:&#x2F;&#x2F;nationbuilder.com&#x2F;designer</a><p>Our application is primarily Ruby on Rails with some additional Ruby and Go services. Configuration management is via Puppet. The majority of our data is in PostgreSQL with additional supporting data in MongoDB and Redis. We&#x27;re hosted in our own datacenter with a little AWS mixed in.","time":1454363490,"type":"comment"}