{"by":"celue","id":11012124,"parent":11012044,"text":"London, UK  |  ONSITE  | Full-Time | ExperiencEconomy | Growing an audience ahead of building the product<p><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i>\n=== What we do ===\n<i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><p>We are building a digital hub for creative professionals (and yes, that means pretty much most hard-to-automate professions). We help our customers with lead generation (helping them use video storytelling in a smart way) and are building a SaaS offering, providing customers with collaboration and content&#x2F;client management software, while facilitating many to many transactions (and that truly means many transactions in an industry worth $114bn in the UK alone).<p><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i>\n=== Crib sheet ===\n<i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><p>-You will be part of small fun team, working in London, United Kingdom (Baker Street)<p>-We have backing from an incubator<p>-50 creative professionals&#x27; usage based on our existing community product prototype (under private-Alpha) built with Meteor JS<p>-We will be transferring our learnings into a new mobile multi-tenant application to be built from scratch (tech-stack choices still to be made). You will have the opportunity to be part of it from the start, establishing the culture and setting the standards.<p><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i>\n=== Looking for ===\n<i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><p>-Senior software engineer &#x2F; Full Stack developer<p>-This freelance opportunity can develop into a full-time lead role (CTO) should we be the right fit for each other.<p>If this sounds interesting, please shoot us an email at jobs@experienceconomy.com mentioning Hacker News in the subject line.<p>More about us at <a href=\"http:&#x2F;&#x2F;www.experienceconomy.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.experienceconomy.com</a>","time":1454339599,"type":"comment"}