{"by":"leadpages","id":11017124,"parent":11012044,"text":"LeadPages (www.LeadPages.net) - Minneapolis, MN | Full-Time | Business Intelligence, Enterprise Security, Python Engineer, Web Developer, Automation, Production Engineers, Technical Project Managers, etc.<p>LeadPages is Minnesota&#x27;s fastest growing startup and we&#x27;re looking for some amazing people to join our team! Our team and culture is like no other. We work remote two days per week and the other three days in our incredible downtown Minneapolis office. We&#x27;re a SaaS company with one of the best tech stacks I&#x27;ve seen yet and... we&#x27;re a Mac shop! :)<p>We currently have full time opportunities available for:<p>- Enterprise Security Architect (application security and development, GAE, GCE, physical security -&gt; network security -&gt; application security, Linux&#x2F;Unix) =&gt; <a href=\"https:&#x2F;&#x2F;leadpages.applytojob.com&#x2F;apply&#x2F;0GL6Od&#x2F;Enterprise-Security-Architect.html\" rel=\"nofollow\">https:&#x2F;&#x2F;leadpages.applytojob.com&#x2F;apply&#x2F;0GL6Od&#x2F;Enterprise-Sec...</a><p>- Business Intelligence and Digital Strategy Senior Manager (Advanced data mining, machine learning, modeling, D3 Data visualization, Google Analytics, query writing, Tableau &#x2F; Domo, R, iPython, or similar statistical analysis packages) =&gt; <a href=\"https:&#x2F;&#x2F;leadpages.applytojob.com&#x2F;apply&#x2F;rzNzQu&#x2F;Business-Intelligence-And-Digital-Strategy-Senior-Manager.html\" rel=\"nofollow\">https:&#x2F;&#x2F;leadpages.applytojob.com&#x2F;apply&#x2F;rzNzQu&#x2F;Business-Intel...</a><p>- Director of Program Management (Agile experience of many flavors - not just Scrum: XP (eXtreme Programming), Kanban, Lean, Crystal Clear Methodologies, AUP, BADM, DSDM; diversity of program management experiences) =&gt; <a href=\"https:&#x2F;&#x2F;leadpages.applytojob.com&#x2F;apply&#x2F;2FwVGi&#x2F;Director-Of-Program-Management.html\" rel=\"nofollow\">https:&#x2F;&#x2F;leadpages.applytojob.com&#x2F;apply&#x2F;2FwVGi&#x2F;Director-Of-Pr...</a><p><i></i>We&#x27;re ALWAYS looking for Python Engineers! Our current Python teams consist of Data Analytics, API and Business Services - reach out to me for more information.<i></i><p>These are all full time positions with great benefits including Medical, Dental, Vision, 401k, PTO, Flexible Schedules, Work From Home options, and more! We even offer relocation packages from anyone that would be open to relocating to beautiful Minneapolis, MN.<p>If you&#x27;re interested in seeing any of the other positions that we also have available on our Marketing, Product, Technical Support, Customer Success or Operations teams, check out our website at: <a href=\"http:&#x2F;&#x2F;www.leadpages.net&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.leadpages.net&#x2F;careers</a><p>Interested in emailing me directly? You can reach me at: Tiffany@Ave81.com<p>I&#x27;d love to talk with you soon!!<p>Thanks, Tiffany","time":1454376637,"type":"comment"}