{"by":"sumodm","id":11014710,"parent":11012044,"text":"Soliton Technologies - www.solitontech.com - Bangalore, India - ONSITE<p>Soliton invites applications for an R&amp;D Software Engineer&#x2F;Lead in a group specializing in Computer Vision and Machine Learning. Recent projects have included obstacle detection on mobile platforms, object detection&#x2F;classification and 3D reconstruction. We are looking for exceptional candidates who have a sense of ownership and have the necessary grit to make successful research products. The candidate must have good understanding of basic mathematics (linear algebra, statistics, probability and good understanding of fundamentals of computing (Algorithms, Data Structure, OS Fundamentals). The ideal candidate will also have strong development skills on <i>nix platform and ability to prototype very quickly.<p></i>Required Skill sets*\n  • Good understanding of Image Processing and Computer Vision with projects to back the same\n  • Strong programming experience in C++\n  • Knowledge of at least one prototyping&#x2F;scripting language : Python, MATLAB&#x2F;Octave, Julia or R\n  • Good understanding of Algorithms and Data Structures\n  • Good knowledge of basics: Linear Algebra, Probability and Statistics\n  • Good written and verbal communication<p><i>Other Openings : Project Lead – Web Technologies (Node.JS&#x2F;Angular.JS)</i>\n  • Lead a highly talented team of 10 people\n  • Set and meet high standards of excellence in the quality and timeliness of the software delivered and achieve customer delight\n  • Ensure that the defined processes are adhered to; and contribute to the development of these processes by sharing best practices and learning from projects\n  • Empower the team and ensure that the team spirit is high at all times and provide individual mentorship to engineers to help them with career growth<p>More details here:<a href=\"http:&#x2F;&#x2F;www.solitontech.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.solitontech.com&#x2F;careers</a><p>Email your resumes @ careers@solitontech.com","time":1454355469,"type":"comment"}