{"by":"Infosourcer","id":11012640,"parent":11012044,"text":"<i>Cloudera</i> | Palo Alto, CA | San Francisco, CA | Austin, TX | Budapest, Hungary | ONSITE | Full-time<p>What&#x27;s hot in 2016? Open Source, Big Data, Cloud, &amp; Hadoop-and Cloudera leads the way!<p>A little backgrounder: Cloudera is leading the industry in Big Data. Our chief architect, Doug Cutting, partnered with Google to create Hadoop, 10 years ago now. Cloudera was the 1st to commercialize it.  With over a billion in funding and a strategic partnership with Intel, Cloudera is revolutionizing enterprise data management by offering the first unified Platform for Big Data, an enterprise data hub built on Apache Hadoop™.<p>At Cloudera, we help companies Ask Bigger Questions and are transforming the way enterprises look at their data centers.<p>WHY CLOUDERA?<p><i>Amazing people</i> - We are a fun &amp; smart team, including many of the top luminaries in Hadoop and related open source communities. We frequently interact with the research community, collaborate with engineers at other top companies &amp; host cutting edge researchers for tech talks.<p><i>Innovative work</i> - Cloudera pushes the frontier of big data &amp; distributed computing, as our track record shows. We work on high-profile open source projects, interacting daily with engineers at other exciting companies, speaking at meet-ups, etc.<p><i>Great culture</i> - Transparent and open meritocracy. Everybody is always thinking of better ways to do things, and coming up with ideas that make a difference. We build our culture to be the best workplace in our careers.<p><i>Experience</i> - be part of the exhilarating ride at a fast-growing pre-IPO startup<p>Picture yourself at Cloudera. We’re hiring in all departments. You can connect with me directly infosourcer [at] cloudera [dot] com or check out our openings here <a href=\"http:&#x2F;&#x2F;www.cloudera.com&#x2F;about-cloudera&#x2F;careers&#x2F;current-openings.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.cloudera.com&#x2F;about-cloudera&#x2F;careers&#x2F;current-openi...</a>","time":1454343550,"type":"comment"}