{"by":"phodphad","id":11013016,"parent":11012044,"text":"Phodphad! (<a href=\"https:&#x2F;&#x2F;phodphad.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;phodphad.com&#x2F;</a>) | Remote | Full Time<p>We are looking for a great or an aspiring developer. If you are one or know one, please read below.<p>What&#x27;s in it for you?<p>1. Better Pay. (In most cases)<p>2. Work From Anyplace. ( It doesn&#x27;t matter whether you live in Kashmir or Kanyakumari or US or Australia. You can work from anyplace as long as you have good internet. )<p>3. Work at Anytime. ( 9am to 5pm or 9pm to 5am . Work whenever you like.)<p>4. Work on the latest and best tech. (Our current stack includes : Node, Meteor, React, React-Native, Relay, GraphQL, MongoDB, PostgreSQL, Babel, ES6 and Webpack)<p>5. Opportunity to make the best use of your abilities. (We’re here to put a dent in the universe. Otherwise why else even be here?)<p>Who are we looking for?<p>1. Self learner. (Given sufficient time and guidance, you can learn any tech on your own using online resources.)<p>2. Talented and Hard working. (Hard work beats talent when talent doesn&#x27;t work hard. )<p>3. Responsible. (You take responsibility for all your actions in both success and failure and don&#x27;t make excuses. )<p>4. Reliable. (People can rely on you. When given a task, they know you will do it to the best of your abilities)<p>What are we working on?<p>Education ( <a href=\"https:&#x2F;&#x2F;phodphad.com&#x2F;education\" rel=\"nofollow\">https:&#x2F;&#x2F;phodphad.com&#x2F;education</a> ) : The best place to learn online. Learn anything at anytime from anyplace and at your own pace.<p>Health ( <a href=\"https:&#x2F;&#x2F;phodphad.com&#x2F;health\" rel=\"nofollow\">https:&#x2F;&#x2F;phodphad.com&#x2F;health</a> ) : Find, book and consult the best doctors online.<p>Job ( <a href=\"https:&#x2F;&#x2F;phodphad.com&#x2F;job\" rel=\"nofollow\">https:&#x2F;&#x2F;phodphad.com&#x2F;job</a> ): The best place to find all remote jobs. Work on anything at anytime from anyplace.<p>Shop ( <a href=\"https:&#x2F;&#x2F;phodphad.com&#x2F;shop\" rel=\"nofollow\">https:&#x2F;&#x2F;phodphad.com&#x2F;shop</a> ) : Get the best offers from top e-commerce websites. Save time and money.<p>Startup ( <a href=\"https:&#x2F;&#x2F;phodphad.com&#x2F;startup\" rel=\"nofollow\">https:&#x2F;&#x2F;phodphad.com&#x2F;startup</a> ) : Transform your idea to startup. Avoid mistakes that startups make and increase your chances of success.<p>How to apply?<p>Along with CV and github, tell us how you can improve Phodphad! at contact@phodphad.com","time":1454345896,"type":"comment"}