{"by":"benweissmann","id":11013167,"parent":11012044,"text":"Tulip - <a href=\"https:&#x2F;&#x2F;tulip.co&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;tulip.co&#x2F;</a> | <a href=\"https:&#x2F;&#x2F;tulip.co&#x2F;careers.html\" rel=\"nofollow\">https:&#x2F;&#x2F;tulip.co&#x2F;careers.html</a>\nBoston, MA | Full time, interns | Onsite<p>Do you want to help realize the next industrial revolution?<p>Tulip is transforming manufacturing processes by bringing the latest technological advances from the lab to the shop floor. We have multiple Fortune 500 customers and are already enabling production lines building the things you interact with everyday.<p>We’re developing a web-based platform and shop-floor hardware, bringing consumer-grade user experiences to a space dominated by ancient enterprise technology. We instrument and augment production lines that still rely on paper to share information, collecting vital data about what’s really happening on the factory floor.<p>Our product overhauls how manufacturing processes are designed, deployed, tested, measured and analyzed, providing immense value to manufacturing companies who are struggling to keep up with technology to stay competitive.<p>We get to visit our customers&#x27; factories, learn about their manufacturing processes (a la How It&#x27;s Made [1]), and figure out how to solve their toughest problems. If that sounds exciting, we’d love to talk.<p>We’re looking for people to join our core team who are excited about working on every part of our software stack: Meteor-based web development, IoT&#x2F;embedded software, computer vision, data science, technical operations &#x2F; DevOps, web-based UI design, and anything else we need to make the best product possible.  E-mail us at jobs@tulip.co.<p>[1] <a href=\"http:&#x2F;&#x2F;www.sciencechannel.com&#x2F;tv-shows&#x2F;how-its-made&#x2F;videos&#x2F;how-its-made-radar-gun&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sciencechannel.com&#x2F;tv-shows&#x2F;how-its-made&#x2F;videos&#x2F;h...</a>","time":1454346907,"type":"comment"}