{"by":"tifking","dead":true,"id":11027717,"parent":11012044,"text":"Bellevue, WA - ONSITE DevOps Manager\nAt DreamBox, our mission is a way of life.  We are changing lives by transforming the way children learn math concepts through our multi-award winning program that brings fun and engaging material to students, while adapting uniquely to each individual, moment-by moment.  We are a passionate group who believe education should be accessible to all, regardless of zip code, age, or level of experience.<p>DreamBox is currently seeking an DevOps Manager to provide day-to-day direction to a team of Operations Engineers, and technical leadership and strategic vision to the overall Product Engineering Group. The ideal candidate is a veteran of complex cloud operations, supporting rapid growth and a high rate of change, while maintaining excellent uptime and efficiency.  It is critical that candidates embrace a DevOps approach: this role is about creating solutions and matching the right technology to each business need, not operating and managing servers.<p>As the DevOps Manager, you will help design, build and maintain systems and processes for production, pre-production, and development environments.  You must energetically advance and champion DevOps concepts and practices within the larger Development Group. That means driving toward better collaboration (we’re an Agile shop), more effective automation, and meaningful use of continuous integration in all aspects of the development process.  You will be responsible for measuring and maintaining compliance with all regulatory requirements and service level agreements - this means metrics!<p>We will look to you to foster innovation within the Operations Team. You&#x27;ll be managing remarkable individuals who have a deep understanding of the Dreambox solution and phenomenal ideas for making things faster, better, and more amazing. You need to be able to identify the right places to put our time and focus, to make the most of all the things your team can accomplish.  As a player-coach, you will also participate in (24x7) on-call rotation for the production environment.<p>View the full job description and apply online at <a href=\"http:&#x2F;&#x2F;chc.tbe.taleo.net&#x2F;chc03&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?org=DREAMBOX&amp;cws=1&amp;rid=213\" rel=\"nofollow\">http:&#x2F;&#x2F;chc.tbe.taleo.net&#x2F;chc03&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?o...</a>","time":1454519633,"type":"comment"}