{"by":"tifking","dead":true,"id":11027727,"parent":11012044,"text":"Bellevue, WA - ONSITE Back-End Quality Engineer\nAt DreamBox, our mission is a way of life.  We are changing lives by transforming the way children learn math concepts through our multi-award winning program that brings fun and engaging material to students, while adapting uniquely to each individual, moment-by-moment.  We are a passionate group who believe education should be accessible to all, regardless of zip code, age, or level of experience.<p>Dreambox Learning is adding a Back-End Quality Engineer to our Software development team.  Back-End Quality Engineers are members of the Quality Assurance team and are responsible for all Quality Assurance activities related to DreamBox Learning&#x27;s Internet platform. BEQE’s are responsible for system quality from initial design to production deployment.  In this role you will be part of an Agile team which designs, implements, tests and deploys services, which support our cloud based education platform. In this position you will be ensuring the overall quality of our lesson delivery, student management, data aggregation, and reporting systems. BEQE’s automate their tests by writing test cases is JSON which are executed within our proprietary testing framework.  This allows for rapid test case development and allows the quality engineer to focus on validating the services rather than writing &#x2F; maintaining code.<p>BEQEs work with engineers, customer service representatives and teachers to ensure that features are released with a high quality bar and in a timely manner.  As a team we continually influence the design and development process in order to build in quality from the very beginning.  The QA team meets together on a regular basis to discuss how we can improve our processes and promote Software Quality as a discipline.<p>View the full job description and apply online at <a href=\"http:&#x2F;&#x2F;chc.tbe.taleo.net&#x2F;chc03&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?org=DREAMBOX&amp;cws=1&amp;rid=161\" rel=\"nofollow\">http:&#x2F;&#x2F;chc.tbe.taleo.net&#x2F;chc03&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?o...</a>","time":1454519731,"type":"comment"}