{"by":"wordpressvip","id":11025645,"parent":11012044,"text":"Automattic, WordPress.com VIP (<a href=\"https:&#x2F;&#x2F;vip.wordpress.com\" rel=\"nofollow\">https:&#x2F;&#x2F;vip.wordpress.com</a>) | Remote<p>We are a distributed company, democratizing publishing and development.<p>We are the people behind WordPress.com, which serves more than 15.8 billion pages a month, as well as a host of other popular services, such as WooCommerce, Jetpack, and Simplenote. We are strong believers in Open Source, and the vast majority of our work is available under licenses like the GPL.<p>Our team members hail from nearly every continent and 43 countries around the world. Come work with us:<p>Technical Account Engineer - (<a href=\"https:&#x2F;&#x2F;automattic.com&#x2F;work-with-us&#x2F;technical-account-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;automattic.com&#x2F;work-with-us&#x2F;technical-account-engine...</a>)<p>You love working with some of the most influential companies on the planet, and helping them get the most out of WordPress and our VIP program.<p>Your style is to get things done while reducing friction for your colleagues and clients, to respond rapidly when called upon, as well as being proactive. You view companies as partners, and not just customers, and pride yourself in establishing long-term relationships. You enjoy managing projects and timelines, and working with everyone from engineers to GMs and VPs of Sales.<p>Enterprise Growth Engineer (<a href=\"https:&#x2F;&#x2F;automattic.com&#x2F;work-with-us&#x2F;enterprise-growth-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;automattic.com&#x2F;work-with-us&#x2F;enterprise-growth-engine...</a>)<p>Through our WordPress.com VIP program, we provide support, hosting, training, and other services to some of the biggest and best WordPress sites on the web.<p>Your style is to get things done with minimum friction, and to respond rapidly when called on, as well as being super proactive. You view companies as partners, and not just customers, and pride yourself in establishing long-term relationships. You enjoy doing demos and meeting with everyone, from engineers to GMs and VPs of Sales.","time":1454493307,"type":"comment"}