{"by":"BRValentine","id":11028502,"parent":11012044,"text":"Voltaiq - SF Bay Area - Full Time - Onsite - <a href=\"http:&#x2F;&#x2F;voltaiq.io\" rel=\"nofollow\">http:&#x2F;&#x2F;voltaiq.io</a><p>Multiple Positions: Data Engineering, Data Science, Frontend, Full Stack<p><i>“The battery is the technology of our time.”</i> -The Economist, January 16, 2016<p>Powering applications from consumer electronics to the IoT, EVs, medical, aerospace, and grid storage, batteries enable our modern world. However battery performance remains the key bottleneck impeding adoption of these technologies. Voltaiq is changing that, using software.<p>Voltaiq is developing a powerful cloud-based platform for data analytics, machine learning, and visualization to enable better, safer, and more reliable batteries and battery-powered products. We have customers, recurring revenue, and funding, and we’re growing our team to meet customer demand. We’re growing our team (currently 6) with product-focused developers who have a passion for shipping well-crafted software.<p>Candidates should be:<p>- Strong coders in one or more of: Python, Javascript, Java, C&#x2F;C++, Go.<p>- Experienced with Git, development on Linux&#x2F;*nix, SQL and relational databases.<p>- Degree holders in CS, Physics, Math, Engineering, or related, and interest in energy and solving hard science problems using data.<p>- US Citizens.<p>Some specifics:<p>Data Engineer &#x2F; Data Scientist<p>- Advanced database usage including scaling, distributed systems, ETL pipelines from multiple different data sources.<p>- Python analysis tools: numpy, scipy, pandas, scikit-learn, matplotlib, and machine learning, supervised learning, neural and bayesian networks, advanced statistics.<p>Frontend<p>- AngularJS, SASS or similar.<p>- Frontend build tools: gulp, bower, nodejs, obfuscation, minification.<p>Full Stack<p>- Web framework (eg Django) and deployment stack (cookies, sessions, websockets).<p>- Asynchronous messaging (eg ZeroMQ).<p>- Webserver deployment: AWS, Salt, Fabric, Nginx, uWSGI.<p>Competitive salary plus equity and full benefits.<p>Send a resume to jobs@voltaiq.io.<p>Thanks, HN!","time":1454524483,"type":"comment"}