{"by":"holidu","id":11025568,"parent":11012044,"text":"Holidu | www.holidu.com | Munich | Germany\n<i></i><i></i><i></i><i></i><i></i><i></i><i></i>*\nJob description\n<i></i><i></i><i></i><i></i><i></i><i></i><i></i>*\nWe’re looking for (senior) Android developers who love to develop worldclass native Android applications for smart-phone and tablet. You will work with a worldclass team of designers, developers and product managers, who among others have been instrumental in developing successful apps such as Candy Crush, Uber and Booking.com.\nYou will be a member of a highly motivated and international team and take over responsibility to develop our Android applications from scratch.\nWe have a strong tech-first approach and always try to work with the latest technologies to achieve outstanding solutions. On the mobile side, there is plenty of room to revolutionize the search for vacation rentals on smart phones and you will take over the technical lead for our Android developments. As such, you will contribute your creativity to find pragmatic and technologically strong solutions and your responsibility to deliver high quality work.\nThe position is based in the heart of Munich in a cool „designer“ office. You will become member of an international, dedicated and young team and be invited to join regular team events: bouldering, soccer, skiing trips, movies, etc..<p><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i>*\nSkills &amp; Requirements\n<i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i>*\nImpress us with your knowledge and apps that you have developed during and after studies. You have at least 2 years of experience in Android development and you love to develop consumer facing applications. Tell us how you can incorporate your ideas and experience into our vacation rental product.\nOur Backend is based on Java and a highly scaling AWS infrastructure. Our frontend is a super fast single-page-application. We always work with the newest technologies and always strive to find newer, quicker &amp; better solutions.\nGerman language skills are a plus.<p><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i>\nOur technology stack\n<i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i>\nBackend: Java, Spring, Play Framework, ElasticSearch; Frontend: JS, AngularJS, JQuery, Less, HTML5; Database: PostgreSQL, NoSQL; General: Git, Mac, Linux, AWS.<p><i></i><i></i><i></i><i></i><i></i><i></i>\nAbout Holidu\n<i></i><i></i><i></i><i></i><i></i><i></i>\nHolidu has the goal of creating the world’s best search apps for vacation rentals. This means that we aggregate, analyze and compare holiday homes from hundreds of vacation rental portals and present them to the user in an easy way. Founded in early 2014, we currently aggregate more than 2.2 million properties all over the world and are growing quickly.\nIf this is you, let us know as soon as possible by sending your application to Michael Siebers: developer@holidu.com","time":1454491759,"type":"comment"}