{"by":"kennpeters","id":11020040,"parent":11012044,"text":"Greenhouse [<a href=\"http:&#x2F;&#x2F;www.greenhouse.io&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.greenhouse.io&#x2F;careers</a>] | New York, NY &amp; San Francisco, CA | Full-time | Onsite<p>Greenhouse is transforming the way companies hire. Since its inception in 2012, Greenhouse has doubled in size every six months and we’ve now grown to more than 180 employees. We’ve grown our customer base by 500% in the last year alone and also raised $65+MM from top VC firms to help fuel our hyper-growth.<p>We&#x27;ve devoted this year to scaling our business, driving product innovation, and growing market share. Engineering has been, and will continue to be, a huge part of Greenhouse&#x27;s success. This team releases features multiple times per week and empowers engineers to have a direct impact on our business. And we&#x27;re hiring!<p>Here&#x27;s a glimpse at who we want to hire: \nFull Stack Software Engineers (New York): you&#x27;ll own entire features and work on product development using Ruby on Rails and Javascript with Angular &amp; React. There&#x27;s a number of scaling challenges that go along with the role, including the parallelization of large transactions with Spark&#x2F;MapReduce. To apply: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;sp2kio\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;sp2kio</a><p>Engineering Lead, Customer Solutions (New York): this role will run the Customer Solutions engineering team-- you&#x27;ll use both sides of your brain every day, whether it&#x27;s chatting with customers, running systems architecture meetings, writing code hands-on, or helping to grow your team. To apply: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;x7dgj3\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;x7dgj3</a><p>Technical Lead, Product Engineering (New York): Similar to the above tech lead position, but working with a team of full-stack engineers as opposed to Solutions engineers, and focusing more on supporting the product as opposed to our customers. To apply: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;qlxep7\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;qlxep7</a><p>Learn more about Greenhouse and our amazing team here: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;4xoevk\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;4xoevk</a>.","time":1454427334,"type":"comment"}