{"by":"mattdiam","id":11046662,"parent":11012044,"text":"MyDiamond (<a href=\"http:&#x2F;&#x2F;www.mydiamondrevolution.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mydiamondrevolution.com</a>) | Toronto, Canada | ONSITE, Part-Time | Equity Compensation<p>Contact: matt@mydiamondrevolution.com<p>Hi HN, MyDiamond (C.G. Diam) is looking for an experienced UI&#x2F;UX Developer to create engaging and highly functional web application interfaces for desktop&#x2F;tablet&#x2F;mobile. The ideal candidate will be able to take requirements, from initial concept and mockup, and deliver final assets in cross-browser&#x2F;device compatible JavaScript, HTML, and CSS.<p>You&#x27;ll work closely with the Product Director and Technical Lead to develop UX flow and use cases, along with collaboratively bringing to life our prototype design mockups, so communication skills and comfort with the critique process are crucial. We&#x27;re looking for someone with an exceptional portfolio demonstrating a keen eye for polished, beautiful design that&#x27;s not just attractive to look at, but functional and intuitive to use. This is an exciting opportunity that has a potential to make an impact in the diamond retail industry.<p>More Details on Requirements &#x2F; Experience:\n<a href=\"https:&#x2F;&#x2F;angel.co&#x2F;mydiamond&#x2F;jobs&#x2F;116572-front-end-developer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;mydiamond&#x2F;jobs&#x2F;116572-front-end-developer</a><p>About MyDiamond (C.G. Diam):\nWith a firm belief in being able to experience a diamond in person before making that special purchase, we’ve revolutionized the way you shop for diamonds. Our online service brings local search results, price transparency, diamond education and social sharing of your journey, to you on one free platform.<p>The Team:\nYou’ll be working with a young but seasoned group of co-founders that have collective experience in the Diamond industry at the wholesale level, and the Tech and Design industries working on social media and SAAS platforms reaching millions of users globally.<p>Compensation and Commitment:\nWe will be offering an equity stake of the company. This role is a part-time position (mostly work-from-home) with milestones set according to personal time commitment and company launch goals.<p>Contact: matt@mydiamondrevolution.com","time":1454735962,"type":"comment"}