{"by":"mattiasgunneras","id":11059145,"parent":11012044,"text":"Instaprint | <a href=\"https:&#x2F;&#x2F;instaprint.me&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;instaprint.me&#x2F;</a> | Brooklyn, New York, NYC - ONSITE or REMOTE | Full Stack Engineer<p>Instaprint is a small team with in-demand products. We&#x27;re starting to grow and we&#x27;re looking for an awesome person to join our small Engineering team. This is NOT a by-the-book job; we are evolving &amp; adapting, everyday. &#x27;Big picture&#x27; thinking and big-time contributions are expected from the whole team -- we&#x27;re a small group, everyone is an asset.<p>We are the de facto #1 inventors of Instagram-driven products -- designing, building and deploying technology that&#x27;s designed to promote social media activity. Our products are used by brands to extend the world&#x27;s most spectacular events, beyond location and date.<p>Over the past 3 years, we&#x27;ve been hired to appear at the Super Bowl, the Grammys, NY Fashion Week, the New York Stock Exchange, the Playboy Halloween Party, and over 800 other events.<p>Instaprint is a creation of BREAKFAST, spun off as a separate, profitable company (sharing the same roof &amp; employees). Here&#x27;s some insight into what we&#x27;re about:<p>Engadget: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=OJZgtL3PXf8\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=OJZgtL3PXf8</a><p>Adweek: <a href=\"http:&#x2F;&#x2F;www.adweek.com&#x2F;video&#x2F;advertising-branding&#x2F;f-train-agencies-breakfast-144524?auto\" rel=\"nofollow\">http:&#x2F;&#x2F;www.adweek.com&#x2F;video&#x2F;advertising-branding&#x2F;f-train-age...</a><p>We build on Postgres, Django, React&#x2F;Redux, Semantic UI. We deploy on linux&#x2F;nginx&#x2F;AWS(EC2, RDS, S3&#x2F;Cloudfront), We use Ansible and Vagrant, GitHub and Slack etc.<p>We’re based in Dumbo Brooklyn (NY), we have a large workshop and electronics rework station (we do a lot of prototyping and hardware production in our studio). Employees get unlimited vacation days, weekly friday beers, well stocked fridge with snacks and drinks, pick your own laptop&#x2F;work setup. A few times a year we take a day off and get everyone out of the office to do something fun.<p>More info on the role and team: <a href=\"https:&#x2F;&#x2F;instaprint.me&#x2F;careers&#x2F;full-stack-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;instaprint.me&#x2F;careers&#x2F;full-stack-engineer&#x2F;</a><p>Let me know if you are interested! mattias@instaprint.me","time":1454949917,"type":"comment"}