{"by":"jordanlewis","id":4053269,"kids":[4053456],"parent":4053076,"text":"Knewton: New York (NYC) - FULLTIME, INTERN, H1B\n<a href=\"http://knewton.com\" rel=\"nofollow\">http://knewton.com</a><p>We're a funded startup seeking passionate software engineers interested in machine learning, distributed systems, and \"big data\" problems.<p>Investors include Peter Thiel (Founder's Fund), Reid Hoffman, and Pearson, a leader in educational publishing. We were recognized as a Technology Pioneer for 2011 by the World Economic Forum in Davos and one of the top 25 best places to work by Crain’s New York Business.<p>We have about 80 employees right now. We pay full market salaries plus stock options, and you can take as much vacation as you need. Hours are typically 40-50 per week.\nOur product is an adaptive learning platform, which means we use machine learning and \"big data\" techniques to deliver an individualized education to each student. Our eventual goal is to make a high-quality, adaptive education available to everyone in the world. The product is used by Arizona State University right now, and we recently signed a deal with Pearson to power many of their products.<p>We're looking for new members of our technical team who are interested or have experience in:<p>* Using technology to democratize education.<p>* Machine learning and data mining, including approaches such as probablistic graphic models (PGMs), Support Vector Machines (SVMs) and Monte Carlo Markov Chains.<p>* The Java Virtual Machine (JVM) internals and performance optimization.<p>* Big data processing using NoSQL techniques like Cassandra, Hadoop, Hive<p>* Designing, implementing, and maintaining fault-tolerant service-oriented architectures that scale horizontally<p>* Thrift (the RPC protocol).<p>* Cloud computing (Amazon Web Services, Unix) and distributed systems.<p>Interested? Take a look at our job posts here <a href=\"http://jobs.knewton.com/\" rel=\"nofollow\">http://jobs.knewton.com/</a>.","time":1338557724,"type":"comment"}