{"by":"mikeryan","id":4053994,"parent":4053076,"text":"San Francisco, CA<p>A Different Engine is looking for a UI Engineer and INTERN in our San Francisco office.<p>ADE is a small interactive agency with offices in San Francisco and New York who focuses on designing and building the next generation of user applications for our customers. We build apps that run in web browsers, on mobile devices and on emerging platforms such as connected TVs.   We're looking to expand our team.<p>A UI Engineer will work with our design and development teams in building applications across a variety of platforms. They’re apprentice craftsmen who take the vision from our design team and turns it into a reality for our clients.<p>This is a junior or entry level UI engineer  (Freelancer? Drop us a line too...)<p><i>Here’s what’s cool about working for us.</i><p>1.  You’ll have fun.  We’re fun and we work with fun clients like NBC, CBS, the UFC.  We might have some late nights but we’ll keep it interesting.<p>2. You’ll become a better software engineer.   There’s really no choice, from project to project you might be working in Javascript and HTML to pure Javascript, you might need to hack together a php script and then update some Objective-C. We don’t expect you to know how to do all this when you start, but you’ll learn.  That’s how we’ve done it.<p>3. You’ll ship.  Again small shop, fast projects that ship. You will  be able to show your friends an app on TV or your mobile device and say, “I built that”.<p>4. If there’s a platform out there you want to learn (Xbox, Nodejs, iOS, Android?) we’ll probably give you chance to learn it.  We work on the cutting edge and we aren’t tied to large legacy systems. This gives us the ability to use whatever tools we like. We use Redis, Nodejs, Websockets etc.  In particular we do a lot of work on embedded platforms using WebViews (and will likely do more as Moore’s law keeps going on mobile devices) so HTML5 skills are great<p><i>Here’s a few things that we can’t provide.</i><p>1. An Exit. We’re not a startup, we’re an agency so there’s no big exit. That being said we do do bonuses at the end of the year based on how well we’ve done.<p>2. Stable work on a single project working on a single language or framework.    Again not what we do, we tend to do short 2-6 month engagements on projects for our clients we design an app, build it and then ship it.  We do it right and we do it fast.<p>3. A lot of management overhead.  We’re small (tiny really - you’d be one of our first hires) so we can’t watch over you all the time. Best if you’re somewhat self-sufficient.<p><i>Nice to have?</i><p>Here’s some skills that will help you get this job (a few of these would be nice).<p>1. \tHTML - in particular its good to know new HTML5 display elements.<p>2. \tCSS(3)<p>3. \tJavascript - this is our primary language. But we’re \nnot snobby about it.<p>4. \tObjective-C<p>5. \tAndroid<p>Think you’ve got what it takes? Drop us a line!  Please if your resume isn’t long take some time to write us a quick note or cover letter telling us why you’re the right person for this job and why you’re interested.<p>jobs@adifferentengine.com","time":1338565134,"type":"comment"}