{"by":"carterschonwald","id":4054370,"kids":[4055057],"parent":4053076,"text":"NY,NY (remote might be possible too, if you're sufficiently awesome and a good communicator)<p>Wellposed is a (very) small NYC based R&#38;D firm that supports itself with a mix of products and consulting.  We only build products (or consult for clients) if there is a kernel of challenging research grade computer science / math / engineering to be done.<p>Tech We use: for our own projects, Haskell. For JVM based clients, Scala. For iOS related work, some blend of obj-c and rubymotion (though Haskell might be viable in the near future). Also computers, those are important. (these are just the main tools. We believe in the right tool for the right job)<p>Current general areas we are working in:<p>• Machine Learning/Data Analysis/Mathematical Modeling (we think that there is plenty of room for improvement over current tools in this space, both in how the data is handled and how the analytics are performed)<p>• DSP as applied to both sound and radio, in conjunction with some interesting questions about how to do robust fast peer to peer sharing on mobile devices over a local network and/or via a custom rf transport layer. (there is more than one project in this blurb)<p>• mathematical modeling of the traffic dynamics of the modern city. (and several other projects in our queue are in the operations research/optimization space).<p>• a few of our projects also have a wee bit of hardware/device design components that are needed to make the deliverable wellposed.<p>• every other interesting area as the opportunity arises.<p>these are just the projects on our deck now, both it and the roster of great organizations we work with are growing and we hope to grow to.<p>If you are demonstrably awesome in at least one area, and would like to learn about at least 50% of the other areas, lets chat! (Of course, we're a small enough business that we'll also need to get along and communicate well).<p>if you'd like to get the conversation started, \nshoot an email to jobs atsign wellposed dot com, with subject: wellposed gigs\nand tell us a little bit about yourself, with some blend of resume, cover letter and/or links to previous work. [note that we're looking to hire for mid-late summer, not next week, and likewise I will reply to every email within a day (or week at most)]<p>I look forward to hearing from you!","time":1338569166,"type":"comment"}