{"by":"hurdleress","id":4055887,"parent":4053076,"text":"San Francisco Bay Area (South SF, CA); Counsyl is Hiring Engineers (H1B and others welcome to apply)<p>Apply online: <a href=\"http://bit.ly/Counsyl_Engineering_HN\" rel=\"nofollow\">http://bit.ly/Counsyl_Engineering_HN</a><p><i>About Counsyl</i><p>Over the last few years, we've grown from a dorm room startup to become one of the largest clinical genome centers in the world. Our pre-pregnancy genomic test is now prescribed by physicians for more than 1% of all births in the United States.<p>As you might imagine, handling this kind of volume puts us in terra incognita. Our situation is similar to the one faced by Amazon in the 90s, before anyone knew how to scale an operation with such highly interconnected physical and informational components.<p>To solve the problems associated with scaling the medical genome, we hire generalists rather than specialists. Our engineers are pragmatists who know when to use machine learning and when to use a simple regex, and understand in what sense those approaches are at different ends of a continuum. Many did not have a bioinformatics background before they joined, but all had strong fundamentals in data structures and algorithms.<p>Experience in general means little to us as genomics is a young field; working code means quite a lot more. If this sounds like your kind of company, we invite you to apply.<p><i>About you</i><p>You should have a BS, MS, or PhD in Computer Science (or equivalent) and significant independent programming experience as demonstrated by Github account, personal web page, or prior employment.<p>You should also be a generalist, interested in rotating through the engineering team and working in one or more of these areas:<p>- Genomics: design, validate, and optimize clinical genomic assays for rare Mendelian variants<p>- Machine Learning and Data Science: extract meaning out of one of the largest clinical genomic datasets in the world<p>- Robotics: automate and scale our backend to do more clinical sequencing and genotyping than anyone has ever done before<p>- UI/UX: design the first widely adopted user interface for the medical genome<p>- Clinical Integration: solve the wide variety of practical issues associated with translating genomics into a clinical context<p>- Infrastructure: build and deploy the hardware and software systems that support secure, large-scale computations on genomic datasets<p>From a skills perspective, you should have familiarity with several of the following technologies. We obviously don’t expect you to know everything on the list, but you should be nodding to yourself by the end of it.<p>- Python: Django, Numpy, Scipy, Cython<p>- HTML/CSS/JS: Coffeescript, Backbone.js, Twitter Bootstrap 2, HTML5 APIs, Chrome Web Inspector<p>- C++: STL, gcc/g++, Boost, C++11<p>- Functional Programming: Haskell, underscore.js, functional reactive programming<p>- Data Science and Visualization: GNU GSL, CUDA, Netlib/LAPACK, graphviz, R, Matlab, Matplotlib, Numerical Recipes<p>- DevOps/System Administration: Amazon Web Services, Puppet, nginx, nagios, Apache, Fabric<p>- APIs: REST, JSON, SOA, and all that jazz<p>- Biological Databases: NCBI, UCSC, 1000 Genomes, Hapmap, UK10K<p>- Sequencing/Computational Biology: OLB, samtools/pysam, pygr, galaxy/bxpython, kent utilities<p>- Unix/Linux: bash/zsh, emacs/vim, git, GNU toolchain<p>- PostgreSQL: psycopg2, hstore, replication<p>- Security: skipfish, SSL, fuzz testing, preventing XSS &#38; SQL injections<p>Again, please consider these guidelines, not absolutes. For example, if you know Chef, we figure you can learn Puppet, and if you know Ruby, we figure you can learn Python.<p>In general, you should enjoy taking care of the practical last mile problems needed to actually achieve a societal ROI on the world's multibillion dollar investment in the Human Genome Project.<p>What you'll do:<p>- Move fast without breaking things :)\n- Start in the areas you're familiar with, and grow to work on the full stack\n- Work closely with a small, tight-knit team\n- Develop algorithms and code for all aspects of clinical genomics, from machine learning to supply chain optimization to insurance billing\n- Quite literally save lives with your keyboard<p>What you'll get:<p>- Competitive compensation and start-up equity package\n- Excellent health insurance\n- Catered meals every day plus a fully stocked fridge\n- Gym access to work it off\n- MacBook Pro, 30\" monitor, iPad, iPhone, and all the gadgets you need<p>Apply online: <a href=\"http://bit.ly/Counsyl_Engineering_HN\" rel=\"nofollow\">http://bit.ly/Counsyl_Engineering_HN</a>","time":1338585962,"type":"comment"}