{"by":"dtwhitney","id":4055740,"parent":4053076,"text":"Full-Stack Web Developer / Boulder, CO<p>Pellucid Analytics is looking for several full-stack web developers in Boulder to work with us on building our quantitative finance application. We're a JVM/Java/Scala shop, and you'll have the opportunity to work with the full TypeSafe Stack, focused mainly on The Play Framework, building both a standard browser based application as well as a mobile application for the iPad. We're an Agile/Lean shop, which means we're dedicated to lean principles throughout the company as a whole - there will be no struggle trying to sell these principles to management. Also if you've taken any of the advanced computer science courses through Stanford, like Machine Learning or Probabilistic Graphical Models, and you're interested in seeing how those are applied to the financial world, Pellucid Analytics is for you.<p>To give you a better idea of what you'll be working on, we're a quantitative financial analytics company called Pellucid Analytics. Our product is going to make it easy for a team of investment bankers to pull together a massive number of analytics and visualizations from our quantitative analysis, focused on either a specific company or industry, and arrange the data and visualizations into a presentation that fits the story they are trying to tell. Our clients engage with a different Fortune 500 company every day of the week where a different analytics presentation is needed. These presentations are put together by a small team and can be as large as 100 pages long, so the ease with which our analysis can be put together is our highest priority.<p>Experience Requirements\n* 5+ years of JVM Development\n* A Desire to learn Scala and other JVM languages\n* 5+ years of Linux use\n* 5+ years of web development (HTML/CSS/JavaScript)\n* Experience with many varieties of databases, i.e. relational, non-relational, column-oriented, graph-based\n* Experience with git (our ideal candidate makes frequent, small commits)\n* Experience working with Amazon Web Services\n* Experience working with wireframes and comps<p>Experience Pluses\n* Bachelors Degree in Computer Science or a related field\n* Experience with Scala\n* Experience with the TypeSafe Stack\n* Experience with the Play Framework\n* Experience working with continuous deployment\n* Finance Experience<p>Please respond with a resume and links to previous work to jobs at pellucid dot com","time":1338584360,"type":"comment"}