{"by":"dale-ssc","id":4066137,"parent":4053076,"text":"Socialserve.com - Charlotte, NC - on-site or remote<p>We need a system administrator and a developer!  <a href=\"http://www.socialserve.com/jobs/\" rel=\"nofollow\">http://www.socialserve.com/jobs/</a><p>Socialserve.com is a 501(c)(3) non-profit that has been around for more than a decade developing and operating a variety of web-based software for governments and other non-profits, starting with our popular housing database product at <a href=\"http://www.socialserve.com/\" rel=\"nofollow\">http://www.socialserve.com/</a>. We take pride in focusing on the needs of our users and providing excellent value to our customers.  Our customers love our work and constantly want us to do more for them.<p>We're a small company using Macs on the desktop and Linux on our servers with a bevy of open source software including Python, PostgreSQL, PostGIS, Apache, Git, and Asterisk.<p>System administrator position:<p>You'll be responsible for:<p>* Supporting our Linux servers including web, database, mail, and file servers<p>* Supporting users with Mac desktops and laptops<p>* Supporting our networks<p>* Automating tasks as much as possible<p>* Maintaining relevant documentation<p>We're looking for someone with:<p>* Experience administering Linux servers and the services running on them including e-mail (SMTP/IMAP), web, and NFS services<p>* Networking experience, including a solid knowledge of common protocols like TCP/IP, HTTP, and SMTP<p>* Programming abilities, including shell scripting, so you can automate your job (Python experience is a plus since that's our primary development language)<p>* Excellent communication skills<p>Developer position:<p>We need developers to create and maintain a variety of web-based applications.  Our developers typically work solo or in small teams with a lot of flexibility to design and implement projects however they see fit.  While we're not strict adherents to any single software development methodology, we gladly incorporate processes that produce better software and happier developers including continuous integration, automated testing, and code reviews.<p>We're looking for developers with good knowledge of SQL, web development, basic Unix/Linux usage, and general computer science topics. Knowledge of Python is preferred, though may not be strictly necessary as we've found it pretty easy to pick up as long as you have experience in a couple other languages.<p>If you're interested in either of these positions please send your résumé to employment@socialserve.com!<p>Only candidates with a legal right to work in the United States, and no recruiters, please.","time":1338846571,"type":"comment"}