{"by":"uniwiz","id":4076025,"parent":4053076,"text":"Bottomline Technologies - Portsmouth, NH / South Portland, ME / Wilton CT - Full Time local<p>Position: Sr. System Administrator<p>The Senior Systems Administrator will be an integral part of the team that is responsible for the installation, configuration and maintenance of mission critical SaaS applications providing payment and legal spend management services. This position will be a key role for the SaaS team, providing technical leadership, driving execution of complex technical initiatives, and providing proactive communication and documentation.<p>You:<p>- Demonstrated technical leadership experience evaluating and recommending process and infrastructure improvements.<p>- Excellent communication and document skills.<p>- Proven experience in driving infrastructure projects in a matrixed organization<p>- Management of Linux and Windows hosts on virtual and physical Intel platforms. Management of associated storage and backup infrastructure.<p>- Management of software commonly found in an SaaS application infrastructure, such as Apache, Tomcat, Weblogic, IIS, Active Directory, DNS, SMTP, etc.<p>- Demonstrated experience managing operational security and stability of SaaS applications.<p>- Support of 24x7 SaaS web applications including on-call<p>-----------------------------------------------------------------------------<p>Position: Application Engineer<p>The Applications Engineer is part of an autonomous, fast-paced team that works to ensure successful software deployments across Bottomline’s suite of SaaS/cloud solutions. This position will combine a strong technical background with great organizational and communication skills to ensure successful deployments with minimal manual effort. They will bring a sense of urgency to troubleshooting, identifying root cause, establishing priorities, and closing issues, as well as working with internal teams to appropriately respond to customers’ needs.<p>You:<p>- 2-3 years of related experience or proven technical skills automating processes and procedures.<p>- Understanding of standard concepts, best practices and procedures for Release Engineering.<p>- Experience and understanding of change management processes.<p>- Knowledge and experience in scripting languages such as shell, Perl and Python.<p>- Experience with Apache, Tomcat, Lotus Notes, WebLogic, WebSphere, IIS, MSSQL, DB2, Oracle<p>- Experience supporting and troubleshooting server operating systems, web servers, application servers, and database systems.<p>- The ability to configure and deploy Java applications in a SaaS environment.<p>- Strong attention to detail with excellent organization skills as well as excellent written and verbal skills<p>-----------------------------------------------------------------------------<p>To apply: Send an email to zmitrovic@bottomline.com with your resume and couple lines about yourself.","time":1339014478,"type":"comment"}