{"by":"xyzzyb","id":4080790,"parent":4053076,"text":"PhishMe (Chantilly, VA) - Full time, local or remote<p>We're growing our Rails development team by one. We're a cool team that's (so far) entirely remote.<p>Details:<p>PhishMe is seeking a motivated individual to join its software development team. While our primary SaaS web application is a Ruby on Rails project, the successful candidate will be well-rounded in various languages with solid, hands-on Rails experience.<p>This is a full time position working for PhishMe, Inc. Outsourced or software development contractors should not apply.<p>Qualifications<p>Successful applicants must have:<p><pre><code>    1 - 2 years of professional development experience with Ruby or Python.\n    Must be fluent in the fundamental components of web application development.\n    Thorough understanding of source control management. You should know how (and when) to make branches, how to merge changes, resolve conflicts, etc.\n    Able to work on a team, independently when necessary, to escalate problems when appropriate, and to thrive in a small business environment.\n    Good oral and written communication skills.\n</code></pre>\nBonus!<p>The following attributes are preferred, but not required on day-one:<p><pre><code>    BS or BA in computer science, management/computer information systems, or related field.\n    Able to research, debug, and resolve cryptic error messages.\n    Experience writing triggers and stored procedures, when necessary.\n    Solid customer support experience (retail, help desk, consulting, etc.).\n    Familiarity with Moonshine, Capistrano, and/or Shadow Puppet.\n    Ability to do simple image creation and manipulation with the GIMP or Photoshop.\n    Mobile application development (iPhone and Android).\n</code></pre>\nCompensation<p><pre><code>    Competitive salary + stock\n    Pick your workstation and OS\n    Retirement plan with 3% company match\n    Health, vision, dental, telecommuting expense reimbursement, etc.\n    Peers that enjoy appropriate use of internet memes e.g. &#60;facepalm&#62; vs. &#60;double facepalm&#62;\n    Enjoy your nights and weekends!\n</code></pre>\nApply at <a href=\"http://phishme.com/careers.php#senior_developer\" rel=\"nofollow\">http://phishme.com/careers.php#senior_developer</a>","time":1339096414,"type":"comment"}