{"by":"urlwolf","id":4089768,"parent":4053076,"text":"Berlin (Germany), CTO/ lead developer<p>We are a funded (seed) startup working on a customer analytics tool for online retailers.We are two people looking for a head of development / CTO. We have offices in Berlin, funding for one year and the package includes very generous shares for the right candidate. We use lean startup methods, and can systematically test hypotheses on any market. Hundreds of customer interviews already done. Our approach is the ‘startup of startups’, that is, iterate fast and discard what doesn’t work, even if the new product looks like a completely new application (and startup!).<p>What we do:<p>-----------<p>Customer Lifefitime Value (CLV) is the mythical ‘magic number’, the amount of money a particular customer will ever bring in. Knowing your CLV makes it trivial to:\n- optimize marketing spend for different inbound channels.\n- identify your highest value customers, \n- identify those in danger of never coming back.<p>Most shops have a ‘gut feeling’ of what their CLV is, but no way of knowing for sure. Yet this is the number that would make the largest impact to their bottom line, if only it was possible to have it. Ah! Predicting the future is hard, right?<p>It turns out CLV can be computed with surprising accuracy (10% error) at the individual level. At Fluidshopping, we use sophisticated bayesian models to estimate CLV. We look beyond what has happened in the past (which you get with say google analytics). CLV changes often, due to your marketing actions, season, or changes in the market. We retrain our models weekly to reflect those changes, and then suggest the actions that would make the largest impact (email campaigns, popups with offers triggered by user behavior on your site, etc).<p>Requirements:<p>-------------<p>You can apply with any language. But we need code samples. Let us see something you build; please explain what it does and how to run it if it’s not obvious. We prefer github projects. Do not send code samples that do not make sense out of context. We are looking for a difficult problem you solved, or a common problem that you solved in a novel way.<p>You need to be within 5 years of your last academic appointment, or graduation. That is, if you graduated from university more than 5 years ago, you are not eligible. You can also apply if you had a job in research settings within the last 5 years. We do not care about you having a title, but we are funded by the government, and they do. They want to see someone with a compSci-related title. We are really sorry in advance if the requirement excludes you, a great hacker who doesn’t have a title.<p>Responsibilities:<p>-----------------<p>Your responsibilities will be to work on new key features, help us scale, contribute to the product and optimize performance. You’ll be the CTO in an agile development environment. Customer interviews tell us our solution attacks a very obvious pain point for online retailers, a large market that is ripe for disruption. As a CTO, you will make decisions to make sure our solution ‘just works’ for clients. We have excellent talent for both front-end and back-end development, so you are free to concentrate on the problems that matter most (architecture, models, etc). But of course, in a small team you will need to write production-quality code yourself.<p>Nice to have:<p>------------<p>Mongo or similar NoSQL db\nJavaScript, Backbone.js, node if you have used it in production\npython/django, ruby/rails or any other web framework\nFamiliarity with HTML5 (websockets)\nR or any other data-friendly language with lots of libraries\nFamiliarity with probability theory and modeling<p>Perks:<p>------<p>Work from home (optional)\nStock options in two-digit range\nDog\nTerrace with barbecue\nIn the center of the Berlin startup ecosystem\nContinuous deployment, strong testing culture<p>contact: jobs@fluidshopping.com","time":1339288073,"type":"comment"}