{"by":"jamieiles","id":11203360,"parent":11202954,"text":"Full time, remote within US and UK<p>Ksplice is the leading technology that allows administrators to patch the critical components of a Linux system on the fly with zero downtime and zero disruption. We&#x27;re a distributed team of engineers forming part of the Linux and Virtualization group at Oracle with a passion for working on exciting technology, software craftmanship and all things Linux.<p>We&#x27;re looking for experienced DevOps and Systems professionals to join our team.<p>As a DevOps engineer, you would be responsible for managing Ksplice&#x27;s infrastructure for building and serving critical security &quot;hot fix&quot; updates for various flavors of the Linux kernel and for user space applications. Our customers depend on us to keep their systems up-to-date and secure, so we would depend on you to make sure our systems stay running and secure. Ksplice has a rich infrastructure that utilizes virtualization heavily. We are looking for somebody who can help us take that infrastructure and modernize it.<p>As a systems engineer, you would be responsible for expanding Ksplice to patch even more of the system, adding support for new releases and improving our workflow. If you take pride in crafting software, don&#x27;t rest until you full understand complex problems and are curious about what happens on the layer below then Ksplice will be of interest to you. You&#x27;ll like working at all levels of a Linux system, developing tooling in Python, building distributed systems and solving difficult problems at each layer.<p>The Oracle Ksplice team is a remote team, so you must be comfortable interacting remotely and working autonomously. We are a small team that expects its members to be comfortable with self-directed work. We won&#x27;t micro-manage you, but, in return, we expect you to learn your job well enough that you know what is important to work on.<p>More information about Ksplice is available at <a href=\"http:&#x2F;&#x2F;ksplice.oracle.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;ksplice.oracle.com&#x2F;</a> and you can contact me by email at jamie.iles@oracle.com for more detailed specs. Oracle is an equal opportunity employer.","time":1456847184,"type":"comment"}