{"by":"jastanton","id":11205942,"parent":11202954,"text":"Convoy | <a href=\"https:&#x2F;&#x2F;convoy.com\" rel=\"nofollow\">https:&#x2F;&#x2F;convoy.com</a> | Seattle, WA | Relocation | ONSITE<p>Javascript, Node.js, React, React Native, Redux, iOS, Android. Frontend, Backend, Mobile.<p>We&#x27;re optimizing the trucking and logistics industry; automating what is, today, a $749B industry that still runs on fax machines and phone calls. Currently backed by top tier investors. Read about us: <a href=\"http:&#x2F;&#x2F;fortune.com&#x2F;2015&#x2F;10&#x2F;27&#x2F;superstar-investors-back-convo..\" rel=\"nofollow\">http:&#x2F;&#x2F;fortune.com&#x2F;2015&#x2F;10&#x2F;27&#x2F;superstar-investors-back-convo...</a>.<p>I&#x27;m employee #3 at this company, having worked at big companies like Google and small startups before I can say I&#x27;ve never had a bigger opportunity for success than this. The team of engineers are smarter than any team I&#x27;ve ever been on, I&#x27;m growing as an engineer and leader every day, the problems we are solving are very real and we are impacting peoples’ lives every day. I couldn&#x27;t ask for a better situation!<p>Software engineers &#x2F; Designers &#x2F; Sales &#x2F; Operations.<p>Engineering positions available:<p>• Front-end engineer - Live and breathe JavaScript, HTML, and CSS? Come work on our single-page app using React and redux!<p>• Mobile engineer - We have Android and iOS apps, and we’re interested in people competent in either native or react-native mobile development (both is a huge plus). These are beautiful, bulletproof apps that solve real-world problems for truck drivers and carriers.<p>• Back-end engineer - We’ve got some fun CS problems to solve around route optimization and market making, plus working on the API that connects all these clients.<p>If you’re a high-performing engineer but don’t have one of these specific tools on your belt, we’d still love to talk. We trust awesome people to learn the tech!<p>If you&#x27;re in Seattle (or willing to relocate) and looking to be on a small team where you can have a huge impact, email me at jobs@convoy.com or check out our jobs page \n<a href=\"https:&#x2F;&#x2F;convoy.com&#x2F;about.html#jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;convoy.com&#x2F;about.html#jobs</a>","time":1456865445,"type":"comment"}