{"by":"davepav","id":11205666,"parent":11202954,"text":"Front End Engineer | Remote (EU Preference, US OK) | $60k, No Equity<p>Placeavote lets you read, debate and vote on every bill before congress in the US. We want to empower voters in the US to really have their voices heard in congress, and we believe that our technology will change voters lives to do that.<p>The Role:\nTo guide the development of the front end web application for Placeavote. To add new features, enhancements and functionality to the web interface. Be aware of trends in web technologies and apply them applicably where necessary to our product. To continually want to develop your own skills within the team and engineer a good dependable solution for a social platform focussed upon politics. To be able to work within a multinational team to deliver and understand the Placeavote application.<p>Requirements:\nYou are more than familiar with Angular. You should be comfortable with creating new directives, services, and controllers (and know when to use which one). Be able to demonstrate&#x2F;explain an understanding of the S.O.L.I.D. principles. Give an explanation on the importance of testing and the benefits of having well tested code. Have an understanding of TDD, Continuous Delivery and Continuous Integration. Have experience with development tools, including but not limited to Gulp, Browserify, Git and Npm. Be comfortable working in a team setting using Slack, Skype, and project management tools like Trello. Be willing to learn and adapt to changing technologies to progress the project in the most suitable and beneficial way. This is a remote position, and we’re looking ideally for someone within the EU timezone. You have solid communication skills, both written and spoken and the ability to work closely in tandem with other developers.<p>Benefits:\nA Macbook Pro (or equivalent) to do your work on from anywhere you choose in the world (preferably EU for the first 6 months). A flexible policy on vacation time, just clear it with senior staff. Join us on planned trips to Lisbon &amp; California this year, stay for as little time or as long as you want.<p>Apply at jobs@placeavote.com","time":1456862921,"type":"comment"}