{"by":"chucknb","id":11207791,"parent":11202954,"text":"NationBuilder - Los Angeles, CA &amp; Remote - Full Time - Software Engineer, Senior Software Engineer, Web Designer<p>NationBuilder is an online Community Organizing System built by a world-class team dedicated to empowering a new generation of leaders and creators with the tools they need to create a new world. If you&#x27;re seeking to build something truly important - a genre-defining new product that is already changing people’s lives. Check out what we build: <a href=\"http:&#x2F;&#x2F;nationbuilder.com&#x2F;mission\" rel=\"nofollow\">http:&#x2F;&#x2F;nationbuilder.com&#x2F;mission</a><p>If you&#x27;re in Los Angeles, join NationBuilder as we welcome Rick Bradley, Principal Engineer of Puppet Labs. Light appetizers, beer and wine will be served directly following the presentation. <a href=\"http:&#x2F;&#x2F;nationbuilder.com&#x2F;omg_what_did_we_build\" rel=\"nofollow\">http:&#x2F;&#x2F;nationbuilder.com&#x2F;omg_what_did_we_build</a><p>Software Engineer (Los Angeles&#x2F;Remote): As a developer you’ll help us architect, build and maintain our main codebase as well as ancillary services. <a href=\"http:&#x2F;&#x2F;nationbuilder.com&#x2F;software_engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;nationbuilder.com&#x2F;software_engineer</a><p>Senior Software Engineer (Los Angeles&#x2F;Remote) As a senior developer you’ll help us architect, build and maintain our main codebase as well as ancillary services. You’ll recommend and implement system-wide improvements, new technologies, and contribute to our technological direction. <a href=\"http:&#x2F;&#x2F;nationbuilder.com&#x2F;senior_software_engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;nationbuilder.com&#x2F;senior_software_engineer</a><p>Web designer (Los Angeles) We&#x27;re seeking a web designer to contribute to the limitless scope of design needs at NationBuilder, software for leaders. Your responsibilities will include maintaining the NationBuilder brand, crafting delightful web experiences to help tell the NationBuilder story, and taking a central role in the evolution of design at the company. <a href=\"http:&#x2F;&#x2F;nationbuilder.com&#x2F;designer\" rel=\"nofollow\">http:&#x2F;&#x2F;nationbuilder.com&#x2F;designer</a><p>Our tech stack is primarily Ruby on Rails along with some Ruby and Golang services utilizing PostgreSQL and MongoDB. Managed by Puppet.","time":1456886610,"type":"comment"}