{"by":"crankin","id":11206310,"parent":11202954,"text":"Chicago, IL | Pangea Properties | Onsite, full time<p>We&#x27;re looking for a senior developer to join our team to help us design the next generation of Customer Relationship Management software. We have a small, young team who&#x27;s eager to learn and need the right leader to help mold and push forward a vision for our software.<p>Pangea is a team of self starters. We pride ourselves on promoting within which is why we need you! Your only directive is to find solutions to problems. If you need a lot of oversight and direction this is not the role for you. We&#x27;re expecting someone who&#x27;s hungry to tackle issues and find creative ways to move the business forward.<p>We&#x27;re not a specific type of shop, Rails, NodeJS, whatever. We use the best tool for the job and sometimes that means building our own frameworks. We expect you to make a judgment call on the right tool to use and the implementation strategy.<p>We&#x27;re a real estate company but the technology team is focused on building general purpose tools. Helping business teams streamline their work and be more effective. Here are some of the things we&#x27;re either doing or trying to do.<p>- Customer Relationship Management\n\t- Workflow Automation\n\t- WebRTC\n\t- Mobile Application Development\n\t- Automate Money Order &amp; Check Processing\n\t- Route Optimization\n\t- Process Automation\n\t- Inventory Management\n\t- Predictive Modeling<p>We&#x27;re located in the River North neighborhood. With the technology wing overlooking the south-west parts of downtown Chicago. Working remotely is allowed and encouraged if that&#x27;s where you&#x27;re most productive but remember we&#x27;re looking for a team leader so sometimes that means being on site to lead the charge. If things get a little rough, and they do at times, you can hit one of the two kegeraters to get you the &quot;inspiration&quot; you need.<p>Please email me at crankin@pangeare.com I&#x27;m head of technology here.","time":1456868459,"type":"comment"}