{"by":"terokay","id":11204770,"parent":11202954,"text":"Devicebook | Bellevue, WA | Full-time | Onsite<p>Devicebook is a well-funded early-stage startup company in the Bellevue, Washington area, developing original IoT-related technologies.   Our team includes an entrepreneur who has track records of building multiple successful companies, executives from billion dollar companies, architects who have consistently transformed ideas into successful products, computer scientists solving algorithmic problems, and seasoned engineers building production software systems.<p>We believe the increasingly affordable hardware and pervasive wireless connectivity will open up tremendous opportunities that were previously cost-prohibitive to address.  We believe a small core team can make a big impact on the technology space, bringing innovation and differentiation by solving the right problems.<p>We are seeking engineers in the mobile clients and cloud backend areas. Send your resume or Linkedin profile to careers@devicebook.com<p>We are currently looking for:<p>1. Senior User Experience Designer\n- Create interaction models, execute quick prototypes, and design production-ready user interfaces.\n- Work with product team to define features needed to make activities intuitive, addictive, delightful and fun.\n- A portfolio demonstrating user-centered design solutions. - Strong knowledge in usability principles and techniques.\n- B.Sc. degree in design, human-computer interaction or 7+ years equivalent professional experience.\n- Able to rapid prototype in HTML, JavaScript and CSS is a strong plus.<p>2. Senior App Store Backend Engineers\n- Design store catalog, rating and search functions.\n- Experience building high transaction volume system.\n- Proficient in NodeJS, REST&#x2F;JSON, WebSocket, AWS.\n- Prior experience in relational and NoSQL data modeling.\n- B.Sc. or M.Sc. in Computer Science.<p>3. Senior Mobile Application Engineers with 2D Graphics Experience\n- Develop sophisticated mobile applications.\n- Enjoy building beautiful and simple&#x2F;intuitive user interfaces.\n- Experience in delivering production-quality responsive designs, including phone and tablets.\n- Experience in building animations with 2D graphics.\n- Proficiency in at least one mobile platforms:  IOS, Android, UWP.\n- B.Sc or M.Sc. in Computer Science.","time":1456856398,"type":"comment"}