{"by":"chrisbrookins","id":11203216,"parent":11202954,"text":"Remote JavaScript Engineer at Help Scout<p>Apply at <a href=\"https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;204256\" rel=\"nofollow\">https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;204256</a><p>More about our culture at <a href=\"http:&#x2F;&#x2F;helpscout.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;helpscout.com&#x2F;careers</a><p>The 19-person engineering team at Help Scout is full of people dedicated to a wonderful experience for our 5,000+ customers in more than 60 countries. We’re excited to add the third full-time JavaScript engineer to the team, who will work on our Docs product.<p>We work remotely and autonomously for the most part, which is why this position requires senior-level skill and experience. We&#x27;re looking for folks who write tests and are rather stubborn about quality front to back.<p>We Use\n- Backbone.js, Marionette, jQuery\n- PHP &#x2F; Java (for backend &amp; APIs)\n- Node.js<p>You&#x27;ll be part of a 3-person team that owns our Docs knowledge base product. The other two engineers work on the Java API and you’ll be responsible for the single-page app that makes up the admin interface. On a given day you’d be adding new features, writing tests and improving performance.<p>You’ll also work with two other full-time JavaScript engineers on the team to maintain and improve the standards and best practices we want to use across all Help Scout products. Our design team owns most of the html&#x2F;css work and will help you make sure everything ends up being pixel perfect.<p>You may also end up doing some work on the Docs front-end that’s customer-facing (like docs.helpscout.net), which is just lightweight Scala templates and jQuery.<p>Aside from a weekly check in and bi-weekly planning meeting, you&#x27;ll be able to work interruption-free. 90% of our communication happens in Slack. You can work anywhere in the world as long as you have 4+ hours of overlap time with your teammates.<p>Everything is secondary to the customer experience. We expect you to have a keen sense of how your code will impact the experience in terms of performance, security and usability.<p>You&#x27;ll be working with product people that challenge you to get better every day. The founders are technical and committed to creating a magical experience for customers. You&#x27;ll deploy work that moves the needle for businesses around the world.<p>Apply at <a href=\"https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;204256\" rel=\"nofollow\">https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;204256</a>","time":1456846347,"type":"comment"}