{"by":"pixelmonkey","id":11205382,"parent":11202954,"text":"Parse.ly - <a href=\"http:&#x2F;&#x2F;parse.ly\" rel=\"nofollow\">http:&#x2F;&#x2F;parse.ly</a> - Fully Remote - Full-Time<p>We are hiring a software engineer to work on our real-time analytics dashboard. Pythonistas and JavaScript hackers especially desired.<p>On the company: We&#x27;ve built a real-time content measurement layer for the entire web.<p>Our analytics platform helps digital storytellers at some of the web&#x27;s best sites, such as Arstechnica, New Yorker, Mashable, The Next Web, and many more. In total, our analytics backend system needs to handle over 50 billion monthly events from over 475 million monthly unique visitors.<p>Our entire stack is in Python and JavaScript, and our team has innovated in areas related to real-time analytics, building some of the best open source tools for working with modern stream processing technologies. Our UX&#x2F;design team has also built one of the best-looking dashboards on the planet, using AngularJS and d3.js. You can see some screenshots: <a href=\"http:&#x2F;&#x2F;parse.ly&#x2F;tour\" rel=\"nofollow\">http:&#x2F;&#x2F;parse.ly&#x2F;tour</a><p>Our distributed team is best-in-class and we happily skip commutes by working out of our ergonomic home offices. Here&#x27;s a photograph of mine running two full-screen Parse.ly dashboards on my monitors: <a href=\"https:&#x2F;&#x2F;flic.kr&#x2F;p&#x2F;v1NZ73\" rel=\"nofollow\">https:&#x2F;&#x2F;flic.kr&#x2F;p&#x2F;v1NZ73</a><p>We are currently looking for software engineers to help us build the best real-time analytics dashboard the world has ever seen. The only requirement is some experience in Python&#x2F;JavaScript. Bonus points for an interest in information visualization, Edward Tufte, and d3.js. To see an example of how we work, check out the blog post, &quot;Whatever It Takes&quot;: <a href=\"http:&#x2F;&#x2F;blog.parsely.com&#x2F;post&#x2F;46\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.parsely.com&#x2F;post&#x2F;46</a><p>Apply now by sending a CV&#x2F;website, github link (if available), and 1 paragraph intro to work@parsely.com. Let us know what part of the position interests you, or point us toward an interesting project or piece of code you wrote. Also, mention the HN Who&#x27;s Hiring thread.","time":1456860665,"type":"comment"}