{"by":"benweatherman","id":11204664,"parent":11202954,"text":"Ordoro | Austin, TX | Full-time | Onsite (we&#x27;ll pay relocation)<p>Ordoro makes it easy for e-commerce businesses to ship orders and manage inventory. Everyday our software helps thousands of small businesses save lots of time and make more money by simplifying and automating the shipping process. It&#x27;s not a glamorous space, but we make it awesome. We&#x27;re well funded and have strong revenue.<p>We need a great devops&#x2F;DBA&#x2F;sysadmin. We really love postgres, continuous deployment, and easy to use tools and you should too!<p>We&#x27;re a small team so you&#x27;ll have the opportunity to make a huge impact. We only have 9 devs on the team, but we code hard to make Ordoro awesome. We&#x27;re serious about having fun while we work. We&#x27;re also serious about taking time off to enjoy the things you miss when you&#x27;re constantly stuck behind a keyboard. Bonus points if you can make us laugh or cry.<p>We’re currently moving all of our infrastructure from Rackspace into Amazon, and trying to take advantage of all the great services they provide. We’re good app developers, but we’re horrible ops developers. We need you to help us navigate the weird world of IAM, lambda, API gateway, SNS, SQS, EC2, RDS, redshift, cloudformation, and on and on. We’ve worked hard to make our ops tools work well in Rackspace, but we’re ready for you to make them as awesome as our application code.<p>In the first 2 days you&#x27;ll commit and deploy code to production. In the first 2 weeks you&#x27;ll help us transition a small project from RAX to AMZN. In 3 months you&#x27;ll be completely responsible for all ops-related activities. In 6 months you&#x27;ll be running the company<p>You&#x27;ll get the normal startupy benefits:<p>- A paycheck<p>- Equity in the company<p>- Health, dental, and vision insurance<p>- 401k (though we don&#x27;t match yet)<p>- Unlimited time off<p>- Whatever gear you need for the job<p>email ben@ordoro.com","time":1456855681,"type":"comment"}