{"by":"jpm_sd","id":11203995,"parent":11202954,"text":"Saildrone Inc. | <a href=\"http:&#x2F;&#x2F;www.saildrone.com&#x2F;#Careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.saildrone.com&#x2F;#Careers</a> | Full-Time ONSITE | Alameda, CA<p>DATA ENGINEERING LEAD<p>Data is Everything. We can&#x27;t understand what is happening to our oceans and climate without it. However, while obtaining precision ocean data is very tough, it is only a small part of the puzzle. Storing, visualizing and distributing the data to scientists and customers, in a form that they can manage, understand and manipulate, is a gargantuan task. A task that the ocean community has not yet been able to fully solve. At Saildrone, we intend to solve that problem and are looking for a transformational individual to spearhead that challenge.<p>Our fleet of Saildrones collect data at a rate, precision and price point that was previously impossible. With NOAA approved data precision and demonstrated reliability, we are now growing our fleet of autonomous vehicles from tens to hundreds, hence need a data architecture that can meet the demand. Challenges range from simply collecting and storing that data in reliable and secure repositories, to visualization and sophisticated augmentation of that data with third party data sets and satellite oceanography, all without compromising precision and always maintaining instant access to raw data. Regularly changing payloads, with different parameters and constantly varying sampling frequencies, give unique challenges to even the latest data storage solutions.<p>Saildrone is searching for more than a &#x27;software engineer with data skills&#x27;. We need a &#x27;Data Jedi&#x27; with deep knowledge of the software systems that create, store and distribute our data, coupled with an understanding of the challenges ahead as we create the richest and most advanced ocean data set on the planet.<p>INFRASTRUCTURE ENGINEERING LEAD<p>Our Saildrone vehicles operate in one of the harshest environments on the planet, sending back consistent, high quality data, on extreme duration missions. While each Saildrone vehicle is incredibly robust, we also need a back-end and server-side infrastructure that is equally robust to support our drone network and data repositories.<p>At Saildrone, we are looking for an energetic and dynamic engineer to lead the ongoing creation and maintenance of our technical infrastructure. Responsibilities will range from network and tech-ops at our shoreside headquarters, to managing our cloud based networks and data repositories. Technical challenges range from optimizing performance and reliability to enabling rapid scalability. Ideal candidates would also have some experience at sys-admin level on embedded Linux hardware. This role requires both a strong technical mindset to solve complex problems as well as the people skills to grow and develop the team.","time":1456851269,"type":"comment"}