{"by":"BornInTheUSSR","id":11204958,"parent":11202954,"text":"Experienced Rails Developer | NYC<p>DESCRIPTION<p>Brickwork is a rapidly growing startup that is changing the way customers engage with brick &amp; mortar stores, online. We are looking for senior software engineers to help us shape the product and the company while growing with us.<p>About you: You are an experienced full-stack Ruby on Rails developer comfortable working both on the front-end and back-end. You have a love of great products and the craft of coding. You are ready to have a big impact on our codebase, engineering process and culture. Ideally, you’re excited about helping to build strong engineering and product culture in NYC (this position is in our NYC office).<p>About us: We are a smart, efficient and fun team (if we say so ourselves) that has a great time working together. Brickwork is funded, has a strong customer pipeline and is poised for tremendous growth. We care far more for results than we do face time, but we certainly enjoy each others’ company. We also understand that there’s life outside the office, and that a well rounded team brings their best to work each day. This is a marathon and not a sprint and we are focused on building a company for the long haul.<p>REQUIREMENTS<p>* 2+ years’ Ruby or Rails experience<p>* Experience working on a large Rails codebase<p>* Computer science education a plus, but not essential (some of the sharpest developers we’ve worked with have transitioned from other fields)<p>Ideally you are:<p>* A driven, passionate, get-@&amp;^$-done type<p>* Excited about working with a top-notch team with which you can share knowledge and mutual respect<p>* Unafraid to be opinionated and to think deeply about the product we’re building<p>BENEFITS<p>* Competitive compensation<p>* Generous equity grants<p>* Full medical benefits<p>Get in touch at EED4E17E51 AT jobs.workablemail.com with a product you have discovered recently and links to where we can learn more about you.","time":1456857775,"type":"comment"}