{"by":"iambrandonn","id":11203732,"parent":11202954,"text":"Kuali | Lehi, UT, possibly REMOTE | Full Stack Javascript Engineer<p>Kuali builds open source higher ed solutions in a competitive space where users are just waiting to be delighted.<p>Why join us? Our work matters — we’re helping our customers improve the quality of education by decreasing administrative costs. We compete in a competitive space where users are saddled with outdated, inefficient, legacy ERPs and eager to be delighted. We’re generating revenue and growing quickly with nearly 150 customers and 50 employees. You’ll have a significant impact on what we do and how we do it because we are an empowered group of entrepreneurs. Plus, you’ll get to work with some truly amazing people at a fast-growing, design-centric EdTech startup.<p>Kuali is committed to open source software development funded by SaaS revenue and development projects. If you’re looking to make your fortune off a quick flip with no business model, you’d be happier someplace else. The Kuali community recently celebrated its 10 year anniversary, and the participating colleges &amp; universities are rooting for us to deliver something amazing with the next generation of Kuali products.<p>We offer a truly exceptional benefits package including full premium coverage for employee and dependent medical and dental care. We offer 401(k) matching, employee profit sharing and all the paid-time off that you need (just work it out with your manager).<p>If these company values appeal to you then we should talk:\n- Delivery Amazing Experiences\n- Cultivate Openness\n- Iterate to Evolve\n- Act with Accountability\n- Assume the Best\n- Practice Humility<p>Our products help universities and colleges manage their administrative business so they can focus on their mission of teaching and learning. They replace cumbersome legacy systems built by big ERP companies. Our Financials product has been in production since 2008 and is used in multiple countries. It has improved efficiencies and audit experiences for our customers but needs improvement in the areas of user experience, configurability, extensibility, and fit for the cloud and continuous delivery. And, of course, there are tons of new features we would like to add. In the past year, we’ve made great progress. Our team’s knowledge and skills are deep and wide, we work hard, we are open and collaborative (everyone has a voice and contributes), and we have fun. We’d love your help as we continue to evolve.<p>To learn more about our engineering positions go here: <a href=\"https:&#x2F;&#x2F;www.kuali.co&#x2F;company&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kuali.co&#x2F;company&#x2F;careers&#x2F;</a>","time":1456849612,"type":"comment"}