{"by":"choijoy","id":11207845,"parent":11202954,"text":"MoveWith | San Francisco, CA | Full Time | Onsite | Head of Engineering | <a href=\"http:&#x2F;&#x2F;www.movewith.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.movewith.com&#x2F;</a><p>MoveWith is reimagining fitness and wellness. We believe that people are our greatest motivators and we’re creating a platform that makes it easy to connect with the most inspiring teachers in a thriving community.<p>We’re looking for an extraordinary Head of Engineering to join our leadership team and help us scale an industry-changing platform that ignites communities and empowers fitness teachers. You will lead and build alongside our engineering organization, taking charge of mobile, web, internal operations, and integrations. As a key member of the leadership team, you will work in lock step with product to help shape the roadmap and translate all requests into shippable product. Your day-to-day will include coding, management of people and projects, feature planning, strategic thinking, recruiting, and inspiring leadership. Your success will come from your expert understanding of technology, clear understanding of the business, and undeniably strong people skills. We are a people-first company that fosters unparalleled community through social sweat. If you love people, quality code, and an occasional new experience, you will thrive at MoveWith.<p>You will\n• Oversee architecture while doing hands-on coding\n• Set project milestones, manage progress, and report potential issues\n• Set technical direction for the company and come to leadership with technical ideas for improving product\n• Collaborate with leadership to build an innovative engineering organization \n• Recruit, inspire, and lead a thriving team\n• Take a deep interest in user experience and engage your team in following suit\n• Set high strong standards for quality code and documentation\n• Create a metrics-driven product development process with weekly reporting to stakeholders<p>How to Apply: \nPlease send your resume to jobs@movewith.com","time":1456887694,"type":"comment"}