{"by":"olivetti","id":11203112,"kids":[11206102],"parent":11202954,"text":"Qualtim&#x2F;Pushing7 | Madison, WI | Multiple Positions | ONSITE, Full-Time |<p>We&#x27;re a multi-faceted marketing &#x2F; web development firm. We&#x27;re an established (20+ years) company in the Madison, WI area associated with the structural building component (think trusses and wall panels) industry, and looking for some new additions to our dev team.<p>We&#x27;re looking for a PHP developer who has an affinity for Drupal development and an interest in creating customized solutions for a diverse set of clients in a variety of industries. If you&#x27;d like to help us build a better mousetrap, improve on existing solutions create entirely new ones, please get in touch. Additional information and instructions for submitting a resume can be found at <a href=\"http:&#x2F;&#x2F;www.qualtim.com&#x2F;careers&#x2F;web-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;www.qualtim.com&#x2F;careers&#x2F;web-developer</a>.<p>Pushing7 is also looking for a full-stack JavaScript&#x2F;TypeScript dev. We write custom Node applications, with the occasional SPA or Metalsmith-powered static site, for a variety of clients solving a variety of problems - most recently engineering ones. We use Angular 1.x on the front end, with Koa on the backend and TypeScript along the whole stack. We&#x27;ve even gotten our hands dirty with hybrid mobile apps using Ionic and Cordova. If any of that jumps out to you, get in touch with me at nlange@qualtim.com; let&#x27;s talk about your favorite npm module. Additional details for this position can be found at <a href=\"http:&#x2F;&#x2F;www.qualtim.com&#x2F;careers&#x2F;javascript-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;www.qualtim.com&#x2F;careers&#x2F;javascript-developer</a><p>I&#x27;ve been here for nearly eighteen months. It feels very much like a startuppy company - on-site childcare, rec facility, shoes-optional, cool with remote work - but with the work-life balance and stability of a &quot;greyer&quot; one. Madison is an awesome town, and since 2014 has been ranked by Livability.com as one of the best places to live in the USA.","time":1456845647,"type":"comment"}