{"by":"loganu","id":11206533,"parent":11202954,"text":"Seattle | Maybe remote | CTO | UAV &#x2F; Drone programmers | DroneSeed.co<p>DroneSeed is bringing tree-planting drones, remote-sensing data, and predictive analytics to the forestry industry. We&#x27;re building a fleet of 15 drones to fly over forested areas and fire seed capsules into the ground with pneumatics. It&#x27;s pretty cool. We&#x27;re a 4-person TechStars company in Seattle <i>right now</i>, we&#x27;ve got our first customers, and we&#x27;re looking to hire in two positions.<p>We&#x27;re looking for a Co-Founder CTO. Ideal candidate will have experience working with either GIS and Image processing, or UAV flight planning, as well as working with large data sets. Capable of leading a team, the candidate will be designing backend architecture, can estimate hours and evaluate talent. You&#x27;re keen to provide the software element to our hardware and business skills. Helpful but not required experience includes: \nArcGIS or QGIS, PixHawk, Pix4d, AgDrone, Python, Q Ground Control, ArduPilot, Python.\n<a href=\"https:&#x2F;&#x2F;angel.co&#x2F;droneseed&#x2F;jobs&#x2F;115308-cofounder-cto-drone-seed-planting\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;droneseed&#x2F;jobs&#x2F;115308-cofounder-cto-drone-s...</a><p>UAV Mission Planner: This position will be charged with owning the software stack to allow 15 drones to be pre-programmed on how to plant tree seeds, where to go, and how to land autonomously. You have 1-4 years experience working writing code for mission planning software. <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;droneseed&#x2F;jobs&#x2F;114965-software-engineer-uav-mission-planner\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;droneseed&#x2F;jobs&#x2F;114965-software-engineer-uav...</a><p>If you&#x27;re motivated by the problem, equity, and are comfortable working at a fast pace in an aspiring startup in a prestigious accelerator (TechStars Seattle), we would love to talk. Candidate should consider moving to Seattle for 1-4 months. (Housing may be provided depending upon need.)<p>Logan@droneseed.co , @droneseed on twitter, or PM me on HN","time":1456870403,"type":"comment"}