{"by":"truongor17","id":11204584,"parent":11202954,"text":"Keen IO | San Francisco Bay Area + Remote USA | Full Time<p>----- About Keen IO -----<p>Keen IO is an API platform that lets developers collect and study custom events at a massive scale.<p>Our Mission = The Discovery of Truth.\nSome things we believe in:<p>-Honesty &amp; empathy<p>-Introspection<p>-Distributed innovation<p>-The importance of laughter &amp; relationships<p>-Play to your strengths; patch your weaknesses with diverse collaborators.<p>----- Storage &amp; DevOps Engineers -----<p>(SF Bay Area or Remote US only) Keen IO is seeking engineers to join our team. We build and nurture an Analytics API that processes user data and queries around the clock, across diverse industries. Whether it’s gaming, e-commerce, advertising, publishing, or IoT, our platform aims to make Analytics so easy for developers that they can focus entirely on their product. Our challenge is to scale with a constantly growing data deluge and evolve along with our user’s needs.\nSkills: Cassandra, Jave, Scala, Python, Tornado, Zookeeper, Storm, Kafka<p>----- Consultative Sales Representative &amp; Sales Development Opportunities -----<p>(SF Bay Area Only) Be one of the first Sales Representative and SDRs for a fast-growing, Sequoia-backed, cloud analytics platform. Our Cross-Vertical Practice is a small, cross-functional team (marketing, sales, sales engineering, data science) tasked with growing our business across all verticals.<p>----- Account Managers &amp; Customer Success Engineer -----<p>(SF Bay Area Only) Join our new and growing customer success team where you will be collaborating closely with our revenue and product teams to provide our customers with the most human and valuable experience with our platform.  You will be instrumental in gathering user experience feedback to platform to provide customer input to product roadmap development.  Most importantly, you’ll be an integral member of a team of pretty great humans who emphasize trust, respect, humility, and self-improvement.<p>For questions, please contact us at humans@keen.io or visit us our career page (<a href=\"https:&#x2F;&#x2F;keen.io&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;keen.io&#x2F;careers&#x2F;</a>).","time":1456855136,"type":"comment"}