{"by":"itsdrewmiller","id":11205150,"parent":11202954,"text":"There is a good chance you have an election today - go vote!<p>NGP VAN - Washington, DC and Boston&#x2F;Somerville, MA<p>* Software Engineer (DC)<p>* QA Analyst or Engineer (Boston)<p>* DevOps Engineer (DC)<p>* UX Designer (Boston)<p>* Software Engineering Interns (Boston or DC)<p>* UX Design or Engineering Interns (Boston)<p>NGP VAN is the world’s leading political technology firm, providing campaign and organizing technology to Democrats, progressives, and non-partisan organizations. We offer an integrated platform that combines the best fundraising, compliance, organizing, and digital products available. We built the voter contact and volunteer management tools used by Obama for America. Nearly every State Democratic Party in the United States distributes our VoteBuilder tools to Democrats up and down the ticket, and we provide industry-leading organizing tools that enable labor unions, environmental groups, pro-choice advocates, civil rights activists, and progressive political parties to win their campaigns around the world. Our fundraising and compliance software is used by the majority of Democrats from the Presidential level on down, and our fast-growing digital platform has become the most-used toolset for Democratic campaigns as well.<p>NGP VAN has been recognized as one of the fastest growing companies in America by Inc. Magazine for seven years in a row, and one of the top 50 fastest growing companies in the DC area by both the Washington Business Journal and SmartCEO. We are a successful and growing company with a passion for our employees’ career advancement. We are an open-minded, flexible workplace that values learning and contributions of many different kinds.<p>Company Site: <a href=\"http:&#x2F;&#x2F;ngpvan.com\" rel=\"nofollow\">http:&#x2F;&#x2F;ngpvan.com</a><p>We are open to interviewing across a pretty wide range of experience levels. Hit me up at dmiller at ngpvan dot com for more info or to apply. I&#x27;m the VP of Engineering here.<p>Keywords: ONSITE INTERNS","time":1456858992,"type":"comment"}