{"by":"greattypo","id":11207114,"parent":11202954,"text":"Clever (YC S12) - San Francisco - onsite<p>Right now the market for educational software is a mess.  It’s incredibly difficult for developers to get their products into schools, and it’s even harder for them to scale.  School districts spend tons of money on learning applications, but they have no way of knowing if students are even using the apps they’re purchasing.  Teachers know there’s great software out there, but relatively simple challenges like getting 30 students logged in at once make using it impossible.<p>At Clever, we’re working to change all that.  We provide schools with a free API and single sign-on solution that makes using educational apps a breeze.  We’ve grown fast: after three and a half years, we’re moving data for a third of all K-12 students in America (20M kids), and 50,000 schools are using us to manage their education apps.  Our goals are much bigger than that, though.  We want to be two things:<p>-a single place where schools can easily integrate, manage and analyze all the software they’re using, and<p>-a single identity that students can use to see everything they’ve learned across multiple apps.<p>We’re a team of 95 (40 engineers) based in downtown SF, and we’re looking for engineers who enjoy working in (or would enjoy learning) Go, Python and Coffeescript.  We’re particularly looking for engineering managers: empathetic leaders who are excited about coaching and professional development.  More generally, we want people who are sharp, adaptable, and passionate about improving the way education works for everyone.<p>Check us out at <a href=\"https:&#x2F;&#x2F;clever.com&#x2F;about&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;clever.com&#x2F;about&#x2F;jobs</a>, or check out our recent press here:\n<a href=\"http:&#x2F;&#x2F;www.npr.org&#x2F;sections&#x2F;ed&#x2F;2015&#x2F;08&#x2F;27&#x2F;434667722&#x2F;one-third-of-schools-are-using-this-app-youve-never-heard-of\" rel=\"nofollow\">http:&#x2F;&#x2F;www.npr.org&#x2F;sections&#x2F;ed&#x2F;2015&#x2F;08&#x2F;27&#x2F;434667722&#x2F;one-thir...</a>","time":1456876060,"type":"comment"}