{"by":"avaslas","id":11219840,"parent":11202954,"text":"LinkBee | Sunnyvale, CA &amp; New York, NY | Full-time | Onsite<p>LinkBee is a well funded startup founded in 2015 taking a unique approach to the residential Internet of Things. By offering direct-to-consumer services and a comprehensive integration platform, we&#x27;re able to overcome the issues plaguing 99% of IoT consumers today.<p>Along with our software platform, we&#x27;re also building a suite of connected hardware modules to intelligently network homes en masse. Delivering an effortless user experience--one that is significantly lacking in the IoT market today--comes with immense technical challenges. So we&#x27;re assembling a top-tier team of highly motivated individuals with a passion for connected devices to join us in our mission to create the smart home of the future.<p>Currently, we&#x27;re seeking to fill two core roles on the team:<p>Software Architect (Principal, Sunnyvale): We&#x27;re looking for someone who will spearhead the design and integration of each component of the LinkBee system. This person should have extensive experience in IoT and deep knowledge of connected devices&#x27; full software stack. For full job description, qualification requirements, and application details, visit <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs2&#x2F;view&#x2F;108904694\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs2&#x2F;view&#x2F;108904694</a>.<p>Hardware Engineer (Senior, Sunnyvale): We&#x27;re looking for someone who will lead the software design and implementation of our connected devices. This person should be prepared to heavily interface with our hardware partners on hardware requirements and write the connectivity code and application algorithms that bring intelligence to the nodes in LinkBee&#x27;s system network. For full job description, qualification requirements, and application details, visit <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs2&#x2F;view&#x2F;108904723\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs2&#x2F;view&#x2F;108904723</a>.<p>To apply, visit the LinkedIn postings above. To contact us directly with any questions, please feel free reach out to jobs@linkbee.com. And to learn more about LinkBee (and us!), check out <a href=\"https:&#x2F;&#x2F;www.linkbee.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkbee.com</a>!<p>We look forward to hearing from you soon! :)","time":1457037410,"type":"comment"}