{"by":"1qbit","id":11211234,"kids":[11211988],"parent":11202954,"text":"1QBit | Software Developer | Vancouver, BC | Full-time | Onsite | C++&#x2F;Python (potentially more in the future)<p>1QBit is the world’s first quantum software company, and one of the select few organizations, alongside Google, NASA and Lockheed Martin, with access to the world’s only commercially available quantum hardware, the D-Wave 2X. Over the past three years the company has developed algorithms and tools to solve high-value optimization problems for Fortune 100 companies in finance, energy, life sciences, and a range of other industries. This year, 1QBit was recognized as a Technology Pioneer by the World Economic Forum (<a href=\"http:&#x2F;&#x2F;www.techvibes.com&#x2F;blog&#x2F;1qbit-world-economic-forum-technology-pioneer-2015-08-06\" rel=\"nofollow\">http:&#x2F;&#x2F;www.techvibes.com&#x2F;blog&#x2F;1qbit-world-economic-forum-tec...</a>), and represented Canada, along with Canadian Prime Minister Justin Trudeau, in Davos at the WEF annual meeting this past January (<a href=\"https:&#x2F;&#x2F;medium.com&#x2F;singularity-university-blog&#x2F;the-theme-of-this-year-s-annual-meeting-of-the-world-economic-forum-in-davos-was-the-fourth-c0c2f8ff517f\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;singularity-university-blog&#x2F;the-theme-of-...</a>).<p>At the core, 1QBit’s development team is building software that organizations and individuals will be able to use to develop Quantum-Ready™ applications, without having to understand the complexities of quantum hardware. Our library is written in C++ for performance, and wrapped with SWIG to provide an elegant Python interface. The next phase of our roadmap includes a limited public release, building new algorithms, binary polynomials and solvers to share with organizations working on NP-hard optimization problems.<p>This is a unique opportunity to work with a diverse range of algorithms, and to collaborate with a strong team of researchers creating new theoretical techniques that you will help build into some of the first real world applications for quantum computers.<p>Please submit your resumes and cover letters to: jobs@1qbit.com<p>The job description can be found here: <a href=\"http:&#x2F;&#x2F;1qbit.com&#x2F;jobs&#x2F;1QBit%20Software%20Developer%20JD%202015.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;1qbit.com&#x2F;jobs&#x2F;1QBit%20Software%20Developer%20JD%2020...</a>","time":1456938393,"type":"comment"}