{"by":"morenoh149","id":11220274,"parent":11202954,"text":"CapsuleRx | New York City, NY | full-time ONSITE<p>Capsule is a healthcare technology company on a mission to elevate and simplify the consumer pharmacy experience. We believe in improving health outcomes through innovative design, mobile technology, logistics, and predictive analytics. We are based in New York City and launching soon.<p>We are seeking a Software Engineer with a generalist&#x2F;fullstack orientation to join our development team.<p>At Capsule you will:<p>- Work at all levels of our Golang &#x2F; React &#x2F; Swift &#x2F; Postgres stack\n- Influence architecture, tooling, process, and culture at a small but growing engineering shop\n- Contribute daily to the product dialogue\n- Build things that meaningfully improve peoples’ wellbeing<p>You should have:<p>- Breadth in many different skill areas (Maybe you’ve written APIs and some front-ends and done some light devops and know a bit of Photoshop and have coded in a functional language … the more the merrier)\n- Depth in one area that you can really school us on (Perhaps you’ve written a pubsub framework as a sideproject?)\n- Experience writing code as part of a (preferably large) team<p>Bonus points if you have:<p>- Built db-backed RESTful APIs (Go = awesome, but also relevant if it was in Java, Scala, Ruby, Python, etc.)\n- Working fluency in technologies like ES6&#x2F;ES2015, CoffeeScript, TypeScript, Sass, Less\n- Knowledge of and&#x2F;or interest in React\n- Experience setting up a web development environment &amp; architecting a web app from scratch (e.g. first person on a web app team or led a web app team)\n- Good grasp of TDD &amp; CI principles\n- Contributed to the development of a native mobile app\n- Facility with design tools like Sketch, Illustrator, or Photoshop\n- Led an engineering team<p>apply at <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;capsulerx&#x2F;934c1772-6d4c-444d-bc2f-53280af4f8db&#x2F;apply\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;capsulerx&#x2F;934c1772-6d4c-444d-bc2f-5328...</a> you can also send me messages by searching my handle","time":1457041312,"type":"comment"}