{"by":"anewman15","id":11283143,"parent":11202954,"text":"Wirestorm Innovations | Dallas TX | Full-time ONSITE<p>Technical Project Manager<p>Wirestorm is seeking a capable Technical Project Manager (TPM) to join our<p>world-class team of exceptionally skilled, and committed professionals. This<p>position is primarily located in Portland supporting four locations across four time<p>zones.<p>The TPM is the central point of customer contact and strategic representative to<p>Wirestorm. This role heavily relies on the candidate’s ability to demonstrate a<p>highly technical software background involving project scope definitions,<p>enforcing industry-leading software methodologies, and managing software<p>deliverables. The project’s success can be a direct reflection of the TPM’s<p>ambitions and motivation.<p>The TPM communicates policies, purposes, and goals of the organization to the<p>project team. The TPM is responsible for assisting the project team with solution<p>design, solution architecture, communication, and expectation setting. Specific<p>duties will include, but are not limited to the following:<p>Summary of Duties:<p>* Ensure an integrated approach is kept to maintain project goals and customer<p>satisfaction by providing clear project priorities and ensuring alignment across<p>business units and functions.<p>* Coordination&#x2F;execution of VIP&#x2F;Customer visits for each project<p>* Organize and track project teamwork to accomplish project goals<p>* Responsible for all contract deliverables submitted by the Company to the<p>Customer and subsequent modifications.<p>Requirements:<p>* Minimum 10 years of related experience or 8 years with related Master&#x27;s degree<p>* Continuous Integration and rapid release methodology and execution<p>knowledge as it pertains to SDLC.<p>* BS or MS degree with executive and customer interface experience<p>* Experience as a software developer or working in very technical teams<p>developing low-level software specifications<p>* Risk and opportunity management background, metrics development<p>* Experience writing technical documentation for various audiences.<p>* Demonstrated ability to manage across diverse geographic locations<p>* Ability to communicate effectively both orally and in writing up to executive and<p>senior staff levels; negotiate complex issues; and maintain good working<p>relationships.<p>Desired Knowledge, Skills and Experience:<p>* Experience writing technical documentation for various audiences.<p>* Strong conflict resolution skills, and management experience so they can<p>effectively handle a diverse set of client stakeholders.<p>* Estimating, must be capable of developing estimates for duration and cost.<p>Who we are:<p>We are an international team of elite technology operatives who craft beautiful<p>interactions between people and the technical world. Our solutions team is<p>responsible for fielding, developing, managing and maintaining effective client<p>relationships, and developing web tools and apps for huge audiences. Wirestorm<p>generates an atmosphere of shared innovation and support, where we continually<p>up-level our skills, break new ground, and highlight and learn from each other’s<p>outstanding work. Come work with a fun company that offers amazing benefits,<p>flexible work schedules, great team synergy, and a wide-open future.<p>For us every project is challenging, and every position critical. We don&#x27;t have ping<p>pong tables or espresso machines, yet we enjoy a thriving culture of shared<p>invention. Our operatives are strategically placed around the globe and our clients<p>range from sovereign governments to Fortune 500 companies.<p>wirestorm.us<p>To apply:  <a href=\"https:&#x2F;&#x2F;wirestorm.bamboohr.com&#x2F;jobs&#x2F;view.php?id=51\" rel=\"nofollow\">https:&#x2F;&#x2F;wirestorm.bamboohr.com&#x2F;jobs&#x2F;view.php?id=51</a>","time":1457966905,"type":"comment"}