{"by":"paulc","id":5970407,"kids":[5970991],"parent":5970187,"text":"New York, NY OR REMOTE - DailyBurn.com<p>Hi, DailyBurn is hiring for a full stack web developer position and an Android development position.<p>We are open to people in NYC (we work out of the IAC office in Chelsea) or Remote.  We have several development team members that work 100% remote and have been doing remote work as a company since day 1.<p>You’ll have the chance to work on a variety of products and platforms (web, mobile, TV, and other media platforms), and will help scale our products to a rapidly growing audience.<p>Your skills:<p>Android: We&#x27;re looking for a solid track record of delivering Android apps.  Experience with other technologies is a plus since we work on a lot of platforms (Roku, Xbox, Web, iOS, etc.) in addition to Android.\n- Full listing: <a href=\"http://www.jobscore.com/jobs/dailyburn/android-developer/aHBf7m2Omr4OoWeJe4iefn?ref=rss&amp;sid=68\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jobscore.com&#x2F;jobs&#x2F;dailyburn&#x2F;android-developer&#x2F;aHB...</a><p>Full Stack Web: Experience building and launching production software with Ruby on Rails (or similar web frameworks)\n- Full listing: <a href=\"http://www.jobscore.com/jobs/dailyburn/ruby-on-rails-developer/aFxfWoKkOr4OU3eJe4egig?ref=rss&amp;sid=68\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jobscore.com&#x2F;jobs&#x2F;dailyburn&#x2F;ruby-on-rails-develop...</a><p>Technologies We Use:<p>- Our web stack is Ruby on Rails, Nginx, and Unicorn.<p>- We use Node.js for real-time services<p>- We use Go for background processing<p>- We store data using MySQL, Redis, and MongoDB.<p>- Platforms we run on: iOS, Android, Roku, Smart TV, Google TV, Xbox, and more coming.<p>DailyBurn brings fitness and nutrition to members, anytime, anywhere, by streaming HD-quality workouts in a variety of disciplines from dance and high-intensity cardio to yoga, kettlebells and strength training.  Our focus is creating and delivering amazing in home workouts.<p>If you&#x27;re interested feel free to apply to the listings or email me directly: paul@dailyburn.com mention the HN posting :)","time":1372684988,"type":"comment"}