{"by":"wellingtonwu","id":5970669,"parent":5970187,"text":"50onRed in Philadelphia, PA is looking for Python and Java Engineers. (Open to Relo)<p>To Apply: Follow this link <a href=\"http://bit.ly/10usP95\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;10usP95</a> OR send your resume to wwu@50onRed.com<p>50onRed operates a premium ad network and serves over billions of online ad impressions each month. We work with large advertisers such as Groupon and eHarmony, and develop innovative products to monetize many of the web&#x27;s largest shopping, dating, and social websites.<p>As a Software Engineer, you will join our extremely talented engineering team comprised of some of the sharpest developers in the area.  The core development team is the beating heart of the company as a whole, creating highly scalable, innovative products used by some of the largest advertisers on the web and seen by millions of people each day.  The core development team works closely with the business lines and the Network Ops team to deliver cutting edge software that revolutionizes the way our clients can monetize the web.  Our products are built using the latest and greatest open-source tools and technologies.  We identify the solution and implement it using whichever language is best for the job.<p>What you&#x27;ll do everyday:<p>Design, Develop and Test new software in an Agile environment\nBuild custom software from ground up—from Database to front-end Javascript<p>Technologies we use include (but not limited to):\n-Python, Java, PHP, JavaScript\n-MySQL, Redis as well as other datastores to fit the current problem we’re trying to solve\n-Flask, Django, SQLAlchemy\n-EC2, Cloudfront and Opscode Chef, Git\n-Effectively manage products at any point of their life-cycle\n-Work closely with the core dev team and Director of Engineering to prioritize work flow on a daily basis<p>Qualifications&#x2F;Experience\nRequired:<p>-Bachelor’s degree in Computer Science or related field\n-Strong experience working with a variety of languages to solve complex problems involving high availability and highly scalable applications.  (Must be able to code something in the interview)\n-Solid understanding of persistence databases and no-SQL datastores\n-Experience working with HTML, jQuery as well as raw JavaScript, without libraries, on large-scale, customer-facing websites\n-Knowledge of Source Control and best practices\n-Experience with Unit Testing\n-Basic working knowledge of Unix&#x2F;Linux and an interest in devops\n-Must have excellent inter-personal communication skills and can work effectively within a team in an open-air environment<p>Desired:<p>-Experience scaling web apps\n-Experience building browser extensions is a bonus<p>50onRed is a great place to work. We have a high energy, creative and smart team. We’re located in the Cira Center next to 30th Street Station in Philadelphia and we’re a short walk from Center City and easily accessible by public transportation.  Employees enjoy competitive salaries &amp; benefits, a casual work environment, Friday Summer Hours, Gym Membership, catered lunch, 401(k) program and flexible hours.","time":1372687390,"type":"comment"}