{"by":"jakemcgraw","id":5970822,"parent":5970187,"text":"Refinery29 -- New York, NY. Fulltime.<p>Refinery29 is the cornerstone of fashion, beauty, and shopping for a new generation. In an industry dominated by traditional print publications with lackluster digital offerings, R29 has broken away and created a successful (profitable) all-digital personal style destination. We&#x27;re expanding our engineering team, and require some talented, experienced individuals to help us improve the process and infrastructure which powers our high traffic website.<p>Please reach out to me via email: jake.mcgraw@refinery29.com or Twitter: @jakemcgraw if you&#x27;re interested or have any questions.<p>* Senior Test Engineer *<p>We&#x27;re still in the early phases of a more formal QA process at Refinery29. We know what we want, just not how to get there. Your job is to show us the way, help us implement a rock solid QA process. Here are some loose guidelines we came up with, but as I&#x27;ve indicated earlier, we&#x27;re open to suggestions on how we should run this.<p>* Stabilize, expand and automate our testing process and infrastructure.\n* Lead our software development team in designing testable code, which will primarily be in PHP using PHPUnit.\n* Design a system for testing client-side functionality, Selenium, PhantomJS, whatever you want, it&#x27;s up to you.\n* Design test plans for larger software&#x2F;architecture projects.\n* Assist in legacy code documentation and setting documentation standards for future development.<p>* Senior Devops Engineer *<p>Over the last 7 months we&#x27;ve made huge improvements to our infrastructure to handle the high volumes of traffic we&#x27;ve received (30 day peak: 550Mb&#x2F;s). We&#x27;d be hiring you as our first in house, dedicated Devops&#x2F;Systems engineer to help us execute the improvements necessary to handle even larger traffic spikes.<p>* Design, optimize, monitor and maintain the server infrastructure for production, development, deployment and testing.\n* Build tools to optimize infrastructure resources for our development team.\n* Assist in cost projection for server infrastructure.\n* Manage projects currently being executed by consulting systems team.<p>Again, please reach out to me via email: jake.mcgraw@refinery29.com or Twitter: @jakemcgraw if you&#x27;re interested or have any questions.","time":1372688803,"type":"comment"}