{"by":"wellingtonwu","id":5970714,"parent":5970187,"text":"50onRed in Philadelphia, PA is looking for a Javascript Engineer (Open to Relo)<p>To Apply: Follow this link <a href=\"http://bit.ly/12BAdM9\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;12BAdM9</a> OR send your resume to wwu@50onRed.com<p>50onRed is seeking an experienced Frontend Engineer with a strong understanding of object-oriented, unobtrusive Javascript to fill a key role in our growing development team.  We are looking for a frontend engineer who understands how to bridge the gap between the functionality being built on the backend and the experience being created by our UX team.  The right person for this position will have a deep understanding of how Javascript interacts with the browser, and will be capable of using Javascript for functionality beyond simple aesthetics. In this role you will be responsible for working closely with the development team and product manager, gathering information on how to enhance our UI across all products. If you like working in a fast-paced environment where you can allow your creativity to prosper, then this is the place for you!<p>We’re a fast-growing and innovative online marketing company. We create a number of advertising based products to help make it easy to monetize the web. We’re located in the Cira Centre next to 30th Street Station in Philadelphia. We’re a short walk from Center City and easily accessible by public transportation<p>Duties:<p>Develop and deliver front end-design assets (graphics, HTML, CSS, and JavaScript etc.)\nInteract with the product team and all developers on daily basis\nDevelop UI &#x2F;UX improvements across all our products\nContinually make improvements based on user feedback    \nRequired Skills:<p>-3 + Years Experience as a frontend developer with emphasis on usability, user interface design, and user experience best practices.\n-Must be able to describe problems and solutions in a concise and objective manner to both developers and non-developers\n-Portfolio and&#x2F;or code samples with current examples of work\n-Knowledge of usability, human factors, and the UX process\n-Experience with HTML, CSS, and Raw JavaScript\n-Motivated, Creative, and Passionate<p>Desired Experience:<p>-Backend Experience with Languages such as Python or PHP  (plus)\n-Experience with Advertising Network, Adwords, traffic platforms (plus)<p>50onRed is a great place to work. We have a high energy, creative and smart team. We’re located in the Cira Center next to 30th Street Station in Philadelphia and we’re a short walk from Center City and easily accessible by public transportation. Employees enjoy competitive salaries &amp; benefits, a casual work environment, Friday Summer Hours, Gym Membership, catered lunch, 401(k) program and flexible hours.","time":1372687832,"type":"comment"}