{"by":"stuherbert","id":5970829,"parent":5970187,"text":"DataSift in Reading, UK - C++, PHP, Technical Architect, Product Management, Operations, QA, and more<p>For details, follow this link: <a href=\"http://jobvite.com/m?3rPiWgwf\" rel=\"nofollow\">http:&#x2F;&#x2F;jobvite.com&#x2F;m?3rPiWgwf</a><p>DataSift helps you find the social conversations that you&#x27;re interested in - in real-time, or from our historics archive. We are one of only three companies in the world currently licensed to resell the Twitter firehose, and across all of our sources, we handle over 6,000 new pieces of data a second. We&#x27;ve grown out of Tweetmeme, the inventors of the &#x27;retweet&#x27; button.  We&#x27;ve raised 30 million USD in funding to date.  Our engineering is based in leafy Reading in the UK, with our sales and corporate HQ in San Francisco.<p>We&#x27;re technology-agnostic - if it works, we&#x27;re using it - and you can see our technical architecture diagram on Slide 13 of this presentation: <a href=\"https://speakerdeck.com/stuartherbert/storyplayer?slide=13\" rel=\"nofollow\">https:&#x2F;&#x2F;speakerdeck.com&#x2F;stuartherbert&#x2F;storyplayer?slide=13</a><p>We&#x27;re successful and growing fast, and are looking to hire in multiple areas!<p>* Technical Architect, to work on scaling our Hadoop cluster to the next stage<p>* Senior C++ Engineer, to work on the runtime engine of our realtime filtering enginer<p>* PHP Engineer, to work on a variety of internal services supporting our data pipelines<p>* Senior Developer in QA, to work on our in-house testing tools<p>* Operations Engineer, to work on managing our servers and deployments<p>... and many more roles besides: <a href=\"http://jobvite.com/m?3rPiWgwf\" rel=\"nofollow\">http:&#x2F;&#x2F;jobvite.com&#x2F;m?3rPiWgwf</a><p>Like everyone else on this thread, we think we&#x27;re a great place to work ;-) with an extremely low turnover of staff.  But most of all, what we can offer is the opportunity to work on one of the largest and most interesting platforms of any startup here in the UK, as part of one of the highest-quality teams of any startup here in the UK.<p>Any questions, ping me on Twitter: @stuherbert","time":1372688860,"type":"comment"}