{"by":"kmano8","id":5970796,"parent":5970187,"text":"Monetate - Conshohocken, PA (Philly suburbs) - No remote, but we will relocate.<p>Monetate helps digital marketers make their content more relevant. We\nturn data into action on our clients&#x27; sites by doing real-time data\nanalysis and DOM manipulation to put the right experience in front of\ntheir users.  We’re looking for engineers who want to do highly\nvisible work on great brands and solve tough problems with great\ncoworkers.<p>What we&#x27;re looking for:<p>* Problem solvers who like to code - we take things apart, figure out\nhow they work, then build software to solve our users&#x27; problems.<p>* People who like to ship - we&#x27;re focused on building and shipping\ngreat products - if you like to see your work in production quickly\nyou&#x27;ll see it here. We ship often, and iterate.<p>* People who like hard challenges - we have great problems across our\nproducts - huge data sets, UX, 3rd party Javascript, high volume &#x2F; low latency\nAPIs - we have no shortage of fun problems to work on.<p>About us:<p>* Founded in 2008<p>* Respect - it&#x27;s our core value. We have a great team and we work well\ntogether. Our vacation policy is the same as Netflix (we don&#x27;t have\none). Our technical teams are self-organizing and have full authority over (and\nresponsibility for) the problems they work on.<p>* Open source - Google Closure, Python, Hadoop, Mahout, Solr and\nLucene - we&#x27;re open source across our stack<p>* Funded by First Round Capital and OpenView<p>* Market rate salaries<p>We&#x27;ve hired great people from HN in the past. We&#x27;re looking for people\nnot positions.  We have people who have joined the team with no\nbackground in our primary languages and people from non-traditional\nbackgrounds.<p>Check out our blog at <a href=\"http://engineering.monetate.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.monetate.com&#x2F;</a><p>Send me a message anytime if you have questions or want to apply: karl at monetate dot com","time":1372688533,"type":"comment"}