{"by":"frabcus","id":5970392,"parent":5970187,"text":"Liverpool, UK - ScraperWiki - CTO<p>ScraperWiki is a Silicon Valley style startup, in Liverpool, UK. We’re changing how data science is done together on the Internet.<p>We&#x27;re hiring a CTO.<p>If you were doing the job, you&#x27;d describe it like this —<p>I&#x27;m &lt;insert your name here&gt;, and my job title is Chief Technology Officer.<p>I make sure our platform works well.<p>There are trade-offs between our resources and technical quality. Features, lack of bugs, performance, security and backups all matter. I pick what matters most.<p>I do this by leading technically the platform team. We use Extreme Programming (XP), and I pair program much of the time. I&#x27;m confident with open source Unix technologies, have used a wide variety at all levels of the stack, and quickly learn new ones.<p>I recruit new members of the team, and help them become better programmers by example and by coaching. I organise any out of hours on-call that we need.<p>I keep track of technologies, both open source projects and proprietary hosted services, so I know which are most suitable for ScraperWiki. I advise on technical aspects of possible acquisitions and partnerships.<p>I make programmers who use the platform happy by making developer APIs that are a joy to use.<p>More broadly in the company, I promote a culture of excellent and professional software practices. For example, guiding design of libraries and use of tools amongst data scientists.<p>I like giving talks and writing technical articles, to communicate what we do. I&#x27;m comfortable in commercial situations, and describe the key benefits of the technologies we use in ways customers find compelling.<p>To apply, send the following:\n* A link to the code of a piece of software you&#x27;ve signficantly contributed to.\n* A link to your résumé&#x2F;CV\n* Any questions you have about the job<p>Along to francis@scraperwiki.com with the word swjob9 in the subject (agencies only if you can find someone I know on LinkedIn to recommend your agency).<p><a href=\"https://scraperwiki.com/jobs/#swjob9\" rel=\"nofollow\">https:&#x2F;&#x2F;scraperwiki.com&#x2F;jobs&#x2F;#swjob9</a>","time":1372684849,"type":"comment"}