{"by":"bootstraponline","id":5970240,"parent":5970187,"text":"Boston, MA. Senior QA Engineer – Automation<p>This role participates in a new enterprise-wide software quality assurance function that will drive SQA automation and promote the adoption and sharing of best practices across multiple business units that are engaged in software development.<p>Responsibilities<p>The successful candidate will work with business units to create automation and promote the sharing and adoption of best practices. To accomplish this, the Engineer will engage in a variety of functions:<p>- Participate in tool selection and create an automated test framework.<p>- Build automated (and some manual) tests for web and mobile solutions (iOS, Android, Windows).<p>- Develop and execute detailed test cases and automated test scripts.<p>- Establish automated functional and regression testing procedures.<p>- Create automated performance testing plans and test scenarios.<p>- Assist in defining Quality Assurance policies and process improvements.<p>- Train and mentor QA team members in automated testing and best practices.<p>Experience &amp; Expertise<p>- Minimum three years quality assurance experience with web and mobile technologies &#x2F; platforms.<p>- Strong experience with automation tools, preferably Selenium WebDriver, Ruby, Appium, Node.js, and other open-source tools. Focus on coding rather than record&#x2F;playback.<p>- Knowledge of QA Procedures and Methodology, and Agile &#x2F; SDLC.<p>- Performance testing experience is strongly preferred.<p>- Excellent analytical, organizational, and problem-solving skills.<p>- Ability to set priorities and multi-task in a fast-paced environment.<p>- Excellent written, verbal and interpersonal communication skills; and<p>- Ability to successfully work independently and in a team environment, build peer-to-peer relationships; typically work with several departments in the organization.<p>Location: Boston, MA<p>About Aquent: For 20+ years Aquent has led the way in transforming how companies find and utilize marketing and creative talent to execute their brand strategies. Aquent’s pioneering approach to staffing and services has helped thousands of companies -­-­ including two-­thirds of the Fortune 500 and 90 of the Fortune 100 -­-­ build their internal marketing and communications capabilities. Today Aquent has 45 offices across the globe and is headquartered in Boston, Mass.<p>How to apply<p>Email your resume to nkotsifas@aquent.com<p><a href=\"https://jobs.github.com/positions/c964f258-dff9-11e2-8f08-ba62b4931af3\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.github.com&#x2F;positions&#x2F;c964f258-dff9-11e2-8f08-ba...</a>","time":1372683169,"type":"comment"}