{"by":"makmanalp","id":5970391,"kids":[5970498],"parent":5970187,"text":"Cambridge, MA - CustomMade (<a href=\"http://www.custommade.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.custommade.com&#x2F;</a>)<p>Full-time devs. Python work, would likely be working with Django. Django could be more or less often depending on the type of position.<p>Boilerplate about stack &#x2F; team here:<p><a href=\"http://engineering.custommade.com\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.custommade.com</a><p>Tech blog here:<p><a href=\"http://engineering.custommade.com/sawdustsoftware/\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.custommade.com&#x2F;sawdustsoftware&#x2F;</a><p>We&#x27;re a two-sided marketplace that does matchmaking between professional artisans &#x2F; craftsmen and buyers. You post your dreams, we find someone to make it real. People come up with some crazy ideas like a custom made quidditch set &#x2F; proposal ring: <a href=\"http://blog.custommade.com/portfolio/a-very-harry-potter-proposal/\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.custommade.com&#x2F;portfolio&#x2F;a-very-harry-potter-pro...</a><p>We&#x27;re funded by Google Ventures and a ton of others: <a href=\"http://www.crunchbase.com/company/custommade-ventures\" rel=\"nofollow\">http:&#x2F;&#x2F;www.crunchbase.com&#x2F;company&#x2F;custommade-ventures</a> so paying you well is not an issue. We just raised an 18 million series B!<p>We&#x27;re right at the point where all the graphs are hockey-stick shaped and we&#x27;re breaking our own records every week. Of course, with that comes scaling challenges. But it&#x27;s all part of the fun.<p>We have a great team and a great environment that focuses on customers and product development.<p>When I&#x27;m working on product stuff, I get to collaborate with product &#x2F; UX &#x2F; support people day to day to build a product that meets a real business need, and makes everyone happy. But when I just need to bang out some code, people leave me alone. When I&#x27;m working on platform or architectural stuff, I get great advice and feedback from my coworkers. Expressing opinions and having discussion is encouraged.<p>Fridays are refactoring &#x2F; innovation day to scratch your good code itch.<p>Work &#x2F; life balance is great. Bureaucracy is at a minimum. Opensourcing is encouraged. Tech blogging is encouraged.<p>More about our stack &#x2F; team here: <a href=\"http://engineering.custommade.com\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.custommade.com</a><p>You&#x27;re a low-ego programmer who is always learning, has pushed code to production innumerable times, and doesn&#x27;t cringe at the prospect of collaborating with a team of non-techies every so often. You know the modern web stack well, and specialize in at least one part of it.<p>Rarely, we&#x27;ll do a remote position. Get in touch with me at mali -at- custommade dotkom","time":1372684848,"type":"comment"}