{"by":"matslina","id":5970324,"parent":5970187,"text":"Spotify&#x27;s Service Infrastructure (SI) team in New York City is hiring.<p>We, the SI engineers, are on a mission to act as force multipliers for all Spotify engineers. We build and maintain software components that allow our feature teams to move fast without breaking things. Some examples of what SI engineers are currently working on:<p>- Core authentication systems for Spotify<p>- High-performance inter-system messaging software<p>- Core storage technologies (Cassandra, PostgreSQL)<p>- Service discovery and orchestration<p>The NYC-based SI team is just booting up and we&#x27;re still quite small. New team members can expect to have a significant impact on our projects. Our mission is to revamp how Spotify deploys backend services and while we&#x27;re currently looking at LXC, nothing is set in stone. As the team grows we&#x27;ll start to branch off into other areas of the Spotify infrastructure universe. Lots of fun will be had.<p>If we are the right team for you, and vice versa, then you&#x27;re probably a bit like us. Here are some of the traits that we share:<p>- a passion for programming and computing in a large scale distributed environment with millions of users<p>- significant familiarity with GNU&#x2F;Linux or other UNIX-like systems<p>- knowledge of a couple of programming languages, typically including Python or Java<p>- an urge to KISS, to iterate, to deliver and to produce high quality software in the process<p>Does this sound like a place for you? If so, please reach out to us. We&#x27;d love to get to know you. Send us your CV (if you have one), a link to your hobby project or github and perhaps a short message to further explain who you are. Mention HN and we&#x27;ll pay extra attention to your application.<p><a href=\"https://www.spotify.com/se/jobs/view/omlBWfwY/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.spotify.com&#x2F;se&#x2F;jobs&#x2F;view&#x2F;omlBWfwY&#x2F;</a>","time":1372684038,"type":"comment"}