{"by":"dave1010uk","id":5970328,"parent":5970187,"text":"Bournemouth, UK. Base are looking for a full-time Midweight Front-end Developer to join our team.<p>About Base:<p>We build user-centred digital products and services for businesses, using data they already have. Every business generates data. We help our clients uncover the stories hidden in their data and transform them into something new and valuable. Clients include Timex, Garmin and Nottingham City Transport.<p>At Base you will be part of a team of makers and doers, working across a variety of projects and clients. We&#x27;re agile, but not dogmatic about it. Our process evolves to suit our needs.<p>We value and support CPD, actively seeking clients with a like-minded desire to push boundaries, providing you with an opportunity to build your experience and skills. We practice a sustainable pace, recognising that we each have lives and families outside of work. Late nights and &gt; 40 hour weeks are rare by design.<p>About the role:<p>1st class front-end. You will be used to working as part of an unsilo&#x27;d production team, where designers work alongside developers, in agile sprints where they&#x27;re useful. Your main skill set is bringing concept artwork to life, turning designs (as Photoshop &amp; InDesign files) into working HTML&#x2F;CSS, using JavaScript. You&#x27;ll be comfortable with canvas, SVG and graphical JavaScript libraries such as D3.js (and may have dabbled with WebGL). You&#x27;ll be familiar with PHP and have experience with front end development for dynamic content&#x2F;apps, using JavaScript libraries like Backbone.js, AngularJS or Ember.js.<p>Visualising Data. You&#x27;ll have a keen interest in visualising datasets, with a good understanding of what makes information beautiful. You&#x27;ll know that an infographic is only as good as the moment it was created. Turning great designs into live visualisations showing real data will be something that excites you.<p>Open all hours. You&#x27;ll have a keen interest in the way openness in technology (and in particular open data) can change things. And you&#x27;ll have ideas that mash one set with another, whether you&#x27;ve realised them yet or not. Our developers come up with projects for our clients, rarely the other way round.<p>More details: <a href=\"http://www.wearebase.com/BaseJobSpecificationMidWeightFront-endDev.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;www.wearebase.com&#x2F;BaseJobSpecificationMidWeightFront-...</a>","time":1372684078,"type":"comment"}