{"by":"joeroot","id":5971009,"parent":5970187,"text":"Pact Coffee - London, Full Time Lead Developer\npactcoffee.com<p>We&#x27;re opening the world of small-batch, fresh roasted and better tasting coffee to a global audience, not just those lucky enough to live in Shoreditch. Join an incredible founding team and help the world fall in love with coffee again.<p>We face a huge array of creative challenges in tying together a physical product with its digital counterpart. In doing so we’re looking for an experienced Lead Developer to help confront these as part of a great founding team. This requires a strong technical knowledge (especially in Ruby), a creative approach and the ability to work with the right languages and tools for the job. You will be joining the team to lead on all things tech, and as such, we’re looking for a generalist with Ruby experience, who will both guide and work on features and tools across both product and operations.<p>Generalist: Our stack is currently made up of Postgres, Rails, HTML, CSS (+ SASS) and JavaScript. Due to the challenges we face, this list is constantly growing and evolving, and we’re looking for a Lead Developer who’s comfortable in our current stack, but has the technical breadth and knowledge to change and move things forward as our needs develop.<p>Creative: You will help define product direction and be the voice for technology in the room. We want to re-approach classic e-commerce challenges in innovative and exciting ways. Be it applying cutting edge research to make sure people get the right coffee for their palette or experimenting with Arduinos and electronics to make sure they never run out; a strong technical background combined with an ability to think creatively are essential to us fulfilling that ambition.<p>Technical chops: You will be leading on forward thinking solutions which will likely push you into areas unknown! You’ll need to be comfortable with the stack we already use whilst also being able to pick up new skills and tools quickly in order to lead the team forward.<p>Product: You will help define our product roadmap, speak to customers and lead on the implementation of user facing features. You should feel comfortable in proposing and validating ideas before going ahead and building them out yourself or with the team. Once those features are live, you should be at home making data-based decisions about their future direction and flaws.<p>Autonomous: Though decisions are made as a team, you’ll be in charge of making sure we deliver on all things tech. As a small team, everyone needs to be comfortable working together whilst also taking individual responsibility and ownership for their area. As an e- commerce company, tech sits at our heart and as such your role is mission critical to the success of the business. You should feel comfortable with this. Ultimately as the company’s technical voice, no­one will tell you how to run things or which tools are best for the job, that’s up to you!<p>Interested? Email stephen@pactcoffee.com","time":1372690220,"type":"comment"}