{"by":"velikos","id":5971288,"parent":5970187,"text":"Washington, DC - Opower. Javascript&#x2F;Node.js Engineer [LOCAL]<p>Opower builds software and services to motivate everyone to use less energy. Utilities from around the world provide energy usage data for tens of millions of their customers to Opower which we then analyze and aggregate using the latest software technologies to motivate consumers to use less energy.<p>Opower&#x27;s web team is reinventing the framework that powers our utility-branded web applications which make consumers’ energy usage understandable and provide personalized ideas and advice on how to reduce usage. You&#x27;ll be part of a team of fun, friendly, and technically skilled JavaScript engineers developing our client-side MVC platform using Angular, automating complex tasks with Grunt, and building open source libraries using Node.<p>=Requirements=<p><pre><code>    * Expert with JavaScript as a first-class language. Excellent CS fundamentals. \n    * Experience creating large JavaScript projects with a team in an agile environment. \n    * Experience with Angular, Ember, Backbone, or Knockout. Experience with SASS, LESS, or Stylus. \n    * Experience with Zurb Foundation or Bootstrap. Experience with Mocha, Karma, Jasmine, QUnit, or other unit testing framework. \n    * Experience or interest in learning Git. Solid understanding of JavaScript prototypes, callbacks, promises, performance issues. \n    </code></pre>\n=About You=<p><pre><code>    * Passionate about JavaScript tools and frameworks and the future of JavaScript because of projects like Node, NPM, jQuery, Backbone, Grunt, etc. \n    * There&#x27;s a special place in your heart for jQuery but you have moved on to MVC-like frameworks such as Angular and functional programming toolsets like Underscore&#x2F;Lo-dash. \n    * You understand how to modularize large JavaScript projects and handle project dependencies. \n    * You welcome having your code reviewed regularly, and can provide meaningful code reviews for your co-workers. \n    * You have been using Node, Grunt, Yeoman, Github, or have been wishing you were using them. \n    * You think that creating pull requests for open source projects is an exciting way to participate with the community. \n    * Learning a new framework isn&#x27;t enough for you - you want to build something and mentor others with your new knowledge. \n    * Passionate about the technology as well as the product, UX, and the general quality of what you build. \n    * Self assured, confident, inquisitive, persistent and willing to argue your point – but at the same time, willing to take on the opinions of others and revise your stance based on the facts at hand.\n</code></pre>\n<a href=\"http://jobvite.com/m?3r8jWgwz\" rel=\"nofollow\">http:&#x2F;&#x2F;jobvite.com&#x2F;m?3r8jWgwz</a>","time":1372692753,"type":"comment"}