{"by":"ahhrrr","id":5971278,"parent":5970187,"text":"Technologists Wanted to Create New Apps for Our Cities!<p>Are you a hacker with a huge heart? Code for America is looking for developers, designers, researchers, and product managers for its 2014 Fellowship.<p>If you want to make a difference while doing what you love to do, this is your chance — build apps that help municipal governments work better.<p>Cities are under greater pressure than ever, struggling with budget cuts and outdated technology. That’s why Code for America is connecting talented technologists with municipal governments to create and implement new web apps and explore new ways of resolving local challenges.<p>During previous years fellows have tackled problems such as criminal justice in NYC, economic development in Santa Cruz, Calif., and 311 in Chicago.<p>CfA fellows come from a variety of backgrounds and experiences from high-profile positions at Google, Apple, and Microsoft to smaller startups to municipal government.<p>Why Become a CfA Fellow?\n- Gov 2.0 Training. You will start with a crash course in municipal government and gain practical understanding of the vital intersection of government and technology.\n- Connections. The biggest names in the tech industry and the Gov 2.0 movement will provide you with unparalleled networking, mentoring, and support.\nProfessional Development. You will develop lasting relationships, learn new skills and languages in a fast-paced, startup atmosphere.\n- Autonomy. Working in small teams with talented individuals you’ll decide what you build and how you build it — from start to finish.\n- A Labor of Love. You’ll not only accomplish a lot and make the world a better place, but you’ll have a lot of fun working with other passionate people.<p>Applications are being accepted until July 31, 2013. This is an 11-month, full-time fellowship located in San Francisco. See <a href=\"http://codeforamerica.org/fellows\" rel=\"nofollow\">http:&#x2F;&#x2F;codeforamerica.org&#x2F;fellows</a> for more information.<p>Apply online at: codeforamerica.org&#x2F;apply","time":1372692705,"type":"comment"}