{"by":"tsandall","id":5971221,"kids":[5972630,5972834],"parent":5970187,"text":"JOB TITLE: Application Software Developer<p>LOCATION: Telecommute, Petaluma, San Francisco, Vancouver (Canada)<p>DEPARTMENT: Engineering<p>SUMMARY<p>As an application software developer at Cyan you work in an agile development environment and thus are enabled to make an immediate contribution to our products and customers. Newly developed features could be released to a live production site in a matter of days. We are looking for smart people to solve hard problems. You will handle a wide array of tasks ranging from prototyping new techniques and technologies, to developing test automation, and supporting our growing customer base. You are expected to write quality code with high availability for large-scale applications in a carrier-class networking environment. You will have the opportunity to work with newer technologies including Python&#x2F;Django, Graph&#x2F;NoSQL Databases, Google Web Toolkit (GWT) and HTML5.<p>EXPERIENCE &#x2F; SKILLS DESIRED<p>Cyan is looking to hire numerous developers with varying experience levels. Please apply if you satisfy most of the following:<p>A solid foundation in computer science, with strong competencies in data structures, algorithms, and software design\nExperience with both static language (e.g. C&#x2F;C++&#x2F;C#&#x2F;Java) and dynamic languages (e.g. Python&#x2F;Ruby&#x2F;Perl&#x2F;Lisp&#x2F;JavaScript)\nExperience with programming in Linux\nExperience in large systems software development or client application development\nExperience with database systems and multi-threaded &#x2F; multi-process applications\nProficiency in web server architectures is desired\nExperience in an Agile Development Methodology is desired<p>Employment Visa Status: Candidates currently authorized to work in the US are encouraged to apply.<p>Contact jobs[at]cyaninc.com or visit <a href=\"http://www.cyaninc.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.cyaninc.com&#x2F;</a><p>Thank you for your interest!","time":1372692139,"type":"comment"}