{"by":"dmarble","id":5971615,"kids":[6031933],"parent":5970187,"text":"Travelzoo - Mountain View, CA (remote considered)<p>• Mobile lead architects &#x2F; senior developers: iOS, Android, and mobile web<p>• Mobile UX and&#x2F;or visual designer<p>I recently joined Travelzoo after being co-founder&#x2F;CTO of a few startups, and am putting together a small team to craft our mobile future. Perhaps you have also worked on a couple startups or freelanced, or perhaps you have a small team of friends and are looking to join a profitable company where you can launch a product with global impact (we have 26+ million subscribers and 2+ million app installs).<p>Travelzoo is mostly spread across North America and Europe (offices in NYC, Chicago, London, Hamburg, Miami, Los Angeles, and several more), but product development happens mostly in our small Mountain View office of around 50. We&#x27;re listed on the NASDAQ, have been profitable for more than a decade, and are loved by our customers for what we do best -- offer exclusive, high quality travel and local experiences at a discount.<p>--------<p>Mobile Lead Architects<p>• iOS (iPhone and iPad ideal), Android, or responsive mobile web<p>• You&#x27;ve shipped stuff<p>• You know how or will thoughtfully find ways to do TDD and architect a code base that a team doesn&#x27;t find painful to work on.<p>• You&#x27;re nice, straightforward, and occasionally humorous<p>• $100K+ (DOE)<p>--------<p>Mobile UX and&#x2F;or Visual Designer<p>• Ideally you&#x27;ve done UX design and&#x2F;or visual design for iOS &#x2F; Android &#x2F; responsive mobile web products that have gone to market.<p>• I want a true UX person on the team to help craft our future products, so may be open to filling 2 positions if I find excellent specialists. If you&#x27;re an expert at both UX and visual design, I bow to you.<p>• Full-time or contract-to-hire, depending on experience<p>--------<p>Let&#x27;s chat. Send me anything you think might be relevant to my username at travelzoo.com","time":1372695535,"type":"comment"}