{"by":"natethames","id":5971055,"parent":5970187,"text":"Senior Rails Developer<p>DevOps Engineer<p>UX Designer<p>All positions full time in Cambridge MA.  Remote a possibility for the right candidate.<p>ActBlue powers the fundraising of the political and social left.  If you’ve ever given online to a Democratic candidate or organization, chances are you’ve used our software.  We are growing like crazy!  We need a few more good software engineers who want to influence politics and online organizing.  ( <a href=\"https://secure.actblue.com\" rel=\"nofollow\">https:&#x2F;&#x2F;secure.actblue.com</a> )<p>We use best in class tools and methods:<p>• Backend: Rails 3.2 with Ruby 1.9, NodeJS, PostgreSQL, Redis<p>• Frontend: Bootstrap, jQuery, Sass, D3, Highcharts<p>• Operations: Chef, Rackspace cloud and AWS<p>• Tools: Github, Tddium<p>While this is a list of what we currently use, we are open to hearing from great people who come from different stacks.<p>You&#x27;ll be an essential contributor to a small team of professionals in our Davis Square office. You&#x27;ll have significant responsibility right out of the gate and a voice in designing our architecture.  We offer autonomy, responsibility, an amazing workplace (full of people geeking out about politics and tech all day) plus these benefits:<p>• Extremely competitive salary<p>• 401K matching<p>• 100% paid medical, dental and vision benefits for you and dependents!<p>• Unlimited paid time off<p>• Public transit pass (Charliecard or Commuter Rail)<p>• Professional Development (conferences, classes, etc...) 100% paid<p>• Choose your own computer setup<p>• Family friendly flexible schedule<p>• Healthy and not-so-healthy snacks<p>Some neat things about us:<p>• ActBlue is a political non-profit that is well capitalized. This gives us the freedom to explore new electoral technology without influence from big donors or investors.<p>• We are an established 9 year old organization.  We have a startup &#x2F; political campaign mentality without the pressure and long hours.  Sustainability is valued.<p>• Our employees have lives outside of work.  We have parents, dog owners, marathon runners, RC plane pilots, Artisan Asylum members and german linguists.<p>• We sponsor RailsBridge Boston, a workshop designed to encourage more women to become Ruby developers in Boston.<p>ActBlue is the software and operations engine that powers the fundraising for thousands of Democratic and progressive campaigns and committees.  In the 2011-2012 election cycle we moved over $175 million for nearly 5,000 campaigns with an average contribution size of $48.90.  Our fundraising software is used by the Democratic Congressional Campaign Committee, the Democratic Senatorial Campaign Committee and countless Senate, House, State and Local campaigns in all 50 states.<p>To start the conversation email techjobs@actblue.com and copy me at nate@actblue.com","time":1372690630,"type":"comment"}