{"by":"nfelger","id":5972566,"parent":5970187,"text":"Interaction &#x2F; Interface Designer – EyeQuant.com – Berlin, Germany<p>EyeQuant is a SaaS company that uses neuroscience and machine learning to optimize interfaces for higher conversion rates. We&#x27;re spun out of Caltech, our customers include Google and Spotify and we&#x27;re backed by some fantastic investors.<p>We&#x27;re now looking for our first full-time designer to join our team of 7 in Berlin. You&#x27;d be responsible for all interaction and visual design in our products.<p>Here&#x27;s what we think is important about the role:<p><pre><code>    • Code – You won&#x27;t be expected to write production code, but you should know\n      your medium well: what&#x27;s possible with HTML&#x2F;CSS&#x2F;JavaScript, and what&#x27;s easy \n      or hard. Most importantly, you know how to communicate effectively with your \n      developer peers.\n\n    • User research – You should care deeply about the people you&#x27;re designing for, \n      and willing to get involved in research. If you&#x27;re passionate about running \n      guerilla user research for the team yourself, that&#x27;s great, but not a \n      requirement.  \n\n    • Interaction vs. visual design – All else being equal, we prefer someone who is \n      great at organising information and making complex flows feel simple over \n      someone whose core strength is crafting beautiful interfaces. We&#x27;re a small \n      team though, so you will be doing a bit of both. \n</code></pre>\nAll that said, none of us come from a design background, so we&#x27;d love to hear from you if you disagree with any of the above and think you&#x27;d be a fit!<p>You should come with an interest in quantitative evaluation of design efforts - both with our own products and A&#x2F;B testing. If you think that&#x27;s heresy, you won&#x27;t be happy at EyeQuant. If you believe that design and science have a lot to learn from each other, you&#x27;ll have a shot at shaping the very industry itself.<p>Get in touch at: niko@eyequant.com","time":1372702760,"type":"comment"}