{"by":"snikolic","id":5972811,"parent":5970187,"text":"SocialWire - San Francisco, CA - full stack engineer, javascript hacker, data scientist, &quot;office manager plus&quot; <a href=\"http://www.socialwire.com/#jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.socialwire.com&#x2F;#jobs</a><p>Online ads suck. But advertising keeps the web free (as in beer), and we want to keep the internet free. So rather than hating on advertising, we decided to do something about it.<p>At SocialWire, we are taking a new approach to advertising: building a recommendation engine for ads. Our system generates product-level ads and hyper-targets them to exactly the right audience. We do this at scale and automatically across a retailer&#x27;s entire catalog. We want our ads to be so good that people discover interesting products through them, and find them to actually be useful.<p>With this comes a boatload of difficult data, analytics, machine learning, optimization, and scalability problems. We&#x27;re formally hiring a full stack engineer, but we&#x27;d also love to talk to anyone who writes beautiful python, elegant javascript, or loves to look at data - we&#x27;re open to contracting&#x2F;part-time work for the right candidates. On the non-engineering side, we&#x27;re looking for an &quot;Office Manager Plus&quot; run our office, finances, and HR while shaping and growing our awesome culture.<p>We have sweet digs in Potrero Hill; we&#x27;ve raised $3mm in seed capital from First Round Capital, 500 Startups, and a crew of other top tier investors; we&#x27;ve got an impressive client list and real revenue; we&#x27;ve got a talented team of hackers, designers, and burners; we&#x27;ve got a bright blue pool table, a fridge full of Pliny the Elder, an airstream trailer full of Stumptown espresso, and all the sushiritos you can eat.<p>Drop a line to stefan@socialwire.com and let&#x27;s chat.<p>Some press:\n<a href=\"http://techcrunch.com/2012/11/13/socialwire-gets-2-5m-from-first-round-capital-and-others-to-be-a-one-two-punch-for-facebook-ads/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2012&#x2F;11&#x2F;13&#x2F;socialwire-gets-2-5m-from-f...</a>\n<a href=\"http://techcrunch.com/2013/05/02/socialwire-seed-extension-new-ceo/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2013&#x2F;05&#x2F;02&#x2F;socialwire-seed-extension-n...</a>","time":1372705006,"type":"comment"}