{"by":"rnsharma","id":5972048,"parent":5970187,"text":"Endurance Lending Network, San Francisco CA, Full Time[Local], On Site<p>We are a financial services tech startup based in San Francisco and are looking for full stack and front end engineers. We currently use RoR, mongoDB and knockout.js. At Endurance Lending Network, we merge a financial services focus with a tech startup feel for a productive, cozy, and energetic work environment.<p>More details @ <a href=\"https://www.enduranceln.com/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.enduranceln.com&#x2F;careers</a><p>About Us:\nThe small loan approval process is slow, antiquated and fraught with unnecessary bureaucracy that discourages small businesses from opening or expanding. Endurance Lending Network is replacing this manual, paper based process with modern, well-designed, lovingly-crafted, amazing software. Our vision is to automate the approval process so a small business owner can be approved within hours of applying. All while keeping our loan quality high through rock solid analytics that leverage non- traditional data sources. We&#x27;re armed with deep financial services and software industry experience, $5 million in the bank from strategic investors, and strong ties to capital providers looking to invest in a better model. Come help us create the future in small business financing. Be a part of making the traditional banking model obsolete.<p>We offer all the usual bells and whistles but beyond that this is an opportunity to be one of the key engineering hires at a well-funded startup. You&#x27;ll get in on the ground floor of a startup that has a mission you can feel good about, and you&#x27;ll help shape our company. Here are some of the bells and whistles:<p><pre><code>   * Full healthcare benefits\n   * Stock options\n   * Opportunities for advancement as the company grows\n   * Competitive salary\n   * Access to our Fat Tire keg and unlimited foosball playing \n</code></pre>\nDrop us a note @ rohit[at]enduranceln.com with a resume and github&#x2F;blog.","time":1372698809,"type":"comment"}