{"by":"cerberusnyc","id":5973283,"parent":5970187,"text":"New York City, NY. Full time<p>At Visual Revenue (an Outbrain company), we collect, analyze, and visualize tons of data – think billions of pings a month. We feed this data into our ever-hungry predictive analytics engine, which (with a little help from some super clever algorithms) then provides online publishers suggestions on how to best promote their content on their website. As our newest frontend engineer, you&#x27;ll help us constantly improve, tweak and develop our dashboard, API and automated modules – there is loads of room for scope here, so bring it ON! You&#x27;ll get to work with the team to figure out big ticket items ranging from mobile apps, responsive design, 3rd party javascript and tonnes of other awesome frontend stuff.<p>FRONTEND<p>What you&#x27;ll bring:\n- Passion for building anything frontend\n- Awesome at JS&#x2F;HTML&#x2F;CSS and writing legible code\n- Ability to find the right tool for the job. Quickly evaluate different libraries but not afraid to roll your own stuff\n- Extra points: Experience with CSS transitions, JQuery, Google Closure toolkit, Java, Python, and Selenium\n- Bonus: eye for design, experience in Agile development<p>Stuff you&#x27;ll do:\n- Participate in design and implementation of new features\n- Evolve frontend architecture\n- Develop UI and frontend logic\n- Integrate and expand backend APIs\n- Build apps and automation modules\n- Develop and extend internal tools<p>BACKEND<p>What you&#x27;ll bring:\n- Hardcore programming skills\n- Architectural and data modeling\n- Experience with building big data systems\n- BS or MS in Computer Science (or related field)\n- Extra points: Experience with EC2, S3, EMR&#x2F;Hadoop, MongoDB, Redis, Nginx, Storm, and Kafka\n- Bonus: Experience with Python, Java, Machine Learning and Agile development<p>Stuff you&#x27;ll do:\n- Scale existing backend\n- Design and develop new features\n- Build internal tools for engineering and account services\n- Integrate with external data sources\n- Expand and evolve APIs<p>Email us @ jobs@visualrevenue.com<p>Alex Poon\nVP, Engineering | Visual Revenue, an Outbrain company","time":1372709688,"type":"comment"}