{"by":"ahultgren","id":5973426,"parent":5970187,"text":"Stockholm, Sweden - FULLSTACK DEVELOPER - Fröjd Interactive<p>I&#x27;m a developer at Fröjd, and we&#x27;re looking for more colleagues. Fröjd is technical web agency, which means that we focus on building websites (and sometimes other apps) for other companies, and leave the visual design and strategy stuff to other agencies. Everyone at Fröjd knows how to code (even the PMs) and you can expect to work in all ends of the stack; from pixel-pushing to server setup. From Wordpress to EPiServer. At fröjd you&#x27;ll do it all.<p>Since it vacation time right now, we&#x27;re looking for people who can start by august&#x2F;september (&#x2F;october).<p>## About you<p><pre><code>  * Experienced as a developer (at least 3 years, more is better)\n\n  * You know any or all of the following really well: PHP, .NET, JS, node.js, Ruby, Java... (etc, I&#x27;m sure you get the point)\n\n  * And you&#x27;re willing to learn what you don&#x27;t know\n\n  * Experience with development for mobile\n\n  * You want to work in a team of awesome developers\n\n  * You want to grow and take responsibility\n\n  * You live in Sweden\n\n</code></pre>\nThere are some more formal requirements that will make the HR ppl happy in the official ad, check it out: <a href=\"http://careers.stackoverflow.com/jobs/35773\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;35773</a><p>## What we offer<p><pre><code>  * Hackday every second week\n\n  * Ping-pong every day\n\n  * Friday beer every friday\n\n  * Office in very central Stockholm (drottninggatan)\n\n  * Yearly allowance to go to conferences, seminaries or buy books\n  \n  * 6 weeks of vacation\n</code></pre>\nFollow the link above to apply or email jobs@frojd.se.<p>PS; we&#x27;re also looking for Technical Directors and Project Managers. Have a look at <a href=\"http://frojd.se/en/career\" rel=\"nofollow\">http:&#x2F;&#x2F;frojd.se&#x2F;en&#x2F;career</a>","time":1372711159,"type":"comment"}