{"by":"teeny25","id":5975893,"parent":5970187,"text":"Pinrose –San Francisco, CA or New York, NY, FULL-TIME<p>=What the hack is Pinrose???=<p>Pinrose is a well-funded startup that is bringing fragrance into the 21st Century and online.    We reduce the pain from the trial and error process of finding great fragrances by leveraging technology, scent science, and social science.  We design and manufacture all of our own fragrances, and we sell them exclusively online.<p>Pinrose has developed a proprietary synesthesia-based technology that can accurately predict which fragrances each user will love.  We can recommend the perfect scents from our collection based on a user’s spotify playlists, instagram filters and facebook activities.  This multisensory approach helps us create the scent playlists for our customer’s lives.<p>=Who we’re hiring=<p>Now that we’ve raised a fat pile of cash, we are building out our engineering team (contractors, begone!).  This is an exciting opportunity to build a novel ecommerce site from the ground up.  You will work directly with the founders to architect a solution that provides a new level of customization in a large and exciting vertical.<p>As an early engineer, you will have a HUGE impact on the product, direction and culture of our company.<p>We are looking for great engineers who can:<p>- Architect our full stack<p>- Own our mobile products (iOS)<p>- Set up the data layer (there will be…SO…MUCH…DATAAAAA!!!!!!!)<p>- Build custom recommendation tools, apply cool machine learning and analytic techniques, and use a broad range of data sources<p>- Tackle interesting and meaningful technical problems<p>- Have a ton of fun and not take themselves too seriously<p>=What we can offer=<p>- Attractive salary + equity<p>- Creative freedom to architect our stack<p>- Deep impact on company formation, culture, and benefits – you tell us what we can offer!<p>- Workcations!<p>- The right mix of good times and hard work<p>We are data junkies and hope you are, too.  If you are interested, show us something cool that you have worked on and our proud of.  Side projects are fine.<p>Email: pinrosescents@gmail.com.<p>BOOM!","time":1372740519,"type":"comment"}