{"by":"kirstylee152","id":5976367,"parent":5970187,"text":"BERLIN, GERMANY, Waymate <a href=\"https://waymate.de\" rel=\"nofollow\">https:&#x2F;&#x2F;waymate.de</a>\nFRONT END DEVELOPER<p>&#x2F;&#x2F; Waymate is a multimodal travel platform. The web app allows you to search for, compare and book trains and flights. &#x2F;&#x2F;<p>You:\nYou are in love with great web experiences. You are passionate with all aspects of front end development and always up-to-date with the latest techniques and optimizations. You want to create an easy to use interface with the perfect look and feel. Design means spirituality to you. As Senior Front End Developer, you will work closely with our designers to bring charming interfaces to life; ones that match people&#x27;s mental model and present information in new, innovative, and creative ways. You have a strong focus on quality, accessibility and compatibility with everything you produce. You know the fundamentals of interaction and visual design and are able to apply them to create clear, usable layouts that provide a great experience across a range of devices.<p>What you&#x27;ll do:<p><pre><code>   -Produce and maintain awesome interfaces across multiple browsers and devices using javascript (especially backbone.js) and other front end technologies\n\n   -Build up our user experiences. You’ll work on the digital spirituality of the platform. You’ll create the face, look and smile of our product\n\n   -Create a holistic design approach as part of an overall engineering strategy across the platform\n\n   -Translate and generate conceptual ideas with our design team, and experiment with new and unique approaches to how we display information\n\n   -You’ll work very closely with our back end, product and design teams\n\n   -Run experiments and benchmarks\n\n</code></pre>\nWhat we offer:<p><pre><code>   -Working with a very successful and highly motivated team\n\n   -Attractive workplace in the heart of Berlin\n\n   -Creating a unique product, changing the world of travelling.\n\n   -Flat hierarchies, great career opportunities\n\n   -Competitive remuneration package\n   \n   -Starting immediately</code></pre>","time":1372751135,"type":"comment"}