{"by":"ZephyrP","id":5995683,"parent":5970187,"text":"Purveu is hiring Javascript&#x2F;Frontend Engineers - Fully Remote, Full time.<p>Our central offering is an analytics platform for wealth managers and other investment advisers; sorting, storing, aggregating and analyzing external systems preexisting data as well as managing growing sets of internal data generated within our own platform. There are exciting technical challenges on all levels of the stack as we balance the expedient consumption and reconciliation of client information with the realtime analysis of gigabytes of client data. Your teammates are skilled in many different areas, ranging from portfolio analysis to higher mathematics.  Come help us invent the technology used to advise financial professionals and inform their clients over the world.<p>Our stack:<p>- Frontend: Ember.js &#x2F; CoffeeScript<p>- Backend: Rails, but increasingly plays the role of concierge to the database as our app grows to face new \nrequirements. We&#x27;re making the first moves towards Scala.<p>- Datastore: MongoDB<p>- The ETL process has many working pieces, historically it&#x27;s been Hadoop processing jobs with Sqoop, but after benchmarking of realtime aggregation performance showed a compelling reason to move to MongoDB, we rolled our own ETL in Erlang keeping a memento in ETS to alleviate integrity concerns and provide redundancy without depending on the integrity of MongoDB. Today, the extraction task lives on as a ruby job wrapping a set of high performance C functions.<p>You:<p>* Technologist by trade or education.<p>* Knowledge of Javascript frontend frameworks like Ember, Angular, etc.<p>* CSS &#x2F; HTML et. al.<p>* A personal project you&#x27;re proud of that you&#x27;d like to show off.<p>Extras:<p>Experience developing applications performing realtime analysis.<p>Experience developing low latency &#x2F; high throughput software \nWeb design and composition skills<p>Amazon EC2 knowledge<p>If any of this sounds interesting to you, contact me at zephyr@purveu.com","time":1373043282,"type":"comment"}