{"by":"udfalkso","id":6016077,"parent":5970187,"text":"New York, NY - Fulltime<p>Hiring: FE Engineer &amp; Head of Marketing&#x2F;Biz-dev<p>iknow.io is a data-driven knowledge sharing community for curious people. We take raw data about Movies, Music, Sports, Economics, Politics and more and make it possible for regular people to analyze and extract useful information from it. We also enable them to browse, share and discuss the fascinating insights they discover using our tools with one another.\nWhile there are mountains of raw data out there, only scientists and programmers can currently make any real use of it. Our mission is to make that data accessible and useful to everyone. Our team has extensive experience working with large, complex data problems and in building and nurturing online communities.<p>We are currently a team of 4 people, and are looking to add 2 more talented individuals to the mix soon.<p>1) FE Engineer: You have a great design sense and some serious engineering skills. You think the famous quote, &quot;there are only two hard things in computer science, cache invalidation and naming things&quot; is spot on. Whenever you&#x27;re browsing the web, you&#x27;re constantly noticing things that could be tweaked and improved. You&#x27;re a pragmatist who&#x27;s ok with ignoring IE6 users. You&#x27;ve built complex, popular web-based applications before. You want to join an early stage startup where you can quickly prove yourself and become the FE engineering lead.\nOur FE Stack includes python (django), javascript (jquery, backbone), html and css. Deep familiarity with all of these is a big plus, but not necessarily required. Experience with mobile app development is also a plus.<p>2) Head of Marketing &amp; Business Development: You&#x27;re a natural born deal maker. When you throw a party, too many people show up. You know how to build, execute and analyze the effectiveness of a marketing campaign. Bloggers and reporters know you, and love you. You believe product design and marketing are one and the same. You&#x27;re ready to join an extremely talented product &amp; engineering team and show them that everything they thought they knew about how to really promote and grow a new site from the ground-up is wrong.<p>If you fit the bill for either of these positions, and you think what we&#x27;re working on sounds intriguing, then we&#x27;d love to hear from you at jobs@iknow.io. Thanks!","time":1373408750,"type":"comment"}