{"by":"hiring2018","id":18115957,"kids":[18117839],"parent":18113144,"text":"Genentech | Data Science, Imaging | South San Francisco, CA | Full-time | Onsite<p><a href=\"https:&#x2F;&#x2F;www.gene.com&#x2F;careers&#x2F;detail&#x2F;201808-117349&#x2F;PHC-Data-Science-Imaging?src=JB-12568\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gene.com&#x2F;careers&#x2F;detail&#x2F;201808-117349&#x2F;PHC-Data-S...</a><p>The PHC Data Science Imaging group seeks a talented and motivated Imaging Data Scientist to join us in supporting the efforts of the Personalized Healthcare (PHC) Group. To aid in the development of novel imaging biomarkers in PHC and their potential use in clinical drug development, the RWD Imaging Group at Roche is responsible for generating and executing plans to: (1) curate and analyze clinical imaging data from Roche’s late stage (Ph3) clinical trials, and (2) devise plans to gain access to (and analyze) clinical imaging data from a RWD setting (e.g., health registries, hospital systems, etc.).<p>The position requires extensive cross functional collaborations working with a diverse team of clinical subject matter experts, data- and imaging scientists, statisticians, and IT staff.  Your responsibilities will primarily support image analysis efforts within the group, focusing especially on applying Machine- and Deep Learning approaches to oncology-, neuroscience-, and ophthalmology projects. In addition to developing and applying novel, data-driven approaches to solving RWD image analysis challenges, the position requires the Imaging Data Scientist to work closely with clinical imaging data management group to deploy, maintain and integrate computational solutions. The job will utilize and build on your experience in scientific&#x2F;medical imaging, data and image management, application of novel statistical and machine learning approaches to `big data’, software development, and scientific data transfers.<p>Responsibilities:<p>Collaborate with internal imaging- and data scientists and external vendors to derive and validate novel imaging biomarkers in support of clinical drug development and RWD evidence (payer support) generation.\nIdentify and gain access to external RWD imaging data sources.\nCurate&#x2F;clean&#x2F;organize large and messy clinical imaging datasets.\nIdentify and support imaging data management solutions within PHC.\nContinually search for opportunities to automate workflows and streamline processes.\nSupport and contribute to the development of advanced analytics and computational tools.<p>Required skills:\nProficient in at least two scripting languages such as Python, Matlab, R, Perl, etc.\n1+ years of data science experience.\nPhD or MS in quantitative field (eg mathematics, statistics, computer science, EE, etc.), and&#x2F;or adv. Life Sciences degree with significant computational experience.\nDocumented experience with Machine Learning, Deep Learning, and statistics.\nSolid understanding of medical image formats (ie DICOM).\nExperience with database applications.\nExcellent communication skills.\nAbility to multitask and prioritize while maintaining efficiency and quality of work.\nInternally motivated with a commitment to accuracy and quality.","time":1538422086,"type":"comment"}