{"by":"mynock","id":18115297,"parent":18113144,"text":"BetterUp | Software Engineer (Full-Stack or Front-End) | Remote | Full-time | <a href=\"https:&#x2F;&#x2F;www.betterup.co&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.betterup.co&#x2F;</a><p>BetterUp is a coaching platform that brings personalized professional coaching to employees at all levels. We help managers lead better, teams perform better, and employees thrive personally and inspire professionally.  Our mission is to help people everywhere pursue their lives with greater clarity, purpose, and passion, so our product was developed by a team of leading behavioral scientists, researchers, and technologists. We&#x27;re already transforming the way companies approach talent development at high-performing organizations like LinkedIn, Salesforce, Capital One, Deloitte, and Logitech among many others.<p>We’re looking for people who can:<p>- Act as an owner - It’s not done until it’s in production.  Adept at moving projects forward and able to unblock projects regardless of role on the project.<p>- Do less, deliver more - Familiar with the terms YAGNI and yak shaving?  Focus your efforts on high impact initiatives that really move the needle.<p>- Impress yourself - We hold ourselves to a quality above and beyond something that “just gets it done”.  Each line of code is an opportunity to blend craftsmanship with playfulness.<p>- Collaborate without ego - Willing to take on roles small or large in order to further the mission at hand.<p>- Stay on your edge - Continuously learning and applying emerging technologies.  Pushing yourself and your team to new heights.<p>Our stack is primarily Ruby on Rails, Ember.js, Gitflow, AWS, and Docker and we prioritize keeping our dependencies up to date while we work in an iterative, collaborative CI&#x2F;CD process. We provide amazing benefits (unlimited vacation, volunteer days), but if you ask the team they’ll tell you that the greatest benefit we offer employees is an incredibly meaningful mission and transformative work.<p>View all roles and apply here: <a href=\"https:&#x2F;&#x2F;www.betterup.co&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.betterup.co&#x2F;jobs&#x2F;</a>","time":1538417817,"type":"comment"}