{"by":"apolishch","id":18115545,"parent":18113144,"text":"Flock | London | Onsite, Full Time <a href=\"https:&#x2F;&#x2F;www.flockcover.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.flockcover.com&#x2F;</a><p>Our first product is a real-time risk analysis and insurance application for the drone industry. We launched a pay-as-you-fly drone insurance app: our policies are purchased in real-time, priced by the minute. Our platform uses real-time data (weather, building types, population densities within your drone flight radius) to quantify, price, and sell risk on the fly. We’ve grown: fast. 2 years old, currently a team of 13, and we have 25% of the UK market on our platform We are actively seeking to disrupt the wider insurance industry by bringing our best in class real time geospatial data based risk analysis algorithms to the wider industry.<p>STACK<p>Our stack is a React Native application, sitting atop a set of NodeJS servers, rigorously typed with Flow, and Postgres databases. We apply rigorous Type safety constraints and data validations. We do not shy away from unorthodox decisions, such as discarding snapshot tests for React testing, not using an ORM, rigidly enforcing type constraints, running a ReasonML service in production, and utilizing Postgres Check constraints, when they help us achieve our goals.<p>CULTURE<p>We practice continuous delivery; we can (and do) ship to production multiple times a day. For everything you need to know about our Engineering Culture, take a look here: <a href=\"https:&#x2F;&#x2F;blog.flockcover.com&#x2F;flocks-engineering-culture-b712370baa9f\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.flockcover.com&#x2F;flocks-engineering-culture-b7123...</a><p>HIRING<p>Our tech hiring process is competitive, fast, fair, and transparent. You can find it (and apply) here: <a href=\"http:&#x2F;&#x2F;jobs.flockcover.com\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.flockcover.com</a><p>Or get in touch with me personally: jobs@flockcover.com","time":1538419173,"type":"comment"}