{"by":"evanwillms","id":18116435,"parent":18113144,"text":"Blue Mesa Health | Head of Engineering, Machine Learning Engineer, Full-Stack Javascript Engineer | New York, NY or Vancouver, BC, Canada or REMOTE | Full Time with VISA possibility<p>Blue Mesa Health is on a mission to deliver world-class digital health solutions that empower individuals to live chronic disease-free.  Our flagship product, Transform, is an evidence-based diabetes prevention program delivered via a combination of software, connected hardware, and professional health coaching.<p>Every day, we are making positive impacts in thousands of people&#x27;s lives that are visible in both glowing testimonials and clinical health measurements.  While we have built meaningful revenue and VC funding over the last three years, we still consider ourselves in the early stages of our growth with aspirations to prevent 100 million cases of chronic disease in the next decade.<p>We are a global, culturally diverse company with a remote primary team working in results oriented flexible collaboration.  Everyone is expected to be able to attend scheduled meetings during US Eastern business hours and there are offices in New York and Vancouver for in-person collaboration.<p>--<p>The Head of Engineering role is a high-impact opportunity for a demonstrated engineering leader to provide structure and support for a growing engineering organization.  You’ll partner with our Product team to plan, design, and develop new features with security and privacy in mind.   And be responsible to help your team grow and evolve, by making sure that our engineers have an opportunity to improve professionally, expand intellectually and build resilience in a fast-moving environment.<p>Learn more and apply:\n<a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;bluemesahealth&#x2F;049382b3-8696-4f9a-a0aa-f39ebf42adce\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;bluemesahealth&#x2F;049382b3-8696-4f9a-a0aa...</a><p>--<p>Machine Learning Engineer and Data Scientists will have an opportunity to use our three years of rich human-human interaction data to design classification, association, and prediction analysis systems to support participants in our diabetes prevention program and lead them to better health outcomes.  Your work will quickly be deployed with measurable real-world outcomes from each iteration.<p>Learn more and apply:\n<a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;bluemesahealth&#x2F;064ef7d6-00b5-4396-83d6-fd090f88618b\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;bluemesahealth&#x2F;064ef7d6-00b5-4396-83d6...</a><p>--<p>There are also several roles for Full-stack Javascript Engineers, including INTERNS, on our growing team.<p>See all opportunities at:\n<a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;bluemesahealth\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;bluemesahealth</a><p>Or reach out to me (CTO) directly: evan.willms@bluemesahealth.com","time":1538424989,"type":"comment"}