{"by":"antoviaque","id":18113410,"parent":18113144,"text":"REMOTE (Worldwide) - Open Source Developer &amp; DevOps on Open edX - Python&#x2F;Django, Javascript, AWS&#x2F;OpenStack (OpenCraft - Fully remote company incorporated in Berlin)<p>Development specialized on the free software project Open edX, used by many universities and companies to run online courses. See edx.org, stanford.edu or fun-mooc.fr for examples of Open edX instances. We are 22 senior developers, all working remotely from Europe, North &amp; South America, Asia &amp; Australia. The company is not affiliated with edX, but rather contributing and working with them on various projects. This is a full time position, were you would be able to work remotely from anywhere you want, as long as you have a good internet connection. : )<p>The Open edX platform is a large Python&#x2F;Django codebase, with good code standards and architecture (a lot of the edX engineers come from MIT). You would work on different clients contracts using the platform. The clients list&#x2F;references include Harvard, MIT, edX themselves, the French government, and various startups &amp; universities currently running their own instances, or looking to create one. Tasks are very varied, from developing core platform features, custom exercises and tools for specific courses (XBlocks), customizing and deploying instances, working fullstack, operating our service infrastructure, improving our hosting platform, etc. You won&#x27;t get bored here.<p>Most of your work is published as free software (Open edX is released under the AGPL license, which requires clients to release modifications under the same license), and you would also contribute to the free software project, pushing most of your developments upstream through pull requests, contributing features, documentation or help on mailing-lists.<p>You can read more about how we work in our handbook, at <a href=\"http:&#x2F;&#x2F;opencraft.com&#x2F;doc&#x2F;handbook&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;opencraft.com&#x2F;doc&#x2F;handbook&#x2F;</a><p>Stack: Python&#x2F;Django, Ansible, AWS&#x2F;OpenStack, React, Debian&#x2F;Ubuntu, MySQL, MongoDB, PostgreSQL, RabbitMQ, Redis, Elasticsearch, JS, HTML&#x2F;CSS.<p>Nice to haves: Terraform, Vault, Packer, Prometheus, ELK, Docker, Android&#x2F;iOS. We are building a modern infrastructure and having a strong DevOps presence on top of core software engineering skills is a big plus with us.<p>Interview process: a 30 minutes Hangout with a (simple) coding exercise.<p>To apply, fill this form: <a href=\"http:&#x2F;&#x2F;opencraft.com&#x2F;jobs&#x2F;open-source-developer&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;opencraft.com&#x2F;jobs&#x2F;open-source-developer&#x2F;</a>","time":1538407213,"type":"comment"}