{"by":"AdsEnv","id":18118029,"parent":18113144,"text":"ADS Environmental | Developers, Data Scientists | Remote | Contract or Full-Time, www.adsenv.com<p>ADS is helping create a cleaner and safer environment by bringing exceptional insight and intelligence to municipalities around the world through our hardware and software products. We&#x27;re very passionate about the products we create because of the positive effects it has on millions of people around the globe.  We&#x27;re part of the IDEX Corporation family, recently rated one of the world&#x27;s most trusted companies.  We&#x27;re seeking full-stack developers and data scientists who can help us create compelling and award-winning software applications as part of a high-performance software and data science team.<p>Tech Stack:<p><pre><code>  Front End: Angular, TypeScript, Google Material Design, HighCharts\n\n  Middle-Tier and Backend: .NET Core (C#) using WebAPIs, CosmosDB, SQL Server, Redis, Linux\n\n  Data Science:  Python, NumPy&#x2F;SciPy, Pandas, Jupyter Notebooks, Scikit-Learn, Keras, TensorFlow GPU, Deep Learning (CNN, RNN).  Anomaly Detection.  Time Series Analysis.\n</code></pre>\nInterview Process: We&#x27;ve hired from HackerNews successfully before. Phone call first, remote coding session, then if all goes well, we&#x27;ll bring you on-site for interviews and to meet the team.<p>Positions We Need:<p><pre><code>   -Front-end Developer:  Someone who is strong in Angular&#x2F;TypeScript and can potentially lead a front-end team\n\n   -Back-end Developer: Excellent at .NET Core and API development.  SQL.  Azure.  Writing highly optimized code for large data sets.  Preferably with a C.S. background.  Bonus points if you can also do Angular.  More bonus points if you have experience with Azure IoT Suite.\n\n   -Senior Python Engineer:  Keras, TensorFlow, Linux, APIs, Flask.  Anomaly Detection and Time Series classification.  Deep Learning experience.  Creativity and problem solving required.  Cloud experienced and ready to jump on projects that can directly impact our bottom line.\n</code></pre>\nInterested?:<p>Email ADSDeveloperJobs .a.t. idexcorp.com or check us out at idexcorp.com&#x2F;careers.  Sorry, no sponsorship available.  Every submission reviewed by a human.","time":1538441894,"type":"comment"}