{"by":"jtg","id":18114344,"parent":18113144,"text":"TrueCar | Santa Monica, CA | ONSITE or REMOTE | Full-Time | <a href=\"https:&#x2F;&#x2F;truecar.com\" rel=\"nofollow\">https:&#x2F;&#x2F;truecar.com</a><p>TrueCar is hiring engineers to help us improve the car buying experience. We&#x27;re on the verge of finishing up our replatforming initiative, and we&#x27;re getting ready to re-accelerate our product development and further improve our infrastructure.<p>A good chunk of our engineering team, including leadership, came from CarWoo (YC S08). We value moving fast, structuring things so that we can keep moving fast, and not being afraid to do hard things. (This is sounds so obvious on HN, but it can be a hard sell sometimes when you&#x27;re in the automotive industry.)<p>The core development frameworks we use are Rails and React. Our data stores include PostgreSQL, Redshift, Elasticsearch, and HBase. For infrastructure management, we use Terraform and Ansible. All of this runs on AWS.<p>Our core consumer- and dealer-facing application is a Rails application with a React frontend, backed by PostgreSQL and Redis. It&#x27;s an intentionally monolithic Rails API. We also have other Rails apps for data curation, infrastructure management, and data movement to facilitate a lot of the workflows around data that add value and speed up our development.<p>We&#x27;ve also built internal tooling whenever it helps us move faster or drastically reduce the amount of manual work for our teammates. One of our tools, Spacepods, is a Rails app that churns out identical, isolated development environments (complete with data sets) so there&#x27;s a mini-TrueCar that each engineer can start developing against immediately, without having to worry about breaking a shared integration environment that other developers depend on. Spacepods also powers our deployments and coordinates our CI&#x2F;CD pipeline.<p>Openings:<p>- Senior Rails Engineer. You&#x27;ve run Rails at scale and know Ruby and Rails really, really well. &quot;Convention over configuration&quot; is always nice to get started, but you&#x27;ve had to roll up your sleeves and configure things, ranging from Ruby VM internals to caching layers to connection pooling. You&#x27;d be working on the Rails app that powers our consumer-facing experience.<p>- Senior Rails Engineer (Platform). You&#x27;ve run Rails at scale, maybe in a smaller company, and have thought to yourself at some point, &quot;If only we had the resources to build developer tools to make our processes better and more repeatable.&quot; You&#x27;ll probably have a lot of fun in this role if you like working on the tooling that gets used by other engineers and get a kick out of enabling others to be 10x&#x2F;100x more productive.<p>- Site Reliability Engineer. You know Linux systems, networking, and&#x2F;or AWS really well. Each team member has a slightly different emphasis but everyone on the team has in common is that we value reliability, observability, and performance.<p>- Site Reliability Engineer (Data). Measure, monitor, and understand YARN&#x2F;HDFS&#x2F;HBase performance in production. Design&#x2F;architect deployment and verification procedures for data pipelines. One of the overarching and continuing challenges here is to take everything great that everyone loves about DevOps and CI&#x2F;CD, and apply it to our data pipelines. Inherent statefulness and the size of the data make this a challenge.<p>- Data Warehouse Engineer. Write ETL to efficiently bring in data from various data sources, enrich it, and make it available to everyone in the company so our decisions are backed by good data. We make use of Postgres and Redshift.<p>Even if you&#x27;re not sure you fit in any one of the above, please reach out if any of this sounds interesting to you. (If you read all the way down here, it&#x27;s a good sign that we should talk!) At the end of the day, we&#x27;re just looking for smart, determined, pragmatic people who love building things and solving problems. We care less about hitting all the bullet points in a job description.<p>Still interested, or just want to talk? Reach out to me at jgo AT truecar.com","time":1538412204,"type":"comment"}