{"by":"johnsonhsieh","id":18119253,"parent":18113144,"text":"Cardiogram | San Francisco | Design Engineer &amp; Generalist Software Engineer &amp; ML Engineer | FULLTIME, INTERNS, ONSITE, VISA | <a href=\"https:&#x2F;&#x2F;cardiogr.am\" rel=\"nofollow\">https:&#x2F;&#x2F;cardiogr.am</a><p>Cardiogram is a mobile app that transforms ordinary wearables—like the AppleWatch, Android Wear, or Garmin—into a personal healthcare assistant, like a Doctor-On-Your-Wrist or Check Engine Light for the human body.<p>The Cardiogram mobile app is live in the Apple App Store and Google Play Store, and we have over 1M registered users and growing fast. We&#x27;re hiring Generalist Software Engineers &amp; Design Engineers to help us build out our newest initiative: Cardiogram Care. We&#x27;re looking for engineers who are product- and user-focused to help us build features that empathize with users, drive behavior change, and ultimately help users improve health. We also have initiatives around growth, experimenting with new ideas to get Cardiogram to more people so that more people can benefit from Cardiogram&#x27;s health &amp; wellness insights, DeepHeart&#x27;s detection of undiagnosed conditions, and from Cardiogram Care to help guide users to the treatment and medical care they need. Stack: iOS, Android, primarily WebView app using React.js, Redux, backend in Node.js, Postgres.<p>We&#x27;ve also built a deep learning algorithm, DeepHeart, that runs in the background, analyzes sensor data from these wearables, and helps users detect medical conditions like: sleep apnea, hypertension, atrial fibrillation, and even diabetes. We&#x27;re running clinical studies with UC San Francisco and have published in JAMA Cardiology, NIPS, AAAI, and more (<a href=\"https:&#x2F;&#x2F;cardiogr.am&#x2F;research\" rel=\"nofollow\">https:&#x2F;&#x2F;cardiogr.am&#x2F;research</a>). We&#x27;re hiring Senior Machine Learning Engineers to help scale our ML infrastructure, improve DeepHeart accuracy, and experiment w&#x2F; new models for new conditions.<p>App Store link: <a href=\"https:&#x2F;&#x2F;itunes.apple.com&#x2F;us&#x2F;app&#x2F;cardiogram-watch-your-heart&#x2F;id1000017994\" rel=\"nofollow\">https:&#x2F;&#x2F;itunes.apple.com&#x2F;us&#x2F;app&#x2F;cardiogram-watch-your-heart&#x2F;...</a>\nPlay Store link: <a href=\"https:&#x2F;&#x2F;play.google.com&#x2F;store&#x2F;apps&#x2F;details?id=com.cardiogram.v1\" rel=\"nofollow\">https:&#x2F;&#x2F;play.google.com&#x2F;store&#x2F;apps&#x2F;details?id=com.cardiogram...</a><p>Cardiogram is founded by ex-Googlers, is currently a team of 10 (and growing), and are backed by Andreessen-Horowitz&#x27;s Bio Fund, CTO of Microsoft, founder of Rock Health, amongst many others.<p>Positions:<p>1. Design Engineer - Engineer with an eye for design, ideally have worked on direct-to-consumer products before. CS degree not necessary. Must have strong design-sense, ability to empathize with users, and proficiency in javascript&#x2F;html&#x2F;css to help us quickly build and iterate user-facing features. At least 2+ yrs of experience.<p>2. Software Engineer (generalist, product-focused) - Engineer who&#x27;s worked on all parts of the stack. Aim is to help us quickly build and iterate end-to-end components that enable features in the Cardiogram mobile app. Candidate must be highly proficient in one of: javascript &#x2F; Android (Java) &#x2F; iOS (swift), have good knowledge of algorithms &#x2F; data-structures, and a quick problem solver. CS degree required, at least 2-4+ yrs of experience. More experience is preferred.<p>3. Senior ML Engineer - Engineer with in-depth experience with machine learning, deep learning, neural networks (CNN, RNN, LSTM, GAN, Attention Mechanisms, etc), loss functions, evaluation metrics, traditional techniques like logistic regression, naive bayes, SVMs, probabilistic inference, math, and statistics. Must have experience with Keras, Tensorflow, python, scikit-learn, pandas. CS degree required, at least 4+ years of experience; or PhD in ML, with at least 1+ years of industry experience. More experience is preferred.<p>Email us at: careers@cardiogr.am!","time":1538461848,"type":"comment"}