{"by":"stavrospap","id":18116234,"kids":[18116446],"parent":18113144,"text":"TileDB, Inc.  | Senior Software Engineer | Cambridge, MA or REMOTE (US)  | tiledb.io<p>Come join TileDB, Inc. in developing the future of big data storage. For emerging and growing fields such as genomics, earth science, imaging, and financial analysis, the volume of data is increasing at an astounding rate, and TileDB is meeting the challenge head on. Data in these areas is well represented as multidimensional dense or sparse arrays, and the open-source TileDB data management software is a novel, cutting edge solution for array storage.<p>The company closed a $1M seed in May 2017 led by Intel Capital and Nexus Venture Partners, and is raising a new round of funding in the upcoming weeks.<p>Our team combines software engineering expertise with domain knowledge to develop the open-source TileDB array data management software, and we are looking for talented and motivated engineers for the following positions:<p>- Full Stack Web Developer: Production experience with Kubernetes, Payment gateways, and React or Vue.js for frontend work<p>- Spark Software Engineer: Deep experience with Spark, Scala, Java, native JVM extensions &#x2F; JNI, Maven packaging and the SBT build system<p>- Bioinformatics Software Engineer: Strong C++ skills, experience with R or Python, FastQ, VCF, BAM formats, bcftools, htslib, GATK, Hail<p>TileDB has been featured on HN: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=15547749\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=15547749</a>.<p>TileDB GitHub organization: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;TileDB-Inc\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;TileDB-Inc</a><p>Our headquarters are located in Cambridge, MA. To cope efficiently with the different time zones and hiring processes, priority will be given to candidates that are located in the US, and are US citizens or permanent residents.<p>Apply at <a href=\"https:&#x2F;&#x2F;tiledb.workable.com\" rel=\"nofollow\">https:&#x2F;&#x2F;tiledb.workable.com</a>","time":1538423874,"type":"comment"}