{"by":"nicogier","id":18119694,"parent":18113144,"text":"Allianz | DevOps Engineer | Munich, Germany | Onsite 60k€ - 100k€<p>The Data Science Platform (DSP) is an internal service which empowers the Allianz group to develop, deploy, and operate data driven products end to end. Our goal is to reduce time for our customers from the first product ideation to its delivery following the DevOps philosophy. The DSP provides a scalable, fault-tolerant, self-service, integrated, security-approved environment at a competitive price. We strive for continuous improvement of our tool stack by evaluating, contributing to, and integrating state of the art technologies. Our platform community fosters knowledge and best practice sharing.<p>We are looking for a DevOps Engineer who is as passionate about our vision as we are. This includes the following responsibilities:<p>- Develop new functionalities for the DSP<p>- Evaluate new technologies in the field of cloud computing, distributed computing, data engineering, and data science<p>- Resolve incidents and change requests<p>- Support and interact with data scientists and data engineers within the Allianz Group<p>- Write user guides, announcements, blog posts, and best practices<p>Our platform is a diverse product consisting of several technologies. This characteristic should be reflected in our cross functional team of individuals who have a deep understanding of their technical specialty and at the same time are able to work outside of their core area. We encourage to contribute your individual strengths and personality to the team and give you the room to develop some new skills and experiences. The following technical skills are required for this particular position:<p>---<p>Technical Skills:<p>- Operations (Linux, Infrastructure as code, Metrics and log management, Virtualization, Networks)<p>- Software Development (Proficiency in at least one programming language (Go, Scala, Python, Elm, Angular etc.), Continuous integration, deployment, and delivery)<p>- Data Engineering (Databases, Distributed systems, Workflow orchestration and automation)<p>- Tools: Build infrastructure (Gitlab CI, Jenkins),  Artifact repository (Nexus), Version control (Gitlab), Deployment &amp; configuration automation (Ansible, Puppet)<p>- Other Skills (Team player, Agile, DevOps mindset, Open source, Fluent English)<p>contact nico.gier@allianz.com","time":1538468668,"type":"comment"}