{"by":"pixelmonkey","id":18117505,"parent":18113144,"text":"Parse.ly | Growth &amp; Data Lead | EST, CST Preferred | Full-Time | Remote | <a href=\"https:&#x2F;&#x2F;parse.ly\" rel=\"nofollow\">https:&#x2F;&#x2F;parse.ly</a><p>What&#x27;s Parse.ly? A real-time content measurement layer for the entire web.<p>Parse.ly is trusted by over 400 enterprises, used by over 3,000 high-traffic websites, and has tens of thousands of active user seats. We are an established, but quickly-growing, company with a 30+ person product + engineering + design team, sitting inside a 70+ person company. We have millions of dollars in revenue.<p>We have two products. Parse.ly Analytics (<a href=\"https:&#x2F;&#x2F;parse.ly&#x2F;analytics\" rel=\"nofollow\">https:&#x2F;&#x2F;parse.ly&#x2F;analytics</a>) is our flagship product, which measures first-party content engagement and audience attention on sites and apps. Just recently, we launched Parse.ly Currents (<a href=\"https:&#x2F;&#x2F;parse.ly&#x2F;currents\" rel=\"nofollow\">https:&#x2F;&#x2F;parse.ly&#x2F;currents</a>), which showcases aggregate attention trends from over 1 billion monthly internet readers in a novel, privacy-safe way.<p>The mission of our lean distributed team is described here:<p><a href=\"https:&#x2F;&#x2F;blog.parse.ly&#x2F;post&#x2F;4736&#x2F;mission&#x2F;?utm_campaign=oct201..\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.parse.ly&#x2F;post&#x2F;4736&#x2F;mission&#x2F;?utm_campaign=oct201...</a>.<p>We happily skip commutes by working out of our ergonomic home offices. Here&#x27;s a photograph of mine running two full-screen Parse.ly Analytics dashboards on my monitors:<p><a href=\"https:&#x2F;&#x2F;flic.kr&#x2F;p&#x2F;v1NZ73\" rel=\"nofollow\">https:&#x2F;&#x2F;flic.kr&#x2F;p&#x2F;v1NZ73</a><p>As our first Growth &amp; Data Lead, you&#x27;ll run a small team of designers and developers that owns the core experience of Parse.ly’s public website, technical documentation, knowledge base, emails&#x2F;newsletters, data studies, and blog.<p>You&#x27;ll have an opportunity to ship new features to any of these projects, with a goal of growing sign-ups (and customers) for these products. From a technical standpoint, you&#x27;ll be able to use modern web development tools atop a simple and agile JavaScript and Python stack, and to work with designers&#x2F;developers comfortable with that stack. But you&#x27;ll also use analytics tools like Google Analytics, MixPanel and yes, even, Parse.ly itself, to understand engagement of our visitors, and to position us for more growth in new channels like organic search, social sharing, data-driven press, and free (self-service) data products.<p>If you&#x27;re someone who loves data, growth, and marketing, and you want to take a B2B software company to the next level, this job is for you. To do this, you&#x27;ll have designers and web developers as collaborators, and be able to leverage data-oriented growth marketing strategies, such as launching public products built with Parse.ly&#x27;s data, or layering growth features into our existing products.<p>To be a fit for this role, you are the kind of person who’d enjoy the books &quot;Hacking Growth&quot;, &quot;Traction&quot;, and &quot;High Growth Handbook&quot;. If you are a former startup founder seeking to relocate to an established startup, but want to continue the path of deploying lean growth techniques, this role may be especially suited for you.<p>Apply at work@parsely.com with a couple paras describing why you&#x27;re interested, a link to any portfolio&#x2F;projects you think may be relevant, and&#x2F;or your resume or LinkedIn profile. Make sure to mention HN and the &quot;Growth &amp; Data Lead&quot; role. Also, please list your timezone, working hours, and location. Note that though we can hire from most locations, we will prioritize those near US&#x2F;Eastern timezone, due to the timezone makeup of this team.","time":1538434666,"type":"comment"}