{"by":"erre","id":18114183,"parent":18113144,"text":"Jump.Work | Frontender, Backender, Data Engineer | Amsterdam or London | ONSITE (we provide VISA SPONSORSHIP) | FULL-TIME<p>Hate recruiters? Eager to disrupt the agency industry? Or just passionate about using real data to understand human behaviour, and help people with their careers?<p>Jump.Work is a Talent Platform in the business services space that applies innovative <i>Behavioural Data Science</i> and <i>Machine Learning</i> to reinvent the way professionals &amp; companies discover and choose each other.<p><i>TL;DR</i><p>You can either apply directly (those links say either Amsterdam or London, but we&#x27;re cool with whichever of these locations you prefer):<p>- Frontender: <a href=\"https:&#x2F;&#x2F;workstaf.breezy.hr&#x2F;p&#x2F;7f5f3ec9623301-senior-front-end-developer\" rel=\"nofollow\">https:&#x2F;&#x2F;workstaf.breezy.hr&#x2F;p&#x2F;7f5f3ec9623301-senior-front-end...</a><p>- Backender: <a href=\"https:&#x2F;&#x2F;workstaf.breezy.hr&#x2F;p&#x2F;fecd600a8baa01-senior-back-end-developer\" rel=\"nofollow\">https:&#x2F;&#x2F;workstaf.breezy.hr&#x2F;p&#x2F;fecd600a8baa01-senior-back-end-...</a><p>- Data Engineer: <a href=\"https:&#x2F;&#x2F;workstaf.breezy.hr&#x2F;p&#x2F;421d1648499101-senior-data-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;workstaf.breezy.hr&#x2F;p&#x2F;421d1648499101-senior-data-engi...</a><p>or shoot me an email (I&#x27;m the CTO): rodrigo@jump.work<p><i>The Long(er) Read</i><p>We all know companies that have transformed industries (e.g., Google, Netflix, Spotify) by analysing information about you and giving you personalised suggestions that seem to know you better then even yourself – but where is the equivalent for jobs? Netflix’s recommendations are not based on “back of the box” blurbs - instead, they extract traits from movies and match them to your taste, based on your interactions. So why are we still evaluating people based on their “blurbs,” i.e. their CVs?<p>We use a combination of unique behavioural data, machine learning, and of course efficient product development, to go beyond the CV and find patterns that humans would otherwise not detect (at least not at scale).<p>Our longer-term goal is to be not only a preferred destination for transactional hiring, but a compelling, intuitive guide to planning and executing your career goals.<p>We have just closed a successful fundraising round and are expanding our team! This is a super exciting time to join, as it’s still early enough that you&#x27;ll help us shape the foundations of the platform and tackle some very interesting problems, yet we’ve already got enough usage, traction and data that you&#x27;ll have a real, immediate effect on people&#x27;s lives.<p>We are very serious about finding the right mix of talent, passion and ownership that meets our values, and is necessary for an ambitious early-stage startup. As we grow, the expectation is that you will too. All doors are open, from diving deeper into a technical speciality, to moving sideways into another area, to mentorship and leadership roles - in the end, it&#x27;s down to you, your goals and your performance.<p>If you want to be a part of a big, ambitious story, let&#x27;s chat!","time":1538411243,"type":"comment"}