{"by":"msolo","id":18114815,"parent":18113144,"text":"Broad Institute of MIT and Harvard | Cambridge, MA | Software Engineer | ONSITE, VISA<p>We are a small team of software engineers, computational biologists, clinicians, and geneticists building cutting-edge tools and methods for interpreting the largest public dataset of human genetic variation ever assembled: currently ~200,000 individual human genomes&#x2F;exomes and approaching 1 million over the next few years. We aim to determine how genetic variation alters our proteins, biochemical pathways, cells, tissues, physiology, and traits&#x2F;susceptibility to disease.<p>Position 1: Work with a team of genome analysts to develop software for solving real genetic disease cases. You should be excited about the engineering challenges associated with loading, searching, deploying, and visualizing huge genomic datasets stored in the cloud. Your work will directly help thousands of kids&#x2F;families find the root causes of rare genetic disease.<p>Position 2: Are you interested in understanding how human traits are associated with genes? This role involves building an interface for scientists to browse through thousands of human phenotypes and explore regions of the genome that are associated with these phenotypes&#x2F;traits. We are looking for a brilliant data visualization engineer that can synthesize multiple datasets and craft performant, beautiful, and useful web applications.<p>Technologies we use: React, Redux, Python, Docker, Elasticsearch, Kubernetes, Google Cloud. We are looking for friendly people with demonstrated experience in web tech, an eye for design, and genuine interest in learning new things. We are supportive of candidates interested in transitioning to graduate school. Your work will be 100% open source and highly visible in the genomics community. You will shape the way scientists interpret human genetic variation.<p>Email: msolomon@broadinstitute.org (conversations will be kept confidential. We now have an application tracking system in place so you will be notified about application status).","time":1538414961,"type":"comment"}