{"by":"eropple","id":18115781,"parent":18113144,"text":"CareStack | Senior&#x2F;Principal Frontend Developer | Full-Time | ONSITE preferred, REMOTE possible | Cambridge, MA | <a href=\"https:&#x2F;&#x2F;carestack.com\" rel=\"nofollow\">https:&#x2F;&#x2F;carestack.com</a><p>CareStack is a dental practice management SaaS. We&#x27;re helping dentists capture hundreds of thousands of dollars more than with legacy tools through schedule optimization and improved claims management--and no, that&#x27;s not just hype, it&#x27;s real. We&#x27;ve just landed a $16M Series A, led by Accel, Eight Roads Ventures and F-Prime Capital Partners, and we&#x27;re expanding our development team from India to the United States. The company has product-market fit and our onboarding pipeline has filled up nicely. Now it&#x27;s up to the engineering team to really turn the product into something special--something that our customers are delighted to pay us for. Having that kind of product-market fit so early and reducing a lot of it to technical problems is a different situation than a lot of startups at this stage, but it makes things a whole lot more fun.<p>Right now, we&#x27;re in need of product-minded senior and principal-level frontend developers who have a track record of making sustainable long-term decisions. Our stack is .NET (though .NET experience isn&#x27;t required) and Angular 1&#x2F;TypeScript; the future of the usual frontend may be a modern version of Angular or a move to React, and it&#x27;s largely up to the leaders of our frontend team to decide. (Our mobile work will probably be React Native.) In addition to technical and architectural competence, a big part of the role is helping to socialize good practices to our existing developer base as well as to forge ahead with the usual: new features, performance and stability improvements, and the like.<p>As for me, I&#x27;m the Director of Infrastructure here--I was impressed enough by the company and the team to wind down my consulting business to come here. For those of you who know me from HN, you know that I&#x27;m big on generosity, kindness, and <i>competence</i>, and I&#x27;m happy to say that this team is better at all of the above than any team I&#x27;ve ever worked with in the past. We all teach; we all learn. It is a pleasure to come into work everyday.<p>Our team is primarily Boston-centric--I was the first engineer hired into this office, we&#x27;re up to 7 local now. We do offer relocation for the right candidates and we will consider remote hires.<p>eropple@carestack.com - put &quot;[HN WHO&#x27;S HIRING]&quot; in the subject line.","time":1538420871,"type":"comment"}