{"by":"h1insights","id":18115708,"parent":18113144,"text":"H1 | Data Scientist | Onsite | New York | Full Time | $110-$150k + equity | <a href=\"https:&#x2F;&#x2F;h1insights.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;h1insights.com&#x2F;</a><p>Our team is building a suite of machine learning tools to help solve problems in the life science space.  This includes the classification of researchers and physicians to their scholarly research, simulating how effective drug compounds will be, and much more.<p>We&#x27;re growing fast in a field that is also growing fast, so we&#x27;re looking for people who want to grow fast too.  We think an environment that is supportive, collaborative, and sophisticated is the key to making this happen.<p>Our data scientists do these kinds of things:<p>Deploy machine learning techniques against a set of collected and cleaned data.  We’ve separated the data engineering and data science roles at H1 because we want our data scientists to spend their time analyzing data, not cleaning it.<p>Work within a Spark&#x2F;Scala&#x2F;Python environment from notebooks through mature pipelines.  Our data scientists are able to implement algorithms in code that runs at scale.<p>Tune and tweak common algorithms for the right result.  Our data scientists are able to tell us how the shape of the data influences the performance of the algorithm, and what the trade-offs are between using one algorithm over another.<p>Find an academic paper which explains a new machine learning concept, and implement it.  This involves not only coding the application, but testing against real-world data and potentially making improvements.<p>All candidates must have a very thorough understanding of linear algebra and statistics.  This means understanding various fundamental matrix decompositions and their effects, various statistical distributions and their applications.<p>If creating foundational infrastructure in data science using the latest tools and techniques sounds appealing, we&#x27;d love to start a conversation. Email me: josh.geisler(at)h1insights.com","time":1538420315,"type":"comment"}