{"by":"mahmoudimus","id":18117148,"parent":18113144,"text":"Very Good Security, Inc. | San Francisco&#x2F;Ukraine | Remote OK | 75%-85% of Market Rate according to <a href=\"https:&#x2F;&#x2F;radford.aon.com&#x2F;surveys\" rel=\"nofollow\">https:&#x2F;&#x2F;radford.aon.com&#x2F;surveys</a> | Full-time | <a href=\"https:&#x2F;&#x2F;verygoodsecurity.com\" rel=\"nofollow\">https:&#x2F;&#x2F;verygoodsecurity.com</a><p>Very Good Security (VGS) is the easiest, most secure, and most compliant way to collect, protect, and exchange sensitive data on the internet. We are building a very developer-friendly way to embed privacy into both existing and new applications today.<p>To quote a Forbes reporter: &quot;Startups, such as Very Good Security (VGS), are building new cloud services so that smaller firms across the economy can offer products with leading edge privacy protection. VGS’s solution is to mediate — and anonymize — transactions, authorizations, and authentications so that our personal information is not stored and transmitted along the daisy chain of hospitals, retailers, online stores, and other points-of-sale, including all their vendors and vendors’ vendors.&quot; (<a href=\"https:&#x2F;&#x2F;www.forbes.com&#x2F;sites&#x2F;washingtonbytes&#x2F;2018&#x2F;09&#x2F;25&#x2F;europe-and-california-get-it-wrong-technology-is-the-solution-to-digital-privacy&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.forbes.com&#x2F;sites&#x2F;washingtonbytes&#x2F;2018&#x2F;09&#x2F;25&#x2F;euro...</a>)<p>We are accepting applications for individuals who are interested in reverse engineering, cryptography, data security, privacy, application security, and&#x2F;or working on making best practices accessible to developers everywhere. We have a very ambitious roadmap, well funded, and growing at a very fast pace.<p>When applying, please let us know why you think you&#x27;d make a great candidate. You can find open jobs here: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;vgs\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;vgs</a>. If you do not see a role that you&#x27;re interested in, but are interested in learning more, please apply anyway!<p>Feel free to email me directly (<a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;user?id=mahmoudimus\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;user?id=mahmoudimus</a>) with any question about what we are building.","time":1538430753,"type":"comment"}