{"by":"xando","id":18113490,"parent":18113144,"text":"Eventplicity | Fullstack, Frontend, Backend Engineer | Gainesville, FL | REMOTE (anywhere) | Full-time | <a href=\"http:&#x2F;&#x2F;www.eventplicity.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.eventplicity.com</a><p>We are seeking both a Senior Backend Engineer and a Senior FrontEnd Engineer. (Fullstack developers also welcome.)<p>About Eventplicity\nEventplicity provides planning and logistics software that helps restaurants book private parties and special events. We&#x27;re a startup with an exciting growth trajectory. This isn&#x27;t restaurant reservations. We book private events that involve the planning and execution of many intricate details. We provide a modern web application that tackles the surprising number of complexities involved in planning private parties from start to finish. Every venue is different, every event is different, and every booking is different. Join our team and help us build the right set of abstractions and the modern interface that will wrangle these complexities into a smooth, easy-to-understand online booking experience.<p>Our Stack:<p>Front-End: Modern Javascript stack (ES 2015+ syntax, babel, webpack, jest, React, Redux, Socket.io, Bootstrap)<p>Back-End: Python, Flask, Small amount of Node.js &amp; Go, Redis, PostgreSQL<p>DevOps: AWS, Docker, CircleCI, Git &#x2F; Github<p>Development Culture<p>* We greatly value high quality code and strong technical acumen.<p>* Since we&#x27;re a startup, we understand there are tradeoffs and there will be technical debt. We can&#x27;t make everything perfect. While we greatly value high quality code, we know it&#x27;s equally important to move fast and learn from our users in order to succeed.<p>* We prefer stable technologies, but we also want to use modern tools.<p>* We do not make artificial deadlines. We work hard to be productive, but it&#x27;s never a push for an arbitrary date.<p>* There is no bureaucracy (our software team is small).<p>Got questions? Sounds interesting? Feel free to contact us at devjobs@eventplicity.com","time":1538407608,"type":"comment"}