{"by":"awad","id":18117239,"parent":18113144,"text":"Pixlee | SF and Toronto | Onsite, Full-Time | <a href=\"https:&#x2F;&#x2F;www.pixlee.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.pixlee.com</a>\nPixlee helps brands market and sell using the voice of their own customers by leveraging user generated photos and videos. Today, one in four Americans interact with Pixlee-managed content before making online purchase decisions. Pixlee offers a unique opportunity to thrive and grow rapidly at a global scale in a small-team startup environment. Our customers are some of the largest brands in the world and everything you do here affects millions of consumers.\nWe are looking for passionate back-end focused developers to help continue to scale our product, and work closely with customers to integrate their eCommerce stores with the Pixlee platform. You&#x27;ll get a chance to work on a wide range of problems in big data analytics, eCommerce integration, and API development just to name a few. You&#x27;ll have a chance to explore brand new areas of interest while leveraging your experience to create robust and optimized data pipelines and third-party integrations.\nWe love product focused engineers with excellent communication skills, the ability to work with a multitude of languages, and a desire to continually step out of their comfort zone.\nHere are our open roles:\n- App &amp; Partner Platform Engineer (SF): <a href=\"https:&#x2F;&#x2F;www.pixlee.com&#x2F;careers?gh_jid=1267300\" rel=\"nofollow\">https:&#x2F;&#x2F;www.pixlee.com&#x2F;careers?gh_jid=1267300</a>\n- App &amp; Partner Platform Engineer (Toronto): <a href=\"https:&#x2F;&#x2F;www.pixlee.com&#x2F;careers?gh_jid=1267422\" rel=\"nofollow\">https:&#x2F;&#x2F;www.pixlee.com&#x2F;careers?gh_jid=1267422</a>\n- Senior QA Engineer (Toronto): <a href=\"https:&#x2F;&#x2F;www.pixlee.com&#x2F;careers?gh_jid=1209290\" rel=\"nofollow\">https:&#x2F;&#x2F;www.pixlee.com&#x2F;careers?gh_jid=1209290</a><p>If you&#x27;d like to learn more, pablo@pixleeteam.com is the best point of contact","time":1538431814,"type":"comment"}