{"by":"andjd","id":18113983,"parent":18113144,"text":"Stationhead | Senior Software Engineer — Mobile (iOS) or Full Stack | ONSITE in Brooklyn, NY | Full-time | Competitive salary based on experience.<p>Hi, I’m Andrew DeFranco, a full-stack engineer at Stationhead. We’re building a music-focused social network fighting back against algorithmically generated playlists and soulless corporate radio. We’re creating a democratized platform people connect with their music, their favorite artists, and each other. Our founder is an actual rockstar, we have artists and industry executives lauding us as the future of music streaming, and at WWDC Apple featured us as one of three companies doing great things in music.<p>We’ve just landed a major injection of capital, and we’re looking to hire a seasoned developer to join our 8-person tech team and help us scale up from a successful open beta to a mainstream product everybody&#x27;s talking about.<p>As an ideal candidate, you have 5+ years of relevant experience, including working at a fast-growing startup.<p>You have a passion for writing correct, clear, maintainable, and well-tested code, and have experience and interest in mentoring junior developers.<p>You should also be an expert in:<p>* creating iOS applications in Swift<p>* diagnosing and fixing bugs and performance issues<p>* ingesting and working with REST APIs.<p>* testing using Quick.<p>If you are applying as a full-stack developer, you should also be expert in:<p>* using Laravel or a similar MVC web framework such as Spring, Ruby on Rails, Django, or Express.<p>* relational databases, including designing schema, writing queries, and diagnosing performance issues.<p>* Redis and ElasticSearch<p>* productionizing, orchestrating, and autoscaling server infrastructure on AWS.<p>Please reach out to me at andrew@stationhead.com if you&#x27;re interested, using the subject line: `Application for Senior Engineer at Stationhead`.<p>Be sure to include your favorite band in the body of the email, so we know you&#x27;re not a bot.","time":1538410123,"type":"comment"}