{"by":"cshenoy","id":18116822,"parent":18113144,"text":"UrbanStems | Director of Engineering | Washington, DC | Full time | Onsite<p>Do you love JavaScript? We  JS at UrbanStems. We&#x27;re looking for a Director of Engineering to come lead our small but nimble developer team. We are creating the best customer experience in the floral industry, which starts with unparalleled technology. Our dev team is fast-paced, data-driven, &amp; innovative. We work closely with our creative, product, operations, customer happiness, and marketing teams to bring our technical ideas to life.<p>What You&#x27;ll Do\n- Collaborate closely with the CEO and other team leads to create dev team priorities\n- Set the technical vision and roadmap for the company\n- Rollout infrastructure incorporating CI&#x2F;CD\n- Lead development of a stable backend&#x2F;API that puts the customer experience above all else\n- Lead a team of developers with up to date and relevant knowledge\n- Work on various front end applications - libraries&#x2F;frameworks don&#x27;t matter.\n- Help optimize processes for operations&#x2F;logistics\n- Have extensive say in not only technical but also business decisions\n- We&#x27;re a startup - when it comes down to it, you’re able to roll up your sleeves and contribute wherever needed<p>About You\n- Demonstrable projects and results from 7+ years of relevant experience\n- Experience managing a team of developers\n- Experience with Agile processes (Scrum, Kanban, etc)\n- Full Stack Experience. If your front-end skills are lacking, your backend knowledge is stellar.\n- Experience designing and interacting with RESTful APIs\n- Database (SQL) familiarity specifically with PostgreSQL and Redis\n- Advanced Linux knowledge\n- Worked with a VCS like Git or Mercurial\n- Knowledge of a variety of languages is desired and encouraged: JS, Python, Ruby, Go, Elixir, and others\n- Self starter within a team structure\n- Strong communications skills around how they’re doing, thought process, and general ideas - we prefer over-communication<p>To apply, send your resume and short blurb about a favorite project you&#x27;ve worked on to chetan@urbanstems.com.","time":1538428074,"type":"comment"}