{"by":"jauco","id":18115345,"parent":18113144,"text":"Royal Academy of Sciences | Amsterdam, The Netherlands | Software Engineer | Full-time, onsite only, Visa | $40K – $60K\nBuild open source software that slowly but surely links all historical data in Europe together<p>We&#x27;re a team of engineers at the Royal Academy of Sciences in the Netherlands. We build (or implement) Open Source SaaS software that allows users to work their data[1][2]. We&#x27;re looking for front-end &#x2F; back-end engineers (we prefer people who like a little bit of both) to add features for exposing the data (search, visualisation) and for working with the data (distributes storage, reasoning&#x2F;inferring knowledge).<p>Examples of problems we tackle:<p>- Given that you have about a million mentions of names in notarial archives of the 17th century, can you make an educated guess at which of those mentions are about the same person? Please note: spelling was optional back then. Birthdates were approximations as well.<p>- Given that you have two scanned pieces of parchment with handwritten text. Can you detect if they were written by the same author? Can you detect what constitutes the &quot;main&quot; writing and what are the reader&#x27;s notes?<p>- Can you extract all mentions of places, people and events from a text. Can you do it with a lexicon that changes over time?<p>- Given a 12km archive of decisions of a legislative body. Can you use network analysis to find clicques based on voting patterns?<p>As you can see most of these problems are not &quot;novel&quot; per sé, but they are often made a tad more difficult by the historical aspect. And they sure are fun :)<p>We provide an environment where people enjoy freedom of work, where our clients understand the uncertainty of experimentation (they&#x27;re researchers after all) and where all code is published under an open-source license.<p>We&#x27;re using python and java (yes, voluntarily), react (I know, sooo 2016) and we&#x27;re hosting on kubernetes. We don&#x27;t really care if you&#x27;ve used these exact technologies before, but we do care if you have built up greenfield applications as well as to have worked on applications that have been in development for a few years.<p>Contract benefits: other then what you get in any Dutch company (which is pretty good, especially for US standards) we provide you with a 38 hour workweek and 30 paid holidays (outside of the national holidays such as christmas)<p>Interview process: you send us some examples of real applications you wrote -&gt; phone interview -&gt; at a later date a technical challenge (in person or screenshare) -&gt; final interview (finalizing the agreement)<p>Drop me a line at jauco.noordzij . di.huc.knaw.nl!<p>[1] <a href=\"http:&#x2F;&#x2F;github.com&#x2F;huygensING\" rel=\"nofollow\">http:&#x2F;&#x2F;github.com&#x2F;huygensING</a>\n[2] <a href=\"http:&#x2F;&#x2F;github.com&#x2F;knaw-huc\" rel=\"nofollow\">http:&#x2F;&#x2F;github.com&#x2F;knaw-huc</a>","time":1538418032,"type":"comment"}