{"by":"HoyaSaxa","id":18116977,"parent":18113144,"text":"Narmi (Techstars NYC &#x27;17)| Senior Full Stack Engineer | New York, NY (NYC) | ONSITE | <a href=\"https:&#x2F;&#x2F;www.narmitech.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.narmitech.com</a> Narmi is helping reinvent banking in the United States. We create a more accessible and useful financial ecosystem by powering the online banking, mobile banking, and open banking APIs for the 10,000 credit unions and community banks in the United States. You&#x27;ll be working on production software that has a real impact on the average American&#x27;s life everyday. Our software helps them save money on their bills, understand their financial story, protect their families and move money. Narmi was founded by two Georgetown University alums who previously worked as CEO and CTO of a $18 million credit union and also at some of the largest banks in the world.\nEven if you don&#x27;t think you are an exact fit for one of our current openings, we&#x27;d still love to talk.<p>We are always looking for well-rounded engineers to join our team in NYC. Having expertise in python (django and django-rest-framework), vue.js, react native, ansbile, terraform, visual design&#x2F;UI&#x2F;UX, and&#x2F;or security are all pluses!<p>Senior Full Stack Engineer: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;narmi&#x2F;jobs&#x2F;180510-senior-full-stack-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;narmi&#x2F;jobs&#x2F;180510-senior-full-stack-enginee...</a><p>Product Engineer: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;narmi&#x2F;jobs&#x2F;343383-product-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;narmi&#x2F;jobs&#x2F;343383-product-engineer</a><p>The interview process entails an intro call to get to know each other, a remote coding session, and finally an in-person half-day.<p>Some keywords: * Senior Full Stack Engineer, Senior Full-stack Engineer, Senior Full Stack Developer, Senior Full-stack Developer * Senior Front End Engineer, Senior Front-end Engineer, Senior Front End Developer, Senior Software Engineer, Senior Product Engineer * Banking, finance, online banking, mobile banking, open banking APIs, * New York City, New York, NY, NYC, Manhattan<p>You can learn more on our website and apply via email: jobs @ our domain. Make sure to mention you found us on Hacker News. You can also apply via AngelList[1] Also please feel free to reach out directly to me chris @ our domain.<p>[1] <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;narmi&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;narmi&#x2F;jobs</a>","time":1538429276,"type":"comment"}