{"by":"kvz","id":18113264,"parent":18113144,"text":"Transloadit | Technical writer | Part-time | Remote | <a href=\"https:&#x2F;&#x2F;transloadit.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;transloadit.com&#x2F;jobs&#x2F;</a><p>Hi, founder at Transloadit here. We just posted a vacancy today. To summarize:<p>Our company is looking for a developer who enjoys technical writing to provide content around our projects in the form of blog posts, documentation, tutorials and walkthroughs. In essence, you’ll be paid to hang out in our various Slack channels and play around with our tech:<p>* a commercial API for uploading &amp; encoding: <a href=\"https:&#x2F;&#x2F;transloadit.com\" rel=\"nofollow\">https:&#x2F;&#x2F;transloadit.com</a><p>* open SDKs for all major programming languages: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;transloadit\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;transloadit</a><p>* an open protocol for resumable file uploads: <a href=\"https:&#x2F;&#x2F;tus.io\" rel=\"nofollow\">https:&#x2F;&#x2F;tus.io</a><p>* the next open source file uploader for webbrowsers: <a href=\"https:&#x2F;&#x2F;uppy.io\" rel=\"nofollow\">https:&#x2F;&#x2F;uppy.io</a><p>While doing so, you’ll be taking notes on any issues you encounter (which we’ll use to improve our products) or anything you think might be fun or interesting to write about. You’ll also be asked to write rough blog posts about new features we are working on. Your writing doesn’t need to be flawless from the get-go, since you will be working closely with our in-house editor&#x2F;writer who can turn raw technical content into well-polished posts.<p>We’re looking for someone who is proficient in English and has experience with <i></i>GitHub<i></i>, <i></i>Markdown<i></i> and <i></i>Node.js<i></i>.<p>We&#x27;re hoping to publish around two substantial posts each month, along with minor updates and tweaks to our existing docs and demos. The job is for 20 to 32 hours a month, paying $25&#x2F;h. You can work whenever you see fit, but we do require a 2-hour overlap with our office hours (07:00-15:00 UTC) during which you are comfortable working for us. That way, we won&#x27;t have to rely purely on async communication.<p>We think this is a great opportunity for <i></i>tech students<i></i> and <i></i>freelancers with some spare time<i></i>! If this sounds interesting to you, please check out the full vacancy here: <a href=\"https:&#x2F;&#x2F;transloadit.com&#x2F;jobs&#x2F;2018-10-technical-writer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;transloadit.com&#x2F;jobs&#x2F;2018-10-technical-writer&#x2F;</a> and drop me a line at kvz@transloadit.com.","time":1538406591,"type":"comment"}