{"by":"vencatter","id":18114485,"parent":18113144,"text":"Unnamed Yet | Advanced&#x2F;Senior Backend Engineer | Germany, Hamburg | Full-Time | ONSITE | GER or EU<p>Use your chance to design the next milestone for a whole product from scratch. We are building an automated solution for an existing, proven and successful business. We started in April 2018 on technical green grass and are a completely decoupled subsidiary from our parent company and can benefit from long-term funding. We are not wasting our time on the next pitch for investors. Instead we focus on and work with our existing customers and benefit from our position without market-entry barriers.<p>You would...<p>* Continue building our platform for our next milestone<p>* Need to work with 100% responsibility of bringing the product forward on a team with currently seven people<p>* Be directly involved in profit sharing instead of working for low equity which eventually would be a net-loss for you<p>* Be part of an international team as we care for different cultures from begin on<p>We...<p>* Care for developer and personal skills and want to benefit from your knowledge<p>* Believe in flexibility instead of 40h&#x2F;week<p>* Live a feedback, non-bullshit-speak culture<p>* Honour error-making instead of unconsciousness (fail fast)<p>* Are located in Germany (Deutschland), Hamburg with own office space near Jungfernstieg &#x2F; central station<p>* Are willing to provide Bachelor-&#x2F;Master-thesis-agreements if you want to stay in long-term<p>* Need on-site activity because of lot of direct business contact nevertheless homeoffice is encouraged<p>Interview process: virtual session(s) and with CTO; on-site Mettbrötchen mit Zwiebeln™ (or pizza ;-) with CEO &amp; CTO; contract<p>Contact me: ta-whoishiring2018@heap.nu<p>Avoid the confidence gap and reach out to me without bullshit-speak. We can talk on Skype and&#x2F;or phone for more details without you having to invest much time before preparing your application. Even a one-liner is okay. Please only applicate if you are near to us, willing to relocate within the EU or to commute some days a week. No remote-only&#x2F;VISA applications, please.","time":1538413063,"type":"comment"}