{"by":"old-gregg","id":18114284,"parent":18113144,"text":"Gravitational Inc | Toronto, Canada | Software Engineer | Onsite | <a href=\"https:&#x2F;&#x2F;gravitational.com\" rel=\"nofollow\">https:&#x2F;&#x2F;gravitational.com</a><p>About us<p>Gravitational, an early stage systems &amp; cloud startup in San Francisco, is looking for ambitious and talented people. We are well-funded by fantastic Silicon Valley investors. We are an experienced team: we founded Mailgun [1] which was acquired by Rackspace, we created Vulcand [2] and some other cool stuff [3] at Rackspace and are authors of Teleport [4] and Teleconsole [5].<p>We are hackers. We love Linux and low level systems programming and we love helping open source communities and other engineers to get things done. Our stack is 100% Linux and Golang with JavaScript&#x2F;React for dynamic web front-ends.<p>We offer competitive compensation and benefits (including a founder shares equity grant, platinum level healthcare insurance, commuter benefits and a stocked kitchen).<p>About you<p>For this role we&#x27;re looking for a generalist full-stack software engineer, preferably located in Toronto, Canada (but we&#x27;re willing to consider exceptional candidates elsewhere). You understand how computers work and what role an operating system plays? You know why the Linux kernel is written in C and not any other language? Most likely we&#x27;ll want to talk to you.<p>Responsibilities<p>Gravitational builds tools for developers, we are not a SaaS company but we still need to develop web apps. You will own the development &amp; maintenance of the customer portal, the web site, the blog and other web applications that we&#x27;re running.<p>Contact<p>Either reach out to my personal email in my profile or jobs@gravitational.com<p><pre><code>    [1] https:&#x2F;&#x2F;mailgun.com \n    [2] http:&#x2F;&#x2F;vulcand.github.io&#x2F;api.html\n    [3] https:&#x2F;&#x2F;blog.rackspace.com&#x2F;onmetal-the-right-way-to-scale\n    [4] https:&#x2F;&#x2F;github.com&#x2F;gravitational&#x2F;teleport\n    [5] https:&#x2F;&#x2F;www.teleconsole.com</code></pre>","time":1538411820,"type":"comment"}