{"by":"cek","id":18116027,"parent":18113144,"text":"Control4 | Senior Audio Electrical Engineer | Draper, UT | Full-Time | Onsite | <a href=\"https:&#x2F;&#x2F;control4.applicantpro.com&#x2F;jobs&#x2F;893721.html\" rel=\"nofollow\">https:&#x2F;&#x2F;control4.applicantpro.com&#x2F;jobs&#x2F;893721.html</a><p>The Control4 smart home solutions span many facets of everyday life, powered by dozens of hardware and software products we design, manufacture, and sell to be professionally installed. Our customers enjoy the convenience of intelligent lighting across their homes with our smart dimmers, switches, and centralized lighting products. Premium multi-room music is provided through best-in-class digital media receivers, high-resolution power amplifiers, audio matrix switches, and the Triad line of speakers (some of the best in-wall and in-room speakers money can buy). We delight homeowners with simple to use home theater and 4K multi-room video solutions. Customers love our hand-held remote controls, mobile apps, and touch screens. Contro4’s Intercom Anywhere solution enables families to stay connected both while at home and out-and-about with native iOS and Android apps. Customers get the most comprehensive Alexa voice control integration of any home automation platform. Our personalization features enable customers to create lighting scenes, add streaming music services, and customize automation through a unique approach we call WHEN &gt;&gt; THEN.<p>Control4 is now available in approximately 100 countries leveraging a professional distribution channel that includes over 5,700 custom integrators, retailers, and distributors authorized to sell the full-line of Control4 products.<p>The Senior Audio Electrical Engineer will be responsible for developing next generation Control4 Audio products as well as supporting existing product lines. He&#x2F;She will define requirements, detail specifications, develop audio hardware with system level&#x2F;holistic approach to optimize system efficiency, performance, and cost, from input to output. The position requires teamwork with existing audio team and designing to high performance standards.","time":1538422487,"type":"comment"}