{"by":"pshintri","id":18124492,"parent":18113144,"text":"Human API | Platform&#x2F;Data Tech Lead, Sr. SWE - API&#x2F;Web Services | San Mateo, CA | ONSITE | <a href=\"https:&#x2F;&#x2F;humanapi.co&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;humanapi.co&#x2F;careers</a><p>Make a difference with technology: specifically, by helping to fix healthcare. We&#x27;re building a real-time data network that allows getting health data from anywhere to anywhere in close to realtime. We roll up this data in a clean RESTful API that developers use to build apps that make peoples&#x27; lives better.<p>Human API is an early stage company that is disrupting the healthcare space.  We are well-funded, generating revenue, and backed by blue-chip VC&#x27;s, including Andreessen Horowitz and Blue Run Ventures.  \nWe have a whole pile of fun, interesting problems, and a team of smart, passionate people that love working on them. We like to work iteratively in small teams, and to give people autonomy and ownership to solve those problems.<p>Some of the things you&#x27;d be working on:<p><pre><code>  - Mapping, modeling and indexing the world&#x27;s healthcare data\n  - Scaling and optimizing our APIs\n  - Modeling human health\n  - Scaling our ingestion pipeline\n  - Data engineering and building tools for data science\n  - NLP and Classification\n  - Extracting healthcare data from a wide variety of unstructured, unclean formats\n</code></pre>\nOpen positions include:<p>Platform Tech Lead \nSr. Data Engineer  \nSr. Software Engineer - Web Services\nSr. Data Scientist<p>More information here: <a href=\"https:&#x2F;&#x2F;humanapi.co&#x2F;company&#x2F;join\" rel=\"nofollow\">https:&#x2F;&#x2F;humanapi.co&#x2F;company&#x2F;join</a>\nThe process: a quick phone screen, a screen-share technical interview, then an onsite to meet with the team and pair with someone on a problem.<p>We&#x27;d love to hear from you even if you don&#x27;t &quot;fit&quot; one of the job specs -- we hire for people, not roles.<p>Contact us at pramod@humanapi.co","time":1538505995,"type":"comment"}