{"by":"haykmartiros","id":18127093,"parent":18113144,"text":"Skydio | Software Engineer -  Skills SDK | Redwood City, CA | ONSITE VISA | Full-time<p>Skydio makes a flying robot platform that’s built on top of the most advanced autonomy stack available in the world today. In the hands of knowledgeable professionals across multiple industries, Skydio has an unprecedented opportunity to put autonomous UAVs to work at enterprise scale. We’re looking for a software engineer to design and build public-facing APIs that drive the growth and development of the Skydio Autonomy Platform, from early beta into product maturity and widespread adoption. Funding 70M+.<p>Responsibilities<p>* Define and lead technical development APIs for autonomous drones targeted towards enterprise and consumer markets.<p>* Understand high-level industry vertical requirements and create actionable API functionality to address high-value requirements.<p>* Develop and maintain a rigorous test and regression framework that ensure continued API safety as the product evolves.<p>* Develop and maintain enterprise integrations with a keen eye for security and sensitivity to intellectual property.<p>Requirements<p>* High proficiency in Python, Javascript, C++<p>* Experience designing, building, and managing substantial software APIs<p>* Strong communication skills, interface effectively with internal engineering team and external partners.<p>* Experience with and understanding of full-stack software principles; Security protocols, performance analysis, cloud compute resource management, documentation<p>* Strong analytical skills; Vector Math, 3D Rotations, Basic Linear Algebra and Calculus.<p>* Passion for Autonomous Flight<p>* Chill<p>Recommended<p>* Extensive knowledge and experience with robotics systems, specifically with Perception&#x2F;Motion Planning&#x2F;Controls.<p>* Past experience with using UAV in an enterprise or industrial setting.<p>* Some experience with IOS&#x2F;Android development.<p>* Some experience with TensorFlow.<p>* UAV pilot<p>recruiting@skydio.com","time":1538531411,"type":"comment"}