{"by":"urlwolf","id":18132538,"parent":18113144,"text":"Deep Learning Retreat | Part-time instructor (2 days every 3 months) | San Francisco | ONSITE  | Part-time<p>Side gig for someone who loves teaching and mentoring. Can be on a weekend day, make sure your contract with your fulltime employer allows that. If you don&#x27;t know deep learning to a level you can teach it but know classical ML, you are good. You are a specialist in one ML domain. You&#x27;re a good communicator, you&#x27;re self-sufficient &amp; you&#x27;re passionate about the work you do.<p>==Mission==<p>Take &#x27;Bedroom deep learning&#x27; to the next level. Every participant comes out of the door with a portfolio project that has social impact, ideally at scale.<p>At DLR, we believe (in spite of the hype) deep learning is actually underappreciated. It has more potential to generate an impact than most other technologies. Big companies (Google, Amazon, Facebook, Netflix, Waymo, Uber, Apple, etc.) are ‘killing it’ using deep learning in their products. You hear you need lots of data and computation to build anything remotely useful. This is just not true. You don’t need to be a corporation to have ridiculous amounts of effect with deep learning!<p>The more we talk to companies interviewing today, the more apparent it is: A portfolio project is decisive when making hiring judgments. Jeremy Howard recommends it. Andrew Ng recommends it. Why? It’s far better at discriminating talent than any other proxy (CVs don’t work; pedigree doesn’t work; puzzles don’t work).<p>You can read more about our method here:\n<a href=\"https:&#x2F;&#x2F;deeplearningretreat.com&#x2F;method-and-manifesto&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;deeplearningretreat.com&#x2F;method-and-manifesto&#x2F;</a>\nSee also the kind of projects we build: a combination of cheap hardware and deep learning that produces serious social impact.<p>==Company Values==<p><a href=\"https:&#x2F;&#x2F;deeplearningretreat.com&#x2F;work-at-dlr&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;deeplearningretreat.com&#x2F;work-at-dlr&#x2F;</a>\nWe follow the &#x27;Teal&#x27; model (Book: reinventing organizations). The company has a strong purpose and everyone is autonomous and empowered.<p>Other instructors tell us that they learn a lot by teaching here. You can join anyone else&#x27;s session anytime.<p>We are customer funded.<p>==Interview==<p>Phone call &#x2F; coffee (1 hr) &gt;&gt; In-person (3 hrs) &gt;&gt; Onsite w&#x2F;team, teaching to DLR participants (half-to-full day)","time":1538587673,"type":"comment"}