{"by":"mattbooy","id":18140499,"parent":18113144,"text":"Phantom | Python Developer, Front End Developer, Analyst | London, UK | ONSITE, Full-Time | <a href=\"https:&#x2F;&#x2F;phantom.land\" rel=\"nofollow\">https:&#x2F;&#x2F;phantom.land</a><p>Phantom is a forward thinking digital creative agency based in Old Street, London, United Kingdom. We are currently expanding the team and have vacancies for mid&#x2F;senior python engineers, mid&#x2F;senior front end developers and a data analyst&#x2F;strategist.<p>No matter what the role, we love Phantoms to be involved in everything from strategy to delivery, working collaboratively with the entire agency to find unique solutions to some amazing briefs. To help facilitate this we have our own bar in the office and the cupboards are always stocked with snacks and treats. Most importantly we have an awesome development and creative team in place and are looking for more like-minded people who will keep pushing the agency forward.<p>A small sample of the technologies, languages and frameworks we use include Angular, Three.js, Unity, GCP, ES6, Django and Flask. Some recent projects we&#x27;ve worked on include a Cardboard VR Experience for Google (<a href=\"https:&#x2F;&#x2F;phantom.land&#x2F;work&#x2F;petra&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;phantom.land&#x2F;work&#x2F;petra&#x2F;</a>), a personalised playlist generator for London Grammar (<a href=\"https:&#x2F;&#x2F;phantom.land&#x2F;work&#x2F;moodmix&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;phantom.land&#x2F;work&#x2F;moodmix&#x2F;</a>), Market Finder (<a href=\"https:&#x2F;&#x2F;marketfinder.thinkwithgoogle.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;marketfinder.thinkwithgoogle.com&#x2F;</a>) and an interactive piece for the TATE Modern featuring music by Sigur Rós (<a href=\"https:&#x2F;&#x2F;phantom.land&#x2F;work&#x2F;states-of-matter&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;phantom.land&#x2F;work&#x2F;states-of-matter&#x2F;</a>).<p>Please check out our site (<a href=\"https:&#x2F;&#x2F;phantom.land&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;phantom.land&#x2F;jobs</a>) for more info on the current jobs available. Alternatively send matt@phntms.com an email directly with your CV and any relevant information. Would love to see any recent or personal projects in your email.","time":1538665325,"type":"comment"}