{"by":"maxneust","id":18166908,"parent":18113144,"text":"Polarsteps | Senior backend engineer | Amsterdam, NL | ONSITE, VISA sponsoring<p>Join us on our adventure!<p>Every day, our team is working on creating the best travel app out there, building the place to go to for people that want to plan, track and remember their adventures around the globe. After launching in 2015, Polarsteps is now used by almost 1.000.000 travellers from 180+ countries. Our app was featured in Apple&#x27;s WWDC keynote speeches of 2017 and 2018, and just recently Google created this amazing short video about us: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=nYcBqtOwLcg\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=nYcBqtOwLcg</a><p>We&#x27;re based in the historical center of Amsterdam. We’re an enthusiastic and multi-faceted team of 8 with a passion for travel, design and code. You&#x27;ll be working closely with us building a super awesome travel app that people genuinely love.<p>Backend at Polarsteps:<p>At Polarsteps, we care deeply about ensuring a seamless, top quality user experience for all our travelers. We provide a fundamentally new type of product that is continuously iterated and improved. As a backend engineer at Polarsteps, you can expect to work with a small team across these challenges. This includes everything from scaling our rapidly growing application, to writing complex business logic that enables new product features.<p>Our ideal candidate:<p>You’re a seasoned, professional and pragmatic developer with a feel for product and 5+ years experience. You love to travel and enjoy solving complex challenges. If in addition to this, you have experience with large-scale (python) backend platforms, then you’re the rainbow unicorn we’re looking for.<p>Benefits, perks, the cool stuff:<p>- Stock options!<p>- Competitive salary<p>- Work&#x2F;life balance<p>- Be part of a fun, international team<p>- Awesome office in the center of Amsterdam, one of the most cosmopolitan and beautiful cities in the world<p>- 30 vacation days (25 ‘regular’ days + 5 Teleporter™ days, see below)<p>- Relocation assistance (if needed)<p>- We believe that regardless of stock options and salary, what will really make you richer are your travel experiences. So once per year you’ll use our Teleporter™: with the push of a button, it will go through all of the locations logged by our users and select a random one &gt; 1.000km away from Amsterdam. This is where your next adventure will take place! The flight is on us. Try it out here: <a href=\"https:&#x2F;&#x2F;www.polarsteps.com&#x2F;teleporter\" rel=\"nofollow\">https:&#x2F;&#x2F;www.polarsteps.com&#x2F;teleporter</a><p>P.S. As for our tech stack, we’re constantly aiming for the best possible setup based on our needs as we scale (we take over&amp;under engineering mishaps very seriously!) - we’re hosted in Heroku, use Amazon S3 for media storage, python (Flask) in the backend&#x2F;API, CloudFront + Lambda@Edge for caching, AngularJS in the frontend, and native apps in iOS and Android. We have single-command build&amp;deploy tasks for production and staging, and we do automated testing with protractor on the web, XCTest on iOS and UI Automator on Android.<p>Interested? -&gt; <a href=\"https:&#x2F;&#x2F;careers.polarsteps.com&#x2F;senior-backend-engineer-for-travel-startup\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.polarsteps.com&#x2F;senior-backend-engineer-for-t...</a>","time":1539002873,"type":"comment"}