{"by":"KurtisL","id":18178455,"parent":18113144,"text":"SigOpt | San Francisco, CA.\nMachine Learning Evangelist: Full time, Onsite<p>Be the public face of machine learning optimization.<p>Built by data scientists for data scientists, SigOpt’s Optimization Platform is fundamentally changing the way models are tuned. For machine learning models in particular, this represents an opportunity to make optimization better, cheaper, and faster.<p>But machine learning is noisy, so we need a Machine Learning Evangelist to be our signal. As the public face of optimization, you will be the advocate for data scientists who deserve a better way to tune and an expert ambassador to constituencies that stretch across industry and academia. With an optimization first and SigOpt second attitude, your efforts will spread the tuning gospel and build a community of users that push the envelope on its potential.<p>Responsibilities: -Nurture a machine learning community by producing and presenting technical content, whether in the form of blog posts, whitepapers, trainings, videos, or otherwise -Enable leading machine learning partners to tell the optimization story, and collaborate with them at live events, conferences, and in online forums -Earn speaking roles at conferences, meetups, and other live events to build momentum for optimization and its technical potential -Engage machine learning and artificial intelligence oriented communities early and often to build relationships, familiarity, and support for optimization as a critical part of AI&#x2F;ML<p>You are: -A quick study, who builds on 2-5 years of technical machine learning experience to translate complex subjects into concise explanations -A student of AI&#x2F;ML who has a technical degree and a proficiency in computer science, machine learning, and the technology stack that enables it -As comfortable speaking in front of a room of a hundred as penning a blog that nails a critical point. -Driven to start and build something -Frequently caught reading and engaging too much in AI&#x2F;ML banter","time":1539109124,"type":"comment"}