{"by":"ouriel_1","id":18180363,"parent":18113144,"text":"WinIt | Software Engineer, Backend | Flatiron, NYC | ONSITE | Full-time | Visa Available<p>Our vision: WinIt is an app enabled driver advocate assisting users with managing and contesting parking &amp; traffic tickets. Our ultimate goal is to create a one stop solution to solve challenges drivers have to deal with throughout the lifestyle of car ownership -- such as: helping drivers get the best price on auto insurance, leasing &amp; financing etc.<p>Your Role: We’re looking for a full-stack engineer driven to solve challenging problems in innovative and elegant ways. You will write modular, high-quality code while actively contributing to peer code reviews. You’re comfortable working on a small engineering team, and with the responsibility that comes with this.<p>You will be instrumental in the development of the next generation of the company’s back-end interface, client applications, and improvements to the existing system as a whole.<p>You are an intelligent, passionate, and innovative developer that can formulate new ideas and execute them in an established codebase.<p>You are comfortable working with third party frameworks and integrating them.<p>Skills: The ideal candidate has overlap from at least two of the following, and is confident in their backend skills. 1. Front end: Angular 5+, or React 16 with a state management library such as NgRx, Redux, or Mobx. 2. Back end: Node.js, ORMs 3. Mobile: Android Java, iOS Swift&#x2F;Objective C. 4. Solid practice in: writing asynchronous javascript, using js test frameworks, using mongodb, building solutions across the stack<p>Experience: Ideally you have previous startup experience, and experience working on a live application: Web, Android, or iOS.<p>You can find out more &amp; apply through this link: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;winit-app&#x2F;jobs&#x2F;68416-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;winit-app&#x2F;jobs&#x2F;68416-software-engineer</a>","time":1539124094,"type":"comment"}