{"by":"rhsimplex","id":18219292,"parent":18113144,"text":"corrux | Frontend Developer | Munich, Germany | 50-60K + equity Full-time or Part-time ONSITE INTERNS<p>corrux is a data analytics company focused on the construction space. We are developing solutions to leverage the increasing amounts of data being collected on construction sites to increase efficiency and prioritize equipment maintenance.<p>The current construction industry UX for equipment maintenance is dated (see examples [1] and [2]) and fragmented. You&#x27;ll have the opportunity to drastically improve this experience for project managers and people on the ground.<p>We are searching for our first frontend developer. We have written a dashboard in Grafana for demo purposes, but we need to create a full-fledged platform to flexibly display sensor readings from construction assets alongside maintenance alerts generated by our machine-learning models.  Based on customer contact we are strongly opinionated on how the application should look and act (we hope you view this as a positive), but you&#x27;ll have considerable freedom in picking the stack.  Most of our backend infrastructure is hosted on Azure.<p>We&#x27;re looking for someone with a few years experience and a couple shipped products under their belt.  Hiring experience is also desirable, since you&#x27;ll be helping to build out the frontend team in the coming months.  Note for part-time applicants: We ask that you only apply for the part-time position if you&#x27;re open to transitioning to full-time within a year.<p>Please email me with questions (ryan at corrux.io) or apply directly here: <a href=\"https:&#x2F;&#x2F;corrux.bamboohr.co.uk&#x2F;jobs&#x2F;view.php?id=26\" rel=\"nofollow\">https:&#x2F;&#x2F;corrux.bamboohr.co.uk&#x2F;jobs&#x2F;view.php?id=26</a><p>[1] <a href=\"https:&#x2F;&#x2F;www.liebherr.com&#x2F;shared&#x2F;media&#x2F;corporate&#x2F;documents&#x2F;brochures&#x2F;services&#x2F;lidat&#x2F;lidat-earthmoving&#x2F;liebherr-lidat-comprehensive-en.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;www.liebherr.com&#x2F;shared&#x2F;media&#x2F;corporate&#x2F;documents&#x2F;br...</a><p>[2] <a href=\"http:&#x2F;&#x2F;www.certiq.info&#x2F;uploads&#x2F;certiq-on-boomer-with-rig-control-system.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;www.certiq.info&#x2F;uploads&#x2F;certiq-on-boomer-with-rig-con...</a>","time":1539608623,"type":"comment"}