{"by":"alosarv","id":13302118,"kids":[13302305],"parent":13301832,"text":"SOCi | QA Engineer | San Diego | <a href=\"https:&#x2F;&#x2F;www.meetsoci.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.meetsoci.com</a><p>Winner of the San Diego Innovator of the Year (<a href=\"http:&#x2F;&#x2F;on.mktw.net&#x2F;ZULfCc\" rel=\"nofollow\">http:&#x2F;&#x2F;on.mktw.net&#x2F;ZULfCc</a>) and named a San Diego Venture Group 2014 and 2015 COOL Company, SOCi brings Big Brand social media campaign and promotion capabilities to small businesses and their service providers. SOCi, Inc. is based out of downtown San Diego.<p>Our SaaS platform solves social media management at scale for multi-location brands and marketing agencies who need to manage thousands of social profiles from a single location. We’re looking for a QA Engineer to help us continuously deliver quality, bug free software in a fast-paced startup environment. You will need to have a natural itch to try to find new and innovative ways to break things and test for scenarios others can’t think of. The role is highly technical – you are expected to review code, verify database states, write test automation scripts, manually verify end-to-end functionality and document reproduction steps.<p>Responsibilities<p>* Functional testing and code review of all new pull requests<p>* Working closely with programmers to identify problems in the code &#x2F; functionality<p>* Working closely with client support staff to replicate client issues and write JIRA tickets<p>* Participate in full system testing before and after code pushes to production<p>* Write test automation scripts, test data generators and other useful test tools<p>* Have an uncompromising passion for quality and a sense of pride when a job is done right<p>Requirements<p>* Ability to read&#x2F;write JavaScript, PHP and MySQL<p>* Solid understand of web application stack from client-side to server-side<p>Send your application and resume to careers@meetsoci.com","time":1483374885,"type":"comment"}