{"by":"kjbekkelund","id":13303869,"parent":13301832,"text":"Elastic (<a href=\"http:&#x2F;&#x2F;elastic.co\" rel=\"nofollow\">http:&#x2F;&#x2F;elastic.co</a>) • ONSITE &amp; REMOTE (Anywhere) • Front-end Developer • Full-time<p>Elastic, the company behind Elasticsearch and Kibana, is hiring.<p>We&#x27;re looking for front-end developers to work on Cloud, our Elasticsearch-as-a-service product offering. Today, Cloud runs primarily in public cloud environments like AWS, allowing customers to provision and scale Elastic clusters in a turnkey fashion. We also plan to bring this same simplicity of deployment and automation to customers who want to run and manage multiple Elastic clusters on-premise (in their own data centers). You will be contributing significantly to both initiatives.<p>To get there we need more developers with strong JavaScript skills, but we definitely prefer developers who also have other strong front-end development skills. Maybe security, design, UX, CSS, functional programming, testing, or something else?<p>We need someone to help innovate, lead and contribute to the front-end and user experience of our Elasticsearch-as-a-Service offering. You will also be integral in shaping the products we build, not just implementing specs.<p>Most of the work we do today is with React and Redux.<p>Check out <a href=\"https:&#x2F;&#x2F;www.elastic.co&#x2F;about&#x2F;careers&#x2F;engineering&#x2F;jobs&#x2F;czg_kyT0Gr5QfieMg-44q7\" rel=\"nofollow\">https:&#x2F;&#x2F;www.elastic.co&#x2F;about&#x2F;careers&#x2F;engineering&#x2F;jobs&#x2F;czg_ky...</a> for more info.<p>We&#x27;re a very remote team with developers in Australia, Poland, Norway, Denmark, Argentina, Panama, the US and several other places (and a couple of us are currently travelling around the world while working).<p>If you&#x27;re interested, don&#x27;t hesitate in contacting me at kim@elastic.co<p>We&#x27;re also hiring for several other positions: <a href=\"https:&#x2F;&#x2F;www.elastic.co&#x2F;about&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.elastic.co&#x2F;about&#x2F;careers&#x2F;</a>","time":1483386806,"type":"comment"}