{"by":"ksolanki","id":13307016,"parent":13301832,"text":"Eyenuk, Inc. | Research&#x2F;software engineers| Los Angeles, CA, USA, ONSITE | Full-time | <a href=\"http:&#x2F;&#x2F;www.eyenuk.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.eyenuk.com</a><p>Did you know that retina (eye) is the only organ in human body where the cardiovascular system, the central nervous system, the microvasculature, all can be imaged without any incision (in vivo)? Abnormalities in retinal images can potentially provide useful information about clinical and sub-clinical cerebrovascular, cardiovascular, and metabolic health of a person.<p>At Eyenuk we are developing the next generation of retinal diagnostic solutions that leverage state of the art computer vision using deep learning with novel low-level morphological image analysis algorithms. Software&#x2F;algorithms we develop makes critical clinical recommendations, and the healthcare professionals rely on the code we write to make these life-altering decisions. We are hiring for:<p>1) Algorithms research engineer: The algorithms research engineer will conduct applied research in computer vision and deep neural networks, developing and implementing high-throughput image analysis algorithms, working closely with clinicians and expert doctors.<p>2) Software engineer (Full Stack): The full-stack engineer will architect, design, develop, maintain, and deploy software that implements high-throughput (think hundreds of thousands of images an hour) image-based diagnostics. Both web and mobile.<p>Our stack: python&#x2F;flask, javascript, Swift, and C++.<p>While we offer usual benefits (health, vision, etc.), a couple things to mention.<p>* Guys&#x2F;gals with young families will find our work environment very supportive (many of us have kids too)!<p>* We work very very hard (and smart) to get things done, however, in 2016 we hardly worked a weekend (and still met the deadlines).<p>Send email to jobs@eyenuk.com to apply (US-based candidates H1b or OPT ok).","time":1483422088,"type":"comment"}