{"by":"darrennix","id":13302119,"parent":13301832,"text":"Interviewed | San Francisco | Account Manager | REMOTE | <a href=\"https:&#x2F;&#x2F;www.interviewed.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.interviewed.com</a><p>Interviewed builds job assessments that let candidates demonstrate their real world skills so that hiring managers don&#x27;t have to rely on resumes, behavioral interviews, and personality tests -- which are inherently flawed. By completing job simulations, instead, the best candidates stand out regardless of their educational background or years of experience. Our customers love it.\nOver the last year, we&#x27;ve added fantastic customers like Uber, Fidelity Investments, Upwork, Thumbtack, Zillow. We need to expand our account management team to ensure all of their needs are met.<p>Here&#x27;s what you&#x27;ll do as an account manager:<p>- Own a set of key accounts and ensure that they are delighted with Interviewed and are achieving success in hiring by using us. That means proactively evaluating their hiring process for better strategies, responding to questions and requests, and frequent check-ins.<p>- Onboard new accounts by building out their hiring pipeline (jobs, assessments, automation, correspondence templates) and training new users.<p>- Ensure job candidates are having a smooth experience by troubleshooting issues and providing guidance to job seekers on behalf of our customers.<p>- Create assessments by researching and writing scripts for new assessments, proofreading and editing for other members of the team, and updating FAQs and macros.<p>We don&#x27;t really care about your background because, after all, we are trying to help companies move away from traditional hiring. Some of the best people we&#x27;ve worked with came from recruiting, sales, and the arts. They have the dedication, endurance, and above all, enthusiasm needed to succeed in a dynamic, multinational tech company. If you are a great communicator, work fast, and are willing to take risks, we’d love to talk!<p>Our hiring process uses our own product and it usually only takes about one week from first contact to final decision!<p>Round 1: We&#x27;ll send you an invitation to complete some questions online. These are designed to show us how well you communicate in writing (really important for a remote team).<p>Round 2: We&#x27;ll schedule a short phone call to get to know you and let you ask questions about the role. We&#x27;ll also invite you to a 1-hour work sample (a mini project) that is a simplified version of something you will do if hired.<p>Round 3: We&#x27;ll schedule a day that&#x27;s convenient for you to take on the role of account manager. You&#x27;ll work with the rest of the team on three projects that will produce concrete deliverables by the end of the day. The projects are challenging but fun. This is your chance to see what we do, up close, and get to know the rest of the team. We provide a stipend to thank you, too.<p>Our generous compensation package will include stock options, medical and dental insurance, a 401K plan, and paid vacations.<p>Please email me directly at daniel@interviewed.com or you can see all our openings at <a href=\"https:&#x2F;&#x2F;internal.interviewed.com\" rel=\"nofollow\">https:&#x2F;&#x2F;internal.interviewed.com</a>","time":1483374886,"type":"comment"}