{"by":"pdegnan","id":13302234,"kids":[13315722],"parent":13301832,"text":"littleBits | Software Developer | NYC onsite | <a href=\"http:&#x2F;&#x2F;littlebits.cc\" rel=\"nofollow\">http:&#x2F;&#x2F;littlebits.cc</a><p>littleBits is a company aiming to get the world inventing. We make an award-winning system of modular electronics. Our kits have been integrated heavily in STEAM education programs and we are dedicated members of the maker movement. We aim to teach kids of all ages about systems thinking, empathy, and curiousity.<p>Our roots have been in hardware, but we are starting to rely more and more on software to enhance the system, and this is a position with that software team. We recently launched an iOS and Android app to allow you to control our Bluetooth LTE bits wirelessly. We also make a small internet-connected bit and run our own internet-of-things cloud to back it. Right now we are working on a programming-based kit that runs on top of our Arduino bit.<p>As a small team of software developers, we choose sharp tools and aim to keep our stack small. We enjoy a services layer written in Scala. Our main client is a Rails application that powers our community invention platform. Most UI work is done in React. A lot of our embedded systems work is C. Our IoT cloud is Java and a bit of Go. The responsibilities of this software team are 60% web&#x2F;mobile work to support products, and 10% each to support our ecommerce site, brand site, sales&#x2F;marketing efforts, and enterprise system integration.<p>Our interview process consists of a one-hour phone screen (including a brief coding exercise,) followed by a more extensive coding project with a 5-day deadline, and an in-person meeting of a half to a full day with the whole team.<p>If any of this sounds interesting to you, don&#x27;t hesitate to get in touch at [paul.degnan@littlebits.cc]. There&#x27;s a tremendous amount to do; ideally you have experience. Most of all though, we hope you&#x27;re warm, understanding, funny, and committed to the cause.","time":1483375679,"type":"comment"}