{"by":"kkouddous","id":13303361,"kids":[13304629],"parent":13301832,"text":"Koko | Data Scientist | NYC, USA preferred (REMOTE for the \nright candidate)<p>Koko’s mission is to bring well-being to everyone.<p>At its heart, Koko is a peer to peer network that offers evidence-based, emotional support wherever people exist online. As is often the case with large networks, our data has unlocked exciting new opportunities. We are using this data to build machines that can interact with people at deep, emotional levels.<p>We are building empathetic machines<p>Koko was originally conceived at the MIT Media Lab and is now based in NY. It has raised funding from Union Square Ventures and Omidyar Network and is growing fast through partnerships with very large social communities.<p>The lead engineer for &quot;data&quot; at Koko will be obsessed with using data to build exceptional products using state of the art tools and algorithms. You’ll be building classifiers to detect nuanced emotional states such as whether someone is at risk of harming themselves or whether a response created by the community is empathetic. You’ll also develop new data products, such as an information retrieval system that re-purposes existing data to help distressed users in real-time.<p>Requirements:<p>* Agile, resourceful and pragmatic. Strains to find the most efficient and highest performing solution to any problem.<p>* Comfortable working across the entire tech stack to build, launch and maintain data products.<p>* Highly proficient in statistics and machine learning. Excited about the ever growing set of libraries, tools and services that enable state-of-the-art deep-learning algorithms e.g. Tensorflow, Theano, FastText. Excited to stay on top of the latest research being published.\nSkilled in written and oral communication (able to summarize data insights for team members, board members, research collaborators, and the greater public)<p>* At least 2 years of related work experienced<p>* Training in applied computational statistics<p>Apply here: <a href=\"http:&#x2F;&#x2F;itskoko.com&#x2F;jobs-data-science\" rel=\"nofollow\">http:&#x2F;&#x2F;itskoko.com&#x2F;jobs-data-science</a>","time":1483382949,"type":"comment"}