{"by":"joshwcomeau","id":13305369,"parent":13301832,"text":"Unsplash | Montreal, Quebec, Canada | Front-End Software Developer | Full-time, Onsite preferred<p>Unsplash is one of the world’s largest photography communities, dedicated to providing stunningly beautiful images released under Creative Commons Zero. Over 1 billion photos are viewed every month and our community is fueled by contributors who offer their photos freely for anyone to use, remixing and re-sharing in a way that has never been seen before. Unsplash photos have been used by millions of creators, from companies like Apple, to writers like Deepak Chopra.<p>We’re applying the principles of the open source movement to photography and what we’re doing isn’t just having a big impact on the photography industry, but the internet as a whole. We see it as an exciting chance to reinvent a major industry run by the old guard and covered in red tape. Unsplash started on Hacker News 3 years ago, and it’s been an amazing ride ever since. In 2016 we grew by over 250%, and we’re looking forward to beating that number in 2017.<p>Our stack is ES6 React&#x2F;Redux, rendered on a Node server, and powered by a Rails API. Our team is small; right now I’m one of two developers on the JS side, and we’re looking to add a third. The ideal candidate should be very experienced with Javascript. Experience with React&#x2F;Redux or contributing to open-source is a plus. Ideally, we’re looking to hire onsite in Montréal, Quebec, but we’re willing to be flexible for the perfect applicant. We can help with relocation costs.<p>You can read a bit about what our team is working on here: <a href=\"https:&#x2F;&#x2F;medium.com&#x2F;unsplash-unfiltered&#x2F;tagged&#x2F;backstage\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;unsplash-unfiltered&#x2F;tagged&#x2F;backstage</a><p>Interested? Email us at javascript@unsplash.com, with links to any open-source work if available. You can also learn more about our hiring practices at <a href=\"https:&#x2F;&#x2F;crew.co&#x2F;hiring&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;crew.co&#x2F;hiring&#x2F;</a>","time":1483399645,"type":"comment"}