{"by":"dochtman","id":13304192,"parent":13301832,"text":"ActiveVideo, web-based application platform for TV applications | Netherlands | Product owner, C++&#x2F;Java developers | full-time, onsite in Hilversum<p>At the Hilversum office of ActiveVideo (which has HQ in San Jose and another office in LA), we&#x27;re looking for a product owner for my team, as well as C++ or Java developers for our end-to-end development teams. We&#x27;re a deeply technical bunch, working on a platform to deliver TV UI&#x2F;UX through a web application development platform in a way that makes it easy to deliver apps to set-top boxes and smart TVs (as well as any other devices, really), with a very thin client layer. Our goal is to obviate &quot;fat&quot; set-top boxes, which are expensive and just get out of date quickly, and move their capabilities into the software cloud. Software Defined Television, if you&#x27;re into this buzzword thing. ;)<p>For my team, I&#x27;m especially looking for a strong product owner. You will work with our end-to-end development teams comprising Java and C++ developers to deliver business value to our global customer base and drive our product innovation. You&#x27;ll need a good understanding of our customer&#x27;s needs and must be able to explain their use cases to the engineering teams. You will also have to understand the nuances of our product&#x27;s feature set and can identify gaps between the current product and our customers&#x27; feature requests.<p>Some requirements:\n- Communicate with Product Management, customers and engineers at their own level\n- Connect our long-term product vision to implementation-ready use cases\n- Balance business value and engineering stewardship\n- Experience in agile development, preferably as a product owner\n- Excellent verbal and written English\n- You will thrive in a small company environment<p>Apart from the product owner role, we&#x27;re also currently looking for strong C++ or Java software engineers. Note, especially for Java folks: we&#x27;re not looking for web programming or CRUD apps, but for strong distributed systems thinking. We maintain our own web browser engine (WebKit fork) and we have very deep in-house video and codecs knowledge.<p>We have a highly informal organization and pretty flat structure. This enables our employees to be flexible and to research their ideas. And of course we offer a competitive package.<p>Our hiring process is generally a quick online coding test, then a phone&#x2F;Skype call, then two or three face-to-face interviews on-site. Can do VISA if necessary -- we&#x27;re a diverse team already, with a bunch of Dutchies, plenty of Eastern Europeans, some NZ&#x2F;Aussies and Indians.<p>If you&#x27;re interested, please email me: d.ochtman at activevideo dot com.","time":1483388929,"type":"comment"}