{"by":"jumby","id":13302805,"parent":13301832,"text":"Digital Recognition Network | Software Engineer | Ft Worth, REMOTE | REMOTE<p>Hello, reader of this job posting! Because you actually clicked into this, we’re going to assume you&#x27;re a solid PHP developer, experienced with both the old (PEAR, Smarty, pre-OOP, pre-MVC) and the new (Laravel&#x2F;Symfony, composer, PSR, etc).<p>Great! Now let’s talk about some of those as they relate to this position.<p>1.      Big Data – DRN is the world leader in license plate recognition and currently has more than 5 billion (with a B) rows of license plate and geospatial data.<p>2.      PHP – We love PHP. We know it has a bad reputation due to a long history of ugliness – and trust us when we say we have experienced it first-hand. However, it has matured greatly over the past few years and it has allowed us to rapidly prototype, develop, and deploy some amazing applications. We love Laravel and composer, and we have PHP 7 in production.<p>3.      SQL – Yeah, it’s weird to have PHP connect to SQL Server. And as a PHP developer, you may not have the strongest grasp on SQL Server and all of its idiosyncrasies. But we’re available to help walk you through it.<p>4.      Linux – Even though we run SQL server, our web servers are fully Ubuntu.<p>5.      Remote – Let’s dispel with the myth that remote developers can kick their feet back and play Xbox. If you’ve spent any time working remotely, you know the challenges and determination it takes to make it work. We work hard from 8 to 5 and want a developer that will do the same without needless distractions.<p>6.      Git – We do everything in git and have some great deployment workflows built around it.<p>7.      Security – Stop here if you have no idea what the OWASP Top 10 is. If you aren’t familiar with how to secure your code against SQL injection, XSS, and CSRF, then we can’t bring you aboard.<p>What is DRN? Here’s a little spiel about us from our marketing department:<p>&quot;DRN is the dominant provider of license plate recognition and vehicle location data to the automotive finance industry.  DRN’s data is responsible for the recovery of more than 550,000 vehicles valued at $4 billion. With its position firmly established in the automotive finance market, DRN is now expanding into other markets including insurance, enterprise&#x2F;government, and digital marketing industries.&quot;<p>Learn more about us at drndata.com.<p>If you’re interested, send us a link to your Github or Bitbucket profile along with your resume or equivalent. We can’t wait to talk to you!<p>Must be eligible to work in the U.S<p>php-careers@drndata.com","time":1483379268,"type":"comment"}