{"by":"jamalex","id":13303151,"parent":13301832,"text":"Learning Equality - <a href=\"https:&#x2F;&#x2F;learningequality.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;</a> - San Diego, CA -- Onsite | Full-time<p># Who we are<p>We&#x27;re a nonprofit startup that builds open-source educational software for those with limited or no access to the Internet. We believe in the transformative power of learning, and are passionate about social justice and breaking down barriers preventing people from reaching their full potential. Our first platform, KA Lite (<a href=\"https:&#x2F;&#x2F;learningequality.org&#x2F;ka-lite&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;ka-lite&#x2F;</a>), has been used in over 175 countries.<p>We&#x27;re now developing Kolibri (<a href=\"https:&#x2F;&#x2F;learningequality.org&#x2F;kolibri&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;kolibri&#x2F;</a>), which includes tools for authoring videos and exercises, an app ecosystem for HTML5 bundles, peer-to-peer device syncing, web-based visualizations for student data, and systems for motivating, engaging, and guiding learners.<p># Who you are<p>You care deeply about making the world a better place, believe in the power of learning, strive to promote equality, and resonate with our statement of core values.<p>You love to build things, and like to think carefully about how best to serve the needs of a diverse set of users.<p># Positions<p>Frontend Web Developer: You have solid experience with web development using HTML5, JavaScript, modern JS frameworks (we use Vue.js), and CSS with pre-processors. You love building beautiful interfaces and collaborating with the UX team.<p>Python Developer &#x2F; DevOps: You have skills and experience working with Python, in a variety of contexts. We use Django for the backend of Kolibri, and also leverage Python for automation of business processes, API&#x2F;web scraping for pulling in new content, media processing&#x2F;computer vision, and data analysis&#x2F;machine learning.<p># Read more and apply<p><a href=\"https:&#x2F;&#x2F;learningequality.org&#x2F;about&#x2F;jobs&#x2F;?gh_src=4t6yqj1\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;about&#x2F;jobs&#x2F;?gh_src=4t6yqj1</a>","time":1483381459,"type":"comment"}