{"by":"spitfire","id":13305785,"kids":[13306133,13307535,13307409],"parent":13301832,"text":"I&#x27;ll post to this thread because this is very relevant for the hiring companies.<p>Hunter and Schmidt did a meta-study of 85 years of research on hiring criteria. [1] There are three attributes you need to select for to identify performing employees in intellectual fields.<p><pre><code>    - General mental ability (Are they generally smart)\n    Use WAIS or if there are artifacts of GMA(Complex work they&#x27;ve done themselves) available use them as proxies. \n    Using IQ is effectively illegal[2] in the US, so you&#x27;ll have to find a test that acts as a good proxy.\n\n\n    - Work sample test. NOT HAZING! As close as possible to the actual work they&#x27;d be doing. Try to make it apples-to-apples comparison across candidates. Also, try and make accomidations for candidates not knowing your company shibboleth.\n\n\n    - Integrity. The first two won&#x27;t matter if you hire dishonest people or politicians.\n     There are existing tests available for this, you can purchase for &lt; $50 per use.\n\n</code></pre>\nThis alone will get you &gt; 65% hit rate [1], and can be done inside of three hours. There&#x27;s no need for day long (or multi-day) gladiator style gauntlets. Apply this process to EVERYONE, including that elite cool kid from the &quot;right&quot; school&#x2F;company. You don&#x27;t want to exclude part of your sample population!<p>[1] <a href=\"http:&#x2F;&#x2F;mavweb.mnsu.edu&#x2F;howard&#x2F;Schmidt%20and%20Hunter%201998%20Validity%20and%20Utility%20Psychological%20Bulletin.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;mavweb.mnsu.edu&#x2F;howard&#x2F;Schmidt%20and%20Hunter%201998%...</a><p>[2] Technically IQ tests are not &quot;illegal&quot;, but the bar courts have decided companies have to climb is so high it effectively means they are. There is existing case law directly covering IQ tests in hiring. You should speak with your lawyer before you decide to try IQ tests.","time":1483404872,"type":"comment"}