{"by":"BrainScraps","id":13303413,"parent":13301832,"text":"True Link Financial | San Francisco | Software Engineer | Onsite<p>We exist to provide quality financial services for all: from protecting granddad’s money from scammers to providing supplemental financial tools that support disabled Veterans.<p>About us:<p>- 90% of our work is in React and Rails, 5% is in Java, and about 5% is DevOps—AWS<p>- Our team works to meet high standards of usability, security, and availability - because our customers depend on our products for their immediate (today&#x27;s groceries) and long-term (retirement investments) financial needs. So we move fast, but we can&#x27;t be cavalier about breaking things. ‍<p>- We also get to experiment and build cool things: We&#x27;ve used Twilio to craft a useful and constantly-improving IVR for customer service, and we help make our customers and operations folks happy by processing inquiries via SMS.  <p>We&#x27;d love to chat if:  \n- You&#x27;ve got a minimum of two years of software engineering experience, preferably with Ruby on Rails .<p>- You’re a nice person who has worked on hairy, wacky full-stack code in production.<p>- You enjoy exploring implementation options and collaborating with product folks.<p>- You can improve the codebase without being rude, judgmental or arrogant about it.<p>- You would describe yourself less as more of a &#x27;session musician&#x27; (i.e. Carol Kaye) than a &#x27;rockstar&#x27;.<p>- You&#x27;re looking for a full-time, on-site role in San Francisco.<p>Our engineering team is striving for true inclusion, since we know what it&#x27;s like to be underrepresented in tech. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. <p>You can apply through Angel List <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;true-link&#x2F;jobs&#x2F;31301-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;true-link&#x2F;jobs&#x2F;31301-software-engineer</a> or by emailing jobs@truelinkfinancial.com.\nWe promise to reply within 2 business days!\nKeywords if you Cmd+F’d the page: rails, RoR, ruby, sloth_gifs, ReactJS, Flux, Ansible, fintech, full-stack, twilio","time":1483383323,"type":"comment"}