{"by":"blocher","id":13309173,"parent":13301832,"text":"Engage | Web Developer (Full-time) | Alexandria, VA (metro Washington DC) | ONSITE  | <a href=\"http:&#x2F;&#x2F;engagedc.theresumator.com&#x2F;apply&#x2F;2kipDB&#x2F;Web-Developer\" rel=\"nofollow\">http:&#x2F;&#x2F;engagedc.theresumator.com&#x2F;apply&#x2F;2kipDB&#x2F;Web-Developer</a><p>Engage is seeking a Web Developer to join our award winning creative team. The Web Developer will collaborate with Engage’s client strategists, designers, and developers to plan and build digital tools, campaigns, web and mobile applications, and websites for our clients. If you’re interested in teaming up with government agencies and House of Representatives committees, Fortune 500 companies, leading advocacy organizations, and the nation’s top trade associations to deliver winning solutions in a fun, fast-paced environment—we want to talk.<p>This is a full-time position and you must be able to work on-site in Alexandria, VA (metro Washington, DC). You&#x27;ll probably need at least two years of experience in a web development role to meet the qualifications below, but we&#x27;re not opposed to hiring a prodigy.<p>Ideal Candidates would meet many of the following qualifications:\n-Strong PHP&#x2F;MySQL background \n-Familiarity with Wordpress theming and plugin development strongly prefered\n-Familiarity with PHP frameworks like Laravel or Symphony preferred\n- Understanding of relational databases such as MySQL\n- Be comfortable with server administration (though by no means at expert level)\n- Well versed in CSS, HTML, AJAX, and JavaScript\n- Familiarity with JavaScript frameworks like Vue.js, Angular or React, a plus\n- A love of creative problem solving\n- Comfortable working on tight deadlines and in a team environment\n- In general, a nice person to be around who enjoys tackling challenges and learning new skills\n- Comfortable with version control—Git preferred\n- Ability to pass House of Representatives background check<p>About Engage:\nEngage is a full-service digital agency based in Alexandria, VA.  Our mission is to impact the world around us through bold strategy and innovative technology.  We offer very competitive compensation packages because we want to work with the best.  Our team is focused and hard-working, but we also want you to have fun and get home for dinner. Work&#x2F;life balance is important to us, and we believe happy employees make happy clients.","time":1483452263,"type":"comment"}