{"by":"enoren","id":13305338,"kids":[13334240],"parent":13301832,"text":"FanThreeSixty | Software Developer, Software Architect | Austin, TX or Kansas City, MO | <a href=\"http:&#x2F;&#x2F;www.fanthreesixty.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fanthreesixty.com&#x2F;</a><p>At FanThreeSixty we strive to build software which allows sports teams and venues to better engage with fans to keep them connected to their teams by providing more personalized and fluid experiences whether at game time or in the off-season.<p>Headquartered in Kansas City, MO, we are hiring in both KC as well in Austin, TX for multiple development positions to help expand our data science and data intelligence capabilities for real time intelligence, recommendations and predictions. Interest in machine learning, analytics, data, and system design is a must as you will be heavily involved in each area of the system. You will also work directly with data scientists on the team to scale models for production and provide an efficient available platform for analysis and insight.<p>The basics:<p>* 3-5 years of Java or Python experience required. We leverage both Python and Java, but Python is the primary language of the data intelligence team, however as long as you have a good Java background and are not afraid to learn than Python experience is not required.<p>* Prior experience in one or more of Spark, Kafka, Cassandra, Hadoop, machine learning application preferred, but not required<p>* Ability to learn quickly and work independently desired as there is a remote component to this position as we are a distributed team. No fully remote positions available though. All applicants must be able to work in either the KC or Austin office.<p>* Our interview process is fairly direct and painless with an hour phone interview and then a half day on-site before making a final decision.<p>* In addition to medical, dental and vision insurance, we also offer a competitive PTO package, matching 401k and reimbursement of attending 2 sporting events each year, for market research.<p>You can see more specifics about the positions on our site <a href=\"http:&#x2F;&#x2F;www.fanthreesixty.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fanthreesixty.com&#x2F;careers&#x2F;</a> or contact me directly with any questions or to send your resume.<p>I will also be at the Data Day Texas conference in Austin on Jan 14th and would love to hook up with anyone there to talk further about the opportunity! Just drop me a line ahead of time.","time":1483399317,"type":"comment"}