{"by":"arshneet","id":13306076,"parent":13301832,"text":"Amazon Web Services | Senior Software Engineer, Senior Software Engineer in Machine Learning | Vancouver, Canada; Seattle, WA | Full-time | ONSITE, VISA |<p>RDS is looking for a Senior Software Engineer to join our team working on AWS scale big-data analytics problems. RDS Performance Insights team is working on a new and as yet unreleased service which will reshape the way that customers use databases and redefine industry expectations of what a modern, enterprise grade cloud-native database provides. Leveraging a number of AWS services including Kinesis and EMR&#x2F;Spark, our mandate is to provide actionable insights into underlying database performance and push the boundaries of product and technology innovation in this area. As the only big-data, analytics and ML focused team in RDS, our greenfield project is worked on by a tight knit devops team, owned, and operated entirely from the new Amazon office here in Vancouver, Canada.<p>Requirements (Senior Software Engineer):<p>- Comp Sci, Engineering, Stats&#x2F;Mathematics BA&#x2F;MA&#x2F;PhD<p>- 8-10+ years professional experience in software development<p>- Experienced technical leader. For more information and to apply: <a href=\"https:&#x2F;&#x2F;www.amazon.jobs&#x2F;en&#x2F;jobs&#x2F;392408\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.jobs&#x2F;en&#x2F;jobs&#x2F;392408</a><p>Requirements (Senior Software Engineer in ML):<p>- Post-graduate level Computer Science, Machine Learning, Mathematics, Operational Research, Statistics or a related quantitative field with up to 5 years of related work experience<p>- 10+ years professional experience in software development<p>- Ability to independently define and execute against a technical vision and roadmap<p>– Recruitment, coaching and mentoring of other engineers<p>– Strong will to adhere to best practices in OO development and a need to leave well–structured code in your tracks. \nFor more information and to apply: <a href=\"https:&#x2F;&#x2F;www.amazon.jobs&#x2F;en&#x2F;jobs&#x2F;425454\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.jobs&#x2F;en&#x2F;jobs&#x2F;425454</a><p>You can also directly contact me (I&#x27;m an engineer on the team) [MyHNUsername][AT]amazon.com, or my manager pimmel[AT]amazon.com","time":1483408738,"type":"comment"}