{"by":"jeremiahblatz","id":13319186,"parent":13301832,"text":"Blink Health | Security Hire #2: Infrastructure-Focused Security Engineer | New York NY | VISA <a href=\"https:&#x2F;&#x2F;www.blinkhealth.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.blinkhealth.com&#x2F;</a><p>Official job posting is here: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;blinkhealth&#x2F;14ec8b7a-b5fe-495e-803d-169981d0809e\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;blinkhealth&#x2F;14ec8b7a-b5fe-495e-803d-16...</a><p>Looking for someone primarily to help securing our AWS infrastructure and maybe local network and host security. What does this mean? Well, what do you want it to mean? We’re a 60ish person startup, so you not only have a lot of flexibility in the role, but also the role requires a fair amount of flexibility.<p>As the title says, this is the 2nd person in the security department. Currently I’m doing AppSec, AWS cloud sec, office IT security, physical security, and policy &amp; security governance. I’m looking for someone to add a bit more capacity, primarily in the AWS area. Our servers are generally linux, and our laptops are generally MacOS. You might be super-senior and able to do everything from day one, you might be junior and need some help ramping up. Either and everything in between is okay. I’m happy to tailor the role to match your experience, expertise, and interests. (Obviously, salary will be based on relevant experience &amp; skills. That said, I’m happy with my pay.)<p>Why you want to work for Blink Health:<p>* Interesting, varied work<p>* Building a real thing that actually helps people<p>* Get in early on a startup that actually has hundreds of thousands of paying customers<p>* Livable work environment (friendly, reasonable people, no permanent crunch time)<p>* Standard “well-funded startup” perks (unlimited vacation time (this is actually a thing), free lunches, good stock plan, etc.)<p>* Standard “real company” benefits (health&#x2F;vision&#x2F;dental, 401(k), etc.)<p>What you should have to apply:<p>* Some experience related to network&#x2F;host&#x2F;IT security<p>* Some coding&#x2F;automation skills<p>* Desire for varied work<p>* Desire to work in NYC SoHo<p>Questions? Ask away or email me at jeremiah @.","time":1483544863,"type":"comment"}