{"by":"vaschek","id":13315479,"parent":13301832,"text":"Airbnb | Marketing Technology Manager (Paid Growth) | San Francisco, CA | ONSITE<p>The Marketing Technology Manager at Airbnb is 50% marketer, 25% engineer and 25% data scientist. As a part of Paid Growth team, you’ll drive Airbnb growth globally and help us build the most innovative, efficient and technologically advanced marketing team in the world.<p>What you’ll do:<p>* Build and support our performance marketing stack: tracking, measurement, attribution, optimization and automation across both web and apps.<p>* Define and execute on our marketing technology roadmap (paid search, paid social, remarketing)<p>* Research and evaluate growth opportunities, onboard new vendors, test new marketing channels and tools<p>* Work cross-functionally between marketing, engineering, product, data science, finance, legal and security teams<p>* Work with external vendors to maintain and develop our technology integrations, facilitate beta-testing of new products and features<p>What we’re looking for:<p>* 5+ years of relevant work experience<p>* Excellent understanding of online marketing and strong interest in how it works “under the hood”<p>* Experience with paid search and&#x2F;or paid social channels and tools: AdWords, Facebook, etc. is required. “Backend” experience (scripts, APIs) is a strong plus<p>* Understanding of web and app technology: cookies, SDKs, tracking, tagging<p>* Experience with mobile apps (user acquisition, re-engagement) is a plus<p>* Strong analytical skills and ability to answer questions with SQL<p>* Can read other people’s code, writing own code (or strong interest to learn it) is a plus<p>* Good understanding of experimentation and A&#x2F;B testing<p>* Excellent communication, organizational and project management skills. Ability to work between teams, functions and geographies, with high autonomy and little guidance<p>Apply here: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;b0m3751\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;b0m3751</a>","time":1483501201,"type":"comment"}