{"by":"JoryFormlabs","id":13313389,"kids":[13313448],"parent":13301832,"text":"Formlabs | Boston, MA | Onsite | Full-time | Applications Engineer<p>Sound interesting? Learn more here: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;ipwv0r1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;ipwv0r1</a><p>THE COMPANY:\nWe are a passionate team of engineers, designers, and problem-solvers who make 3D printing tools for professionals. Started out of MIT in 2011, Formlabs is committed to bringing innovative and sophisticated fabrication tools into the creative hands of designers, engineers, and artists around the world.<p>JOB DESCRIPTION:\nBe one of the first to work with unreleased resins and help realize their potential by immersing yourself in advanced processes, ranging from industrial moldmaking and digital dentistry to contemporary craft. Use your technical know-how and curiosity to develop resources that help our customers be successful to engage new audiences and ultimately drive sales. If you’re more interested in the digital workflow than post-print processes, help us evaluate and recommend end to end solutions, incorporating scanning, 3D modelling or parametric design. The applications team pursues projects that are high risk &#x2F; high reward, so a good sense of priority and personal project management is required.<p>YOU WILL:<p>* Propose, research and develop highly visual demos that will translate well online.<p>* Collaborate and support customers already doing amazing things, providing input and friendly guidance to build mutually beneficial relationships that we can convert into content marketing.<p>* Stay up to date with the latest trends and popular topics in the industry, benchmarking competitors and advising development teams so we can offer industrial solutions at a fraction of the cost.<p>* 3D modeling, 3D printing, writing, documentation, part finishing, experimentation, strategy and communication.<p>Sound interesting? Learn more here: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;ipwv0r1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;ipwv0r1</a>","time":1483479754,"type":"comment"}