{"by":"Ibotta","id":13313075,"parent":13301832,"text":"Ibotta| Platform Engineer | Denver, Colorado \nFor more information about this position; <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;kafnr41\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;kafnr41</a><p>Ibotta is looking for a Platform Engineer to come build something great with us. As part of the engineering team, you will work on the platform that powers our app that is used by millions of consumers. We&#x27;re looking for a self-motivated engineer who has a real passion for building and scaling infrastructure using technologies such as Ruby on Rails, Redis, machine learning, and OCR. Every engineer has input into our product process and will have a real impact as part of a small, nimble team.<p>Ibotta| Big Data Engineer | Denver, Colorado \nFor more information about this position; <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;a0omqe1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;a0omqe1</a><p>Ibotta is looking for a Big Data Engineer to come build something great with us. As part of the engineering team, you will work with both Engineering and Analytics to build and own stable, scalable, and repeatable data-driven features. We&#x27;re looking for a self-motivated engineer who has a passion for working with technologies including AWS Data Pipeline, Redshift, DynamoDB, and EMR (Hadoop, Spark, MapR), as well as non-AWS technologies. Every engineer has input into our product process and will have a real impact as part of a small, nimble team.<p>Ibotta| DevOps Engineer | Denver, Colorado \nFor more information about this position; <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;vmokl81\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;vmokl81</a><p>Ibotta is looking for a DevOps Engineer to come build something great with us. As part of the engineering team, you will work on the platform that powers our app that is used by millions of consumers. We&#x27;re looking for a self-motivated engineer who has a passion for building and scaling infrastructure leveraging technologies using AWS, Ruby on Rails, Redis, machine learning and OCR. Every engineer has input into our product process and will have a real impact as part of a small, nimble team.<p>Ibotta| Android Engineer | Denver, Colorado\nFor more information about this position; <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;n8g3mx1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;n8g3mx1</a><p>Ibotta is one of the top mobile shopping applications on the App Store and Google Play. Our apps are used by millions of customers every month and we&#x27;re looking for an Android Engineer to come build something great with us. As part of the mobile engineering team, you will work with our Android team to build new features and fix bugs while continuing to build out our automated testing framework.  We&#x27;re looking for a self-motivated engineer who has a passion for building high-quality consumer-facing applications. Every engineer has input into our product process and will have a real impact as part of a small, nimble team.<p>Ibotta| Android Engineer - Contract | Denver, Colorado\nFor more information about this position;  <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;r64fyj1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;r64fyj1</a><p>Ibotta is one of the top mobile shopping applications on the App Store and Google Play. Our apps are used by millions of customers every month and we&#x27;re looking for an Android Developer to come build something great with us. As part of the mobile engineering team, you will work with our Android team to build new features and fix bugs while continuing to build out our automated testing framework.  We&#x27;re looking for a self-motivated engineer who has a passion for building high-quality consumer-facing applications. Every engineer has input into our product process and will have a real impact as part of a small, nimble team. This is a 6-month contract position.","time":1483477399,"type":"comment"}