{"by":"anthonylukach","id":13313360,"parent":13301832,"text":"Osprey Informatics | Experienced Machine Learning &#x2F; Computer Vision Developer | Calgary, Alberta, Canada | REMOTE <a href=\"http:&#x2F;&#x2F;www.ospreyinformatics.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ospreyinformatics.com&#x2F;</a><p>Company: Osprey Informatics provides intelligent visual monitoring for industrial operations. The company’s cloud-based platform, Osprey Reach, provides instant access to live and recorded video and images from across a company&#x27;s operations. Our technology detects important operational events, analyzes related images and video along with data from other sensors and systems, and alerts clients of situations that are relevant to their interests.<p>About the Team: Osprey&#x27;s development team is small tight-knit group of developers, the majority of whom are located in the Calgary office. We tend to hire full-stack developers and subsequently aim for everyone to get some exposure to most of the components of our system. We work in 2-week sprints following the Agile process.<p>The Position: We are looking for an experienced Machine Learning &#x2F; Computer Vision Developer to lead the development of our data analysis tooling. You will build, evaluate, and deploy computer vision and machine learning algorithms including object classification, object tracking, object detection, background subtraction and event recognition. You will have the support and collaboration of the rest of the team, however we are looking for this role to lead and direct the future of our data analysis tooling. We&#x27;d prefer someone on-site however we are open to the right hire provided that at least half of their workday overlaps with 9am to 5pm Mountain Time Zone.<p>Qualifications:<p><pre><code>    - The ability to develop scalable and performant systems\n    - Strong communicator\n    - Strong software development skills in Python, C++, and other languages\n    - Ability to research current state-of-art in machine learning and implement techniques described in publications\n    - Experience with different computer vision&#x2F;machine learning libraries and packages including OpenCV, numpy, Tensorflow&#x2F;Caffe or similar, CUDA\n    - Experience with web development, the Django framework, SQL, Linux&#x2F;Unix, Git, Amazon Web Services (AWS) are all pluses\n</code></pre>\nApply by emailing us at careers+hn@ospreyinformatics.com","time":1483479515,"type":"comment"}