{"by":"gmermoud","id":13328177,"parent":13301832,"text":"Cisco | Paris, France | Full-time | Senior Software Engineer | Full Time | <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;258084180\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;258084180</a><p>Our team is made of highly talented engineers with passion for innovation who turn wildly disruptive ideas into products that impact industry at large. We have built one of Cisco&#x27;s next-generation advanced threat detection system by combining cutting-edge machine learning algorithms and architectures with best-in-class networking technologies (with dozens of patents). Now, we are tackling our next challenge and we are looking for agile, pragmatic and talented engineers with deep expertise and hands-on experience in cloud technologies and highly scalable infrastructure. If technology and innovation is your passion, Cisco is the place for you.<p>As a Senior Software Engineer, you are responsible for developing, scaling and maintaining our cloud software infrastructure, with a specific focus on data-intensive technologies. You work in close collaboration with a team of data scientists and networking experts, supporting them with best-in-class software development methodologies and design patterns. You thrive in a fast-paced, dynamic environment that requires a unique blend of innovation, risk taking and speed of execution.<p>Our technology stack includes Python, Scala, C++ as well as a wide range of internal tools built on top of Docker, Kubernetes, Cassandra, Kafka, Spark, Hadoop, InfluxDB and a variety of front-end visualization technologies (D3.js, WebGL, HTML5).<p>Desired qualifications\n* Master Degree in Computer Science\n* Excellent knowledge of Java or Scala and the Java Virtual Machine\n* Experience with micro-service architectures (e.g., Docker, k8s) and cloud solutions (e.g., AWS) is a plus\n* Experience with Big Data technologies (e.g., Spark, HDFS, Kafka, Cassandra) is a plus\n* Knowledge of UNIX environments (e.g., Ubuntu) and scripting skills (e.g., Python, Shell)\n* Experience with software development methodologies and tools (e.g., git, Gitlab)\n* Excellent English spoken and written skills (C1 level) is a must.<p>More information about careers at Cisco here: <a href=\"https:&#x2F;&#x2F;www.cisco.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cisco.com&#x2F;careers</a>","time":1483632208,"type":"comment"}