{"by":"MongoDB_Jason","id":13320819,"parent":13301832,"text":"MongoDB -- Palo Alto, CA (ONSITE - relocation package available) | Software Engineer (mid level) | Full-Time |<p>Compensation: Base + Pre-IPO stock Options<p>If interested please email Jason DOT Gorsky AT Mongodb DOT com or apply here: <a href=\"http:&#x2F;&#x2F;tinyurl.com&#x2F;hz74rak\" rel=\"nofollow\">http:&#x2F;&#x2F;tinyurl.com&#x2F;hz74rak</a><p>The Technical Services Tools team is a new initiative at MongoDB to centralize the ownership and core ongoing and new development of software used by both the internal Technical Services organization and external MongoDB customers. As a large part of MongoDB, Technical Services requires customized tools to deliver a world-class support experience for our customers. These tools include custom web-based dashboards and workflow tools, chat bots to enable task automation, content scrapers and continuous integration tools<p>Additionally, MongoDB customers have access to a number of tools that help diagnose problems with their MongoDB deployments. The Technical Services Tools engineer will work with stakeholders for each of the major tools projects to define timeline and architecture for new features and maintenance of existing production functionality. The engineer will help deliver these new tools and functionality to both internal and external customers, helping drive the success of the Technical Services organization.<p>Responsibilities:<p>- Own critical support tools, both in terms of production uptime and development contributions\n- Coordinate with stakeholders for new feature development and high priority fixes\n- Integrate customer-facing tools into the MongoDB Support Portal\n- Develop new customer experiences in the MongoDB Support Portal\n- Build continuous integration environment for tools development and scheduled deployments<p>Requirements:<p>- Strong development background (preferably Python and JavaScript)\n- Strong web development experience (HTML, CSS, jQuery, react)\n- Experience with continuous integration tools (Jenkins, Evergreen)\n- Strong RDBMS and&#x2F;or Document Database administration&#x2F;architecture knowledge<p>Nice to haves:<p>- Development experience on the Salesforce platform (Apex and Visualforce)","time":1483554907,"type":"comment"}