{"by":"antmachine","id":13329141,"parent":13301832,"text":"Ruby on Rails Developer | Bellingham, WA | Salary DOE<p>We’re looking for someone with a passion for programming and for writing beautiful code.  You will join a team of exceptional developers building custom tools and web applications for the real estate industry. We are committed to simple, functional, and powerful user interfaces, API’s, and information storage systems.<p>Our company is located in Bellingham, WA. Home to WWU, Bellingham is a beautiful waterfront city nestled between Puget Sound and the Cascade mountains. Life here means access to the mountains and the sea providing an abundance of outdoor activities including skiing, mountain biking, hiking, sailing, kayaking, fishing, and wildlife viewing. A progressive city with lots to do, Bellingham is an ideal location to live and work!<p>Requirements:\n2+ years of direct experience in RoR\nUnderstanding of front-end technologies, such as JavaScript, HTML5, and CSS3\nUnderstanding of the syntax of Ruby and its nuances\nA knack for writing clean, readable Ruby code\nGit experience<p>We offer:\nOpen, collaborative workspaces\nA fully stocked kitchen\nProfessional experience working on a team as well as experience using Git, Visual Studio Online, and other development tools<p>Submit your resume (and optionally cover letter) to us. thomas@benkinney.com (he&#x27;s our talent dude). We also encourage you to provide links to your GitHub or StackExchange profile, your LinkedIn page, sites or apps you&#x27;ve built, etc.<p>Brivity: <a href=\"https:&#x2F;&#x2F;www.brivity.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.brivity.com&#x2F;</a> \nActiveRain: <a href=\"http:&#x2F;&#x2F;activerain.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;activerain.com&#x2F;</a>\nKWKLY: <a href=\"http:&#x2F;&#x2F;kwkly.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;kwkly.com&#x2F;</a>\nBlossor: <a href=\"https:&#x2F;&#x2F;www.blossor.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.blossor.com</a>","time":1483637099,"type":"comment"}