{"by":"jcsalterego","id":13332018,"parent":13301832,"text":"Union Metrics | Operations Engineer | Austin, TX | Full-time<p>We’re looking for an Operations Engineer to support, maintain and scale our fleet of servers powering unionmetrics.com and our analytics data pipeline. Millions of social events continuously flow and propagate through our systems every day, and our Operations Engineer will be responsible for keeping the lights on and blinking at the right frequency.<p>DUTIES<p><pre><code>  * Maintain and scale existing services to maximize uptime and performance\n  * Triage and resolve system alerts; participate in on-call rotation\n  * Develop runbooks and other support materials as part of a continuous improvement process\n  * Work with a talented team at a great company with all these benefits and perks\n</code></pre>\nREQUIREMENTS<p><pre><code>  * Strong mastery of and absolute comfort in Linux, including knowing when to\n    trust a second-nature reflex of reaching for grep&#x2F;sed&#x2F;awk, and when to back away slowly\n  * Strong background in configuration management, preferably Chef\n  * Experience with monitoring and alerting systems such as Nagios, Munin&#x2F;Monit\n  * Experience with at least a handful of open source datastore technologies such as\n    Cassandra, MySQL, MongoDB, Redis, Solr\n  * Comfortable with at least one scripting language, e.g. Ruby, Python, Golang\n  * Experience supporting a web stack, e.g. LAMP; Rails experience preferred\n  * At least two years operations engineering experience\n  * Familiarity with the construction and maintenance of highly available systems\n    preferred, e.g. HTTP load balancing or distributed databases such as Cassandra,\n  * Degree in MIS, Computer Science, or other technical field preferred\n</code></pre>\nEXTRA CREDIT<p><pre><code>  * Competency with Ruby, SQL\n  * Experience with: Jenkins, Spark, Hadoop, Docker, Vagrant, Kubernetes\n  * Know some good GIFs\n  * Experience in small start-up environments\n</code></pre>\nIf you think this job is right for you email jobs@unionmetrics.com with the subject line Operations Engineer. Include your resume and a link to your GitHub account. If you don’t have a GitHub account, send us some code you’re proud of.","time":1483655138,"type":"comment"}