{"by":"Endocoders","id":13373515,"parent":13301832,"text":"Endocode AG | Berlin, Germany | Cloud Engineer | Full-time | ONSITE | <a href=\"https:&#x2F;&#x2F;endocode.com&#x2F;jobs&#x2F;cloud-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;endocode.com&#x2F;jobs&#x2F;cloud-engineer&#x2F;</a><p>We are looking for people who are enthusiastic about building applications for distributed environments based on Kubernetes or other cloud technologies.<p>We are consulting and developing for customers who want to port or build their software to run as microservices in a PaaS Kubernetes cloud. You will work with market leading companies, creating and scaling their services in public and on premises private clouds.\nIf you already have experiences with hosted or private clouds: great! If not, but are interested to move into this direction and have already worked with open source technologies, in the area of software development, virtualization, system engineering, scripting languages and you understand web services you should apply for this position.<p>Responsibilities:<p>- Engage with clients to create and improve cloud solutions and microservices, for new and existing software, identify issues, and recommend solutions.<p>- Work with open source communities and external partners to get code right and upstream changes.<p>- Follow developments of Kubernetes, Docker, Rkt, Systemd, CoreOS, the Linux Kernel and other Free and Open Source Projects<p>Required skills and experience:<p>- At least one programming language like C++, Go, Java, Python and Ruby<p>- Familiar with at least one SQL or NoSQL database<p>- Communicate effectively in English<p>Great to have skills and experience:<p>- The ability to describe a solution in architecture patterns is a big plus<p>- Acceptable German is a plus<p>- Knowledge of various testing frameworks and methodologies<p>Who we are:<p>Endocode AG is an employee-owned, shareholder company based in Berlin, Germany providing professional IT services with a focus on open source technologies. The Endocode team is currently numbered at 14 from 6 different countries. Endocode is a strong supporter of a healthy work-life balance, believing your work will be better if your life is better.<p>Endocode also does not discriminate on the basis of race, color, age, ethnicity, religion, national origin, pregnancy, sexual orientation, gender identity, sex, marital status. In short, we’re an equal opportunity employer.<p>Contact us at jobs@endocode.com and tell us about yourself.","time":1484138453,"type":"comment"}