{"by":"gdilla","id":11205865,"parent":11202954,"text":"Copper Studios | www.copperstud.io | SF (Mission), CA | Lead Backend Engineer<p>Job Description<p>We are a small, strong team, building a new way to discover and experience media. Our backend is built using Python and node.js, running on AWS, using a neo4j graph database for storage. We are looking for a talented backend engineer to architect and implement a highly scalable backend infrastructure to make an incredible user experience possible.<p>We… \n- Are planning to change the game. Completely. We dream big. \n- Consist of team members who have built some of the very biggest products in mobile, social, and digital media \n- Drive each other to reach a very high bar of engineering and design quality \n- Want to help people rise to their potential by trusting each other and giving everyone on the team a lot of autonomy and responsibility. \n- Believe that a balance of work and personal life is essential to making breakthroughs in technology and creativity<p>You… \n- Are an exceptional backend architect. You enjoy breaking down a complex problem into smaller parts, and don&#x27;t stop refining until you have reached the most simple and elegant solution \n- Know the latest backend services and systems, and when to use them. Our backend is built on AWS, which provides a tremendous variety of puzzle pieces that can be fit together in different ways \n- Are comfortable working in all parts of the stack. You understand the complexities of deploying, scaling, and monitoring cloud components \n- Have designed database schemas. We are using a graph database, which solves interesting problems and poses interesting challenges \n- Can debug with the best of them. \n- Have strong opinions, weakly held. You don&#x27;t hesitate to speak up when you have an idea that could make things better \n- Have experience building web services, integrating authentication and external APIs \n- Love social media and culture. We believe the best products are the ones we build for ourselves \n- Have a bachelors degree or higher in computer science&#x2F;engineering, etc.<p><a href=\"https:&#x2F;&#x2F;angel.co&#x2F;copper-studios&#x2F;jobs&#x2F;109544-lead-backend-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;copper-studios&#x2F;jobs&#x2F;109544-lead-backend-eng...</a>","time":1456864868,"type":"comment"}