{"by":"secondspectrum","id":11203065,"parent":11202954,"text":"Second Spectrum - offices located in Los Angeles (HQ), Boston, and Shanghai<p>Player tracking data is transforming the sports experience, and Second Spectrum is at the forefront of this revolution. Leveraging unique capabilities in spatiotemporal pattern recognition and machine learning, we transform this data into highly specific and actionable analytics for professional teams, while enhancing storylines for broadcasters and creating new interactive experiences for all sports fans. Currently, we serve nearly half of NBA teams, and have media partnerships with ESPN and FOX, among others. We are also developing products across several other professional sports, including football, soccer, and baseball. Our board and investors include top names in Silicon Valley and the sports&#x2F;media world, including Steve Bornstein, former CEO of ESPN and NFL Network, David Hornik, Partner at August Capital, and Mark Stevens, former Partner at Sequoia Capital and board member of NVIDIA.<p>We are looking to fill a variety of engineering roles, in areas such as:<p>- Full stack<p>- UI &#x2F; UX<p>- Dev-ops<p>- Machine learning<p>- Computer vision<p>The responsibilities range from sophisticated UI design that supports detailed but intuitive analytics - to front-end interfaces that will appear on national sports broadcasts - to scalable backend infrastructure that supports robust video streaming - to ML and CV engineering which enables the semantic layer to understand the game. Our software stack is based around Node, Go and Python, and we also use C++ for our video systems.<p>In addition to these roles, we are also looking for experienced mobile developers to help build out mobile applications on iOS and Android for a beta consumer product.<p>If you&#x27;re interested in joining us, our jobs email is work@secondspectrum.com. I&#x27;m also available for any questions you might have at karl@secondspectrum.com","time":1456845240,"type":"comment"}