{"by":"splitrocket","id":11207735,"parent":11202954,"text":"Blue Ridge Labs @ Robin Hood ( <a href=\"http:&#x2F;&#x2F;labs.robinhood.org&#x2F;fellowship&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;labs.robinhood.org&#x2F;fellowship&#x2F;</a> ) | Brooklyn, NY | Onsite | Full Stack Engineers, UI&#x2F;UX Designers, Product Managers | Fulltime Paid 5 Month Fellowship<p>Think the world doesn’t need another selfie app? We agree. Our intensive summer Fellowship is designed to help top talent attack big problems in new ways. By taking a customer-centric approach and pushing our teams to iterate quickly and cheaply, we aim to build products that can really make a difference.<p>The Fellowship is a paid, five-month program that invites talented innovators from the tech, design, and social change communities to spend the summer building new digital tools that address the needs of low-income Americans. Past fellows have come from Twitter, Linkedin, Facebook, Adobe, MOMA, Huffington Post, Successful Entrepreneurs etc. The products from previous fellowships have spun their ideas out as new ventures (both for-profit and non-profit), and gone on to raise funding from VCs, foundations, and corporations.<p>Our Portfolio: <a href=\"http:&#x2F;&#x2F;labs.robinhood.org&#x2F;portfolio&#x2F;#fellowship\" rel=\"nofollow\">http:&#x2F;&#x2F;labs.robinhood.org&#x2F;portfolio&#x2F;#fellowship</a><p>This year, the program is focused on addressing the &#x27;justice gap&#x27; ­ the fact that more than 70% of low-income families face the complex civil justice system without any professional assistance. This instantly stacks the system against them. In New York, as an example:\n- 90% of landlords in eviction proceedings have an attorney vs. only 10% of tenants\n- 100% of creditors are represented vs. only 4% of defendants\n- 60% of detained immigrants facing deportation lack counsel<p>Apply Here: <a href=\"http:&#x2F;&#x2F;labs.robinhood.org&#x2F;fellowship&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;labs.robinhood.org&#x2F;fellowship&#x2F;</a>","time":1456885477,"type":"comment"}