{"by":"prophetjohn","id":11204151,"parent":11202954,"text":"PolicyGenius | New York, NY (NYC) | Full-Time | Onsite<p>Software engineer (full-stack or front-end, mid-to-senior) We&#x27;re looking for multiple new team members to help us build and grow our Rails and React applications.<p>Our stack:<p>- A lightly service-oriented architecture with the backends powered by Rails and a mix of Rails, Rails and React or full React on the frontend. Whatever makes the most sense for the application in question<p>- We use Redux as our flux-ish implementation of choice and believe strongly in a styleguide-driven modular CSS architecture to help keep the UI maintainable.\nOur values:<p>- High-quality, robust code. We achieve this with a heavy focus on strong object-oriented design and great test coverage. We&#x27;re firm believers in the benefits of test-driven development<p>- Collaboration and continuous learning - we pair program sometimes, we review each others code all the time and we love to pragmatically explore new technologies. We&#x27;re able to keep our best practices evolving and help each other get up to speed quickly on new things.<p>- Full-stack skills. We&#x27;re not all experts on all parts of the stack, but anyone can jump in and help wherever and as the team grows, everyone will be encouraged to rotate projects regularly to stay sharp and challenged.<p>About you:<p>- You&#x27;re strong in either Rails or React (even better if both) and eager to work on both the front and back ends.<p>- You practice TDD and have strong opinions about why you do it.<p>About us:<p>PolicyGenius is changing the way America shops for insurance. We&#x27;re an online education and shopping platform for insurance akin to TurboTax for insurance. It&#x27;s a big, confusing industry and we&#x27;re making it easier for consumers to understand insurance and purchase it. Check out our CEO&#x27;s article in Entrepreneur about how we&#x27;re disrupting the industry: <a href=\"http:&#x2F;&#x2F;www.entrepreneur.com&#x2F;article&#x2F;250095\" rel=\"nofollow\">http:&#x2F;&#x2F;www.entrepreneur.com&#x2F;article&#x2F;250095</a><p>Questions&#x2F;applications: Email josh@policygenius.com<p>All roles: <a href=\"http:&#x2F;&#x2F;careers.policygenius.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.policygenius.com&#x2F;</a>","time":1456852191,"type":"comment"}