{"by":"chrisbrookins","id":11207697,"parent":11202954,"text":"Remote Android Engineer (Java &#x2F; JS) at Help Scout<p>Apply at <a href=\"https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;214240\" rel=\"nofollow\">https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;214240</a><p>After recently launching the Help Scout iOS app to 5 star reviews, we have big plans for our first Android app. We’re looking to hire an experienced Android engineer to help us craft a wonderful experience there. You’ll be joining one other full-time engineer on the project and working on a product used by over 5,000 companies around the world.<p>Our engineering team is currently about twenty people, with one focused on iOS and no one yet focused on Android. We’re starting at the ground floor with Android and have yet to make several platform-specific and technology decisions. You’ll be involved in every decision we make regarding implementation and testing.<p>You’ll be helping us select a framework for implementation. We currently are debating between Java or React Native and while you may have several years experience with Java on Android, you are curious enough about React Native to do some exploring and help us make an informed decision.\nA separate team of engineers owns all the API endpoints, so your work is focused on the app implementation and design details. You’ll also be getting everything you need from the design team with regard to Android-specific visual design and interactions.<p>Since our experience skews heavily toward web development, you bring a level of Android-specific expertise that will help us craft an outstanding experience for customers.\nWith years of experience working with Android, Java and Javascript, you are someone that loves picking up new skills and refining your craft.<p>You delight not only in the way an application works, but in how it looks, and have an excellent understanding of Android interaction design. Complex cross fades, card flips and other Android animation details are something you love working on because it can help you execute the perfect user experience.<p>You stay up-to-date on the Android platform and can provide insightful advice about leveraging native platform APIs or evaluating and leveraging wrappers.<p>You believe remote teams are the future of work, or are at least excited about the idea. You have experience working with remote teams or can adjust your work&#x2F;management style to be remote-friendly.\nAbout Us<p>Help Scout is a remote team with employees in eleven states and six countries (seven in the Boston office). We optimize the team for excellence over geography and overcome remote challenges through transparency, trust, and video conferencing.<p><a href=\"https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;214240\" rel=\"nofollow\">https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;214240</a>","time":1456884940,"type":"comment"}