{"by":"eli_oat","id":11207480,"parent":11202954,"text":"Mobile Software Dev. | Remote | Full time, US Only<p><a href=\"https:&#x2F;&#x2F;www.newstartmobile.com&#x2F;careers&#x2F;dev&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.newstartmobile.com&#x2F;careers&#x2F;dev&#x2F;</a><p>As a software developer with New Start Mobile you will design, develop, and maintain a variety of enterprise-level apps and services for some of the world&#x27;s largest sporting authorities.<p>Responsibilities<p>* Work with our development team to build native mobile apps for a wide variety of users, across many different sectors<p>* Steward an app from a spec document to a working product<p>* Maintain and troubleshoot our pre-existing mobile apps<p>* Communicate effectively and take direction from team members to ensure our high standard of work<p>* Work efficiently and transparently to meet deadlines<p>Qualifications<p>* B.S. or higher in Computer Science (or equivalent experience)<p>* Experience with iOS and&#x2F;or Android application development<p>* Experience with multi-threaded environments<p>* Experience with automated testing is a plus<p>* Excellent written and verbal communication skills<p>* Proficiency in one or more of the following languages (Objective C, Java, Swift)<p>* Solid understanding of data structures, and how to interact with APIs<p>* Ability to work collaboratively with product owners, project managers, and designers<p>* Ability to solve problems on your own<p>* Interest in working remotely<p>* Self-motivated worker, able to work with a team<p>* Experience with Apple’s design standards and&#x2F;or Google’s material design standards<p>* Experience with version control (Git)<p>* Experience working with databases and data infrastructure<p>* Familiarity with server-side Java is a plus<p>If interested, visit <a href=\"https:&#x2F;&#x2F;www.newstartmobile.com&#x2F;careers&#x2F;dev&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.newstartmobile.com&#x2F;careers&#x2F;dev&#x2F;</a>\n or email careers@newstartmobile.com","time":1456880994,"type":"comment"}