{"by":"clarkbarz","id":11204519,"parent":11202954,"text":"Alloy | New York, NY | Full-Time | On-site<p>Alloy is an API to collect and manage customer data from many different sources. We help companies in financial services or other regulated industries safely onboard more “good&quot; customers without introducing any more fraud into their systems. We connect many data sources used for identity verification into a rules engine, allowing a &quot;waterfall&quot; of information through a series of checks across different service providers. We&#x27;re currently hiring for two positions:<p>1. Front End Developer<p>- Own our business-facing application. This is where our customers can see all their data, can build workflows for our APIs, and manage identity data over time. This is the only piece of our product that you can &quot;see&quot;, so it&#x27;s important we make it something our customers will love.<p>- Write clean, performant code. We value the end result, but we value code quality as well. Our dashboards are currently written in Python&#x2F;Django and React, but we&#x27;re open to whatever gets the job done.<p>- Own the User Experience. Our ideal candidate can write good HTML&#x2F;CSS&#x2F;Javascript to build features, but also knows how to build great user experiences from a thoughtful and empathetic place. We&#x27;ll help you learn about our users and you&#x27;ll bring real world UX&#x2F;UI experience.<p>- Test your code! As a SaaS Company in a competitive market, its important for us to know our product is running correctly end-to-end.<p><a href=\"https:&#x2F;&#x2F;paper.dropbox.com&#x2F;doc&#x2F;Front-End-Developer-Alloy-NYC-zT95AmmHxCKNQ7y78AaxU\" rel=\"nofollow\">https:&#x2F;&#x2F;paper.dropbox.com&#x2F;doc&#x2F;Front-End-Developer-Alloy-NYC-...</a><p>2. Software Developer<p>- Create structure where there is none - you will design features for an API that dynamically pulls from multiple data sources and displays the results in a consistent and structured manner.<p>- Write clean, performant code. We value the end result, but we value code quality as well. Our API is written using Node.js, and we are always looking at new technologies and libraries to improve the performance of our stack.<p>- Do simple server administration tasks and application monitoring. Knowing how to develop software is important but so is knowing how to deploy that software it to a production server.<p>- Test your code! As a SaaS Company in a competitive market, its important for us to know our product is running correctly end-to-end.<p><a href=\"https:&#x2F;&#x2F;paper.dropbox.com&#x2F;doc&#x2F;Software-Engineer-Alloy-NYC-IKp3nHNlo6yU44FZhHuK0\" rel=\"nofollow\">https:&#x2F;&#x2F;paper.dropbox.com&#x2F;doc&#x2F;Software-Engineer-Alloy-NYC-IK...</a><p>Email jobs@alloy.co with your resume and&#x2F;or portfolio to apply to either position.","time":1456854692,"type":"comment"}