{"by":"gregdoesit","id":11209640,"parent":11202954,"text":"Skyscanner | London, Barcelona, Edinburgh, Budapest, Sofia | ONSITE, VISA | full-time<p>We&#x27;re one of the biggest travel metasearch enginees in the world by traffic... and we want to x10 that :)<p>Hiring distributed systems engineers, full stack engineers and iOS &amp; Android engieners. We are hiring to all our European offices - London and Barcelona being the 2 newest ones, with the most fresh buzz right now.<p>Specifically we&#x27;re looking for people interested in working on large scale personalization challenges: how do we turn data we have of 50M monthly users&#x27; search habits into new products, or adopt our web site and apps to &quot;just work&quot; for any type of person. For example a busy traveller with less price sensitivity will want to see a different set of default results then a backpacker who is looking for the cheapest flights hitting multiple cities.<p>We&#x27;ve recently opened a Barcelona and London office - I&#x27;m one of the first engineers in London, and there is incredible energy across the company. We are set out to be the #1 flight search engine in the world: from the UK through US, all the way to Asia.<p>We&#x27;re one of the very few unicorn companies HQ&#x27;d in Europe who are profitable - and have been so for the past 7 years. Recently we&#x27;ve had the director of Amazon S3, Bryan Dove join us as our VP engineering - in London you would be working closely with him (as I already am).<p>You can apply at <a href=\"http:&#x2F;&#x2F;www.skyscanner.net&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.skyscanner.net&#x2F;jobs&#x2F;</a> - or ping me at gergely (dot) orosz (at) skyscanner.net for a referral.<p>On a personal note I love the company&#x27;s culture of &quot;ask for forgiveness, not permission&quot;. Engineers make a LOT of decisions, so your ideas make it into production quite easily. This would be typical for a startup... but for companies this size it was a breath of fresh air to me. Any questions you might have, please email me and I&#x27;ll be happy to answer.","time":1456923887,"type":"comment"}