{"by":"ISNIT","id":11204666,"parent":11202954,"text":"UK, Marlow | Full-time | Onsite only\n<a href=\"http:&#x2F;&#x2F;squaredup.com\" rel=\"nofollow\">http:&#x2F;&#x2F;squaredup.com</a><p>Squared Up was founded with the vision of using cutting-edge data visualisation to solve the challenges of Enterprise IT complexity and, from humble beginnings, we are loved by some of the world’s leading companies and growing fast.<p>We’re a genuine start-up, which means that there are no old grey men in suits telling us what to do; we’re driven by ambitious software engineering goals, not by the demands of sales teams and investors, and are passionate about building an awesome company together.<p>We’re based in the picturesque town of Marlow, a beautiful spot on the River Thames between Maidenhead and Reading, where you’ll be joining a young, dynamic, energetic team. Don’t worry if you’re not already local to us, if you’re the right ﬁt for Squared Up, then we’ll help you relocate.<p>If this sounds of interested drop us a line at brilliantcareers[at]squaredup.com<p>You’ll head to community events to keep up to date with the latest tech trends, get face-to-face with customers at our regular customer workshops, or travel to the world&#x27;s largest technology conferences to help spread the word about the amazing product you&#x27;ve helped build - all at the company’s expense. And, of course, being treated to some amazing company social events like Secret Cinema.<p>Skills &amp; Requirements:<p>• You must have experience with JavaScript or ASP.NET MVC or both. If you only have experience with one, you’re willing to roll your sleeves up and get stuck into the other.<p>• You put the needs of the user first and have a passion for delivering clean, intuitive UI.<p>• You have a keen interest in data visualisation: you’ve dabbled with d3.js, devoured Edward Tufte’s book series or can wax lyrical about Bret Victor’s Magic Ink essay.<p>• If you’re a JavaScript guru, you’ve been hands-on with mustache templates and reactive libraries like Ractive.js. Or you’re an Angular.js veteran who’s looking for a fresh start.<p>• You probably have some experience with the Microsoft stack and related technologies: Azure, SQL, IIS, ASP.NET, HyperV, VMWare, Active Directory etc. Again, if you don’t already have the experience, you’re willing to give it a shot.<p>Email: brilliantcareers[at]squaredup.com<p>Apply online: <a href=\"https:&#x2F;&#x2F;squaredup.com&#x2F;about-us&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;squaredup.com&#x2F;about-us&#x2F;careers&#x2F;</a>","time":1456855712,"type":"comment"}