{"by":"johnrball","id":11203620,"parent":11202954,"text":"QA Manager - With Strong Hands on Linux Ability (Able to install and configure Linux) - On Site in NYC or Remote within the U.S<p>Nucleus is an early stage startup with unprecedented traction redefining family communication via an innovative smart home intercom device.<p>The Nucleus team is seeking a Senior QA Manager to establish a culture of quality early in the lifeblood of the company. Nucleus’ namesake product is a thin, affordable, connected device, giving families the easiest way to stay in touch, secure the home and connect to what matters most.<p>The Senior QA Manager will face the ambitious challenge of ensuring hardware and software work flawlessly in preparation for a massive launch this summer in over a thousand Lowe&#x27;s stores and on Amazon.com. This position will be the second QA hire at the company and will be tasked with working with engineering to establish innovative and efficient processes and procedures to scale with the enormous growth potential. The right candidate will be inspired and driven by the challenge of building innovative technology to help families communicate.<p>You are responsible for making sure our hardware and software runs is error- and bug-free. You will be charged with testing our software, and conveying the results of your tests in written form and via tickets in Jira and other bug tracking tools.<p>REQUIREMENTS<p>5+ years experience as a SW tester as well as experience in testing embedded SW.<p>Experience with B2C products such as mobile apps, web applications, medical devices, home automation, home entertainment.<p>Experience testing automation tools for mobile and web applications.<p>Excellent knowledge of local area networks, as well as hands on experience with configuring managed switches, internet gateways and routers.<p>Familiar with the Internet and web (HTTP, HTML, etc.).\nGood knowledge of Linux and ability to install and configure Linux services.<p>Knowledge in real time video and &#x2F; or VOIP utilizing UDP and TCP.Proficiency with at least one scripting language.\nExcellent written and oral communication skills and willingness to liaise with multiple entities within the organization.<p><a href=\"https:&#x2F;&#x2F;nucleus.workable.com&#x2F;jobs&#x2F;193568\" rel=\"nofollow\">https:&#x2F;&#x2F;nucleus.workable.com&#x2F;jobs&#x2F;193568</a>","time":1456848908,"type":"comment"}