{"by":"darkobodnaruk","id":11208682,"kids":[11266609],"parent":11202954,"text":"Mediately | Ljubljana, Slovenia | REMOTE | full-time | Ruby backend engineer<p>We are developers of a medical information mobile app. It&#x27;s targeted at doctors and other medical professionals, and our users love us. More than half of all doctors in Slovenia use the app daily and we are the market leader in all 4 countries we have apps in. And this year we&#x27;re growing to 3 more, so we need you!<p>We do not require a full-stack unicorn who knows everything from AWS to CSS, we&#x27;re looking for someone to help us maintain and build on our backend. Its job is to automatically combine information from websites and docs and build local databases. Your job will be to help us do this faster in new countries, automate as much as possible and further develop internal tools for getting insights out of these databases. It would be great if you have experience in text and data mining and if you find natural language processing interesting you will love the potential our databases have.<p>Our sources are in all European languages - knowing these is not needed but some ingenuity and resourcefulness is.<p>You will find the job difficult without being comfortable in Unix command-line tools and databases. Currently we use Postgres but we might soon be moving to something more text-oriented like Solr or ElasticSearch.<p>We&#x27;ll hire you full-time with an indefinite contract, unless of course you have other preferences. We do not obsess over formal education, as long as you have the skills we need.<p>We have a very nice office in the heart of Ljubljana but if you think you have enough self-discipline, we have no problem with remote work and weird work hours. We use agile development methods as much as is practical, but we&#x27;re not zealots - a very short daily meeting is unavoidable but otherwise we&#x27;ll let you work in peace.<p>If you see yourself helping our user base of 30.000 medical professionals and over 100.000 patients (many more in the future) who currently depend on us for fast, useful and objective drug information, contact us at info@mediately.co!","time":1456906338,"type":"comment"}