{"by":"_fs","id":11203722,"parent":11202954,"text":"NetBurner | <a href=\"http:&#x2F;&#x2F;netburner.com\" rel=\"nofollow\">http:&#x2F;&#x2F;netburner.com</a> | San Diego, CA | ONSITE | FULL TIME &#x2F; INTERNS<p>Interested in joining a team of doers? Our small embedded devices are network enabling hundreds of thousands of products, experiments and hobby applications around the world. Join our company and get the chance to help design, implement, and show off your ideas on our hardware and software platform. We have multiple positions, as detailed below.<p>Students! We have summer internship positions available. Come and join the team in San Diego for the summer! Our internships are very open ended and allow you to develop and show off cool technologies utilizing our hardware. Please have a look at the past projects below and our website to get an idea of what you would be interested in developing and submit your resume and a short list of a project ideas that would interest you.<p>Last summer, our internship projects included:<p>Bitcoin ATM - <a href=\"http:&#x2F;&#x2F;www.netburner.com&#x2F;learn&#x2F;insert-coin-receive-bitcoin\" rel=\"nofollow\">http:&#x2F;&#x2F;www.netburner.com&#x2F;learn&#x2F;insert-coin-receive-bitcoin</a><p>Black box network packet sniffer - <a href=\"http:&#x2F;&#x2F;www.netburner.com&#x2F;learn&#x2F;live-packet-sniffing-with-an-embedded-module\" rel=\"nofollow\">http:&#x2F;&#x2F;www.netburner.com&#x2F;learn&#x2F;live-packet-sniffing-with-an-...</a><p>Robotic arm - <a href=\"http:&#x2F;&#x2F;www.netburner.com&#x2F;learn&#x2F;intelligent-robotic-arm-with-networking-part-1\" rel=\"nofollow\">http:&#x2F;&#x2F;www.netburner.com&#x2F;learn&#x2F;intelligent-robotic-arm-with-...</a><p>Open Full Time Positions:<p><pre><code>  Technology Evangelist &#x2F; Content Marketer\n  * Generate interest through social media and SEO\n  * Create site content through examples, video demonstrations, and articles\n  * Market research to understand and utilize latest technologies\n  * Work with business development team to find new markets\n  ---\n  System Architect\n  * Develop and maintain GCC based cross-compiling tool-chains runnable on multiple OS platforms.\n  * Develop and maintain GNU Make based build systems\n  * Develop and maintain Eclipse based IDE including QT-based development applications\n  * Maintain our C.I. implementation based on Jenkins\n  * Ideal candidates should be proficient in C and C++.\n  ---\n  Software Test Engineer - Design and create example applications for end customers to demonstrate product features\n  * Develop, maintain and execute software and hardware test plans\n</code></pre>\nIf you have any questions or comments about any of our positions or technology, please reach out to me directly fstanley @ netburner (dot) com. No recruiters please.","time":1456849533,"type":"comment"}