{"by":"danielnc","id":11204006,"parent":11202954,"text":"CareMessage (YC W14) | Software Engineer | REMOTE | Full Time | <a href=\"http:&#x2F;&#x2F;caremessage.org\" rel=\"nofollow\">http:&#x2F;&#x2F;caremessage.org</a><p>CareMessage is a Stanford University born and Google and Y Combinator backed not-for-profit social enterprise headquartered in San Francisco. Our mission is to improve health literacy and disease self-management for underserved populations. The CareMessage technology platform and associated disease management programs enable healthcare organizations to facilitate communication and outreach to promote engagement and better self-care.<p>CareMessage has been funded by Google.org, the Pershing Square Foundation, the National Institutes of Health, the David and Lucile Packard Foundation, Y Combinator, the Draper Richards Kaplan Foundation, Echoing Green, Goldman Sachs, the William K. Bowes Jr. Foundation, the Franklin and Catherine Johnson Foundation, LA Care, the California Community Foundation, the Ralph M. Parsons Foundation and Stanford University&#x27;s BioDesign Department. Several CareMessage projects have been funded by the California Healthcare Foundation and Blue Cross Blue Shield of Illinois.<p>We&#x27;re looking for a full-time full stack Rails developer to help build and maintain our web platform that streamlines care management and allows interactive mobile programs to improve health outcomes. You’ll be working on exciting projects like optimizing our Sidekiq queuing system, improving and building new integrations with Twilio, building our customer analytics code, and help improving and maintaining our own API. Our team believes in an Agile development environment, test driven development. Our tools of choice are Ruby on Rails, AngularJS, PostgreSQL, and we place an emphasis on open collaboration and ownership. When something isn’t working, we’re not afraid to throw it out and try something new - so if you have exciting ideas about the dev process and how to make your own job even easier, you’ll fit right in. We&#x27;re remote first! All of our developers and QA engineers are working from a remote location<p>Apply here: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;xnyjc6\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;xnyjc6</a><p>If you want to ask any questions feel free to mail me directly at dnaves@caremessage.org","time":1456851330,"type":"comment"}