{"by":"johnrball","id":11204626,"parent":11202954,"text":" Olo - Xamarin Mobile Developer\nEngineering - New York  or Remote within U.S.  - Full Time<p>At Olo we develop an online food ordering platform used by many of the country’s largest restaurant chains, reaching millions of consumers. We take pride in a neat codebase with automated tests and continuous integration, and encourage constant refactoring.  We encourage new ideas and experimentation.  We’re so obsessed with automation that we laugh nervously at xkcd.com&#x2F;974.<p>Olo is revolutionizing the customer experience at these restaurant chains, and we&#x27;re looking for talented engineers to join our mobile team and help us achieve this vision. As part of the team you will play a significant and visible role in helping us deliver an exceptional mobile ordering experience to our clients’ consumers via our native iOS and Android apps, as well as contribute to our ongoing innovation in restaurant operations tools and services.  You’ll work with a small and passionate team dedicated to delivering amazing products using modern tools and technologies such as Xamarin, HockeyApp, MVVM, and more.<p>This is a full-time position.<p>Requirements<p>You are excited by the ongoing advances in mobile technology.\nYou have strong working knowledge of the iOS or Android platforms (bonus points for both).\nYou have experience working with Xamarin and have built apps that integrate with web services.\nWhile not a designer, you understand the key factors in a quality mobile UI&#x2F;UX design.\nYou have at least 3 years on-the-job development experience at a senior technical level.\nYou can demonstrate thorough knowledge of C#, .NET and object oriented design and patterns.\nYou are adept at writing unit tests and testable code, and working under distributed version control (preferably Git).\nYou have an innate drive to automate anything that has to be done more than once.\nYour English writing and verbal communication skills are strong.<p>please email your resume to johnball@olo.com<p><a href=\"http:&#x2F;&#x2F;www.olo.com&#x2F;careers.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.olo.com&#x2F;careers.html</a>","time":1456855422,"type":"comment"}