{"by":"jjjjjosh","id":11205424,"parent":11202954,"text":"AdColony | Bellevue, WA (Seattle area) | ONSITE<p>AdColony, the world’s premium mobile video ad network and an innovation leader in HD mobile video advertising, is looking for Software Engineers to join our growing infrastructure engineering team. You&#x27;ll collaborate on a wide variety of projects all across the stack, including:<p>- Building our next-generation deployment, monitoring, and big data platform\n- Developing libraries and services to enable other teams to do their best work\n- Building products to help the rest of the org make sense of our business metrics, monitoring, and big data\n- Infrastructure that processes billions of data points per day<p>We write mostly Scala, Javascript (both on the server, and with Ember.js for web apps) and Go, and we work with MySQL, AWS, ElasticSearch, Hadoop, Presto, Redis, ZeroMQ and Ansible. If you don&#x27;t know any or all of these things, don&#x27;t worry – we are nice people and we will help you learn.<p>The ideal candidate would:\n- Be a good software engineer with 2+ years of experience\n- Have experience programming in at least one OO or OO-ish language (Java, Scala, C#, Python, Javascript, PHP, Ruby, C++, etc.)\n- Write and run automated tests for your code, or are interested in learning to do so\n- Be someone that others enjoy working with\n- Value empathy, communication and teamwork<p>Here&#x27;s what current team members say they value most working here:\n- Mentorship: Helping you grow as an engineer is a big focus of 1-on-1&#x27;s, and we&#x27;ll pay to send you to relevant conferences and trainings\n- Opportunity: We love to promote from within.\n- Interesting work: We get to use a lot of different technologies, but we&#x27;re not just chasing the latest fad\n- Making an impact: We work with the people we build tools for, and it&#x27;s satisfying to look people in the eye knowing you&#x27;ve made a difference for them\n- Regular R&amp;D weeks: Prototype a new product or feature, learn a new programming thing, or document a dusty corner of our code base","time":1456860944,"type":"comment"}