{"by":"BRValentine","id":11206956,"parent":11202954,"text":"Voltaiq - SF Bay Area - Full Time - Onsite - <a href=\"http:&#x2F;&#x2F;voltaiq.com\" rel=\"nofollow\">http:&#x2F;&#x2F;voltaiq.com</a><p>Data Engineering &#x2F; Full Stack<p>“The battery is the technology of our time.” -The Economist, January 16, 2016<p>Powering applications from consumer electronics to the IoT, EVs, medical, aerospace, and grid storage, batteries enable our modern world. However battery performance remains the key bottleneck impeding adoption of these technologies. Voltaiq is changing that, using software.<p>Voltaiq is developing a powerful cloud-based platform for data analytics, machine learning, and visualization to enable better, safer, and more reliable batteries and battery-powered products. We have customers, recurring revenue, and funding, and we’re growing our team (currently 8) to meet customer demand. We look for product-focused developers who have a passion for shipping well-crafted software.<p>At present we’re hiring for a senior developer position for data engineering, with some full-stack inclination as a bonus.<p>Candidates should have:<p>* 5+ years experience engineering large-scale data systems including database scaling, distributed systems, and ETL pipelines from multiple different data sources<p>* Strong coding skills in one or more of: Python, Javascript, Java, C&#x2F;C++, Go<p>* Experience with Git, development on Linux&#x2F;<i>nix, SQL and relational databases<p></i> A degree in CS, Physics, Math, Engineering, or related, and interest in energy and solving hard science problems using data<p>* US Citizenship<p>Experience with the following would be a plus:<p>* Web framework (eg Django) and deployment stack (cookies, sessions, websockets)<p>* Asynchronous messaging (eg ZeroMQ)<p>* Webserver deployment: AWS, Salt, Fabric, Nginx, uWSGI<p>Competitive salary plus equity and full benefits.<p>Send a resume to jobs@voltaiq.com<p>Thanks, HN!","time":1456874412,"type":"comment"}