{"by":"maxneust","id":11202972,"parent":11202954,"text":"Android Engineer at Polarsteps (talented all-rounders are welcome too) | Amsterdam, NL | Onsite, relocation within EU<p>====================<p>TL;DR: want to have fun working for an awesome travel startup? -&gt; max at polarsteps dot com<p>====================<p>Join our journey! We&#x27;re a young startup building a beautiful and easy to use travel tracker&#x2F;journal, which will eventually become THE platform for planning, tracking and remembering your trips. We believe that the current online travel ecosystem is utterly fragmented (did you know the average traveller visits 40+ sites to book a trip?) and we are on a mission to fix that.<p>The first version of our product has been live on the web and iOS since April 2015 and with 0€ spent on marketing&#x2F;user acquisition we’ve already attracted over 20K users. Together they logged over 3 million locations using the Polarsteps iPhone app (you can check out the 5 month adventure all the way from northern Europe to the southernmost point of Africa by one of our founders here: <a href=\"https:&#x2F;&#x2F;www.polarsteps.com&#x2F;niek&#x2F;615-amsterdam-to-cape-town-by-bike\" rel=\"nofollow\">https:&#x2F;&#x2F;www.polarsteps.com&#x2F;niek&#x2F;615-amsterdam-to-cape-town-b...</a>).<p>We’re a fully funded, enthusiastic and multi-faceted team of 5 with a passion for travel, design and code, and we’re looking for someone interested in leading the efforts of building the first version of our Android app from the ground up. You’ll be working closely with the rest of the team creating a super sexy travel app that people genuinely love!<p>===== Do you have what it takes? =====<p>You’re a professional and pragmatic developer with a feel for UI&#x2F;UX. You love to travel and believe in data as much as you believe in user feedback. In addition to this, if you have Android experience and successfully released one or more apps in the Google Play Store then you’re the rainbow unicorn that we’ve been looking for. BTW, at this moment we can only consider you if you are eligible to work within the EU, sorry about that!<p>===== Benefits, perks, the cool stuff =====<p>Does this description (partially) apply to you? Then check out these additional perks -specially the last one ;)-, and drop me a line at max at polarsteps dot com<p>- Stock options!<p>- Competitive salary<p>- Work&#x2F;life balance<p>- Relocation assistance (within the EU)<p>- Awesome office in the center of Amsterdam, one of the most \ncosmopolitan and beautiful cities in the world<p>- 30 vacation days (25 ‘regular’ days + 5 Teleporter™ days, see below)<p>- We believe that regardless of stock options and salary, what will really make you richer are your travel experiences. That is why once per year you’ll have the chance to use our Teleporter™: with the push of a button, the Teleporter™ will go through all of the locations logged by our users and select a random one that is at least 1.000km away from Amsterdam. This is where your next adventure will take place! The flight is on us (plus the 5 Teleporter™ days, naturally).<p>P.S.: As for our tech stack, we’re hosted in Heroku, use Amazon S3 for media storage, python (Flask) in the backend&#x2F;API, AngularJS in the frontend, and we have a fully native iOS app written in Obj-C. We have single-command build&amp;deploy tasks for production and staging, and we do automated testing with protractor on the web and appium on iOS.","time":1456844557,"type":"comment"}