{"by":"probst","id":11224694,"kids":[11258483,11232877],"parent":11202954,"text":"Aircloak | Berlin | REMOTE (european timezones) | <a href=\"https:&#x2F;&#x2F;aircloak.com\" rel=\"nofollow\">https:&#x2F;&#x2F;aircloak.com</a><p>Hi, I am Sebastian, the CTO at Aircloak. At Aircloak we develop a query and anonymisation layer that our customers put in front of their highly sensitive personal data. Using our technology they avoid accidentally leaking sensitive data, and gain the ability to exploratively work with, and share their data with untrusted third parties – effectively opening up untapped data in a completely safe way.<p>The challenges in building such a system are countless. At the core of it lies our ability to provide a rich query interface, while ensuring that no query can ever leak sensitive information about individuals. It’s a daunting task, but daunting tasks are what we live for.<p>We are currently a team of seven, and are looking to hire:<p>- full stack software engineers<p>- a front-end&#x2F;UX designer<p>- a developer with a primary focus on testing and automation<p>Our tech stack is centered around Elixir and Erlang and our apps are deployed with docker. The frontend has so far been designed by engineers (and looks like it), so if you are interested in the frontend&#x2F;UX role, you are very much encouraged to shape its future direction!<p>We all work remotely, and the team is spread all over Europe. You will be working remotely too, and should be situated within two time-zones of Berlin. We organise periodic retreats in beautiful locations to fuse together as a team. Our work style relies on the fact that you are self-driven, can work independently, and possess stellar communication skills.<p>Your background matters less than your clear head, problem solving skills, critical reasoning abilities, and ability to reduce a problem to its bare essential.<p>We offer competitive salaries, equity, and an exciting and friendly work environment.<p>If you are interested, please send me an email at jobs@aircloak.com.\nWe are looking forward to getting to know you!","time":1457108102,"type":"comment"}