{"by":"KWalton","id":11226127,"parent":11202954,"text":"Dynamit | Columbus, OH | Full Time | ONSITE\nDynamit is looking for a full-time Front End Developer and a full-time PHP Developer.<p>About Dynamit: We are a software development company located in downtown Columbus. We build web and mobile applications and serve our clients as strategists, creatives and engineers. We work hard and play hard, and operate daily by our core values: Drive, Accountability, Growth, Community, Client-Centric, and Do the Right Thing. We have the energy of a startup, and are always looking for great new projects and opportunities to solve complex problems for our clients. Learn more about Dynamit at <a href=\"http:&#x2F;&#x2F;dynamit.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;dynamit.com&#x2F;</a><p>About the position: \nWe have an opening for a Front End Developer. This person should be experienced with HTML, CSS, and Javascript (ES6), preferably with 2 years+ of experience in front end web development. It is preferred that the candidate have experience with HTML5 APIs, SEO best practices, data formats (e.g. JSON, XML), and progressive enhancement&#x2F;graceful degradation. The full posting can be viewed here: <a href=\"http:&#x2F;&#x2F;www.dynamit.com&#x2F;careers&#x2F;position&#x2F;253066fc-69ad-4c2f-b898-f3b3dcd81a5c&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.dynamit.com&#x2F;careers&#x2F;position&#x2F;253066fc-69ad-4c2f-b...</a><p>We also have a new opening for a PHP developer. This candidate should have experience building data-driven OOP web applications, experience with PHP(5.5+), HTML(5), CSS(3), JavaScript (jQuery preferred), AJAX, JSON&#x2F;XML, version Control (Git &#x2F; Subversion), and preferably MySQL, SQL, MongoDB, Redis&#x2F;Memcache as well. The full list of qualifications can be found on our website, here: <a href=\"http:&#x2F;&#x2F;www.dynamit.com&#x2F;careers&#x2F;position&#x2F;0fa7b975-94f0-4dda-aff5-d0ecd4ff14c1&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.dynamit.com&#x2F;careers&#x2F;position&#x2F;0fa7b975-94f0-4dda-a...</a><p>Dynamit offers great benefits like health, vision, dental and life insurance (we cover 100% of premiums for employees and chip in with 25% for dependents), a 401K matching program, paid parking in the Arena District, and a flexible PTO policy. However, the best thing about us is the people who work here!<p>The best way to apply is on our website. Direct links to the postings are above, or visit <a href=\"http:&#x2F;&#x2F;www.dynamit.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.dynamit.com&#x2F;careers&#x2F;</a> to check out our full list of openings. \nThanks!\n-Kelli, HR Coordinator","time":1457118776,"type":"comment"}