{"by":"bruhwiler_ycomb","id":11226835,"parent":11202954,"text":"RadiaSoft LLC | Boulder, Colorado | Full Time | Software Engineer<p><a href=\"http:&#x2F;&#x2F;radiasoft.net&#x2F;careers&#x2F;software-engineer&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;radiasoft.net&#x2F;careers&#x2F;software-engineer&#x2F;</a><p>If you love to code and want to build something cool, then come work with us.<p>RadiaSoft is a well-funded, open-source software company dedicated to improving scientific workflows through our state-of-the-art Science-as-a-Service platform. We are a cross between a startup and research institute. We publish extensively and present at conferences around the globe. We are a distributed team that pushes the limits of parallel computation, the cloud, data visualization, and browser-based user interfaces.<p>We bring cutting-edge software technology to computational science and high performance computing. We have extensive and deep relationships with international research groups, including Fermi National Accelerator Laboratory, Brookhaven National Laboratory, Lawrence Berkeley Laboratory, Argonne National Laboratory, UCLA, SLAC National Accelerator Laboratory, Texas A&amp;M University, Thomas Jefferson National Accelerator Facility, the European Synchrotron Radiation Facility, the University of Strathclyde, Darmstadt Technical University, the European X-ray FEL and Oxford University.<p>You are an experienced software engineer who has worked extensively in multi-paradigm programming environments. You are an artist, who delights users by solving hard problems. You enjoy reading code, and you can refactor anything. You have the confidence to deliver a good enough implementation and to accept feedback from your users and team. You can overcome a barrage of overwhelming challenges with courage, collaboration, and creativity. You communicate clearly and provide constructive feedback. We expect to learn from you.<p>RadiaSoft provides excellent benefits and generous compensation. You can work where and when you want. You will have the time and money to take vacations. Your job is to keep our users happy.<p>You can see our code and current technological choices on GitHub <a href=\"https:&#x2F;&#x2F;github.com&#x2F;radiasoft\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;radiasoft</a><p>You can learn about our team on LinkedIn <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;vsearch&#x2F;f?keywords=radiasoft\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;vsearch&#x2F;f?keywords=radiasoft</a>","time":1457125429,"type":"comment"}