{"by":"anewman15","id":11226778,"parent":11202954,"text":"Wirestorm Innovations | Richardson, Texas | Full-time | Onsite<p>We are looking for a Lead Developer to join our team of global software engineers. Our team is trusted to implement scalable, efficient, and maintainable software products that solve complex problems. \nCapability: Order Management &amp; Service Catalog Application Developers &amp; Architects<p>REQUIREMENTS: \n* Business process knowledge in wire-line telecommunication business\n* Working knowledge of workflow concepts such as BPM, BPMN, BPML and BPEL.\n*  Knowledge of UML, Object Orientation, Service Orientation, programming languages (Java&#x2F;J2E), Relational Databases (mainly Oracle), Client-Server&#x2F;Web systems, Unix&#x2F;Linux systems.\n* Knowledge of server-side JavaScript, WSDL, XSD and XML.\n* Knowledge of Java plugins and formatting of the APIs.\n* Strong knowledge of SQL, PL&#x2F;SQL.\n* Experience in order management&#x2F;customer service role.\n* Understanding of how Order Management within the Fulfillment area impacts the other OSS functional areas (like inventory management, activation management, workforce management, and service assurance) as well as interactions with the BSS (sales channels, CRM, billing) and its fit to the overall Telecom Business Model.\n* Knowledge of the TMForum concepts, including NGOSS, SID, TAM, atom and OSS&#x2F;J.\n* Understands fully the fundamentals of how a Telco Product and Service Catalog is designed.\n* Has comprehensive knowledge of data modelling.<p>Must be able to travel 30% of the time. Ability to work with Geographically Dispersed teams.<p>For us every project is challenging, and every position critical. We don&#x27;t have ping pong tables or espresso machines, yet we enjoy a thriving culture of shared invention. Our operatives are strategically placed around the globe and our clients range from sovereign governments to Fortune 500 companies.<p>wirestorm.us<p>Please apply here: <a href=\"https:&#x2F;&#x2F;wirestorm.bamboohr.com&#x2F;jobs&#x2F;view.php?id=50\" rel=\"nofollow\">https:&#x2F;&#x2F;wirestorm.bamboohr.com&#x2F;jobs&#x2F;view.php?id=50</a>","time":1457124848,"type":"comment"}