{"by":"tene","id":11616518,"parent":11611867,"text":"IMVU | Redwood City, California | Remote<p><a href=\"http:&#x2F;&#x2F;im.vu&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;im.vu&#x2F;jobs</a><p>The teams at the top of our hiring priority right now are the operations, android, ios, and web services teams.<p>I lead the operations team, so I know the most about this position.  For the operations team, we&#x27;re looking to hire an SRE or a sysadmin.  We&#x27;re open to a remote employee for this team.  We run one-week on-call shifts, so you&#x27;ll need to be on-call once every six or seven weeks.  The operations team is responsible for monitoring and maintaining about 800 servers (hardware is all handled by a different team).  We&#x27;re mostly running Ubuntu today, but we&#x27;re in the middle of migrating our first service into coreos&#x2F;kubernetes.  We&#x27;ve got some legacy code in Perl, and most new code we write is in Go.  Our biggest projects planned for the next year involve containerization, network storage, and possibly investigating migrating the most-elastic parts of our workload into amazon or google&#x27;s cloud.  We&#x27;re open to non-coding contributors in a sysadmin role instead of SRE.  For a remote employee, we&#x27;d want you to come on-site for the initial spin-up process.<p>For the Android and iOS teams, I know we&#x27;d love someone with 3d experience.  I don&#x27;t think those teams are very interested in a remote member.<p>The web services team writes mostly PHP and Haskell.  This is working on the backend supporting our mobile, web, and native clients.<p>Our hiring process usually involves a couple of casual phone screens, then a series of on-site interviews.<p>The company runs a chat service and a marketplace for users to make and sell 3d content to each other.  It&#x27;s a fairly relaxed, laid-back company.  I started working here in 2010, quit in 2013 to try working at Google, and came back here a year later when I decided that Google was far too stressful for me to be happy.<p>If you have any questions, feel free to reach out to me.  My personal email is in my profile, and my work email is sweeks@imvu.com.","time":1462230678,"type":"comment"}