{"by":"eganist","id":11611911,"parent":11611867,"text":"Senior Application Security Engineer<p>The Advsory Board Company | Washington, D.C. (preferred) or Austin, TX | Full time (Fulltime&#x2F;FT) onsite<p>The Advisory Board Company (NASDAQ: ABCO) is a global research, consulting, and technology firm helping hospital and university executives to better serve patients and students. We provide strategic guidance, actionable insights, web-based software solutions, and comprehensive implementation and management services. If improving healthcare and education motivates you every morning, you might be a good fit for our many open engineering positions across the firm. More information at <a href=\"https:&#x2F;&#x2F;www.advisory.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.advisory.com&#x2F;careers</a><p>Boilerplate aside, I&#x27;m personally seeking either an experienced security engineer with some development background or an experienced developer with a strong interest in security to work with me in automating application security into CI&#x2F;CD pipelines across the firm, training our developers on secure coding practices, and building a robust security champion program. In addition to the routine application security assessments (code reviews + pen tests), we&#x27;re using this three-pronged approach to empower developers with the tools, training, and support they need to take ownership of security in their code. The Senior Application Security Engineer can take ownership of any of these programs as desired, and I&#x27;m always open to other projects in support of building security into software development.<p>On top of the role itself, we&#x27;ve got a world class team of domain experts (numerous conference talks and research efforts under their belts) who can support you with your knowledge and career, and both the benefits and life balance here are nothing to sneeze at. Case in point: this position gets twenty five (25) use-or-lose days of paid time off per year, and that&#x27;s not including the ten (10) firm-wide holidays.<p>If you&#x27;re interested, let&#x27;s talk. Shoot me a note directly at zadeganb@advisory.com, or you can catch me at the OWASP NoVA&#x2F;DC social this week (<a href=\"http:&#x2F;&#x2F;www.meetup.com&#x2F;OWASPDC&#x2F;events&#x2F;230551659&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.meetup.com&#x2F;OWASPDC&#x2F;events&#x2F;230551659&#x2F;</a>) or at any future OWASP DC event.<p>Details: <a href=\"http:&#x2F;&#x2F;advisorycareers.force.com&#x2F;openings&#x2F;apex&#x2F;ts2__jobdetails?jobId=a0KF000000GKt6pMAD\" rel=\"nofollow\">http:&#x2F;&#x2F;advisorycareers.force.com&#x2F;openings&#x2F;apex&#x2F;ts2__jobdetai...</a>","time":1462201517,"type":"comment"}