{"by":"jfountain2015","id":11615406,"parent":11611867,"text":"New York City, NY (Union Square) | Vettery <a href=\"https:&#x2F;&#x2F;www.vettery.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.vettery.com</a> | ONSITE | Full-time Full Stack Engineer<p>Here’s the gist: Vettery is a tech company, but what we ultimately do is help people find their dream job. We are looking for self-starters who care about helping people find a job the love! It’s pretty simple, we are looking for hungry people with an energy to disrupt an ancient industry and at the same time enjoying the perks of a growing startup.<p>Vettery engineers work across the full stack and are committed to optimizing the experience for our users as well as our employees. A Vettery engineer has input into the whole process of the company from business decisions to where our tech stack is going. You will be involved in all levels of the products we produce. There is a large variety of projects here and we strive to align people with what tech they like to use or want to learn. See more info and apply here...<p><a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;vettery&#x2F;jobs&#x2F;118230\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;vettery&#x2F;jobs&#x2F;118230</a><p>PHP, Javascript, Angularjs, MySQL, Python, CSS, Sass, Bootstrap, Grunt, Ubuntu, AWS, Vagrant, D3.js, Apache, Nginx, Git, Protractor&#x2F;Jasmine\nBenefits: Competitive salary Open vacation &amp; sick time Medical, vision, and dental insurance Vettery Perks: Frequent team outings, lunches, and team building events Lots of free food - stocked kitchen + beverages.<p>Interview process: \n1. Phone screen (30 Min)\n2. Take home exercise ( 2-4 Hours )\n3. Call to discuss exercise results (30 Min)\n4. In person tech interview ( 1.5 Hours )\n5. In person pair programming ( 4 Hours )\n6. Final round with product lead, designer, co-founders. ( 1.5 Hours )\nSome of the in person interviews can be combined or done after hours depending on your schedule.","time":1462221706,"type":"comment"}