{"by":"dsymquen","id":11615010,"parent":11611867,"text":"Fevo | New York, NY | <a href=\"https:&#x2F;&#x2F;www.fevo.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fevo.com</a> | Full-Time | ONSITE\nJOB DESCRIPTION<p>Fevo is a well funded startup that&#x27;s focused on disrupting the age-old way people buy tickets to live events. Our mission is to turn the process of organizing groups going to an event into a social &quot;experience&quot; both online and offline. Our clients range from top major league sports teams to broadway and concerts.<p>Our team is a small, nimble collective of technologists who have an incredible opportunity to influence an entire industry to think differently.  We work on cutting edge technologies, collaborate constantly and most importantly have a lot of fun while doing it. Did we mention our secret love for functional programming?<p>ABOUT YOU\nYou’re passionate about building the best product and consumer experiences for live events. You love the challenge of scaling software - be it traffic or horizontal (across apps and platforms). You have a core competency in back-end and&#x2F;or front-end engineering but want full breadth of knowledge across the stack.<p>You can write quality code with speed, love to collaborate, think through all possible scenarios and edge cases.  As an engineer, you will manage Fevo’s cloud infrastructure, model the database, write services and build responsive front-end components and pages.<p>RESPONSIBILITIES \nWork across the full stack - every engineer comes in with core strengths and we open the opportunity to learn everything. \nManage and improve our cloud infrastructure\nBuilding data services including database modeling\nEngineer core features on our application layer\nBuild responsive components that run on Fevo platform and our 3rd party SDK&#x2F;widgets\nBe capable of building across the stack solo or collaboratively with a team\nThis position will report into the Director of Engineering<p>TECHNOLOGIES INCLUDE (BUT NOT LIMITED TO):\nScala, Java8, Play Framework, ES2015 (using Babel and SystemJS), AWS, DropWizard, Node, modern lightweight JS Frameworks (not tied to a specific one)<p>QUALIFICATIONS \n2-5 years of engineering experience\nCore strength in back-end or front-end but an eagerness to learn a full stack<p>If you would like to find out more after looking at the above,email me at sagar[at]fevo[dot]com","time":1462219097,"type":"comment"}