{"by":"expend","id":11619544,"parent":11611867,"text":"Expend - London, UK - Full time - FinTech - ONSITE<p>Back-end Python Developer (Competitive salary with stock options)<p>Expend is a FinTech payments company innovating within the financial services sector with an innovative new product in the financial services sector. We simplify the annoying company expenses process with a smart solution, built using cutting-edge technology with a side of creativity. We’re ambitious, with multiple targets and objectives, and our first challenge is to revolutionise business expenses.<p>We are working within a huge sector mainly dominated by big companies using outdated approaches. It is in massive need of change and we aim to revolutionise the industry. We provide mobile, online, card and payment products as part of an intuitive solution with unique functionality.<p>The Role:<p>We are looking for talented Python backend engineers to join our team in our dynamic office space in the heart of Shoreditch, London. You will be using your knowledge to help build the Expend product, working across various disciplines, including security, accountancy and financial systems.<p>The role encompasses the following:<p>* Working alongside the Expend team (currently 7 strong and growing) to help build and improve our core transaction and backend systems which are at the heart of our service (this involves REST APIs and Microservices)\n* Actively contributing to the open source community whenever possible\n* Other suitable work dependant on skills\n* You will have the opportunity to work within a talented team alongside experienced engineers.<p>Requirements:<p>* Proficiency in Python and cloud technologies (i.e. AWS)\n* Knowledge of Databases (i.e. PostgreSQL, DynamoDB)\n* Appreciation for modern Agile development using Scrum\n* Strong communication skills and punctuality\n* Self awareness and a desire to improve your skills\n* Proficiency in English with the right to work in the UK\n* And most importantly: A passion for creating products that people love to use!<p>Send CV to (jobs at expend dot io) or apply at <a href=\"https:&#x2F;&#x2F;expend.io&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;expend.io&#x2F;jobs</a>","time":1462274097,"type":"comment"}