{"by":"daniel_iversen","id":11616942,"parent":11611867,"text":"Dropbox (YC S07)  |  Sydney, Australia  |  Full-Time  |  On-site<p>Position: Enterprise Solution Architect<p>As you know, Dropbox has changed the way millions of people work, collaborate and keep their information safe. The APAC part of the business, run out of Sydney, is expanding and we are looking for talentented and passionate technologists to join the pre-sales team.<p>As a Solutions Architect in our Enterprise Sales team, you’ll play a huge role in bringing on board new enterprise clients and in the region our customers include some of the most prestigious brands.<p>However, whats more important, Dropbox a really delightful place to work; team work and hard (but satisfying) work go hand in hand, creativity is not only rewarded but its encouraged and nurtured. The culture is one of openness and transparency. We get a lot of perks but we also try hard to earn them and live up to the high standards we&#x27;ve set.<p>This role has you working with clients of different sizes through their Dropbox evaluation - you&#x27;ll be doing presentations, workshops, code, deployment plans and more.. You&#x27;ll be covering digital workplace, security, APIs, deployments, data migration, the future of work and more. One one end you will be doing really deep hairy technical stuff and other and on the other end of the scale you will be having C-level business centric conversations.<p>What we&#x27;re looking for is essentially someone who:<p>-  Is passionate about technology and the future<p>-  Craves being in front of the customer, solving their problems<p>-  Has a deep technical hands-on foundation - presales or consulting<p>-  Works best in a fast paced environment where creativity and new thinking is table stakes<p>-  Loves Dropbox, SaaS and the future of collaboration<p>-  Has real-life experience &#x2F; battle scars<p>-  Wants to (and can) work in Sydney (we&#x27;re all more or less based here)<p>The interview process can seem a bit overwhelming (about 5-7 or so interviews) but its not that drawn out.<p>If you&#x27;re interested hit me up on danieliversen (AT) dropbox (DOT) com - I&#x27;ll be happy to have a conversation with anyone who reaches out from HN (we&#x27;re a YC alumni) within the next 2 weeks.","time":1462235390,"type":"comment"}