{"by":"antoviaque","id":11612805,"parent":11611867,"text":"Open edX -- REMOTE (Worldwide, remote company based in Berlin), OpenCraft<p>Open Source Developer - Python&#x2F;Django, Javascript<p>Development specialized on the free software project Open edX, used by many universities and companies to run online courses. See edx.org, stanford.edu or fun-mooc.fr for examples of Open edX instances. We are a team of nine developers, working remotely from Europe, North America, Asia, Russia &amp; Australia. The company is not affiliated with edX, but contributing and working with them on various projects. This is a full time position, were you would be able to work remotely from where you want, as long as you have a good internet connexion. : )<p>It&#x27;s a large Python&#x2F;Django codebase, with good code standards and architecture (a lot of the edX engineers come from MIT). You would work on different clients contracts using the platform. The clients list&#x2F;references include Harvard, edX themselves, the French government, and various startups &amp; universities currently running their own instances, or looking to create one. Tasks are varied, from developing developing core platform features, custom exercises and tools for specific courses (XBlocks), customizing and deploying instances, working on both client&#x2F;server sides, etc.<p>Most of your work is published as free software (Open edX is released under the AGPL license, which requires clients to release modifications under the same license), and you would also contribute to the free software project, pushing some of your developments upstream through pull requests, contributing features, documentation or help on mailing-lists.<p>Stack: Python&#x2F;Django, Ansible, AWS&#x2F;OpenStack, Debian&#x2F;Ubuntu, JS, HTML&#x2F;CSS, MySQL, MongoDB<p>Interview process: 30 minutes Hangout, then a (paid) test task for selected candidates (a contribution to the Open edX project) - the decision is taken based on how you handle the upstream contribution.<p>To apply, end an email to jobs+dev-hn@opencraft.com, including: 1) A short explanation of why the role interests you (no formal cover letter, please :) ) 2) A list of links to free software contributions you have made, preferably to third-party projects. You can also include communication threads or documentations you have written if any, as free software contribution is more than just about code. 3) A link to your github account 4) Your resume (or a link to an online resume like LinkedIn)","time":1462206115,"type":"comment"}