{"by":"joshmaker","id":11613368,"parent":11611867,"text":"The Atlantic | Washington DC | Full time onsite<p><i>The Atlantic</i> is a digital-first media company with over 150 years of history and 30 million online visitors a month. <a href=\"http:&#x2F;&#x2F;www.theatlantic.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.theatlantic.com&#x2F;</a><p>Roles:<p>-<p><i>Full-Stack Python&#x2F;Django Developer</i><p><a href=\"http:&#x2F;&#x2F;atlanticmedia.applytojob.com&#x2F;apply&#x2F;IVakvI&#x2F;FullStack-PythonDjango-Developer\" rel=\"nofollow\">http:&#x2F;&#x2F;atlanticmedia.applytojob.com&#x2F;apply&#x2F;IVakvI&#x2F;FullStack-P...</a><p>We’re looking for a full-stack developer who is passionate about clean code and great journalism and is interested in joining our growing team for full time onsite work at the historic Watergate complex in Washington DC. The full-stack developer will write well-documented and maintainable Django &#x2F; Python, HTML, JavaScript, and CSS code in a team-oriented environment. Responsibilities include maintaining and improving our custom content management system and web platform, and adding and deploying new features to our websites.<p>* Ability to define and communicate a technical vision, possessing excellent verbal and written communication skills<p>* Familiarity with the Django web framework<p>* Experience with GIT version control<p>* Strong attention to detail while implementing technical specifications<p>* Demonstrated problem-solving skills<p>* Minimum of two years fulltime professional experience working with a Python web framework front end web technologies<p>-<p><i>DevOps Engineer</i><p><a href=\"http:&#x2F;&#x2F;atlanticmedia.applytojob.com&#x2F;apply&#x2F;y5d1GQ&#x2F;DevOps-Engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;atlanticmedia.applytojob.com&#x2F;apply&#x2F;y5d1GQ&#x2F;DevOps-Engi...</a><p>We are looking for a talented and knowledgeable DevOps engineer who is passionate about infrastructure and automation. We’re looking for a fast learner who can figure things out independently and  show us a better way of continuously deploying complex systems to the web. The DevOps engineer would also work with the corporate IT team as we move to automate server provisioning and configuration management using Puppet.<p>* Experience deploying high volume Python applications; knowledge of Nginx and uWSGI configuration is a definite plus<p>* Familiarity with automation tools such as Puppet and Ansible<p>* Deep knowledge of Linux internals, tuning, and troubleshooting<p>* Experience mitigating and preventing DDOS and other attacks<p>* Familiarity with Git and version control<p>* Good Python coding skills","time":1462209360,"type":"comment"}