{"by":"vorador","id":11614351,"parent":11611867,"text":"Nylas | <a href=\"https:&#x2F;&#x2F;nylas.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;nylas.com&#x2F;</a> | San Francisco, CA (Soma) | Frontend (JS), Backend (Systems+Ops)<p>Hi! We&#x27;re Nylas. We build N1, the extensible, open source email client, and the infrastructure powering it. We&#x27;re looking for fronted application engineers (React, Electron, JS), designers, backend systems engineers, &amp; infrastructure&#x2F;operations engineers.<p>We recently launched N1, have accumulated over 16K stars on GitHub, and are looking for core application engineers to design an extensible platform around email, calendar, and contacts. You&#x27;ll not only use modern web tech to build a better email experience, you&#x27;ll design the developer platform to power the next generation of email apps. See more about N1 here: <a href=\"https:&#x2F;&#x2F;nylas.com&#x2F;N1\" rel=\"nofollow\">https:&#x2F;&#x2F;nylas.com&#x2F;N1</a> &amp; code: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;nylas&#x2F;N1\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;nylas&#x2F;N1</a><p>We have more data for a single user than in most startups&#x27; entire database. We&#x27;re scaling heavily and if you have experience with automated deployments, debugging running systems, release engineering, and on-call schedules, but are still comfortable writing code, we&#x27;re for you. :)<p>We take pride in the diverse culture we&#x27;ve built and are looking for more than raw technical talent: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=z7sHc4P4zPg\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=z7sHc4P4zPg</a><p>== We&#x27;re particularly looking for folks who ==<p>* Take personal pride in their work and value autonomy and ownership<p>* Want the chance to step up and lead a team<p>* Put the work before ego. We&#x27;ve got each others&#x27; backs, and we want you to be with us on that<p>== A bit more about us ==<p>* Our backend is built on Python, Flask, gevent, nginx, MySQL, AWS, and Debian. We&#x27;ve been careful to keep our architecture componentized.<p>* N1 uses javascript (ES6), React, Flux, SQL for offline caching, Electron, and no jQuery<p>* Tons of our code is open source. Check it out: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;nylas\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;nylas</a><p>* We&#x27;re a small team * We have a paid vacation policy &amp; value personal responsibility and ownership. Benefits include free Lyft to &amp; from the office, full health, dental, vision, and lunch every day. Some remote work &#x2F; work-from-home is OK too<p>Apply at <a href=\"https:&#x2F;&#x2F;nylas.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;nylas.com&#x2F;jobs</a> or ping me directly (karim@nylas). We&#x27;re a diverse team, and encourage applications from all backgrounds.","time":1462215233,"type":"comment"}