{"by":"aioprisan","id":11612893,"parent":11611867,"text":"HubSpot | Boston&#x2F;Cambridge, MA | Full-time, Onsite | Senior Full Stack Software Engineer (inbound.org) | aoprisan@hubspot.com<p>HubSpot is looking for a senior full stack software engineer to help build a community of Inbound marketers on inbound.org. This is an exciting opportunity for someone looking to wear many hats and join a startup within a startup. We’re building the largest marketing community website, inbound.org, as part of HubSpot Labs, HubSpot’s R&amp;D group. We get to test our hypotheses, iterate and ship code daily. Our full-stack engineers own features end-to-end, with unparalleled independence and flexibility.<p>Duties:<p>* Develops and maintains both client-side and server-side of scalable software that works on a wide variety of modern browsers\nMentors and develops more junior software engineers by providing advice, coaching and educational opportunities<p>* Contribute to the overall design and architecture of inbound.org&#x27;s deployment product, as well as creating technical design specifications<p>* Participates as part of an agile product team in all stages of the development lifecycle including architecture, design, coding, unit testing, and code reviews<p>* Works autonomously at a senior level and trusted to run with a project without constant guidance, while following conventions and best practices<p>* Talks with customers to better understand real-world software use cases and proposes product roadmap features<p>* Works with marketing and growth teams to come up with technical solutions that balance time to market with community and growth impacts<p>* Provides information by collecting, analyzing, and summarizing development and service issues<p>* Ability to automate machine image startup&#x2F;shutdown with scaling and fault tolerance considerations<p>* Works with designers to implement a consistent look and feel<p>* Accomplishes engineering and organization mission by completing related results as needed<p>Qualifications:<p>* Not afraid to ship small, functional pieces that allow us to validate hypotheses than creating perfect solutions<p>* 4+ years of full-stack software engineering experience<p>* Ability to work with a remote team and meet deadlines<p>* Excellent communications skills, written and verbal<p>* Highly motivated with strong attention to detail<p>* Portfolio of relevant work that you can share or show us<p>More details: <a href=\"http:&#x2F;&#x2F;www.hubspot.com&#x2F;jobs&#x2F;apply?gh_jid=206395\" rel=\"nofollow\">http:&#x2F;&#x2F;www.hubspot.com&#x2F;jobs&#x2F;apply?gh_jid=206395</a>","time":1462206659,"type":"comment"}