{"by":"barclay","id":11613174,"parent":11611867,"text":"Deliv (<a href=\"http:&#x2F;&#x2F;www.deliv.co\" rel=\"nofollow\">http:&#x2F;&#x2F;www.deliv.co</a>) | Menlo Park, CA and Grand Rapids, MI | on-site | full-time<p>Deliv is a crowdsourced logistics company that powers same-day delivery and returns for retailers, local businesses, and e-commerce companies. Deliv is focused exclusively on moving packages; not selling goods (so we can be really good at what we do). We work behind the scenes of some of the largest and most innovative companies - including Best Buy, Google Express, Bloomingdale’s and Walgreens and more, in over 100 cities (from manhattan to honolulu), and are getting ready to scale to a LOT more for 2016. We&#x27;ve also recently raised a $28mm series B led by UPS (<a href=\"http:&#x2F;&#x2F;www.reuters.com&#x2F;article&#x2F;us-ups-deliv-idUSKCN0VX2U4\" rel=\"nofollow\">http:&#x2F;&#x2F;www.reuters.com&#x2F;article&#x2F;us-ups-deliv-idUSKCN0VX2U4</a>).<p>In 2015 we acquired two companies, one of them based in Grand Rapids, and we&#x27;re looking to expand there as well as Menlo Park.<p>Who we are: an 11 person engineering team, looking to grow to 16 by the end of the year. We&#x27;re primarily ruby&#x2F;rails&#x2F;angular (and iOS&#x2F;android), and are reaching that exciting stage of the company where it&#x27;s all about really scaling the platform, blowing up old assumptions, making things purr.<p>We&#x27;re currently looking for:<p><pre><code>  * Full-Stack Engineers (all levels experience) \n  * Back-end Software Engineers (all levels of experience)\n</code></pre>\nInterview process (for CA, slightly different for MI):<p><pre><code>  1. Intro call with me, to answer any questions you might have (20 minutes).\n  2. Technical phone interview with one of our engineers (45 minutes).\n  3. On-site interview 3-4 sessions, an hour each\n  4. (optional) lunch with the group, or come to our bi-monthly game night\n</code></pre>\nSee more at: <a href=\"http:&#x2F;&#x2F;www.deliv.co&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.deliv.co&#x2F;careers</a>, or for more details shoot me an email: barclay[at]deliv.co","time":1462208318,"type":"comment"}