{"by":"evtothedev","id":11614779,"parent":11611867,"text":"Snapdocs | DevOps &amp; Security Engineer | San Francisco, CA (ONSITE) | Full-Time<p>Snapdocs (YC W14)- we&#x27;re hiring our first DevOps Engineer<p>We currently use OpsWorks to deploy to AWS. We&#x27;re looking for someone to move us to an even-more-modern workflow. I&#x27;m thinking something like Docker and ELB? But that will be your decision.<p>Snapdocs is an early-stage, rapidly growing company tackling the absolutely massive mortgage market. We&#x27;re bringing modern, elegant software to a field that still relies on fax machines and manilla envelopes. We bring security, efficiency and joy to a paper-based pillar of the US economy.<p>Snapdocs’ culture is one that strongly values diversity and drive. We want to work with people of different backgrounds and different paths in life. We value experience and curiosity over college degrees.<p>We trust our team members to make smart decisions. This means we value both independent work as well as seeking collaboration. We&#x27;re becoming ubiquitous in one segment of the market and we&#x27;re looking to hire another core engineer to help us expand further.<p>Skills &amp; Requirements:<p>* Experience deploying to AWS.<p>* You build a stack that is secure by default, while still actively monitoring against threats.<p>* Experience with auto-scaling servers.<p>* Experience making a CI build that maximizes coding joy.<p>* You would be the 6th member of on a fast-growing technical team. This means helping to form a healthy and happy culture. We strive to be respectful of each other&#x27;s time and point of view. We&#x27;re learning how to do this together. We&#x27;re creating a place where it&#x27;s OK to fail, and that you know the team has your back the whole way through.<p>* You&#x27;re self-motivated. To us that means when you get an interesting problem, you will rip into it until you understand its nuances and perhaps have a glimpse of the solution.<p>* Knowledge of Rails is a huge plus.<p>Please drop us a line at jobs@snapdocs.com","time":1462217768,"type":"comment"}