{"by":"neiljohnson","id":11613584,"parent":11611867,"text":"Lyst | London, UK | ONSITE<p>When we started Lyst, the fashion world felt to us like the most broken thing online. So we thought we&#x27;d try and fix it.<p>Hiring process: On application an initial phone call, then a take home task. No deadline, any language you like, tested internally to be achievable in 1-2 hours, dare I say it &#x27;fun&#x27;. Then a technically focused call followed by a single onsite interview over an afternoon, covering fit (as a first class citizen), coding and technical common sense.<p>Lyst is a VC backed fashion e-commerce service. Lyst has grown over 300% every year since launch in 2011 and has raised over $60M from top-tier investors<p>At the heart of Lyst is a data aggregator that lists millions of products from hundreds of designers, brands and retail partners. A scraping architecture that makes more than 4 million calls a day, we automatically add, de-duplicate and moderate 1000s of new products to the site every week. On top of this data, we build systems that help people discover, follow and buy from their favourite fashion brands.<p>Lyst is principally a python shop, but really we just want to hire great engineers regardless of language background. Our tech blog is a good place to learn more about the sort of problems we work on \n<a href=\"http:&#x2F;&#x2F;developers.lyst.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;developers.lyst.com&#x2F;</a><p><a href=\"https:&#x2F;&#x2F;www.smartrecruiters.com&#x2F;Lyst&#x2F;91238144-senior-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.smartrecruiters.com&#x2F;Lyst&#x2F;91238144-senior-softwar...</a>\n<a href=\"https:&#x2F;&#x2F;www.smartrecruiters.com&#x2F;Lyst&#x2F;87473116-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.smartrecruiters.com&#x2F;Lyst&#x2F;87473116-software-engin...</a><p>Either apply via <a href=\"https:&#x2F;&#x2F;www.lyst.co.uk&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lyst.co.uk&#x2F;careers&#x2F;</a> or get in touch personally if you&#x27;d like to chat first - my mail is in my profile.","time":1462210573,"type":"comment"}