{"by":"batbomb","id":11612857,"parent":11611867,"text":"SLAC National Accelerator Laboratory | Menlo Park, CA (Onsite)<p>* tldr: Python and C++ (or Java) developer for public-facing services and APIs in astronomy<p>Officially, please refer to the HR-mangled job posting:\n<a href=\"https:&#x2F;&#x2F;chk.tbe.taleo.net&#x2F;chk01&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?org=SLAC&amp;cws=1&amp;rid=2175\" rel=\"nofollow\">https:&#x2F;&#x2F;chk.tbe.taleo.net&#x2F;chk01&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?...</a><p>Unofficially:<p>We are part of the Data Management team for the Large Synoptic Survey Telescope (LSST, lsst.org); an extremely important telescope for astronomy, astrophysics, and cosmology. The camera for the telescope is 3.2GP and will be continuously scanning the sky every night.<p>We&#x27;re looking for a strong python developer to join our Data Access team, which develops APIs and services to enable access of data for our science partners and the greater astronomy community. This involves developing APIs and services for access to datasets, images, and our in-house developed distributed database which will contains 10s of petabytes of data and grow throughout the tenure of the survey.<p>Ideal candidates have a background in Physics or CS (preferably both), development in REST APIs, and extremely strong database knowledge. The person can also architect new systems on their own based on abstract requirements (i.e. the initial work will be straightforward, but this probably isn&#x27;t a position for just-finished-my-PhD). Ideally, you know what it takes to deal with a petabyte of data. This position will be multi-faceted, and the ideal candidate would also be able to switch to development of our distributed database if need be.<p>Employees of SLAC are also Stanford employees, and receive most of the same benefits. If you also care about working on open-source software, the entire LSST stack is open source (GPL) and, as a DOE employee, you are almost always free to open source all of your work as well (typically BSD).","time":1462206479,"type":"comment"}