{"by":"ksaun","id":11615669,"kids":[11616653],"parent":11611867,"text":"Nexon | El Segundo, CA | Technical Lead&#x2F;Lead Programmer | ONSITE | (VISA possible)<p>Nexon is creating a new PC game development incubator at its Nexon America office in southern California. A small team (6-10) will conceive and prototype a game concept, eventually growing to a production team of 20-30 developers. (Nexon is currently best known for F2P mobile games, but that is not the focus of this incubator team.)<p>My name&#x27;s Kevin Saunders and I&#x27;m leading this new initiative at Nexon. (Games I&#x27;ve worked on in the past include Shattered Galaxy (MMORTS), Command &amp; Conquer Generals: Zero Hour, Star Wars: Knights of the Old Republic 2, Neverwinter Nights 2: Mask of the Betrayer, and Torment: Tides of Numenera.) I am currently seeking candidates to form the core of this new studio within Nexon. This is an opportunity to work in a small team environment and help establish a new product and a team culture, but with the support of an established corporation.<p>We will begin from an existing engine, such as Unity or Unreal. You will be a&#x2F;the key technical voice within this team.<p>Depending upon your interests, you will be either a senior engineer&#x2F;architect for the prototype (and later the game) or a lead programmer who grows and mentors a small team of engineers. (In this latter case, you&#x27;ll still be writing code, at least during the prototyping phase.)<p>5+ years of programming experience, please. Previous professional game development experience NOT required, but please have significant experience with one or more game engines. (I have had some great experiences working with programmers who wanted to transition from other industries, but in these cases game development was at least a hobby.) I&#x27;m looking for the right person&#x2F;people more than I&#x27;m looking for a specific skill profile.<p>Salary: $120+K\nComprehensive benefits package, including unlimited vacation time<p>Casual inquiries are OK. Let us know what you&#x27;re interests are and what you&#x27;ve been working on. We are a small group within Nexon and so our interview practices are still evolving, but coding tests are not part of our process.<p>If you may be interested, please contact Aaron Morrison (amorrison@nexon.net). Thanks!","time":1462223464,"type":"comment"}