{"by":"jburwell","id":11613352,"kids":[11613405],"parent":11611867,"text":"2 points by jburwell 30 days ago | parent | on: Ask HN: Who is hiring? (April 2016)\nShapeBlue | Software Engineer | Full-Time | REMOTE (Global)<p>Join us at the intersection of cloud computing, DevOps, and distributed systems to build infrastructure automation and datacenter optimization tools. We actively contribute to the Apache CloudStack Infrastructure-as-a-Service (IaaS) project -- building new features driven by the needs of our customers and the user community. In addition to our open source work, we are developing products atop CloudStack to create a datacenter management platform.\nOur work involves deep knowledge of hypervisors, storage, and&#x2F;or networking. We are a polyglot environment with focus on Java and Python for CloudStack development. We plan to base our future products on a functional language such as Clojure, Erlang, or Elixir.\nOur team values collaboration, continuous improvement, and the Apache Way [2].<p>To apply for this position, please send email to jobs@shapeblue.com with the following:<p><pre><code>  - Cover Letter explaining your interest in the position\n  - Current resume (PDF preferred, Word accepted)\n  - Salary expectations\n  - Skype ID and&#x2F;or Github URL\n</code></pre>\nOur hiring process is composed of an introduction&#x2F;initial technical screen (~1hr) call followed by 2-3 technical meetings (1-1.5 hrs each) which allow you to meet everyone in Engineering.  Finally, we will check 3 professional references before extending an offer.<p>If you wish to ask questions about the role, please feel free to email jobs@shapeblue.com.\nPlease see our careers page [3] for a list of all available positions, as well as, a more in-depth description of this position.<p>[1]: <a href=\"http:&#x2F;&#x2F;cloudstack.apache.org\" rel=\"nofollow\">http:&#x2F;&#x2F;cloudstack.apache.org</a> \n[2]: <a href=\"http:&#x2F;&#x2F;theapacheway.com\" rel=\"nofollow\">http:&#x2F;&#x2F;theapacheway.com</a> \n[3]: <a href=\"http:&#x2F;&#x2F;www.shapeblue.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.shapeblue.com&#x2F;careers</a>","time":1462209256,"type":"comment"}