{"by":"caitlinspothero","id":11612079,"parent":11611867,"text":"SpotHero | Chicago, IL | <a href=\"http:&#x2F;&#x2F;spothero.com\" rel=\"nofollow\">http:&#x2F;&#x2F;spothero.com</a><p>SpotHero is changing parking, and our tools will redefine the transportation industry. With over a million cars parked, fast growth, and solid funding (<a href=\"https:&#x2F;&#x2F;angel.co&#x2F;spothero\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;spothero</a>), SpotHero offers countless ways to make an impact on the company and your career.<p>Senior Backend Engineer - <a href=\"http:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;124847\" rel=\"nofollow\">http:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;124847</a> As a member of our Backend team, you will be responsible for building all things related to the backend horsepower that powers our website, our API, and our native apps!<p>Software Engineer, Android - <a href=\"http:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;88317\" rel=\"nofollow\">http:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;88317</a> SpotHero is a mobile product. If you love building Android apps, you&#x27;ll love what we&#x27;ve got in store. We have an amazing Android app, that we&#x27;re looking to do a full ground up redesign on. So there is a lot of bluesky work in the very near future.<p>Software Engineer, iOS - <a href=\"http:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;88318\" rel=\"nofollow\">http:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;88318</a>\nWe’re looking for product-aware engineers who are thoughtful, responsible and passionate builders who appreciate user experience. We’re looking for someone who is not only well versed in iOS development, but also has a strong understanding of good UX and isn’t afraid to work hand-in-hand with our backend or design teams.<p>To apply, please email your resume to jobs@spothero.com. Include any github account, linkedin profile, and any project that you’re particularly proud of. We love seeing work that others loved working on.","time":1462202389,"type":"comment"}