{"by":"chrisbrookins","id":11612437,"parent":11611867,"text":"Java Engineer at Help Scout | REMOTE | Full-time<p>Apply at <a href=\"https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;234938\" rel=\"nofollow\">https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;234938</a>\nMore about our culture at <a href=\"http:&#x2F;&#x2F;helpscout.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;helpscout.com&#x2F;careers</a><p>The 22-person engineering team at Help Scout is dedicated to delivering a wonderful experience for our 6,000+ customers in more than 60 countries. This position requires senior-level skill and experience because we work remotely and mostly autonomously.<p>The ideal engineer for this position loves building RESTful APIs and other web services at scale. You relish the opportunity to take on a challenging problem, choose the right tool for the job and build an elegant, scalable solution. We leverage Solr for several tools at Help Scout and are looking for someone that can improve and maintain our implementation as we grow.<p>Tools We Use:<p>Java 8<p>Apache Solr, MySQL, MongoDB<p>Spring, Play frameworks<p>RabbitMQ<p>Git<p>Your first project involves working with another Java&#x2F;Solr engineer to build and own our Search and Reporting services. Solr runs all search functions, reporting, folder views and other areas of the product. On a daily basis, you&#x27;ll work on improving existing code, adding new functionality and API endpoints all with a focus on testing and documentation.  Your team will be responsible for handling large amounts of data within Solr and ensuring it can be searched&#x2F;delivered with optimal performance.<p>Aside from a bi-weekly planning and grooming meetings, you&#x27;ll be able to work interruption-free. 90% of our communication happens in Slack.   You&#x27;ll be working with product people that challenge you to get better every day. The founders are technical and committed to creating a magical experience for customers. You&#x27;ll deploy work that moves the needle for businesses around the world.<p>About You<p>You became an engineer because you like writing software that helps people.You have a history of working on Java projects at scale and can bring a high level of expertise to the business. Your code is not only a pleasure for customers to use, but for other engineers to read and understand easily. A big part of being great at your job revolves around being very organized and communicative. It’s clear from your experience that you have those characteristics.<p>Apply at <a href=\"https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;234938\" rel=\"nofollow\">https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;234938</a>","time":1462204129,"type":"comment"}