{"by":"wayfaringrob","id":11614342,"parent":11611867,"text":"Human API | Redwood City, CA &amp; Vancouver, BC | Full-time | ONSITE | <a href=\"http:&#x2F;&#x2F;humanapi.co&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;humanapi.co&#x2F;</a> | jobs@humanapi.co<p>== About us ===<p>We&#x27;re a small, product-centric team focused on opening the world of health data.  We&#x27;re solving a hard but interesting problem: health data exchange. We ingest health data from thousands of sources and transform that data into an API that developers can build apps on.  This allows thousands of developers to create apps that improve peoples&#x27; lives. Our investors include a16z, Eric Schmidt, Blue Run Ventures, Max Levchin, Scott Banister, and Alex Payne.<p>== What you will build ==<p>Human API is the easiest way to integrate health data from anywhere. Users can now securely share their health data with any application or system, regardless of how that data was recorded, processed or stored. As an engineer on our team, you’ll be involved in one or more of the following areas:<p><pre><code>  - Modeling clinical data: organizing and normalizing the world of health data\n  - Developing and scaling structured APIs\n  - Scaling our ingestion platform and optimizing a multivariate rate limited system\n  - Data engineering and building tools for data science - NLP and Classification\n  - Powering platforms and tools for customers to build health apps\n</code></pre>\n== Open roles ==<p>Most of our engineers have a diverse programming background (Javascript (Node.js) &#x2F; Scala &#x2F; Python &#x2F; Java &#x2F; C), and most roles require willingness to work on Node.js. However, we gravitate toward using the right tool for the job. Experience with some of the following is required:<p><pre><code>  - Stream processing and unified log systems with Kafka and RabbitMQ\n  - Mongodb, Redis and Cassandra for data storage\n  - Data analysis with Spark or Python tools\n  - Building and scaling a modern infrastructure stack with Docker and Mesos\n  - Building consumer focused apps and&#x2F;or developer focused tools\n  - Powering search with ElasticSearch and related tools\n  - Building a performant mobile UI using React\n</code></pre>\nYou can read more about some of the open roles here: <a href=\"http:&#x2F;&#x2F;humanapi.co&#x2F;company&#x2F;join\" rel=\"nofollow\">http:&#x2F;&#x2F;humanapi.co&#x2F;company&#x2F;join</a><p>We&#x27;d love to hear from you even if you don&#x27;t &quot;fit&quot; one of the job specs -- we hire for people, not roles.  If you&#x27;re interested, contact jobs@humanapi.co","time":1462215193,"type":"comment"}