{"by":"Ported","id":11612175,"parent":11611867,"text":"1x Devops &#x2F; Build Engineer, 1 x Full Stack Java C++ Developer| King.com | Stockholm, Sweden | Full-time | Onsite (Relocation offered)<p>Why King?<p>I&#x27;ll talk a bit about my experience, I joined King as a Java Developer 2 years ago and am now the Product Owner for the Platform team. Having worked at a few different companies in my career, from large Fortune 100s to small 5 person startups I can honestly say that King is far and above the best working environment I have experienced. Kings culture is fantastic for allowing technical people the space to get on and do great things and we genuinely believe in looking after our people. We value having a good work life balance (even by Swedish standards). Then there are all the small things that make a big difference - choosing your own hardware, company wide gatherings every 6 months to share knowledge and have a party, interesting training and coaching opportunities as well as being encouraged to attend conferences. More details at <a href=\"https:&#x2F;&#x2F;jobs.king.com&#x2F;benefits\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.king.com&#x2F;benefits</a>.<p>The best part for me though is the opportunity to work on applications at a massive scale, I will give some vanity numbers taken from last year... Our MySQL cluster processes 1.1 M queries per second, our Application Servers respond to ~ 660k RPC calls per second and we have over 100 M daily active users. We lean towards writing a lot of our features ourselves rather than using libraries, we do make use of Open Source and encourage people to contribute back to projects they use and Open Source internal projects whenever possible.<p>Joining us has nothing do with where you’re from, what you look like, your gender or what you wear. It’s all about your talent, your potential and what you can achieve with us. We are not looking for people who tick all the boxes in our adds, we want people with potential, the desire to learn and to write high quality code. You can send me your CV at greg.chrystall@king.com if you want to apply for either of these roles.<p>Read more about King and see our positions from all locations at <a href=\"https:&#x2F;&#x2F;jobs.king.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.king.com&#x2F;</a>.<p>I am recruiting for two roles on my team at the moment:<p>* DevOps &#x2F; Build Engineer *<p>We build a Java Backend which is deployed to many game clusters and package C++ libraries for the Game Teams, we need help with our builds, continuous integration, continuous delivery and working on automation with the Ops team. <a href=\"https:&#x2F;&#x2F;apply.king.com&#x2F;vacancy&#x2F;build-and-configuration-engineer-stockholm&#x2F;1054&#x2F;description&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;apply.king.com&#x2F;vacancy&#x2F;build-and-configuration-engin...</a><p>* Full Stack C++ &#x2F; Java Dev *<p>Working on the Platform team you will deliver systems that enable small game teams to ship a game to tens of millions of players with confidence. The focus will be on building simple, robust, highly scalable services. We are looking for someone who can work on the backend in Java as well as write the C++ APIs our game teams to access these feature from our players mobile devices.<p>If these roles sound interesting to you send your CV to me at greg.chrystall@king.com.","time":1462202787,"type":"comment"}