{"by":"jbaviat","id":11612978,"parent":11611867,"text":"Sqreen - <a href=\"https:&#x2F;&#x2F;www.sqreen.io\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sqreen.io</a> | Full-time Onsite developers | Engineering team in Paris (France)<p>Sqreen&#x27;s mission is to provide robust security layer to help developers protect their web applications against weaknesses. We develop solutions that combine instrumentation, defensive algorithms and machine learning. Our dashboard displays detailed information about the security of every sqreened application.<p>We are recruiting 10 new engineers to join our team to help porting Sqreen to all environments and ship our incoming products:<p>- C gurus with a strong PHP background (or the opposite !)<p>- Node experts, having written Node extensions in C&#x2F;C++ : LibUV, v8 API...<p>- Java experts, who like low level Java internals, such as bytecode manipulation.<p>We are obviously looking for great developers, and you don&#x27;t need to be a security nerd (even if at Sqreen, you will learn a lot about it). Therefore we also have a position for a Web security expert:<p>- Web hacker, with great knowledge of frameworks attacks and browsers defenses<p>Our code runs inside our customers&#x27; applications, which is a challenge for reliability and efficiency.<p>We have a cool and modern stack based on Docker, AWS, Mongo, Flask &amp; React, and we do full continuous integration. We are passionate, we love code, we attend and contribute to meet-ups and open source!<p>Sqreen is already live for Ruby on Rails applications, and it is securing dozens of high traffic applications.<p>You can find our job offers here: <a href=\"https:&#x2F;&#x2F;www.sqreen.io&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sqreen.io&#x2F;jobs&#x2F;</a><p>Email: jobs@sqreen.io<p><a href=\"http:&#x2F;&#x2F;techcrunch.com&#x2F;2016&#x2F;04&#x2F;29&#x2F;with-sqreen-web-developers-can-seamlessly-find-and-avoid-security-threats&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2016&#x2F;04&#x2F;29&#x2F;with-sqreen-web-developers-...</a>","time":1462207131,"type":"comment"}