{"by":"jamesrichardson","id":11626473,"parent":11611867,"text":"Cammy.com | Sydney, Australia | Onsite<p>Process is one telephone call and two onsite interviews.<p>At Cammy, we’re committed to using the latest technology to make the world a safer place for you, your family and your business.\nOur product is a simple and affordable security solution and general monitoring platform that allows you to keep an eye on your home, kids and pets, Cammy provides peace of mind wherever you are.\nIntegrated into your daily life through your mobile device, Cammy is a well funded Sydney based technology driven start-up. We’re currently 40(ish) software, marketing and operations people and we’re looking for one more to join us as a Devops&#x2F;Automation&#x2F;Tool builder.<p>You’re an accomplished Engineer, you love to tinker, to build stuff. You look at manual tasks as a chronic waste of time, you look around at available tools and try to break them, thinking all along that you could do a better job, if only you had the time.\nYou look at most “devops” think pieces and job ads requiring System Engineers that are also Puppeteers, Chefs and Docker wearers and think “they just don’t get it…” You genuinely see Devops as a philosophy, bringing together “ops”, “dev” and “test” into a single unified mentality - building great products!\nHere’s what we want and need to see from you to know you can do the role:<p>* You’re a Devops philosopher, ready to lambast anyone that maintains that just running Jenkins, Chef, Hudson etc. is devops.\n* You’re a tool builder, you love combining, testing out and if necessary building our new tools\n* You know your way around an API - how they work, what questions to ask and how to make sure they have a firm footing\n* You’ve built test automation solutions before, you know how to get the most out of automated testing, not just “I’ve used Selenium”\n* You’re a scripter (Former Developers would be awesome too!) - Python&#x2F;Ruby etc. but we won’t hold you to just those\n* You’re interested in being part of a wider team, we hold monthly tech talks internally, you’d be keen to contribute\n* You’re not a jerk<p>For more info, see the full advert here: <a href=\"https:&#x2F;&#x2F;cammy.workable.com&#x2F;j&#x2F;EE45302E94\" rel=\"nofollow\">https:&#x2F;&#x2F;cammy.workable.com&#x2F;j&#x2F;EE45302E94</a> or contact james (dot) richardson (at) cammy (dot) com","time":1462340692,"type":"comment"}