{"by":"caseyrabiea","id":11632337,"parent":11611867,"text":"The Trade Desk | Full Time, Onsite | San Jose CA, San Francisco CA, Aliso Viejo CA, Ventura CA, Boulder CO, New York NY, London UK, Sydney AUS<p>Hiring: All levels of fullstack software engineers, as well as fullstack engineers with a UI focus<p><i>You might be a great fit for The Trade Desk dev team if</i>:<p>* You are a full-stack SOA engineer &#x2F; generalist. Experience &#x2F; interest in working in a variety of layers and technologies within a SOA is a must for our team. This includes: AngularJS SPA development, MVC-based web architecture, external RESTful APIs, distributed (and in our case, highly scaled) request handling services, no-SQL and relational SQL databases, big data processing (e.g. data bus architecture, Hadoop &#x2F; MPP data warehouse, etc.), and data visualization (e.g. Tableau). Experience in all these layers is not strictly required, but we do like to see experience working in more than one, as well as eagerness to work on projects that might slice through them all.<p>* You have product-driven software development experience using a modern, object-oriented language. Memory-managed languages are best -- .e.g. C#, Java, Python, Ruby, etc. We do a lot of development in C#&#x2F;.NET, but specific experience here is not required.<p><i>Cool stuff about TTD</i>:<p>* Our platform processes 3million+ requests per second<p>* Work with the best engineers in the business<p>* Lunch catered<p>* Dog friendly offices<p>* We&#x27;ve grown faster than any other adtech company in the industry, and have been ranked as the 7th fastest growing company in North America on Deloitte&#x27;s 2015 Technology Fast 500<p>* Amazing Company Culture (5 star reviews on Glassdoor don&#x27;t lie)<p>* Unbeatable Benefits<p>If you want to learn more, email casey.rabiea@thetradedesk.com or apply directly on our website <a href=\"http:&#x2F;&#x2F;thetradedesk.com&#x2F;join-us\" rel=\"nofollow\">http:&#x2F;&#x2F;thetradedesk.com&#x2F;join-us</a>","time":1462399831,"type":"comment"}