{"by":"vfiles","id":11678319,"parent":11611867,"text":"VFILES • NYC • Full Time • ONSITE • Full-stack + iOS<p>VFILES is the hippest and foulest-mouthed unification of community, content, and commerce in the fashion world today. To spare you a longer, platitudinous spiel about the brand, here&#x27;s some things to read about us:<p>• Mashable: <a href=\"http:&#x2F;&#x2F;mashable.com&#x2F;2015&#x2F;09&#x2F;09&#x2F;vfiles-vogue-gen-z&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;mashable.com&#x2F;2015&#x2F;09&#x2F;09&#x2F;vfiles-vogue-gen-z&#x2F;</a><p>• High Snobiety: <a href=\"http:&#x2F;&#x2F;www.highsnobiety.com&#x2F;2016&#x2F;02&#x2F;11&#x2F;vfiles-fall-winter-2016-show&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.highsnobiety.com&#x2F;2016&#x2F;02&#x2F;11&#x2F;vfiles-fall-winter-20...</a><p>• Nylon: <a href=\"http:&#x2F;&#x2F;www.nylon.com&#x2F;articles&#x2F;how-vfiles-is-changing-fashion\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nylon.com&#x2F;articles&#x2F;how-vfiles-is-changing-fashion</a><p>• Page Six: <a href=\"http:&#x2F;&#x2F;pagesix.com&#x2F;2016&#x2F;05&#x2F;02&#x2F;soho-residents-annoyed-with-fashion-companys-wild-events&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;pagesix.com&#x2F;2016&#x2F;05&#x2F;02&#x2F;soho-residents-annoyed-with-fa...</a><p>We&#x27;re looking for<p>• an experienced iOS developer: Our app has been developed with Swift 2, targets iOS 9, and uses functional, modern programming techniques. Check it out in the app store.<p>• a full-stack engineer: Our application is a decoupled suite of Snap services serving an increasingly mature Angular frontend. You&#x27;ll not only get to work with Haskell every day, but also fun tools like Neo4j, ElasticSearch, and more. Engineers here always have the right to experiment with new techniques and technology to solve problems. Check it out at vfiles.com.<p>You&#x27;ll join a team of six engineers in a company of about twenty people amongst the editorial team, shop team, video production, etc. Everybody here is at the top of their game; it&#x27;s a very refreshing environment to work in, regardless of your interest or lack thereof in fashion and pop culture.<p>As for fringe benefits, we throw the best parties in town (hosted by A$AP Mob and crashed by Kendrick Lamar), have company trips to Montauk, organize Soul Cycle rides and boxing workouts with designers, models, and other personalities, and are invited to essentially everything that happens in New York.<p>You can write me directly at tamara ∀ vfiles ∘ com if you are interested in hearing more and coming in to meet us.<p>At this time we can only consider local applicants willing and legally able to work at our Soho offices without sponsorship.","time":1462994073,"type":"comment"}