{"by":"sumana25","id":11689331,"parent":11611867,"text":"Onsite|Permanent Position |Oslo, (Norway)\nSoftware Engineer, Analytics, Data Insights - Telenor Digital AS<p>Are you an experienced software developer with a passion for data analytics?\nDo you want to participate in a team with a key role in our game changing strategic transformation to becoming a digital service provider? Do you want to bring to life your passion for Big Data in a truly agile and international environment?<p>Our challenge\nTelenor is a large international company, spanning 13 countries and with our 200M+ customers, we are experiencing an exploding increase in real-time digital data – especially in Asia. We are now building a data lake in AWS that will ingest, process and govern all of this data. How do we map the customer across various feeds down to specific use cases in the most optimal way?<p>Who do we think we need?\nWe, the Data Insights team at Telenor Digital, want a strong team player with a passion for high quality code, who easily communicates both with the other team members and with our customers. In our team, we combine an ambitious pride of workmanship with a humble attitude, and we want you who believes you bring these qualities to the table.<p>Professional qualification:\n• Strong front end developer skills. HTML, CSS, and Javascript, with knowledge of d3.js or other charting libraries. Clojurescript is a plus.\n• You have worked with various programming languages, like Java, Clojure, or Python.\n• Experience with some SQL database, preferably PostgreSQL.\n• Experience with Cloud Computing, specially with AWS.\n• Deep foundation in computer science; data structures, algorithms and programming languages, as well as networking and concurrency.\n• Exposure to architectural patterns of a large, high-scale web application\n• Effective in a Linux terminal (shell scripting, configuration files, etc.).\n• You enjoy automating things and building systems.\n• Continuous Integration and Delivery is important to you, and writing tests a given.<p>Why should you join us?\n• You will be part of a rapidly growing young team, where the role will highly depend on you.\n• You will get to work in an agile, autonomous and self-organizing environment, because nothing is constant when we look at the future.\n• You get to work with modern tools and infrastructure\n• You get to choose your own dev machine and which tools to run on them. We mostly use Macs, but it’s up to you. You pick out the phone you want.\n• You get to work in several markets across Europe and Asia with different consumer needs and market dynamics<p>Application Link -<a href=\"http:&#x2F;&#x2F;tinyurl.com&#x2F;h4rwjxw\" rel=\"nofollow\">http:&#x2F;&#x2F;tinyurl.com&#x2F;h4rwjxw</a>","time":1463129045,"type":"comment"}