{"by":"sumana25","id":11689306,"parent":11611867,"text":"Onsite|Permanent Position |Oslo, (Norway)\nData Engineer, Data Insights - Telenor Digital AS<p>Are you an experienced data engineer who loves to swim in the data lake?\n​​Do you want to participate in a team with a key role in our game changing strategic transformation to becoming a digital service provider? Do you want to bring to life your passion for Big Data in a truly agile and international environment?<p>Our challenge\nTelenor is a large international company, spanning 13 countries and with our 200M+ customers, we are experiencing an exploding increase in real-time digital data – especially in Asia. We are now building a data lake in AWS that will ingest, process and govern all of this data and want to add two more great people on our team to contribute to this growing task.<p>Who do we think we need?\nWe want a strong team player with a passion for high quality code, who easily communicates both with the other team members and with our customers. In our team, we combine an ambitious pride of workmanship with a humble attitude, and we want you who believes you bring these qualities to the table.<p>What we think you need to succeed\n• You know Java, and possibly Clojure or Scala.\n• Effective in a Linux terminal (shell scripting, configuration files, etc.)\n• Experience with some SQL database, preferably PostgreSQL.\n• Streaming technologies, especially Apache Kafka.\n• Event processing, ideally experience with Apache Spark.\n• Knowledge about Elasticsearch.\n• Enjoy automating things and building systems.\n• Machine learning experience is a plus.\n• Continuous Integration and Delivery is important to you, and writing tests a given.\n• You are humble and passionate. You like to listen and can understand the viewpoints of others and strive to be a good dialog partner, but you can focus on delivery once a direction is decided.<p>Why should you work with us?\nYou will be part of a rapidly growing team, where the role will highly depend on you. You will get to work in an agile, autonomous and self-organizing environment, because nothing is constant when we look at the future - but the data architecture needs to be future proof. That is why we need exactly you!<p>Application Link - <a href=\"http:&#x2F;&#x2F;tinyurl.com&#x2F;zhbzdg6\" rel=\"nofollow\">http:&#x2F;&#x2F;tinyurl.com&#x2F;zhbzdg6</a>","time":1463128265,"type":"comment"}