{"by":"jtheory","id":10824733,"parent":10822019,"text":"Patients Know Best, REMOTE-only. Full-time, with occasional exceptions. Working hours: within a few hours of GMT (current IRL span: Costa Rica to Bangalore).<p>See my other posts for more depth on work-life balance (&amp; hiring working parents = many of us), building something that improves life&#x2F;health, our culture (collaboration and good communication, not competition).<p>Superb communication skills required -- we all need to be highly articulate, clear, and at ease talking through complicated concepts with each other (skills talking with strangers: useful, but not an everyday requirement).  Sometimes remote work tools are (nearly) flawless, but with some bad luck you might be explaining something complicated over a choppy connection with a 4-second delay and a marching band in the background.<p>If you&#x27;re interested in PKB&#x27;s growth, funding, profitability, contracts, etc., ask -- our CEO is also active on HN. Or Google us. I&#x27;m in the CTO role.<p>Current positions we&#x27;re filling (continuously):<p>- Mobile developer: existing apps with Steroids(better Cordova, basically), OAuth2, JSON, REST. Later this year: helping choose tech for our next-gen apps.<p>- Mid-level to senior full-stack devs: Java expertise required. Of interest &#x2F; stuff we&#x27;re using: migrating bit by bit from J2E (JBoss&#x2F;Hibernate, Tomcat&#x2F;Spring&#x2F;Struts) to simple microservices (DropWizard&#x2F;SpringBoot) -- experience on either side of this migration is useful. TeamCity, Artifactory, Docker, Vagrant (dev environment), Selenium-based integration testing. CentOS, PostgreSQL (should be comfortable with native SQL), Hadoop DFS (just adding in now...). Crypto at various levels (&quot;using it carefully&quot;, not &quot;inventing it&quot;). REST and SOAP&#x2F;HL7 APIs. This isn&#x27;t a checklist; we like partial overlaps in particular if you&#x27;ve worked with tools&#x2F;ideas we&#x27;re not yet using (but maybe should).<p>- Product manager: technical background (not just mgmt), startup mindset (look ahead, self-prioritize, adapt fast). Gather the best ideas from customers &amp; us, and help us guide projects through to completion. Bonus points: good grasp of healthcare and mobile apps.<p>Bonus points (all positions) for significant experience in the medical world (as an intelligent patient counts!), as well as some history building things from scratch.<p>More details (and to submit an application): <a href=\"https:&#x2F;&#x2F;www.patientsknowbest.com&#x2F;careers.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.patientsknowbest.com&#x2F;careers.html</a><p>Note that at present my record for active communication with people applying isn&#x27;t great. :|  We&#x27;ve recently switched to Workable and I&#x27;m sharing out this work so it&#x27;s not purely reliant on bits of time I can claw out of an over-full schedule!  If you&#x27;ve already applied, no need to re-submit; we haven&#x27;t lost anything.","time":1451703315,"type":"comment"}