{"by":"kjbekkelund","id":10822033,"kids":[10879994],"parent":10822019,"text":"Elastic (<a href=\"http:&#x2F;&#x2F;elastic.co\" rel=\"nofollow\">http:&#x2F;&#x2F;elastic.co</a>) • ONSITE &amp; REMOTE (Anywhere) • Front-end Developer • Full-time<p>Elastic, the company behind Elasticsearch and Kibana, is hiring.<p>We&#x27;re looking for front-end developers to work on Found, our Elasticsearch-as-a-service product offering. Today, Found runs primarily in public cloud environments like AWS, allowing customers to provision and scale Elastic clusters in a turnkey fashion. We also plan to bring this same simplicity of deployment and automation to customers who want to run and manage multiple Elastic clusters on-premise (in their own data centers). You will be contributing significantly to both initiatives.<p>To get there we need more developers with strong JavaScript skills, but we definitely prefer developers who also have other strong front-end development skills. Maybe security, design, UX, CSS, functional programming, testing, or something else?<p>This is an early role on a fast-growing team, so you&#x27;ll have a lot of impact from day 1. We&#x27;re a very remote team with developers in Australia, Poland, Norway, Denmark, Panama and several locations in the US.<p>We need someone to help innovate, lead and contribute to the front-end and user experience of our Elasticsearch-as-a-Service offering. You will also be integral in shaping the products we build, not just implementing specs.<p>Check out <a href=\"https:&#x2F;&#x2F;www.elastic.co&#x2F;about&#x2F;careers&#x2F;engineering&#x2F;javascript-engineer-found&#x2F;dT2u9oOSar5zktdG1ZS6tF\" rel=\"nofollow\">https:&#x2F;&#x2F;www.elastic.co&#x2F;about&#x2F;careers&#x2F;engineering&#x2F;javascript-...</a> for more info.<p>Additional information<p>- Extremely competitive pay<p>- Stock options<p>- An environment in which you can balance great work with a great life<p>- Passionate people building great products<p>- Employees with a wide variety of interests<p>- Your age is only a number. It doesn&#x27;t matter if you&#x27;re just out of college or your children are; we need you for what you can do.<p>- Distributed-first company with employees in over 23 countries, spread across 18 time zones, and speaking over 30 languages! Some even fly south for the winter :)<p>We&#x27;re also hiring several other positions: <a href=\"https:&#x2F;&#x2F;www.elastic.co&#x2F;about&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.elastic.co&#x2F;about&#x2F;careers&#x2F;</a>","time":1451660674,"type":"comment"}