{"by":"davi","id":10823017,"kids":[10823108],"parent":10822019,"text":"Bock lab, Janelia research campus, Howard Hughes Medical Institute (HHMI) | Ashburn, VA | ONSITE<p>Data scientist &#x2F; Neurogeometer<p>We recently finished acquiring an electron microscopy dataset encompassing the entire brain of a fruitfly (120 million images, 115 TB on disk, voxel size 4 x 4 x 40 nanometers). A team of tracers is manually skeletonizing portions of this animal&#x27;s nervous system, and we are starting to see interesting circuit motifs emerge.<p>We are looking for someone to help build and use tools supporting this analysis (neurogeometry), as well as help wrangle the millions of images  continuing to flow from our three microscopes (~500 TB of primary image data anticipated in the next two years). During this time we expect to switch from RAID-based file systems to an object store (likely Scality), with substantial support from a team at Janelia outside the lab.<p>Desirable attributes:<p>- Education: B.S. or M.S. in Computer Science or related field (or an equivalent in education and experience)<p>- Strong familiarity with Linux, including command line wizardry and detangling dependency nightmares<p>- Proficient in Python and at least one other programming language (e.g Java or C&#x2F;C++)<p>- Experience with utilizing SQL and&#x2F;or NoSQL data stores (e.g. MongoDB, PostgreSQL, Microsoft SQL Server)<p>- Experience with image processing (ImageJ, SciPy, Matlab, OpenCV, etc.)<p>- Comfortable working with new programming languages and tools when necessary<p>- Familiar with RESTful web services<p>- Experience using an HPC cluster (MPI, SGE&#x2F;OGE, Spark, etc.)<p>- Follows current trends in industry and academia<p>- Willing to get hands dirty with hardware<p>- Ability to concentrate in a fast paced and dynamic environment<p>- Ability to communicate effectively, orally and in writing<p>- Ability to take initiative, prioritize tasks, use good judgement and monitor completion of assigned duties.<p>- Experience or strong interest in working in an interdisciplinary environment.","time":1451677035,"type":"comment"}