{"by":"connor","id":10823155,"parent":10822019,"text":"Notable Labs (YC W15) | <a href=\"https:&#x2F;&#x2F;notablelabs.com\" rel=\"nofollow\">https:&#x2F;&#x2F;notablelabs.com</a> | San Francisco, CA | Full Time | Onsite<p>Changing the way cancer is treated is our personal mission, which starts with putting patients first. We’ve developed an individualized laboratory testing service for cancer patients and their doctors. We screen thousands of FDA-approved drugs against the patients own cancer cells to identify drug\ncombinations that can be immediately prescribed by their doctor without a clinical trial. By repositioning treatment as a patient-centered service we can unlock the power of modern data science and laboratory automation to achieve the promise of combination therapy and personalized medicine.<p>== Looking for ==<p>Fullstack engineer<p>Help build out the stack powering our robotic lab. You&#x27;d join as the third engineer and would own the frontend dashboards and related API&#x27;s.<p>The day to day work would involve designing web apps with the science team for use in the lab and then building out the frontend code and backend API&#x27;s. Beyond the core infrastructure, you&#x27;d have the freedom to explore new areas where we need help such as machine learning, robotic automation, and data visualization.  Experience with Ruby&#x2F;Python, Angular&#x2F;Backbone&#x2F;React, Grunt&#x2F;Gulp, API design a plus.<p>Data Scientist<p>Use machine learning to help us decide which drug combinations to test for a patient.  Even with automation, we&#x27;re only able to test less than 5% of the combination space.  You would work with the science team to design the features and then would work with the engineering team to put the model into production.  Experience with bioinformatics, machine learning, Python, R, API design, and nosql products a plus.<p>== Tech Stack ==<p>Ruby&#x2F;Rails for automation API&#x27;s, Angularjs frontend, Python for data analysis, AWS and with Chef<p>== Contact ==<p>Apply at <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;notablelabs\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;notablelabs</a>, mention Hacker News","time":1451679002,"type":"comment"}