{"by":"mkrn","dead":true,"id":10822829,"parent":10822019,"text":"MethodExists | Calgary, AB | Full-time | REMOTE | Backend developer with great SQL &#x2F; Postgres experience<p>We are a Canadian company based in Calgary, but completely Remote, with developers all over the world. We are developing a universal web-based platform that can be customized for any industry. It is structured to allow non-technical people to edit everything from data model to forms and workflows and visualizations.<p>Some of the problems we&#x27;re tackling: \n- universal and safe formula language that&#x27;s easier than Excel&#x27;s.\n- spinning up new sites instantly and allowing them to be hosted behind corporate firewalls\n- visual form and report editors \n- allowing business analysts to change data model live with zero downtime migrations<p>Some technologies we are using to achieve this:\n- Javascript, node.js, React, D3.js, Leaflet\n- Docker, Rancher\n- Postgres, Redis, RabbitMQ<p>We are using Phabricator for project management, planning and code reviews.  Communication happens through Slack and Google Hangouts. You should have an adequate intersection with UTC-7 and remote work experience!  English is the language of communication, and quality communication is highly important. We write unit tests, lint, and continuously integrate with TeamCity. We are using all the best tools and philosophies to write high-quality code and automate and monitor delivery.<p>As we are Remote we do meet up from time to time, last time we met up to surf and hack in the Dominican Republic.  Hired candidates will need to travel to meet teammates.<p>Your job will be writing backend APIs and coming up with the best SQL queries. You should know your database inside out, we are talking about automated migrations and deep schema analysis.  You should also have a good idea about proper configuration, security and monitoring of the db cluster.<p>We offer a paid trial to prospective candidates, which are about deep immersion with the team, working completely integrated in the process. Your code will be reviewed by team-mates just like everyone else&#x27;s does every time. This is about ensuring a good fit with team members and good productivity and understanding of our philosophy.<p>Please write to us and sell us on why you’re the right candidate.  We don’t enforce a certain way of applying like CVs, so communicate in the way that best describes your value.<p>jobs@methodexists.com","time":1451674541,"type":"comment"}