{"by":"jamalex","id":10824515,"parent":10822019,"text":"Learning Equality - <a href=\"https:&#x2F;&#x2F;learningequality.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;</a> - San Diego, CA -- Onsite | Full-time<p>Who we are<p>========<p>We’re a small nonprofit committed to bringing the online education revolution to the 60% of the world without Internet. We started 3 years ago with KA Lite (<a href=\"https:&#x2F;&#x2F;learningequality.org&#x2F;ka-lite&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;ka-lite&#x2F;</a>), an offline-installable platform bundling Khan Academy content and our own student tracking tools in an easy to install bundle. KA Lite has already reached over 2.1 million learners in 160+ countries.<p>We’re now starting to work on our next-gen offline ed-tech platform, Kolibri (<a href=\"https:&#x2F;&#x2F;learningequality.org&#x2F;kolibri&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;kolibri&#x2F;</a>), which aims to incorporate not only a wider set of content from partners, with alignment to local standards, but also allow anyone to create their own videos and exercises to meet the needs of their local context.<p>Positions<p>======<p>Full-stack Web Developer -- You will need to have some experience doing full-stack web development -- the specific stack we use is Javascript, Backbone.js, jQuery, HTML, CSS&#x2F;LESS , Python and Django. We’re designing Kolibri as a small core app with the majority of user-facing features implemented as plugins. As an initial project, you’ll be working on creating a plugin that ports one of KA Lite’s features into Kolibri.<p>Executive Assistant&#x2F;Office Manager -- You will have two roles - As “Executive Assistant”, you will be responsible for supporting core team members with communications, planning, drafting, and research. As “Office Manager”, you’ll be responsible for making sure the office runs smoothly, including handling mail, ordering supplies, organizing events and so forth. This is a combined role, with the exact job title and focus areas negotiable based on skills and interests.<p>Benefits<p>======<p>- Salary at the same levels as other core team members<p>- Retirement plan with matching employer contributions<p>- Health care + dental insurance<p>- Flexible and generous vacation policy<p>- Working in sunny San Diego<p>Read more and apply at: <a href=\"https:&#x2F;&#x2F;learningequality.org&#x2F;about&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;about&#x2F;jobs&#x2F;</a>","time":1451698601,"type":"comment"}