{"by":"charlesweitzer","id":10838867,"parent":10822019,"text":"Voleon | www.Voleon.com | Berkeley, CA | Senior Machine Learning Researcher - Quantitative Hedge Fund<p>The Voleon Group is a technology-driven investment firm employing cutting-edge statistical machine learning techniques. We are looking for an exceptional researcher.<p>We are a science-driven systematic trading firm, built on the principle that statistical machine learning provides the best solutions to the scientific problems we must solve.<p>We are looking for a PhD-level scientist to join us in developing predictive models and other components of automated trading systems. You will apply modern statistical machine-learning methods to large, high-dimensional data sets. The work will range from data preparation to model development to production software implementation.<p>We are successful and growing. Willingness to take initiative, and a gritty determination to productize, are essential.<p>We hire on the basis of exceptional talent. If you excel in a technical field such as statistics, mathematics, computer science, engineering, or operations research, then we encourage you to contact us.<p>The following criteria, while not all requirements, illustrate the demands of this role: + Background in modern statistical methods &#x2F; machine learning<p>+ Evidence of strong mathematical abilities, e.g. publication record, graduate coursework, or competition placement<p>+ Substantial programming experience and interest in software development techniques<p>+ Competence in solving large-scale computing problems<p>+ Track record as an applied researcher<p>+ Demonstrable clarity of thought (not optional)<p>Interest in financial applications is essential, but experience in finance is not a primary factor in our hiring.<p>Benefits and compensation are highly competitive.<p>The above job description is just a starting point in terms of possible duties and seniority. We can be very flexible for the right person.<p>Email CV&#x2F;request for more info to Charles@Voleon.com","time":1451943543,"type":"comment"}