{"by":"planteen","id":10844043,"kids":[10846260],"parent":10822019,"text":"Blue Canyon Technologies | Boulder, Colorado (ONSITE) | <a href=\"http:&#x2F;&#x2F;bluecanyontech.com\" rel=\"nofollow\">http:&#x2F;&#x2F;bluecanyontech.com</a> | FULL-TIME<p><a href=\"http:&#x2F;&#x2F;bluecanyontech.com&#x2F;company&#x2F;#careers\" rel=\"nofollow\">http:&#x2F;&#x2F;bluecanyontech.com&#x2F;company&#x2F;#careers</a><p>Aerospace Software Engineer<p>Blue Canyon Technologies is a small business specializing in spacecraft component and systems design and development. Our current product portfolio ranges from Star Trackers and Reaction Wheels, to complete spacecraft guidance, navigation and control systems to entire spacecraft systems. The BCT development team has experience designing and building spacecraft for DOD, NASA, and commercial aerospace organizations, including the design, development, test and operations of more than 20 diverse systems currently in operation and providing reliable service for our country and the world.<p>Blue Canyon Technologies is looking for a Software Engineer. This Engineer would be working in a team environment, sometimes with remote team members, engaging in full life-cycle development (plan, design, verify, certify) of embedded software for operation and control of a variety of spacecraft components and subsystems. Development work will span Matlab, autocoding, programming in C, FPGA interfaces, and verification using aerospace standard approaches.<p>Required Qualifications:<p>* Experience with all phases of the software lifecycle (design, implementation, testing, and support)\n* Software used production&#x2F;in the field by a customer is a must<p>* Working knowledge of formal software development practices<p>* Version control, coding standards, naming conventions, build&#x2F;release procedures, and code reviews by peers<p>* Understanding of how to write concurrent software correctly and reliably<p>* Well-versed in the C programming language<p>* Embedded software experience writing device drivers to interface with hardware<p>* Experience interfacing to custom hardware (e.g. FPGAs, ASICs, CPLDs) is a plus<p>* Ability to debug if a problem is being caused by hardware or software<p>* Good documentation and communication skills<p>Desired Qualifications:<p>* Experience with network programming, especially TCP&#x2F;IP and&#x2F;or security<p>* Experience with operating system concepts, especially RTOS and&#x2F;or Linux<p>* Experience with shell scripts (Bash), MATLAB, Simulink, and&#x2F;or Ruby<p>* Exposure (job, class project, internship) to spacecraft and&#x2F;or ground stations<p>* Exposure to software defined radios, such as GNU Radio<p>* Strong understanding of quality software development processes","time":1452011069,"type":"comment"}