{"by":"xly","id":10855480,"parent":10822019,"text":"Mattr | <a href=\"http:&#x2F;&#x2F;mattr.co\" rel=\"nofollow\">http:&#x2F;&#x2F;mattr.co</a> | Austin, TX | Full Time | REMOTE or ONSITE<p>Mattr is a Social Analytics and Influencer Marketing startup located in Austin, Texas. Mattr provides a rich and colorful picture of a brand’s social media audience—who’s influential, what influences them, and how to engage on a personal level by uncovering values and intent.<p>We are seeking a mid&#x2F;senior level Ruby on Rails Developer with a get-it-done attitude to join our small team of developers. We work a flexible schedule and like to get things done without worrying about too much red tape.  We embrace new technologies and like to work with people who are passionate about their craft. We place an emphasis on open collaboration and ownership.<p>MINIMUM REQUIREMENTS:<p>* Proven working experience in developing applications with Ruby on Rails.<p>* Proficient with documenting, debugging and testing Ruby on Rails applications (unit&#x2F;integration tests)<p>* Solid understanding of MySQL database structuring and optimization. Elasticsearch experience is a plus.<p>* Ability to work within an existing, large codebase<p>* Thorough understanding of version control using Git<p>* Experienced with OSX, Vagrant, Linux and efficient working within the command line and rails console<p>* An understanding of AWS (EC2, S3, etc.) and Amazon web frameworks is a plus<p>* Self-motivation and the ability to quickly catch on to new concepts<p>* Excellent communication skills and able to work within a small team setting.<p>* Experience working within an Agile environment.<p>* Reliable internet connection and availability during standard company hours<p>BENEFITS:<p>* Flexible hours<p>* Full benefits package including health, dental, vision, life insurance and 401k<p>* 4 Weeks vacation (5 weeks after first year)<p>* Stock Options<p>* Company provided cell phone and Macbook Pro<p>* Company sponsored training resources and travel to conferences of your choice<p>If interested, contact us at careers@mattr.co and please include your resume, work samples, and salary requirements. Recruiters - Do not contact us.","time":1452132153,"type":"comment"}