{"by":"chrisbrookins","id":10899157,"parent":10822019,"text":"REMOTE<p>Java Software Engineer - Help Scout - <a href=\"http:&#x2F;&#x2F;www.helpscout.net&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.helpscout.net&#x2F;careers&#x2F;</a>\nTo Apply: <a href=\"https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;185336\" rel=\"nofollow\">https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;185336</a><p>The 18-person engineering team at Help Scout is full of people dedicated to a wonderful experience for our 5,000+ customers in more than 60 countries. We work remotely and autonomously for the most part, which is why this position requires senior-level skill and experience.<p>The ideal engineer for this position loves building RESTful APIs and other web services at scale. You relish the opportunity to take on a challenging problem, choose the right tool for the job and build an elegant, scalable solution.<p>Tools We Use:\nJava 8\nPlay framework\nMySQL, MongoDB, Solr\nRabbitMQ\nGit<p>About the Role:\nYou will be working with another Java engineer to own the back end API and presentation of our Docs Knowledge Base product. On a daily basis, you&#x27;ll work on improving existing code, adding new functionality and API endpoints all with a focus on testing and documentation.<p>REQUIREMENTS\nYou became an engineer because you like writing software that helps people.\nYou have a history of working on Java projects at scale and can bring a high level of expertise to the business.\nYour code is not only a pleasure for customers to use, but for other engineers to read and understand easily.\nA big part of being great at your job revolves around being very organized and communicative. It’s clear from your experience that you have those characteristics.<p>About Us:\nHelp Scout is a remote team with employees in twenty-three cities all around the world. We optimize the team for excellence over geography and overcome remote challenges through transparency, trust, and video conferencing.<p>To Apply: Go to <a href=\"https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;185336\" rel=\"nofollow\">https:&#x2F;&#x2F;help-scout.workable.com&#x2F;jobs&#x2F;185336</a>","time":1452736825,"type":"comment"}