{"by":"maimden","id":10906325,"parent":10822019,"text":"Cityami | New York, NY | Will support visa | Partial remote OK (we all like to travel a lot)<p><pre><code>  **********************\n  === About Cityami ===\n  **********************\n</code></pre>\nCityami is a home sharing concierge. We are an integral part of the home sharing economy.  Across the globe, people are finding the best way to travel is to rent their home out on Airbnb, VRBO, etc. while they’re away. We’re here to make that happen for them, without all the hassle. We not only handle the essentials like guest check-in, check-out, and emergency care - we also serve as their guest’s local guide, offering an insider’s view to the city and an experience they’ll continue to share!<p><pre><code>  ******************\n  === The Role ===\n  ******************\n</code></pre>\nCityami is looking for a strong CTO to come on as co-founder, helping to own and implement the technical vision of the company. We&#x27;ve come a long way using our current MVP, but with your help are ready to scale and grow. A good fit for the role will have hands-on experience building large, complex web applications. This means you know your way around a browser and have 5+ years working with JavaScript, HTML, CSS, and a backend language like Node, Python, Ruby, or Java. DevOps experience is a huge plus too, though not required if you are at least handy with Heroku or a similar platform.<p><pre><code>  ***********************\n  === What You&#x27;ll Do ===\n  ***********************\n</code></pre>\nYou’ll be helping refine and implement the technical vision of the company. That means building an enterprise scale, responsive web application that can handle increasing amounts of traffic in different regions of the country and eventually world. As long as it meets our business requirements, the software stack will be the product of your imagination, which means you’ll get to use the tech you love to help build a business everyone will love.<p><pre><code>  ************\n  === You ===\n  ************\n</code></pre>\nYou’re a tech-savvy entrepreneur at heart and ready to take some risks for big rewards. Cityami is a new business, starting to make its way in New York City (and preparing to expand beyond), but we need your help to reach our full potential. The sky’s the limit, but you&#x27;ll have to be willing to fly. If you want a stable job where you do the same thing everyday, look elsewhere. This is about thinking big and building something new and needed in the hospitality industry.<p><pre><code>  ************************\n  === What You&#x27;ll Get ===\n  ************************\n</code></pre>\nWe’re looking for risk-takers, which means you’ll have to take a risk. By joining Cityami at this stage, you’ll be on the ground floor of a new business that intends on growing fast. You’ll get a founder’s share of equity in the business as your compensation, and the opportunity to forge a lucrative destiny as your reward.<p>Apply =====&gt;&gt;&gt;&gt;&gt; www.cityami.com&#x2F;cto<p>.. or send an email to michelle@cityami.com","time":1452820279,"type":"comment"}