{"by":"jot","id":4857857,"parent":4857714,"text":"UK, London £40,000 - £60,000 CTO / Lead Developer<p>You’re a Python, Ruby or PHP web developer, and you’re bored of hearing about photo-sharing apps. You’ve always imagined putting your skills to use and making a real difference to the world.<p>Marblar needs your skills, and we want to put them to excellent use supporting over 10,000 scientists around the world already bringing about the next scientific revolution.<p>Here’s how Marblar is different to most other startups vying for your interest:<p>- We’ve launched (and even had a little TechCrunch coverage to boot)<p>- We’ve been revenue positive since day 1<p>- We’ve now got the backing of some investors who wants us to succeed not just for the money they’ll make, but because they love science as much as we do<p>- We already have a tonne of users using our product, and we’re learning from them every day<p>- We have several customers - from top Universities, to top tier law firms to learned scientific societies.<p>- We’ve got the hustle and we need your tech skills to match it.<p>Our team is made up of PhD students from a range of scientific disciplines, but don’t let that put you off. Our less academic advisors tell us their IQ levels jump a few notches after spending a day with us, but we know our limitations and we want you to join us as our web technology expert.<p>Your role will be to help us learn even more from our users and devise and implement solutions to their problems that can be iterated fast. We love making decisions on data, and we believe everything is an experiment.<p>Please e-mail hello@marblar.com with the subject “Look at my marbles”. No need for a CV if you don't have one, just give us some links to examples of your work and tell us why you'd like to work with us.<p>Salary: £40,000 - 60,000 based on experience + meaningful equity.<p>Benefits: Your choice of hardware and a generous training budget.<p>Find out more about what we do at <a href=\"http://marblar.com\" rel=\"nofollow\">http://marblar.com</a>","time":1354375733,"type":"comment"}