{"by":"witten","id":4858663,"parent":4857714,"text":"EnergySavvy - Seattle, WA<p>EnergySavvy is looking to add to an amazing development team working with cutting-edge, modern technologies. Do you love working on challenging software implementation problems? Do you spend your free-time learning new programming languages and contributing to open-source projects? If so, you'll thrive in EnergySavvy's quick-paced, collaborative atmosphere.<p>We're a small but rapidly growing software company with the mission of transforming how energy efficiency is delivered by combining user experience and software technology to deliver software-as-a-service solutions our customers and users love. Our software helps people make their houses more energy efficient, addressing a major source of energy waste in this country that impacts our energy independence and contribution to global climate change.<p>As a software engineer at EnergySavvy, you'll work with Django, Python, jQuery, nginx and  PostgreSQL, and deploy your creations early and often to live customers.<p>Requirements:<p>* You're passionate about learning web technologies, and have experience with modern engineering techniques (Mercurial/Git, staging, continuous integration, etc)<p>* You have a Computer Science degree or equivalent with a strong foundation in data structures and algorithms<p>* You have programming experience in one or more of C/C++, Python, Ruby, Javascript, C#/Java<p>About EnergySavvy<p>EnergySavvy is a Seattle-based software company focused on energy efficiency. EnergySavvy's flagship product, Optix, is an energy efficiency management system that helps utilities achieve their cost-effective savings goals. Optix drives program success by engaging customers, streamlining stakeholder interactions and providing real-time analytics.<p>We have a great team, wonderful customers, supportive investors, and we are growing quickly in a massive and important space. We are an investor-funded company with real customers, real revenues and a reality-based plan to scale. Learn more about EnergySavvy's company and culture.","time":1354389584,"type":"comment"}