{"by":"salsf","id":4858169,"parent":4857714,"text":"San Francisco, CA │ ePantry │ Founding Engineer<p>We launched in August and were seeded behind a vision of making it easier for busy people to be responsible in how they buy household products.  Highlights below:<p>*  Customer Problem: People want to buy (and not run out of) “the right” household products, but busy people don’t want to put time into finding sustainable toilet paper<p>*  What We Do: “Dollar Shave Club” for name-brand, “green” household consumables ($24+bn TAM), with an emphasis on flexibility and customer service<p>*  Customer Value Proposition: 5 min registration = A) never run out of TP, B) never overpay, C) always get products good for people &#38; the earth<p>*  Customer Archetype: ~35 y/o female, kids, busy; “green,” but SUV; Whole Foods, but 365 (private label); iPhone, but not techy; Gilt often, but Gucci rarely<p>*  Our Challenge: Create the most convenient platform in the world for a set of household products with unique purchasing patterns (not a shopping cart site…)<p>*  Competition: Selling a niche product better than Amazon has a surprising track record.  e.g. Alice, Dollar Shave Club, Manpacks, Quidsi, Zappos<p>*  Traction: Initial revenue in November through an offline product version.  Backlog for &#62;$150,000 run rate bookings through offline version in first 45 days of availability (by mid-Jan).<p>*  Full Time Team: Stu (Biz/PM): Advisor &#38; raised &#62;$2m @ 4 start-ups, &#62;$100m invested in tech, employee #2 twice; Jordan (Mktg): Goodby, Doritos, TD Ameritrade<p>*  Seeders : The entrepreneurs behind companies like Hotwire, CitySearch, Friendster, Cater2.me, Everfi, Vincraft, Augusta Columbia, and Toro IP<p>*  Stage: Funded. Prototype of product being tested compulsively now to acquire alpha users.  Lean startup methodology.<p>*  Founding Engineer: A fully empowered co-founder with strong opinions, understanding of lean &#38; MVP tradeoffs, full stack ownership, and a long term vision<p>*  What You Get: Competitive cash, generous equity, full benefits, flexible/fun environment, passionate team, leave the world better than you found it<p>I would love to grab a coffee/beer and brainstorm about the challenges/opportunities ahead.  sl@epantry.com","time":1354380452,"type":"comment"}