{"by":"connoryikes","id":4858289,"parent":4857714,"text":"Yikes Corp  ||  Tokyo, Japan /  San Francisco  /  Geoflexible  ||  CTO<p>Yikes is a social media content creation company. Businesses need daily text content for their Facebook pages, Twitter feeds, and blogs. We create that content at scale, hassle-free. Our customers are some of the largest ad agencies and brands in the world. We’re growing quickly and so far have managed to finance our own growth with our profits, but we’re looking to fundraise soon.<p>There are 2 people on the core team, and we coordinate a team of freelance writers who create all the content which we then sell to our customers. At the moment we’re doing this all by hand, and we need a generalist-type full-stack engineer to give our company some much-needed tech muscle.<p>The thing we need short-term is a web application which allows for content (text + links + images) to be input by our employees and passed through a workflow chain which ends at our customers. The thing we need long-term is a mechanism which allows our customers to be intelligently paired up with employees who would be a good fit for them- and also uses analytics from Facebook + Twitter + anything else to help us learn more about how to provide our customers with awesome, effective, engaging content. This is going to involve a lot of iteration and that’s why we need a new core member of our team instead of an outsourced partner or contractor etc. This is a green-field proposition: you can work with whatever tech tools you like. You’d be the guy or gal in charge and we will stay out of your hair about that kind of stuff.<p>We are two dudes from the US who’ve spent a lot of time in Japan – I live in SF now and my partner is in Tokyo. A lot of our clients are in Japan because that’s where we started, but we’re scaling up in the US now too. You can work from wherever you want, Tokyo included.<p>To make sure this works for everybody, we’d like to do a 3-month trial period starting in January wherein we’d pay you a monthly salary- and then, assuming everyone’s happy, you’d get a substantial grant of stock (co-founder level). This is pre-financing, so you’d be getting in on the ground floor.<p>TL;DR: We’re good at business and sales but we suck at tech, come and work with us, #hacktheplanet. Email jobs@yikes.jp with a resume or github link or both.","time":1354382743,"type":"comment"}