{"by":"flangston","id":4859748,"kids":[4859755],"parent":4857714,"text":"PayByGroup - Senior Developer/Engineer - H1B accepted<p>To apply email joinus@paybygroup.com.<p>ABOUT PAYBYGROUP<p>We're a team of execution-loving dreamers that are backed by prominent angels and VCs, including 500 Startups.  We help people plan and pay together for activities they've always wanted to do with friends and family: from vacations to season tickets. We integrate directly with merchant websites but are in semi-stealth mode so we haven't revealed much publicly.  Our traction has wildly exceeded our expectations; merchants and users alike LOVE our service.  In a nutshell, we're making people's lives better by making collaborative payments a reality on the web.<p>THE POSITION<p>You would be the first full-time, on-shore member of our technical team besides our CTO, who is a badass PhD in machine learning. We're looking for someone that loves building things that improve people's lives.  Do you want to build the next photo-sharing app? Move on to the next job posting please!<p>You will be working to architect and implement many core elements of our platform and shape the direction of the product. You also have the potential to gain status as... wait for it... a co-founder!  Yup, that is how much we value this new potential team member.<p>YOUR SKILLS<p>We're looking for someone who has felt the pain we solve and understands the challenge of getting friends and family together for trips, concerts, and other meaningful life moments and adventures. We are a team of organizers ourselves and maintain a tight feedback loop between our users and how we build the product.<p>We want someone that loves solving challenging problems, from how to architect our merchant integrations to how to optimize the user experience.  Our vision is HUGE.  Like, call-me-and-let-me-tell-you-all-about-it huge.  We're going for a home run and aren't looking back. YOLO!<p>Rails, HTML/CSS, and Javascript are must-haves.<p>Any mobile dev or UX experience is gravy but not required.<p>Speaking of gravy, you must also like cookies, pies, and other bountiful fruits of the best kitchen appliance ever: the oven.  They make frequent appearances at our office.<p>THE GOODS<p>We offer $80-120K and 0.1-2.0% equity commensurate with experience and you can set your preference for salary vs. equity. We're looking for folks who are in it for the long haul as part of a close knit team. Job hoppers need not apply.<p>Extra Perks: What do you dream of?  Work retreats in Tahoe with lunch breaks on the slopes... sweet tech / desk setup... dogs at the office... all of the above! It's all on the table or already done. Let us know what we haven't thought of.<p>THE TEAM<p>We're an experienced founding team with previous start-ups under our belts and a great balance of business and technical chops. Why waste your time with first-timers that don't know what they're doing?  Come learn, grow, and share in fame and fortune with a team that is quickly putting its stamp on world.","time":1354412635,"type":"comment"}