{"by":"rvivek","id":4859043,"parent":4857714,"text":"Product hackers at HackerRank.com (Mountain View,CA). Full time.<p>Our goal is to build an engaging platform for hackers to solve interesting real world challenges in all domains of Computer Science<p>We have a dedicated, core group of users since we launched in beta. We're hiring a Product Hacker to focus on two important metrics - Engagement (time spent and interaction) and Retention (churn factor). We listen to our users a lot and been doing a bunch of experiments on our site - bot-vs-bot games, real-world challenges from companies, etc. which has made thousands of users happy. Imagine if you grew this number by 100x or 1000x? Software is eating the world and if all the world's problem solvers come together at a single place, it will be the most valuable place EVER built. We are looking for a Product hacker to help us push features (or kill features) to reach the goal. The Product Hacker is the bridge between the user and the product and works with everyone in the team (designers, founders, engineers)<p>Job Responsibilities<p>-- Analyzing engagement and retention metrics, feedback from users and base product decisions on them<p>-- Detailed product specifications that'll help designers and hackers to execute them and make it live<p>-- Coding some components of the product<p>What are we looking for?<p>--You have coded extensively in the past and continue to build stuff for fun<p>-- You understand the way hackers think and what they enjoy, and you are able to translate ideas into how it should reflect on the website<p>-- Explicit mention of some of the earlier products you've worked on - what changes you made and how they affected the business value<p>-- Experience working in user growth teams in the past<p>-- You are very numbers obsessed and the first thing you wake up to is an analytics dashboard<p>How to apply?<p>-- Send an e-mail to hackers [at] hackerrank.com with your profile","time":1354396964,"type":"comment"}