{"by":"adahm","id":4859704,"parent":4857714,"text":"Minneapolis, MN: Web Developer<p>Fast Horse seeks a front-end web developer to lead digital production on a wide variety of projects. We need a go-getter who can offer and implement innovative web design, UX and UI ideas. Candidate must be able to code standards-compliant sites and social applications.<p>Responsibilities \n• Create standards-compliant websites\n• Help design and build custom Facebook tabs and various other social applications\n• Customize and create WordPress templates\n• Provide valuable input on web design, user experience and user interface for digital development projects\n• Implement SEO best practices on all projects\n• Communicate effectively with colleagues and clients\n• Develop cost estimates for digital projects<p>Skills &#38; Experience\n• Proven track record of coding standards compliant sites\n• Strong focus on front-end design and modern web/mobile design\n• Familiarity with implementing responsive design\n• Strong understanding of APIs\n• Experience in building social applications interfacing with Facebook and Twitter\n• Project management – including the ability to set and meet deadlines and budgets\n• Problem analysis – thoroughly defining challenges and solutions\n• Resourcefulness– integrating creative knowledge with business realities\n• Openness to new ideas and influences\n• Curiosity to seek out new techniques and innovations\nIntangibles\nWe value initiative, a sense of humor, risk-taking and flexibility.\nYou also need to have a thick skin and a long fuse to thrive in a creative, open, fast-paced environment<p>Workplace/Compensation\nFast Horse has been named as one of Minnesota’s Best Places to Work by both The Mpls/St. Paul Business Journal and Minnesota Business Magazine, and was named to the The Mpls/St. Paul Business Journal’s “Fast 50″ list honoring the fastest-growing companies in the Twin Cities.\nWe offer a highly flexible workplace, where Fast Horse staffers are untethered by a designated office or desk. We call it “hotdesking.” Our building is set up to facilitate communication and collaboration, and our people are offered the flexibility work wherever they desire, whether that’s at the office, at a coffee shop, at home, or anywhere else where they feel creative and productive. We offer highly competitive salaries and benefits, including a cafeteria healthcare plan, a SIMPLE IRA, and incentive compensation opportunities.<p>To apply for this position, email your resume and a link to your portfolio to info@fasthorseinc.com","time":1354411522,"type":"comment"}