{"by":"late2part","id":4862411,"parent":4857714,"text":"LOCAL OR REMOTE Candidates\nSunnyvale, CA USA or elsewhere (Europe, Asia remote workers okay)<p>WANTED:  AIRHEADS THAT LIKE TO PLAY IN THE CLOUD<p>We are a group of expert airheads looking to play in the cloud space with creative engineers like us.<p>Aruba Networks (www.arubanetworks.com) is known as the biggest small company, and we’re looking for great people to help us build great things to delight our customers.<p>We are looking for:<p>•\t<i>DevOps Engineers</i>: to help build the infrastructure as code systems that power the dynamic and reliable online systesms.  Our stack is AWS, Rackspace, Openstack, and others; with Ubuntu, Chef, and many other technologies including New Relic, Thousand Eyes, and (yes, this will be an occasionally on-call position) Pager Duty.<p>•\t<i>UI/Front-End Developers</i>:  to build visually stunning interfaces to allow intuitive and efficient use of our services and systems<p>•\t<i>Web Application Developers (back-end)</i>:  Build reliable scalable systems with technologies like postgres, redis, mongodb, cassandra, python, flask, celery, and others<p>•\t<i>QA Engineers</i>:  to help prevent problems so that everything runs smoothly with no bumps so we can continue to delight our customers<p>We’re located in Sunnyvale, easily accessible by Caltrain and VTA Lightrail and will help with relocation to the Bay Area.<p>We’re a charming group as seen in this video:  <a href=\"http://www.youtube.com/watch?v=8iXH_dv4BCs&#38;feature=youtu.be\" rel=\"nofollow\">http://www.youtube.com/watch?v=8iXH_dv4BCs&#38;feature=youtu...</a> .<p>Do you want to be a real airhead and help shape the future of wireless Ethernet?  If so, come join us.<p>Please mail hn-jobs@arubanetworks.com with:<p>•\tTell us the theoretical bandwidth of 802.11ac<p>•\tAn Intro Letter – tell us why we should hire you, how you get stuff done, and if you’re fun to be around or not<p>•\tA resume or CV<p>•\tA list of projects or accomplishments – links to github very much appreciated!","time":1354480858,"type":"comment"}