{"by":"joshyeager","id":4862660,"parent":4857714,"text":"Swift Software - Frederick, MD (Near DC) - Software Engineers for Product Development and Professional Services<p>Are you tired of commuting to DC or Northern Virginia? Swift Software is a growing product-centered technology company seeking talented developers to join our development and proserv teams in Frederick, MD. Our flagship product is JobTraQ, a task management and workflow system that offers vastly more flexibility and power than any other product in our market segment, and is significantly less expensive and easier to configure than big \"BPM\" suites like MetaStorm and Lombardi. These advantages are allowing us to disrupt both markets.<p>Product developers will create new features in JobTraQ and enhance existing functionality. You’ll help us build advanced visual design and administration tools, augment the product’s business intelligence capabilities, improve performance and scalability, and use customer feedback to enhance all parts of the system.<p>Proserv developers will work with our mid-market and enterprise customers and our business analysts to design and implement software solutions that build on JobTraQ's capabilities. Our implementation and customization projects are usually one week to two months long, so you’ll enjoy a wide range of work on interesting problems for clients in many regions and industries. Recent projects have included a touchscreen system for warehouse tracking, integration with accounting systems, complex custom finance and billing reports, and automatic data synchronization.<p>Both teams have an enjoyable and collaborative culture in a creative environment. We interact positively and openly and emphasize learning and professional development. These attributes have enabled us to produce an industry-leading product with a globally recognizable and satisfied client base. Our environment is relaxed and fun, we play everything from Total Annihilation to Alien Swarm at our game nights, and we equip everyone with new quad-core Thinkpads with SSDs and dual monitors. Our policies and benefits are family-friendly, with generous vacation time, good health insurance options, and flexible work schedules.<p>For more information about these positions, see the links below. If you are interested in either one, email your resume to resumes@swiftsoftware.com.<p><a href=\"http://www.jobtraq.com/jobs/se227-software-engineer-product-development.html\" rel=\"nofollow\">http://www.jobtraq.com/jobs/se227-software-engineer-product-...</a><p><a href=\"http://www.jobtraq.com/jobs/se152-software-engineer-professional-services.html\" rel=\"nofollow\">http://www.jobtraq.com/jobs/se152-software-engineer-professi...</a>","time":1354485016,"type":"comment"}