{"by":"rattab","id":4871544,"parent":4857714,"text":"Montreal(MTL), Canada(CAN)<p>* Datacratic (<a href=\"http://datacratic.com\" rel=\"nofollow\">http://datacratic.com</a>, <a href=\"http://datacratic.com/site/careers\" rel=\"nofollow\">http://datacratic.com/site/careers</a>)<p>The team is made up of engineers, and scientists and we are creating a real-time data platform that allows developers to easily and efficiently create sophisticated, predictive, machine-learning applications.<p>Our systems deal with the aggregation of tens of thousands of network events per second, updating complex internal data structures, and scheduling and executing machine learning models. All of this on 16 or more CPU cores with hard real-time constraints.<p>* C++ Software Developer (<a href=\"http://datacratic.theresumator.com/apply/zIk4Dc/C-Software-Developer-Developpeur-Logiciel-C.html\" rel=\"nofollow\">http://datacratic.theresumator.com/apply/zIk4Dc/C-Software-D...</a>)<p>We're looking for someone to help write the real-time machine learning platform onto which all our products are built.<p>We are pushing the limits of what a machine can do in both memory size and processing capacity and we need someone who can help us push them further.<p>We love C++11 and we make extensive use of Boost, ZeroMQ and Linux system calls.<p>* Software Developer (<a href=\"http://datacratic.theresumator.com/apply/BM6u6M/Software-Developer-Dveloppeur-Logiciel.html\" rel=\"nofollow\">http://datacratic.theresumator.com/apply/BM6u6M/Software-Dev...</a>)<p>We are looking for generalist software developers to work on the productization of our applications: creating systems and processes for configuration and control, reporting and visualization, monitoring and deployment, as well as working with our clients to adapt our technology to their needs and develop new features as appropriate.<p>We value personal initiative, accountability and collaboration. We're committed to mentoring and we expect you to walk out the door a better developer than when you walked in.","time":1354637529,"type":"comment"}