{"by":"ryansapper","id":4918535,"parent":4857714,"text":"San Francisco (Financial District) - Full Time - Will Relocate - iOS<p>Causes.com engineers are an elite, close-knit A-Team of big thinkers, night owls, and weekend rock climbers. Every day our programmers take on a series of tech challenges together; walk around the Causes.com office and you'll see developers pairing together and sharing tips. To unwind, you'll find them playing ping-pong, enjoying a cold beer or two from the Keg-a-rator, giving quick tech talks, and releasing their own open-source projects. If you're wildly talented with a desire to do meaningful work, we want to hear from you.<p>Causes is looking for the first iOS developer to join our team. This is a rare opportunity to have your code impact millions of people all over the world. Causes is the world's largest platform for civic engagement and activism. We are working to empower anyone, anywhere to build movements for change by bringing together like-minded friends and supporters to take strategic collective action that produces a measurable, real-world impact. Come work with work a group of first-class engineers who are constantly trying to improve themselves and the people around them.<p>Responsibilities<p>-Help design and build our first iOS application<p>Requirements<p>-You built an iOS application that is on sale in Apple's App Store<p>-You find fulfillment in building great products<p>-You thrive in a collaborative environment and are eager to learn from and teach others on the team<p>-You have at least three years of experience building iOS applications<p>-You have at least three years of experience building web applications<p>-Fluent in a *nix development environment<p>Bonus Points<p>-Experience with UX design<p>-Fluent in a high level language such as Ruby, Python, PHP, or Javascript<p>-You have contributed to an open source software project<p>To apply, send your resume, code samples, and relevant links to jobs@causes.com; use \"Mobile Dev-HN\" as the subject line. For more information visit our careers page at www.causes.com/jobs","time":1355438065,"type":"comment"}