{"by":"johmathe","id":12628671,"parent":12627852,"text":"Bay Labs - San Francisco (Union Square)<p>Bay Labs is at the forefront of bringing deep learning advances to critical unsolved healthcare problems. We have assembled an exceptional team of clinicians, engineers and scientists who are developing breakthrough technologies in cardiovascular imaging and care, addressing the largest cause of death in the US. The Bay Labs team brings diverse expertise to the problem of diagnosing and managing heart disease, with leaders in machine learning, visual neuroscience, robotics, and physics. We have teamed up with a network of world class clinical and academic advisors and made remarkable progress in a very short period of time. Current investors in Bay Labs are recognized leaders in venture capital.<p>1. We wish to find a versatile engineer, who can demonstrate a capability to scientifically develop, benchmark, and validate a wide variety of deep neural network architectures for the purpose of extracting clinically-relevant knowledge from medical images.<p>2. We are hiring to fill a role that blends data pipeline architect and site reliability engineer. Site Reliability Engineering (SRE) is what you get when you treat operations as if it’s a software problem. If you are a software engineer at heart with ops experience and want to work some craft on deep learning, this role is for you.<p><a href=\"http:&#x2F;&#x2F;baylabs.io\" rel=\"nofollow\">http:&#x2F;&#x2F;baylabs.io</a>\n<a href=\"http:&#x2F;&#x2F;blogs.wsj.com&#x2F;venturecapital&#x2F;2016&#x2F;01&#x2F;28&#x2F;bay-labs-launches-to-bring-artificial-intelligence-to-ultrasounds&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;blogs.wsj.com&#x2F;venturecapital&#x2F;2016&#x2F;01&#x2F;28&#x2F;bay-labs-laun...</a><p>email: jobs@baylabs.io\nsite: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;baylabs\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;baylabs</a>\ncrafts: python, C++11\nVISA ONSITE","time":1475511182,"type":"comment"}