{"by":"clinth","id":12628007,"kids":[12628208],"parent":12627852,"text":"New York Genome Center | <a href=\"http:&#x2F;&#x2F;www.nygenome.org\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nygenome.org</a> | SoHo in New York City | ONSITE<p>New York Genome Center is a nonprofit in SoHo aiming to become a leading sequencing lab and general driver of genomics science excellence. NYGC&#x27;s partnerships with nearby top-tier hospitals in Manhattan enable unique human analysis studies. We have both junior and senior software engineering positions available. The group is a mixed local&#x2F;remote team, but all of the currently open positions are ONSITE. Our interview process is phone conversation followed by onsite interview.<p>NYGC is not a software company; it is a sequencing lab trying to push science at scale, and needs software to do so. We have gone from zero to top-three in five years, and we are hungry to become the leader. We&#x27;re aggressively scaling our clinical services, so if you have even the smallest allergy to documentation or process, please stop reading now.<p>These positions are for the automation group, which currently has ten people. NYGC is graduating from successful startup to a medium-sized company. In software, we&#x27;re replacing duct tape with small applications, and introducing larger applications to help people with scale. We also introduce duct tape to make impossible things happen. People who join NYGC software are expected to learn quickly, be self-motivated, and be comfortable switching tracks. You don&#x27;t have to understand e.g. genome sequence alignment, but you do have to be able to read a manual on a tool&#x27;s use and learn enough vocabulary to have an intelligent conversation with an expert on the subject.<p>This group uses python and postgresql, adding minimal javascript when making frontend applications. We are intentionally boring (<a href=\"https:&#x2F;&#x2F;valdhaus.co&#x2F;writings&#x2F;boring-systems&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;valdhaus.co&#x2F;writings&#x2F;boring-systems&#x2F;</a>) in our technology choices because our goal is data analysis, not novel software work. We design everything for reliability, maintenance, low cost of ownership, and failure recovery. It is a combination of boring technology and fast pace: we are the computational pipeline team, the automation team, the LIMS team, the database team, the data transport team (surprisingly fun at &gt;20PB), the customer delivery team, the JIRA team. We don&#x27;t do genomic methods software (e.g. better variant calling) -- we have a great computational biology group for that. Our team is not Agile, but our business is. We make it all run at scale, on our local cluster of &gt;6k cores. This group is focused on making a sequencing lab and automated analyses run at scale.<p>The lab and automation combined drive some really interesting real-world problems, particularly in the clinical space. How fast can we get first-order cancer screening to sick people? If you want to be part of a growing firm that drives science with stable software solutions, please drop me a note or use NYGC&#x27;s careers page.","time":1475507813,"type":"comment"}