{"by":"caitlinspothero","id":12628001,"parent":12627852,"text":"SpotHero | Chicago, IL | <a href=\"http:&#x2F;&#x2F;spothero.com\" rel=\"nofollow\">http:&#x2F;&#x2F;spothero.com</a>\nSpotHero is changing parking, and our tools will redefine the transportation industry. With over a million cars parked, fast growth, and solid funding (<a href=\"https:&#x2F;&#x2F;angel.co&#x2F;spothero\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;spothero</a>), SpotHero offers countless ways to make an impact on the company and your career.<p>Director of Development - <a href=\"https:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;126707\" rel=\"nofollow\">https:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;126707</a>  \nWe’re looking for someone who still enjoys problem solving, architecting, and reviewing code, in addition to leading engineers, communicating closely with our executives, and determining the best use of new technologies – all the while nurturing and maintaining a development culture that SpotHero can be proud of.<p>Senior Backend Engineer - <a href=\"http:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;124847\" rel=\"nofollow\">http:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;124847</a>\nAs a member of our Backend team, you will be responsible for building all things related to the backend horsepower that powers our website, our API, and our native apps!<p>Senior Data Engineer - <a href=\"https:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;242762\" rel=\"nofollow\">https:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;242762</a>\nOur Senior Data Engineer with be responsible for building and maintaining our data pipelines, deploying computational resources for data science&#x2F;analytics initiatives, and creating tools to help teams throughout the company make better decisions and customers have a better experience with our product.<p>Level 2 Support Engineer - <a href=\"https:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;260546\" rel=\"nofollow\">https:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;260546</a>\nSpotHero is seeking a Level 2 Support Engineer to work primarily with our customer care and engineering departments in order to polish our product and defeat some parking villains (tech bugs). If you’re technical, love to solve problems, a little meticulous, and are ready to jump into an &quot;all hands on deck&quot; environment, this role is for you!<p>Junior Software Engineer - Spring 2017 Hire - <a href=\"https:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;460619\" rel=\"nofollow\">https:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;460619</a><p>Software Engineering Intern - Summer 2017 - <a href=\"https:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;459520\" rel=\"nofollow\">https:&#x2F;&#x2F;spothero.com&#x2F;careers&#x2F;459520</a><p>To apply, please email your resume to jobs@spothero.com. Include any github account, linkedin profile, and any project that you’re particularly proud of. We love seeing work that others loved working on.","time":1475507751,"type":"comment"}