{"by":"joectastic","id":12627950,"parent":12627852,"text":"Warby Parker | NYC | Onsite | Full-Time | Principal Software Engineer<p>We’re looking for a stellar Principal Software Engineer to lead a brand-new team at Warby Parker! The go-getter in this role will be blazing a whole new trail for the company, so the job is ideal for an ambitious engineer who’s eager to pioneer new technology and products within an already successful organization.<p>We’re building a cross-functional team of (initially) five people focused on long-term product development utilizing emerging technology with a substantial mobile component, including the development of iOS&#x2F;Android applications. This project will entail everything from developing a proof of concept to user testing to launching a consumer product that meets Warby Parker’s high standards for amazing customer experiences.<p>In this role you’ll be responsible for architecture and selecting technologies used. Current technologies include Swift, Python, JS, OpenCV, React, Reactive Cocoa, Tornado and AWS infrastructure—and you’ll be the person helping decide which other ones we pursue! Think you’ve got the goods? Keep reading.<p>What you’ll do:\n\t•\tLead technology for an independent product group operating within Warby Parker \n\t•\tMentor and recruit a team of best-in-class software engineers  \n\t•\tDevelop and evaluate industry-leading technologies \n\t•\tImplement new ideas from prototype to production \n\t•\tDesign and implement new tech infrastructure <p>Who you are:\n\t•\tEquipped with at least 6 years professional programming experience \n\t•\tAn expert  in data modeling in one or more modern relational databases <p>Extra credit:\n\t•\tExperience with multiple languages, web frameworks, and datastores \n\t•\tExperience in native mobile development \n\t•\tExpert knowledge of Swift \n\t•\tAlso a plus: experience with Python, JS, OpenCV, React, Reactive Cocoa, Tornado and&#x2F;or AWS infrastructure (we use them all!) <p>Please apply by sending an email to recruiting@warbyparker.com","time":1475507449,"type":"comment"}