{"by":"beemboy","id":12630471,"kids":[12633954],"parent":12627852,"text":"Mason | Seattle, WA | Full-Time | ONSITE | Back-End, Front-End, Systems Engineers<p>US: We&#x27;re Mason, a YC-backed (W16) company building mobile deployment infrastructure that allows any company to create their own Android-based device ecosystem. Think privately owned and managed device fleet and cloud.<p>YOU: An engineer with 2+ years of experience and&#x2F;or a CS background, and the right attitude (<a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;uPi6Y4\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;uPi6Y4</a>). We&#x27;re fully aware of &quot;imposter syndrome&quot;, so don&#x27;t let a job description keep you from applying. If the idea that you will experiment, learn, build, <i>ship</i>, and grow with the rest of us appeals to you, don&#x27;t think twice about contacting us. Our most immediate need is for people that can take on backend work (Node&#x2F;Python&#x2F;etc.), frontend&#x2F;UI work, and AOSP hacking&#x2F;embedded Linux&#x2F;drivers&#x2F;systems work.<p>WHY MASON? We&#x27;re a small company aspiring to build very large things. We&#x27;re 10 now and looking to grow. Selected perks:<p>- This is not &quot;ground floor&quot;, more like a &quot;basement&quot; opportunity. Define, build and ship foundational stuff for Mason.\n- We value diversity of thought, being and experience.\n- Dogs welcome.\n- A fully stocked pantry, and an actual kitchen.<p>Full JDs on AngelList -- <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;masonamerica&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;masonamerica&#x2F;jobs</a><p>Unfortunately we&#x27;re unable to handle H1Bs at the moment.<p>WHERE? We&#x27;re based in gorgeous SEATTLE, one of the few YC-backed ones here, with sweeping views of Cap Hill, and no parking issues (not a typo, I can vouch for this).<p>PROCESS: 30 minute chat (in person or Hangouts) -&gt; offline coding and work sample evaluation -&gt; on-site interview -&gt; offer. We delete parts of this workflow for the right candidate.<p>INTERESTED? Email [work] [at] [bymason.com] with your resume and brief answers to the following questions:<p><pre><code>    1) Why are you interested in Mason?\n    2) Why are you a great candidate?\n    3) What your favorite feature of your favorite programming language&#x2F;framework and why?</code></pre>","time":1475522470,"type":"comment"}