{"by":"zeeamzn","dead":true,"id":12635542,"parent":12627852,"text":"Amazon Flex | Toronto, ON | Full-Time \nSoftware Development Engineers (multiple openings) &amp; Web Developer\nOn-Site<p>About us: \nAmazon’s new crowd-sourced delivery platform, Amazon Flex, aims to delight customers by delivering millions of packages faster than ever before. We are expanding our platform rapidly to new geographies and products from groceries to big-screen TVs in an increasingly complex transportation network. We recently launched Prime Now that delivers orders in an hour or less. You can find out more at flex.amazon.com<p>Job:\nOne challenge within flex is to accurately track work by ingesting data from multiple sources and making sense of it, so delivery personnel can be paid accurately and quickly. We are building the entire stack, from the data store and platform to UX. The platform will not only ingest data through a well-defined interface, but will also support mechanisms to publish clean data for consumption. We will build data analytics and business intelligence to perform key data inquiries independently that will help business teams reliably answer important questions.<p>Our engineers are top-notch software developers who love listening to customers, working as a team, and proactively taking the lead whenever necessary. The successful candidate will be responsible for creating and delivering software solutions for the new transportation program. In this role, you will have an opportunity to own design and development of key parts of services. You will have influence on subsystem design and help build a team culture around practices that are critical to a quality product.<p>Your work would be cross-functional involving partnering with other teams in Amazon, including operation, fulfillment, IT, and finance teams. We are looking for someone with a go-getter attitude who is ready to own a problem and passionately drive successful implementation. We want someone who is a quick learner and ready to learn and adopt the latest techniques in computer science.<p>Come join the team and help us make history!<p>The job posting will be up at jobs.amazon.com in a few days. Shoot me an email at zee@amazon.com with your resume.","time":1475589717,"type":"comment"}