{"by":"lespider","id":12630877,"parent":12627852,"text":"tCell.io, Inc | San Francisco, USA and Stockholm, Sweden | Full-Time | On-Site | Senior DevOps Engineer | <a href=\"https:&#x2F;&#x2F;www.tcell.io&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.tcell.io&#x2F;careers&#x2F;</a><p>tCell.io is an early-stage startup building disruptive technology to secure web applications in production. tCell.io is a multi-tenant cloud service capable of analyzing large volumes of data in real-time to identify attackers and to protect sites. To help take this to the next level, we are looking for a DevOps engineer to join our team to help drive a highly-scalable, performant, and robust infrastructure that enables to team to be data-driven, continuously deploying, and embracing infrastructure-as-code. tCell.io&#x27;s success depends on the ability to handle data at scale, and iterate rapidly. Your goal is to relentlessly enable the team to operate both efficiently, effectively, and securely by judicious balance of technology and process.<p>Responsibilities<p>* Automate - Work with team to automate all services, such that all services have fully-automated deployment, enabling frequent pushes to production as needed. This includes designing and implementing all the automated systems and tools that enable continuous deployment and delivery.<p>* Monitoring - Work with team to define requirements for monitoring, and design and maintain dashboards and alerts to enable rapid response to incidents. In addition, be able to help team investigate production problems, and measure the changes made to the product in terms of service improvement, or degradation.<p>Requirements<p>* 5+ years experience on all manner of <i>NIX and TCP&#x2F;IP network design&#x2F;implementation&#x2F;admin activities, 5+ years developing automation<p></i> Extensive experience in designing, implementing, maintaining, and automating cloud infrastructures on at least one cloud service (e.g. AWS) utilizing CLI and REST APIs. Including services such as security, storage, auto-scaling, load balancing, replication, and monitoring. Terraform experience a plus.<p>* Experience scaling web applications&#x2F;services, and associated technologies, such as nginx&#x2F;apache, memcached, etc.<p>* Experience in data technologies, such as Kafka, Druid, Cassandra, Hadoop, Spark, and PostgreSQL<p>* Familiarity, and deep knowledge of container and virtualization technologies, particularly Docker. (and related subjects like lxc, chroot, etc.)<p>* Programming experience in Shell, Python, and&#x2F;or Ruby.<p>* Working expertise in at least one configuration management framework, Chef preferred. Experience in Ansible, Puppet, or other a plus.<p>* Ability and passion for learning new things, and pushing the limits of excellence<p>* Bachelors of Science (or higher) in Computer Science, or equivalent experience.","time":1475525189,"type":"comment"}