{"by":"blahshaw","id":12638170,"parent":12627852,"text":"Marin Software | San Francisco, CA | On-site | Full-time<p>Want to join the team of an acquired Y-Combinator ad-retargeting startup? The Perfect Audience (YC 11) team at Marin Software is hiring!<p>blambert @ marinsoftware.com<p>== Senior Full-Stack Engineer ==<p>We are a fast-growing programmatic advertising company working with hundreds of companies you know and thousands more. We&#x27;ve built a simple product that&#x27;s loved by customers all over the planet. We&#x27;re looking for a clever full-stack engineer to help us make it even better.<p>The perfect candidate to join our team would enjoy database design, application logic, and standards-based front ends. You will have a chance to explore cutting edge big data technologies in the context of a modern Rails web application.<p>This is a chance to work on every facet of a successful web app and grow your engineering skill set.<p>What we are looking for:<p>- 5+ years of engineering experience<p>- Experience with one or more of: Rails, Ruby, MongoDB, Hadoop<p>- Excellent at communicating and collaborating (ready to discuss features, bugs, architecture, etc.)<p>- Knowledge and interest around database technologies and Big Data<p>== Senior Java Engineer for Real-Time Bidding ==<p>We are a team of engineers focused on building a performant, self-service ad platform that enables small and medium sized businesses to drive more sales and conversions through retargeting lost visitors on Facebook and across the web.<p>We&#x27;re looking for an experienced Java developer to hack on our massive real-time bidding system. Our bidders need to scale to handle response times in 10s of milliseconds. Our stack utilizes many Amazon Web Services including DynamoDB, Redshift, EC2, and others.<p>What we are looking for:<p>Ability to architect, develop, and test key infrastructure.\nSolid understanding of performance and design tradeoffs without compromising quality\nExperience scaling web apps and services, especially on a hosted platform\nKnowledge and interest around Database technologies and Big Data is a huge bonus\n5+ years experience on a team in software development","time":1475606991,"type":"comment"}