{"by":"iancar","id":12630885,"kids":[12640060],"parent":12627852,"text":"Microsoft | Redmond, WA | Full-time | Onsite<p>Are you inspired to constantly push the edges of web UX? Are you looking to join a team of talented engineers developing a next-generation user interface? Do you want to be an integral part of Microsoft&#x27;s mission to be a leader in the cloud? Do you enjoy customer interaction, being customer focused and data driven?<p>We are the IaaS Experiences team and we&#x27;re looking for passionate Software Developers to deliver revolutionary new web experiences that harnesses the power of the cloud and push the boundaries of what a website can do. We are where Compute, Networking and Storage come together in Microsoft Azure.<p>Do you have:\n<i>Two or more years of web development experience and proficiency building engaging user experiences\n</i>Expertise with the latest techniques building web apps and services using HTML5, CSS, and JavaScript\n<i>A goal to work on a state of the art product and take on interesting problems every single day\n</i>A love for frameworks like jQuery, Knockout.js, TypeScript, and ASP.NET MVC\n<i>Experience with technologies like JSON, AJAX, and Git\n</i>Dedication and passion for scenario&#x2F;unit testing; we use Jenkins, Selenium, and Mocha&#x2F;Chai at cloud-scale<p>We:\n<i>Build features that get over 50 million requests a day\n</i>Deliver in many languages and run in multiple, globally distributed datacenters\n<i>Release frequent updates every month\n</i>Believe in agile development and continuous improvement<p>Do you value:\n<i>Performance, scalability, usability, security, reliability, and accessibility in everything you do\n</i>Working with a group of talented designers to craft elegant and beautiful user interfaces\n<i>Helping Linux and Windows customers succeed with Azure\n</i>Team-players eager to excel in a dynamic, customer-focused collaborative environment\n*Fun and rewarding teamwork with partners across Microsoft<p>If you have an eye for UX design and excellent attention to detail, and this sounds like your dream job, come talk with us!<p><a href=\"https:&#x2F;&#x2F;careers.microsoft.com&#x2F;JobDetails.aspx?ss=&amp;pg=0&amp;so=&amp;rw=1&amp;jid=261352&amp;jlang=EN&amp;pp=SS\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.microsoft.com&#x2F;JobDetails.aspx?ss=&amp;pg=0&amp;so=&amp;r...</a>","time":1475525265,"type":"comment"}