{"by":"mbesto","id":12630817,"parent":12627852,"text":"Liberty Advisor Group, Anywhere in US (preferably Chicago or SF Bay Area, but not required)<p>This is a very unique position in that we are not a &quot;tech startup&quot; but rather provide services to technology investors and IT groups within large organizations seeking to transform their businesses with technology. I&#x27;m looking for someone who has a background developing web (or mobile) applications and can leverage that knowledge to provide strategic direction to investors and CxO&#x27;s.<p>What we do: We provide M&amp;A transaction services for Private Equity and Venture Capitalists, as well as general technology strategy for businesses of all sizes. This role would be focused on M&amp;A deals mainly for middle market technology companies with revenues between $1M and $400M.<p>About you:<p>- Understand what agile management looks like<p>- Understand financials (Capex vs Opex, EBITDA, leverage buyouts, etc)<p>- May have personally fully developed a solution using web technology or have a varied history of doing so. Hands on .NET, Java and Rails are pluses<p>- Can understand the difference between the &quot;old guard&quot; tech companies and &quot;unicorns&quot; and decipher the business value between the two for investors<p>- Understand the role of a strategy&#x2F;management consultant for M&amp;A professionals<p>- Are a self starter and self learner (don&#x27;t need much direction to get stuff done)<p>- Background at a management consulting company is a plus<p>- If you&#x27;ve written code and executed an IT due diligence service for an investor before, then you should apply<p>- Like to travel<p>Please contact me directly with the Subject line &quot;HN Opportunity&quot; and your resume attached (brief intro why you&#x27;re a good fit would be good too). If you do not follow these instructions you&#x27;ll be ignored. My email is mbestvina AT our website linked below.<p>More about us: <a href=\"http:&#x2F;&#x2F;www.libertyadvisorgroup.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.libertyadvisorgroup.com&#x2F;</a><p>NO RECRUITERS","time":1475524773,"type":"comment"}