{"by":"jdangu","id":12631389,"parent":12627852,"text":"ClarityAd | New York, NY | Onsite | Full time<p>ClarityAd&#x27;s software protects from bad ads. We run ads in our custom browser environment in the cloud to gather hundreds of data points. We assess security and compliance for billions of ad impressions daily. Our back-end stores this wealth of data in a way that&#x27;s usable and efficient, allowing publishers and ad platforms to protect their audience in real time.<p>You will work with our VP of engineering and back-end engineering team and you will be directly involved in:<p>- Setting up a robust and highly scalable backend<p>- Optimizing database queries and caching as required<p>- Optimizing web server configurations<p>- And most importantly, participating in the day-to-day improvement and extension of our product functionalities, for all things backend.<p>We would love to hire someone with ad tech experience, but we’re ready to train newbies and give you a deep understanding of the ad serving stack and Real Time Bidding (RTB). This environment has grown to such a level of complexity and automation that consuming online media has become an exercise of frustration: Latency, invasive ads, privacy issues, malware&#x2F;malvertising that exposes users to trojans, ransomware, botnets… The rational option for the audience is to rely on ad blockers. Our unique product suite makes it possible for publishers and ad platforms to protect their audience in real time. We have the secret sauce to disrupt this market for good, annihilate the bad actors and restore confidence in publishers.<p>We are passionate about solving these issues and we want to grow our team with people who share our vision and ambition.<p>We use: PHP, MySQL, PostgreSQL, Redis + Lua, Node.js, C++ (browser sandbox). Our infrastructure includes: AWS EC2 (thousands of VMs) &#x2F; Route53 &#x2F; ELB &#x2F; S3 &#x2F; Bare metal &#x2F; lots of exotic hardware in exotic places with exotic vendors all playing nice with Puppet.<p>Bragging rights:<p>- We routinely are the 1st to report on-going live malvertising attacks to ad platforms, including to Google<p>- We increased our volumes by 20x last year and keep getting stronger<p>- We have have received mentions in Google’s Security Hall of Fame<p>- We&#x27;re still an “engineer only” startup, even as our monthly revenue passed into six figures less than 3 years in.<p>Apply at jerome at clarityad com (co-founder &#x2F; CTO)","time":1475529293,"type":"comment"}