{"by":"zaphod42","id":12634481,"parent":12627852,"text":"TIM Group | London | ONSITE or REMOTE | Full Time<p>TIM Group develops and runs the leading, independent alpha-capture platform. We connect brokers and fund administrators to get market insight to the right people at the right time and then we give them even more value by providing useful analytics and signals by combining their ideas with market data and our own expertise.<p>Our interview process goes through several stages of: a phone call; a short, online coding exercise; 2 hours of in person, technical interviews; a day of technical and non-technical interviews. Our aim is to help both us and you get the information both need to make an informed choice at every stage. We also vary this process based on the situation of the person (we won’t ask a remote person to do two separate trips, for instance).<p>Our system is a web application (Java&#x2F;Scala, React&#x2F;Redux, MySql) running on our own hardware (but in virtual machines). CI and CD are old hat for us. You’d be working on a range of different problems depending on where you find yourself working in the system. Although we use these technologies, don’t shy away if you aren’t an expert. We always strive to improve and want to incorporate your skills and knowledge into our team.<p>You can work from our London office or remotely (or a mix, if you like). We are a supportive group, and trust each other to take responsibility for their work.<p>You can learn more about us by watching the lightning talks that we’ve posted online: <a href=\"https:&#x2F;&#x2F;vimeo.com&#x2F;user3637590\" rel=\"nofollow\">https:&#x2F;&#x2F;vimeo.com&#x2F;user3637590</a>\nOr by reading our blog: <a href=\"https:&#x2F;&#x2F;devblog.timgroup.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;devblog.timgroup.com&#x2F;</a>\nOr by taking a look at our current job posting: <a href=\"http:&#x2F;&#x2F;timgroup.com&#x2F;careers&#x2F;software-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;timgroup.com&#x2F;careers&#x2F;software-developer</a><p>If interested email andy.parker@timgroup.com","time":1475576818,"type":"comment"}