{"by":"varunjuice","id":12630203,"parent":12627852,"text":"Stealth mode enterprise software company | Palo Alto, CA | Onsite<p>We are building an enterprise software company that will define how the next generation of knowledge workers get stuff done. Unlike traditional enterprise software, our software has artificial intelligence and messaging at its core, not as a bolt on. We have started 5 companies, 3 of which were acquired by public companies while the remaining 2 are vibrant private businesses. Backed by Sand Hill road VCs, our investor group includes world&#x27;s leading AI experts and F50 CIOs.<p>We are looking for founding engineers to join us on this journey. You will play a pivotal role in defining and shaping the product, working with early customers and lighthouse partners, and other key aspects of building the company. Send us an email at work@bannertech.co<p>Our interview process starts with a phone screen, a tech challenge followed by an onsite interview.<p>Software Engineer, Machine Learning\n* building data pipelines to acquire&#x2F;crawl, clean and maintain data for model building, as well as productionizing ML models\n* ML toolkits like Scikit Learn, Apache Spark MLlib, H2O, Aerosolve or Apache Mahout\n* developing on the Linux platform with languages like Java&#x2F;Scala, Python, or C++\n* prior experience working with Open source software or having contributed to it \n* familiarity with deep learning algorithms and frameworks like TensorFlow, Theano, Keras or Torch\nAs a bonus, if you have some experience with NLP frameworks like SpaCY, Gensim or NLTK<p>Software Engineer, Platform\n* built high performance, fault tolerant, scalable backend services in the past\n* familiarity with building and integrating with API based platforms and have an understanding of REST and RPC based systems\n* experience with SQL and noSQL databases (like PostgreSQL, MySQL, Cassandra and HBase)\n* developing on the Linux platform with languages like Java&#x2F;Scala, Python, or C++\n* hands-on experience with IaaS systems like AWS, GCE or Microsoft Azure.","time":1475520476,"type":"comment"}