{"by":"Bazingaforlife","id":12634035,"parent":12627852,"text":"iZettle | Swift developer | Stockholm, Sweden| Full time |ONSITE<p>Our groundbreaking iOS app has truly made an impression on the mobile payments market.<p>We released the first version back in 2011 and the rest is, as you know, history.<p>With that being said, we are never satisfied. When our user base grows, the demands on our app increases. We&#x27;re dedicated to delivering stable software that our users can trust and love to use. There is always new features to be developed, new technologies to be used, new architecture to be tested and new problems to be solved. \nWe&#x27;re constantly revisiting previous solutions; turning them into small, reusable, testable and maintainable components. Furthermore introduction of Swift has opened up for new solutions and ways of thinking.<p>We are a small, well oiled team that live and breathe Apple. As part of that team, you will have the opportunity to influence every aspect of our app; from UI animations down to peripheral hardware integrations. \nYou will discuss technical solutions with the team, and together we&#x27;ll build amazing software that we can be proud of. We are keen to share our knowledge and to learn new things. We’re always on the lookout for new technologies, methods and different ways to solve new problems.<p>If you want to join us, you’re probably a proven asset within iOS development. We’re looking for developers who we can learn from and help us take our app to the next level.<p>Take a look at our latest release, you find our app here:<p><a href=\"https:&#x2F;&#x2F;itunes.apple.com&#x2F;se&#x2F;app&#x2F;izettle-complete-point-sale&#x2F;id447785763?l=en&amp;mt=8\" rel=\"nofollow\">https:&#x2F;&#x2F;itunes.apple.com&#x2F;se&#x2F;app&#x2F;izettle-complete-point-sale&#x2F;...</a><p>Read more about our tech culture here:<p><a href=\"http:&#x2F;&#x2F;tech.izettle.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;tech.izettle.com&#x2F;</a><p>Please apply through the add on our website: <a href=\"http:&#x2F;&#x2F;tech.izettle.com&#x2F;jobs&#x2F;7441-ios-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;tech.izettle.com&#x2F;jobs&#x2F;7441-ios-developer</a>","time":1475569035,"type":"comment"}