{"by":"efu","id":12632176,"kids":[12632776,12632230],"parent":12627852,"text":"Fu Team | TOKYO, JAPAN | SAN FRANCISCO, CA | REMOTE | VISA<p>$80K - $140k - Special Ops (Coding || Writing || Design || Products || Research || Business || Venture Capital || M&amp;A)<p>Hiring incredibly smart folks with a no-nonsense approach to communicating, creating, and maintaining relationships. This is the fastest way to become an insider in SV &#x2F; tech.<p>This role will put you in front of every kind of project you can imagine. Get on a flight to Southeast Asia to negotiate a contract with high ranking government officials. Code (or hire coders to create) a MVP for 3d printer IDE. Re-design everything about company in 48 hours (logo, name, press kit, marketing message, hiring, etc.) and then see it live on Techcrunch. Diligence a $2M investment. Edit an masterpiece for Forbes. Co-create a new university class on corporate venture capital. Jump in to help a team scaling from 100k to 100M users in 4 weeks.<p>These are REAL examples from the last 12 months, which hopefully provide you a sense of the adventure you are in for.<p>You&#x27;ll work on a tiny team of brilliant folks on a range of special projects I am involved in. It&#x27;s important we hit it off: I like no no-nonsense folks who jump in and make everything they touch better. Communicators rule the world, so you better be good at writing and speaking. Your ambitions should include something grand. You think it&#x27;s worth it to pick up the refreshments and chauffeur a guest to an engagement in order to get 10 minutes with a world famous entrepreneur.<p>I like people who have done the hard things, failed (or not), and still have the curiosity and enthusiasm to get back up and go full speed ahead. Most importantly, you need to be <i>really really good</i> at something.<p>Please email my EA keela@fu.team with the following subject line: Apply: Special Projects  (SKILLSET) - NAME - REMOTE|TOKYO|SF<p>The body should include an introduction and personal note SKILLSET should be something you&#x27;re spectacular at.<p>Examples:<p>Apply: Special Ops (Software Engineer) - Jane Smith - TOKYO|SF<p>Apply: Special Ops (Arduino Hacker + Political Theorist) - John E - REMOTE<p>Apply: Special Ops (Writing + Graphic Design) - Balthazar Melindres - SF","time":1475536720,"type":"comment"}