{"by":"jordibunster","id":12662944,"parent":12627852,"text":"Yammer (Microsoft) | Redmond, WA | Onsite | Full-Time | Variety of positions<p>Yammer is looking for awesome engineers to join the team in Redmond, WA located in the Puget Sound region and close to Seattle. Send your résumé to brida @ microsoft.com or apply at one of the URLs below.<p>About Yammer:- At Yammer, our mission is to change the way people work, and that mission starts with us. We use our own product every day to promote and encourage our culture of openness and transparency. Yammer provides each user with a voice, empowering individuals to share ideas, ask questions, and voice concerns. We&#x27;re passionate about building a great product that people love to use, and we&#x27;re always on the lookout for similarly product-minded engineers to join us. Our engineers work on rich, complex problems. At Yammer, engineers don&#x27;t just get handed specs and mocks to build -- we work in an iterative and collaborative way with Product and Design to create the best possible user experience. So, we need people who are enthusiastic, who ask great questions, who have strong opinions but aren&#x27;t afraid to admit when they&#x27;re wrong, and who enjoy collaborating with a cross-functional team. At Yammer, we hire smart people, expect them to learn and grow, and trust them to make day-to-day decisions. We care most about creating products people love - to enable that, we move quickly (pushing code to production at least daily), we iterate, and we value learning over shipping features.<p>Software Engineer II\n* <a href=\"https:&#x2F;&#x2F;aka.ms&#x2F;yam&#x2F;oct-2016-sde2-0\" rel=\"nofollow\">https:&#x2F;&#x2F;aka.ms&#x2F;yam&#x2F;oct-2016-sde2-0</a>\n* <a href=\"https:&#x2F;&#x2F;aka.ms&#x2F;yam&#x2F;oct-2016-sde2-1\" rel=\"nofollow\">https:&#x2F;&#x2F;aka.ms&#x2F;yam&#x2F;oct-2016-sde2-1</a><p>Production Engineer\n* <a href=\"https:&#x2F;&#x2F;aka.ms&#x2F;yam&#x2F;oct-2016&#x2F;prodeng\" rel=\"nofollow\">https:&#x2F;&#x2F;aka.ms&#x2F;yam&#x2F;oct-2016&#x2F;prodeng</a><p>Frontend Engineer\n* <a href=\"https:&#x2F;&#x2F;aka.ms&#x2F;yam&#x2F;oct-2016&#x2F;frontend-0\" rel=\"nofollow\">https:&#x2F;&#x2F;aka.ms&#x2F;yam&#x2F;oct-2016&#x2F;frontend-0</a>\n* <a href=\"https:&#x2F;&#x2F;aka.ms&#x2F;yam&#x2F;oct-2016&#x2F;frontend-1\" rel=\"nofollow\">https:&#x2F;&#x2F;aka.ms&#x2F;yam&#x2F;oct-2016&#x2F;frontend-1</a><p>keywords:- React, JS, JavaScript, HTML, Backbone, ES6, Redux, TypeScript, Ruby, Rails, Java, Postgres, REST Apis, Docker, Azure","time":1475865650,"type":"comment"}