{"by":"nchuhoai","id":13304678,"parent":13301832,"text":"Wellframe | Healthcare | Boston, Ma | Onsite&#x2F;Fulltime <a href=\"https:&#x2F;&#x2F;www.wellframe.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.wellframe.com</a><p>At Wellframe, we are building an intelligent care-management platform that allows health plans and care-delivery organizations to better manage large populations of complex patients. Because the most clinically complicated cases in a patient population tend to drive a majority of the costs, even seemingly small improvements in these patients’ well-being have dramatic benefits for the care provider. Wellframe focuses on improving patient health by providing personalized and adaptive care programs for people trying to recover from or manage serious health problems. We use the health data we collect in order to intelligently allot care resources to the specific needs of patients, paying special attention to the most-critical patients. Through clinical studies and working with large healthcare payers, we have seen that our platform improves patient outcomes, increases the capacity of care management teams and reduces costs of the care provider. We have a relatively small engineering team at about 10 engineers. What makes us unique is that we have a full time clinical team of doctors that work with us to break down clinical science so that we can build it back up into personalized and adaptive care programs.<p>We&#x27;re currently looking for several mid&#x2F;senior engineering positions (android, iOS, frontend, infra&#x2F;platform, sre) across our engineering team. More descriptions can be found on our jobs page (below). If you&#x27;re in the area I&#x27;d love to just grab coffee regardless of whether or not you&#x27;re actively looking to move -- I love talking to other passionate, driven people about what they do.<p>Our stack is native Android (Java) and iOS (Objective-C), our API is served in a Ruby on Rails monolith and Scala services, on top of MySQL, Cassandra, ElasticSearch and Spark. We are especially focusing on expanding our frontend team as we see significant growth on that side of the product. We are mostly Backbone + React, although some more complex state we are moving to Redux. It&#x27;s a very exciting time for the frontend, as we are planning to grow both in scale in terms of patient populations, as well as product use cases that require diverse interactions. It is super rewarding to see our product affect real people&#x27;s lives and the opportunity to reinvent this massive industry is enormous.<p>Jobs: <a href=\"https:&#x2F;&#x2F;www.wellframe.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.wellframe.com&#x2F;jobs</a> Also feel free to reach out to me at nam@wellframe.com!","time":1483392329,"type":"comment"}