{"by":"diddeb","id":13305178,"kids":[13308791],"parent":13301832,"text":"Stockholm, Sweden | ONSITE | Full-time | Senior Software Engineer and Devops&#x2F;Reliability Engineer<p>Dreams is challenging the fundamental idea of how banking is experienced by people every day. We&#x27;re currently changing the landscape of personal savings by combining behavioural economics, findings from cognitive behavioral therapy, a tight user experience with technology. 2017 will be an exciting year as we look to execute on our product roadmap.<p>We&#x27;re a mixed bunch of around 20 people: developers, behavioral scientist, data scientists and pretty much everything in between. Oddly enough, we only have one ex-banker involved in the mix – casual dresscode all week long :)<p>You will be working with our existing platform, ultimately helping people learn how to best realize their own dreams. In a nutshell, how they spend less on crap and channel those savings into things dreams are made of. It&#x27;s pretty awesome.<p>The tooling we use vary from component to component as the architecture is by design built to support multiple languages and platforms. Today, we like using Ruby, Python and Java – looking at Crystal for a prototype application. Bringing your own knowledge and experience into the mix is highly encouraged.<p>Feeling intrigued? Ping hello@getdreams.com and come over for a fika (<a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Fika_(Sweden)\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Fika_(Sweden)</a>). We would love to learn more about you!<p><a href=\"https:&#x2F;&#x2F;www.getdreams.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.getdreams.com&#x2F;</a> and <a href=\"https:&#x2F;&#x2F;itunes.apple.com&#x2F;se&#x2F;app&#x2F;dreams-spara-till-drommar&#x2F;id1083073963\" rel=\"nofollow\">https:&#x2F;&#x2F;itunes.apple.com&#x2F;se&#x2F;app&#x2F;dreams-spara-till-drommar&#x2F;id...</a> – sorry, our english version of the site is a WIP.","time":1483397034,"type":"comment"}