{"by":"ejo0","id":13303376,"parent":13301832,"text":"PHOSPHORUS | Technical Product Manager &amp; Software Engineers | New York, NYC | ONSITE | Fulltime | <a href=\"http:&#x2F;&#x2F;phosphorus.com\" rel=\"nofollow\">http:&#x2F;&#x2F;phosphorus.com</a><p>PHOSPHORUS is a computational genomics company with the vision to create a world where every healthcare decision is optimized with genomics. Founded in 2016 and based in New York City, Phosphorus develops powerful data-driven software that enables labs around the world to deliver the most advanced clinical genetic tests beginning in cardiovascular genetics and for infertility. With a team of experts in computational biology and computer science, Phosphorus is building a data network that will help providers, researchers and patients around the world better understand and harness the power of the human genome.<p>We are a spinoff from Recombine&#x27;s acquisition by CooperSurgical last year, we are growing quickly, and are well-funded with a Series A by FirstMark Capital.<p>We are looking to hire a Technical Product Manager with prior technical experience and experienced software engineers. We use Spark, Scala, Rails, Parquet, Javascript, SQL, AWS, etc.<p>Our interview process is straightforward and quick. Phone screen, followed by in-person interviews.<p>Keywords: genomics, scala, technical product manager, intern<p>More information on positions can be found here:<p>* Technical Product Manager - <a href=\"https:&#x2F;&#x2F;phosphorus.workable.com&#x2F;jobs&#x2F;347163\" rel=\"nofollow\">https:&#x2F;&#x2F;phosphorus.workable.com&#x2F;jobs&#x2F;347163</a><p>* Summer 2017 Software Engineer Intern - <a href=\"https:&#x2F;&#x2F;phosphorus.workable.com&#x2F;jobs&#x2F;343340\" rel=\"nofollow\">https:&#x2F;&#x2F;phosphorus.workable.com&#x2F;jobs&#x2F;343340</a><p>* Software Engineer - <a href=\"https:&#x2F;&#x2F;phosphorus.workable.com&#x2F;jobs&#x2F;312859\" rel=\"nofollow\">https:&#x2F;&#x2F;phosphorus.workable.com&#x2F;jobs&#x2F;312859</a><p>* Senior Software Engineer - <a href=\"https:&#x2F;&#x2F;phosphorus.workable.com&#x2F;jobs&#x2F;312856\" rel=\"nofollow\">https:&#x2F;&#x2F;phosphorus.workable.com&#x2F;jobs&#x2F;312856</a><p>Message Eugene at eugene@phosphorus.com if interested. Also if you want to learn more about this area happy to talk, just send me a message.","time":1483383059,"type":"comment"}