{"by":"ykil","id":13307151,"parent":13301832,"text":"proteinmetrics.com | Senior Software Engineer | San Carlos CA | Full Time | ONSITE<p>We are seeking a talented and self-motivated senior software engineer who is excited to be play a key role with a small, rapidly growing software company serving life science researchers.  We expect the applicant to be able to contribute to our software team immediately, with both hands-on coding and an ability to direct remote resources as needed.  The candidate should have experience writing commercial desktop applications in C++ and other languages that allow users to interact with rich data sets and in meeting commercial development milestones.  Must be legally eligible to work in the U.S.\nSkills &amp; Requirements:\n• Object oriented design and programming in C++\n• At least 5+ years of experience developing commercial applications\n• Experience with SQL\n• Strong time management, teamwork, and interpersonal skills\n• Experience with C#, Qt, java, python are desirable\n• B.S. or higher in computer science or related field, or extensive software development experience<p>Experience in any of the following areas are a plus:  back-end development, web development, statistics, algorithms, bioinformatics, cloud or cluster computing, additional programming languages.<p>Contact ykil+hn@proteinmetrics.com<p>----\nAbout Protein Metrics<p>Protein Metrics is a dynamic software company serving biopharmaceutical development professionals and proteomics researchers. The company focuses on the analysis of mass spectrometric and other analytical data to provide detailed, efficient characterization of proteins and glycans. Over the past ten+ years, hardware for mass spectrometry and other analytical techniques has improved at an amazing rate, but the software for analyzing the resulting wealth of data has not kept pace. The company’s aim is to correct this imbalance by providing innovative software to make analytical results more complete, sensitive, accurate, and easier to achieve allowing scientists to convert data into to knowledge.<p><a href=\"http:&#x2F;&#x2F;www.proteinmetrics.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.proteinmetrics.com&#x2F;</a>","time":1483424654,"type":"comment"}