{"by":"sveme","id":13302573,"parent":13301832,"text":"CellTool | Munich, Germany | Software Developer&#x2F;Bioinformatician | ONSITE<p>Who we are and what we can offer<p>CellTool, a biomedical startup working on Raman spectroscopy with a functional (and also already sold) device consisting of a digital microscope, camera, laser, spectroscope and fluorescent lighting. We are a small team with lots of individual responsibilities and often need to quickly learn a new technology to solve our tasks. You will be working on GUI design (using Python and Qt), Database stuff and data&#x2F;image analysis and visualization, so plenty of different demanding, but always interesting, tasks. You will have an office all for yourself and the beautiful lake Starnberg right in front of you for a quick summertime afterwork or lunchtime swim. Munich is just a 35 minute train ride away.<p>Job description<p>You will be maintaining, extending and refactoring the GUI controlling the BioRam device. You will implement new data processing and analysis methods so that they are accessible from the GUI. Sometimes a new device will have to be integrated in the software, so you’ll have to write a wrapper around the driver.<p>Skills &amp; Requirements<p>+ Our GUI is written in Python and Qt using the pyQt bindings and makes extensive use of twisted for asynchronous communication with devices and the database, so some prior knowledge about object-oriented Python is essential and knowledge of Qt and twisted would be beneficial<p>+ Data are stored in a CouchDB database, so some understanding of NoSQL document stores is helpful. At the least, you should know how to write some Javascript to be able to write new views.<p>+ Data and Image Analysis is mostly done using Python (numpy, scipy, scikit-learn and scikit-image), so prior exposure will help you get up to the task much quicker.<p>+ Being a startup, we are a small team that has to handle a lot of different things, so flexibility, quick learning and good team communication skills are essential.<p>Why work with us?<p>+ We acknowledge your creativity and input, due to our lean organizational structure.<p>+ Close customer contacts guarantee diverse projects and never boredom.<p>+ Highly interesting insights in innovative bio-medical research projects.<p>If this attracts your attention, please send us your CV (ideally including a link to your github account, if existing) and cover letter or email k.schuetze at celltool.de for any further questions.","time":1483377664,"type":"comment"}