{"by":"tbarbugli","id":13302282,"parent":13301832,"text":"Stream.io | Backend Developer, Python | Amsterdam, The Netherlands | ONSITE | Full time<p>We&#x27;re currently expanding our core development team in Amsterdam and are looking for a talented Python Backend developer. Our ideal candidate has years of experience building complex systems at scale.<p>Our stack<p><pre><code>  * Python&#x2F;RabbitMQ&#x2F;ZeroMQ&#x2F;Golang&#x2F;NodeJS\n  * AWS &#x2F; Softlayer &#x2F; GCE\n  * Cassandra&#x2F;Postgresql&#x2F;Redis&#x2F;Memcached\n  * Puppet&#x2F;CloudInit&#x2F;Terraform&#x2F;Cloudformation\n</code></pre>\nSkills and requirements<p><pre><code>  * Bachelor’s degree in Computer Science or prior engineering experience \n  * Experience building complex high performance software \n  * You are fluent with Python and at least a 2nd language like Go, Erlang, Scala or similar\n  * Comfortable with Django\n  * In-depth experience with SQL database\n  * Memcached&#x2F;Redis\n</code></pre>\nWhat we offer<p><pre><code>  * Work on nice-to-have problems (millions of HTTP requests every day)\n  * Competitive salary \n  * Dev setup of your choice\n  * Equity\n</code></pre>\nAbout Stream<p>Stream is an API for building, scaling and personalizing feeds. The technology relies heavily on Cassandra and machine learning. Stream powers the feeds for over 50 million end users and handles billion feed updates every day. Our customers include small startups as well as Fortune 500 companies. Building a scalable, highly available, secure and performant feed infrastructure is a hard problem.<p>About us<p>Stream was founded in The Netherlands and joined the prestigious Techstars accelerator in NYC. After Techstars Stream raised $1.75m and now has offices in both Amsterdam and Boulder, Colorado.\nMore details: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;stream&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;stream&#x2F;jobs</a> or email tommaso@getstream.io","time":1483375980,"type":"comment"}