{"by":"rene_lf","id":13305575,"parent":13301832,"text":"The Linux Foundation | Linux Systems Engineer | Full time | REMOTE (AU preferred) | $109k (AUD) base salary<p>We are looking for an experienced Linux Systems Engineer to join the Certification IT team. The Certification IT team is responsible for the development and support of the Certification Platform which hosts various skills based technical exams.<p>For more information about our service, visit <a href=\"https:&#x2F;&#x2F;training.linuxfoundation.org&#x2F;certification\" rel=\"nofollow\">https:&#x2F;&#x2F;training.linuxfoundation.org&#x2F;certification</a>.<p>Job Responsibilities:\n - Assist in design, development, testing, implementation, deployment and maintenance of distributed systems across multiple regions within different Cloud providers.\n - Provide level 3 technical support to Linux Foundation support staff on platform operational related issues.\n - Document technical design and processes for Linux Foundation team members<p>Skills and Technical Experience:\n - Advanced Linux system programming in bash and python.\n - Linux systems management using SaltStack and the SaltStack API.\n - Low level Linux system administration experience with CentOS, Ubuntu and openSUSE with excellent troubleshooting and problem solving skills.\n - Experience using git for version control.\n - Experience with AWS services EC2, CloudFormation, SQS, S3, VPC, IAM and Route53 in a production environment.\n - OpenStack experience running in a production environment.\n - Experience with building and deploying Docker containers within production environments.\n - Python experience in building HTTP API clients and servers.\n - A demonstrated ability in writing technical documentation for team members to communicate complex design, concepts and workflows.\n - Ability to work autonomously from a remote location with team members being located in the United States, Canada and Australia.<p>The Linux Foundation is a largely all-remote workforce that hires top-notch talent.  We are as passionate of providing a flexible and supportive work culture as we are in Open Source Software.  Collaboration is in our DNA, and we pride ourselves on being able to work closely together while not being tied to an office.<p>The Linux Foundation is an equal opportunity employer.<p>For more information, check out <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;linuxfoundation.org&#x2F;4b14926f-7b26-4a00-b4c8-183d02d5d988\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;linuxfoundation.org&#x2F;4b14926f-7b26-4a00...</a>.<p>To apply, send a short email to it-jobs@linuxfoundation.org with your resume or use the above jobs.lever.co link.","time":1483402096,"type":"comment"}