{"by":"cj","id":13303495,"kids":[13306364],"parent":13301832,"text":"Localize | <i>Senior</i> Javascript Engineer | San Francisco (SF) | Full-Time | Onsite &#x2F; Remote<p>Localize (<a href=\"https:&#x2F;&#x2F;localizejs.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;localizejs.com&#x2F;</a>) is building tools to help companies launch their products in other countries and languages. Our mission: unify the internet by breaking down language barriers, allowing companies, services, and information to be freely accessible to anyone + everyone, anywhere. Growing customer base: Meraki, Uber, Tinder, StatusPage, Bulova, and 500 more... from Fortune 500 as well as small family-run restaurants. Founded by YC + Techstars alum, 3x revenue growth in 2016, near cashflow neutral in 2016. We&#x27;re building a sustainable + scalable, customer-funded business that won&#x27;t go bust in 2 years.<p>We&#x27;re a team of 8 people and 4 engineers (half remote, half in SF). On-site in SF (4th &amp; Brannan) preferred for this role, but will consider remote.<p>We&#x27;re looking for senior engineers with 5-10+ years of real-world experience + expert level Javascript experience.<p>Small company offering large-company benefits, without the bureaucracy. Sane 40-hour work week, competitive salary + equity, 401k + matching, 100% company-paid health insurance, life insurance, generous + flexible PTO, paternity &#x2F; maternity leave, charity donation matching, plus the standard startup stuff like bean bags + free food ;)<p>You should be able to:<p><pre><code>  —  Navigate our stack: Javascript, Node, Backbone, MongoDB, Redis, AWS.\n\n  —  Use native browser APIs, deep understanding of Javascript (w&#x2F;o jQuery or frameworks).\n\n  —  Solid understanding of MVC patterns.\n\n  —  Excited by (and experience with) learning and managing a large + complex code base. \n\n  —  Understanding that *efficiently* delivering the best experience to customers + meeting company objectives sometimes requires working with legacy code.\n\n  —  Understanding of unit &#x2F; integration testing, TDD, and security best practices.\n\n  —  Understanding that the &quot;latest and greatest&quot; Javascript frameworks aren&#x27;t always better than vanilla Javascript.\n\n  —  Learn quickly, act autonomously, think analytically.\n\n  —  Bonus points for UI &#x2F; UX &#x2F; design experience or management experience.\n</code></pre>\nApply by emailing emailing CEO: brandon@localizejs.com or jobs@localizejs.com.<p>1-2 week application process: Non-technical phone screen, real-world coding exercise (no whiteboard!), in-person meeting or 2nd phone screen if remote.<p>Timeline:  ASAP, but flexible up to a couple months.<p>Relocation:  Financial assistance available, TN visa, H1B sponsorship if remote, O1 visa if applicable.","time":1483383897,"type":"comment"}