{"by":"managedbyq","dead":true,"id":13309438,"parent":13301832,"text":"Managed by Q\nNew York, NY- Software Engineer- Onsite- Full time<p>About Q:<p>Q is building an operating system for physical space, backed by a comprehensive technology and service platform. Today, hundreds of companies in four cities trust Q to make their offices run better. We handle everything from catering to IT, to cleaning, plumbing and office supply management.<p>We also believe that creating good jobs is fundamental to our success. We treat all of our employees well — from software engineers to office cleaners. We know that 5-star service comes from talented, motivated people.<p>Engineering at Q<p>We are using technology to take the headache out of office management.  We are building a platform to help office managers run their offices seamlessly, to allow vendors to fulfill requests with ease, and to enable our employees to work more efficiently. We have a problem-solving culture that is based on making an impact instead of hitting arbitrary deadlines.<p>Software Engineer:<p>You will be responsible for making engineering design decisions and developing features that support our technical and product strategy. We are solving logistics problems such as consolidating billing, dispatching the right person to the right place at the right time, helping employees book services seamlessly, vendor fulfillment, and a robust Marketplace. We follow best practices, to ensure we’re writing clean, tested, and scalable code.<p>What we are looking for:<p>- We take a generalist approach to hiring. We’re looking for smart engineers who are problem solvers and passionate about their craft<p>- 4+ years experience building software or web applications\nDoesn’t matter what language, just a focus on writing well designed code (our stack is JavaScript, Python, MySQL, and PostgreSQL)<p>Apply here- <a href=\"https:&#x2F;&#x2F;managedbyq.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;managedbyq.com&#x2F;careers&#x2F;</a>","time":1483454823,"type":"comment"}