{"by":"hgscngsi","id":13302200,"parent":13301832,"text":"Senior Scientific Programmer Human Genome Sequencing Center, Baylor College of Medicine<p>Onsite, Houston, TX<p>apply online here: <a href=\"https:&#x2F;&#x2F;www.hgsc.bcm.edu&#x2F;careers&#x2F;senior-bioinformatics-programmer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.hgsc.bcm.edu&#x2F;careers&#x2F;senior-bioinformatics-progr...</a><p>Job Summary: Software you write in the Next-Generation Sequencing Informatics (NGSI) clinical informatics group will influence healthcare decisions for thousands of patients and contribute to research projects with far-ranging impacts on human health. The position requires an individual with very strong software development skills; especially design and implementation of highly available production systems. We&#x27;re looking for experienced software engineers who are up to that challenge, and who have a track record of working in an environment that demands a high level of quality.<p>As the HGSC Bioinformatics Core, NGSI manages the production, maintenance and primary analysis of all HGSC genome sequence data, including HiSeq X Ten informatics. This position will be specifically involved in supporting several large clinical projects. Under the direction of the NGSI clinical lead, you will develop features and upgrades to software pipelines for data generation and analysis of next-generation sequence data.\nThe HGSC was founded in 1996 under the leadership of Dr. Richard Gibbs and is a world leader in genomics. The fundamental interests of the HGSC are in advancing biology and genetics by improved genome technologies. As one of the three large-scale sequencing centers funded by the National Institutes of Health, the HGSC provides a unique opportunity to work on the cutting-edge of genomic science in a state of the art institution. Today, the HGSC employs ~ 200 staff, and it occupies more than 36,000 square feet on the 14th, 15th, and 16th floors of the Margaret M. and Albert B. Alkek Building. The HGSC is located on the southwest edge of downtown Houston, the fourth largest city in the U.S., in the Texas Medical Center, the world&#x27;s largest medical complex. The major activity of the HGSC is high-throughput DNA sequence generation and the accompanying analysis. The HGSC is also involved in developing the next generation of DNA sequencing and bioinformatics technologies that will allow greater scientific advances in the future.<p>REQUIREMENTS: B.S. or equivalent in Bioinformatics, Computer Science or similar field with 3+ years relevant work experience Linux background with at least 3 years hands-on experience working on Unix&#x2F;Linux terminal and programming with Python, Ruby or Java<p>Duties Maintain and develop analysis pipelines, including refactoring to improve performance and maintainability Improve maintainability and testability of existing code Support on-going operations for clinical projects Maintain extensive project-specific documentation and best practices Participate in calls and meetings with collaborators Identify novel ways to improve data quality and analysis Provide excellent customer service to other HGSC groups and outside collaborators through ticketing systems<p>Desirable Skills and Experience: Preferred Experience: Familiarity with next-gen Sequencing analysis tools (e.g., BWA, vcftools, BEDtools, bamUtils, SAMtools, Picard) and common genomics data formats (e.g., FASTQ, BAM, VCF)","time":1483375405,"type":"comment"}