{"by":"jcnhvnhck","id":13310849,"parent":13301832,"text":"SimplyCredit (<a href=\"https:&#x2F;&#x2F;www.simplycreditinc.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.simplycreditinc.com&#x2F;</a>) | Scala and Clojure Engineers | SF Bay Area<p>We are looking for talented Scala and Clojure engineers eager for a defining role in building a company. As an early employee you will be responsible for architecting and building key aspects of our platform, work autonomously guiding the technologies we use and create, and help develop our company and engineering culture. You’ll work directly with the founders who have deep experience in consumer lending, data science and business development from their work at companies FICO and Kaggle.<p>RESPONSIBILITIES<p>Build RESTful APIs that will power the user-facing website and mobile apps * Write secure code and ensure the privacy and safety of sensitive user information * Interface with financial system APIs such as the credit bureaus and payment systems * Architect the backend to allow for sophisticated deployment of machine learning algorithms and data science  * Design and build the data warehousing infrastructure * Define key workflow infrastructure including automated testing, continuous integration, and continuous deployments * Experience with PCI compliance, payment systems or other banking applications is a plus * Language&#x2F;stack experience in Scala or Clojure * At least 4 years of experience with RESTful web architecture * Experience building consumer products<p>If you’re itching to get in on the ground floor of building a new product and company, then we’d love to hear from you! Send an email with your resume to jobs@simplycreditinc.com and let us know why you would be a good fit at SimplyCredit.<p>About SimplyCredit\nAt SimplyCredit, our mission is to redefine consumer lending as it is known today. We believe in doing right by the consumer: no fees, no penalties, no gotchas or fine print. We want to bring sanity back to lending and ensure that consumers get the value and service they deserve. Using advanced technologies we are creating credit and lending innovations in line with these values, all delivered through seamless customer experience.","time":1483464371,"type":"comment"}