{"by":"0xa","id":13310630,"parent":13301832,"text":"Kensho | <a href=\"https:&#x2F;&#x2F;www.kensho.com&#x2F;#&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kensho.com&#x2F;#&#x2F;careers</a> | Primarily: Boston, MA (Cambridge) and Washington DC. Case-by-case: New York (NYC) | ONSITE | FULL TIME<p>Kensho is applying machine learning and quantitative algorithms to timeseries, graph and unstructured data to make computer driven answers faster, more accessible, intuitive and beautiful.<p>-----<p>+ Software Engineers -- Front end, backend, infrastructure, APIs, apps, frameworks, performance, security, data wrangling.  Machine learning skills a strong plus.<p>+ Machine Learning Engineers and Scientists -- You understand the math, the tools, and the implications of various algorithms and approaches.  Software engineering skills a strong plus.<p>Who We Interview:<p>You stand out due to your work at a top technology company, research, and&#x2F;or open source contributions.<p>Our Interview Process:<p>* We hope you&#x27;ll share a project, paper or resume with us that highlights where you shine, with a short note so we can appreciate you as a person. Please say hi at jobs@kensho.com or <a href=\"https:&#x2F;&#x2F;www.kensho.com&#x2F;#&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kensho.com&#x2F;#&#x2F;careers</a><p>* As a small team, we&#x27;ll reach back out to a few individuals to chat with a team member via phone, video or, if you are local, in person--to show and discuss your work, projects and code<p>* We may ask you to do a programming or data science challenge (&lt;= 4 hours)<p>* We&#x27;ll invite you to our Harvard Sq. headquarters to meet more of the team, where we hope you&#x27;ll interview us too<p>* We&#x27;ll discover we are peanut butter and jelly together, and wish we&#x27;d met sooner<p>* Having made you a non-exploding offer, we think you&#x27;ll want to sign it<p>* You&#x27;ll join us and have a lot of fun, get to play with fascinating data, algorithms and technology alongside delightful, hungry and creative people<p>* Something about being on a mission to change the world (hey, we&#x27;re a start up)<p>Stack: Functional javascript (react, canvas), python (numpy, pandas, scikit-learn et. al.)","time":1483463234,"type":"comment"}