{"by":"elgeeko1","id":13323026,"parent":13301832,"text":"Lead Backend Engineer for Hamburger Making Robots | San Francisco, CA | ONSITE | $140-$160k + equity<p>Momentum Machines makes the most advanced restaurant robots in the world. We&#x27;re a small collective of food lovers and engineers with decades of robotics and restaurant experience.  We bring robotics to life and delight to our guests.<p>You are:<p>+ An experienced backend developer: You’re proficient in a backend language and framework, you know your way around a cloud hosting platform, and you’re not afraid of dipping your toes in front-end when needed. You care about SQL vs. NoSQL, but not that much. You also know how to make Linux work for you.<p>+ An architect: You start from a blank slate, you chose the technology stack that best fits the product and timeline, and you use off-the-shelf as often as possible. You’re up-to-speed on the latest technology trends. You have a deep understanding of security, scalability and reliability.<p>+ Autonomous: You take initiative and pitch in where it helps the most. You play well with software developers but will go solo when necessary. You carve your own path and are driven to do your best. You also communicate well (with humans).<p>+ Pioneering: You’re excited to take creative control of a greenfield project and to be among the first to revolutionize how we eat.<p>+ User-oriented: You design for the user above all else.<p>You will:<p>+ Choose our technology stack: our guests are agnostic to language, framework, database and hosting platform. You recommend the technology stack that gets us to market and delivers the best guest experience. The language can be Python, Javascript, Ruby, PHP, Java, or other; the framework can be Django, Flask, Node.js, Backbone.js, Ruby on Rails, FuelPHP, or other; the database can be SQL or NoSQL; the hosting platform can be AWS, Google App Engine, Microsoft Azure, Heroku or other.<p>+ Build a backend: you turn on a cloud host, set up a backend framework and database, and create an API that allows guests to place orders and machines to produce them.<p>Apply at <a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;3zqrj9\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;3zqrj9</a>","time":1483571548,"type":"comment"}