{"by":"sync","id":13338581,"parent":13301832,"text":"Thought Industries | REMOTE | US | Full-time | Javascript Application Engineer | <a href=\"https:&#x2F;&#x2F;www.thoughtindustries.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thoughtindustries.com&#x2F;</a><p>We’re looking for a JavaScript Application Engineer to help us build out our SaaS Learning Business Platform.<p>You would be a good fit if:<p>- You are excited about new web technologies like ES2015 and RxJS.\n- You sweat the small stuff, but know when to ship it.\n- You are passionate about listening to users &amp; building elegant web products.<p>We use Node.js with Koa and Ember.js, but are open to any framework experience you might have. This role is split evenly through the full stack. Bonus points for reporting, data viz, and any AWS experience you might have.<p>Throughout the day, we rely on Slack, GitHub pull requests, and Screenhero for remote collaboration. Our platform makes heavy use of Node.js, RethinkDB and Ember.js. The development team is completely distributed across the US.<p>The company:\nThought Industries is a funded startup in the Online Learning space. We enable companies to launch and sell their own online school and distribute learning material — think Shopify meets Udemy&#x2F;Coursera.<p>This is a full-time position. You can work from anywhere, but there should be some overlap with US East Coast hours. No Recruiters, please, and we are only able to consider US citizens at this time.<p>Headquartered in Boston, Massachusetts, Thought Industries is one of the world’s fastest-growing online learning companies in the U.S. We are helping consumer brands and for-profit learning organizations change how they build, deploy and grow online learning businesses. Today, more than 100+ customers and brands are using the Thought Industries’ Learning Business Platform to transform the way they reach, teach, and engage audiences.<p>We are a growing, well-funded technology company, with a talented team and a clear vision. This is a unique opportunity to take a lead role at an exciting SaaS software company with a robust cloud-based platform. We hire talented people who are self-motivated and team orientated.","time":1483726060,"type":"comment"}