{"by":"kmtrowbr","id":13332870,"parent":13301832,"text":"ALPINE DATA | SENIOR JAVASCRIPT DEVELOPER | SAN FRANCISCO | ONSITE, VISA, <a href=\"http:&#x2F;&#x2F;alpinedata.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;alpinedata.com&#x2F;</a><p>My company is looking to hire a senior Javascript developer to take change of our Backbone.js frontend.<p>Here are a few of the things I believe we should try to accomplish (I&#x27;m looking for someone to have this conversation with):<p>* Our Backbone codebase is currently located deep within a Rails app, and served with the Rails asset pipeline.  I think we should separate the two codebases.  The Backbone Javascript codebase could then use be set up with modern tooling such as npm, webpack, etc.<p>* Some folks have thought we should scrap the Backbone codebase entirely and rebuild it using a newer framework like React or Angular.  But, I believe that it&#x27;s too large for that, and I&#x27;d prefer a moderate approach where, we upgrade to the latest Backbone version, perhaps using Marionette as well, while also refactoring &#x2F; cleaning the codebase.  We could also refactor it to use a v2 of the Rails API.<p>You should be a modern Javascript expert who has worked on many (minimum 2-5) Backbone.js projects.  You should be comfortable and passionate enough about Backbone.js to be willing and interested to refactor a large, existing app to be more performant, easier to work with, and so on.<p>So -- and thank you for reading this far -- basically we have a great opportunity -- lots of well paid, very comfortable, steady, challenging and interesting work, for the right person.<p>We offer very competitive pay, a very diverse, friendly, modern (unlimited snacks and drinks! not too many meetings!) and relaxed work environment, as well as valuable stock options.  Office is in SF, SOMA and you must be able to come into the office several times per week.<p>Please apply here: <a href=\"https:&#x2F;&#x2F;www.jsco.re&#x2F;l-zx\" rel=\"nofollow\">https:&#x2F;&#x2F;www.jsco.re&#x2F;l-zx</a> OR you can email me directly at kevin@alpinenow.com","time":1483663006,"type":"comment"}