{"by":"ivanmanolov90","id":13382775,"parent":13301832,"text":"Reaktor | New York City | Full-time | Senior Software Engineer| <a href=\"https:&#x2F;&#x2F;www.reaktor.com&#x2F;careers&#x2F;senior-software-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.reaktor.com&#x2F;careers&#x2F;senior-software-engineer&#x2F;</a><p>Reaktor is a strategy, design, and engineering company based in NYC, Helsinki, Tokyo and Amsterdam. Our New York office is growing fast and we’re always on the look-out for the most talented software engineers to make sure our teams are filled with best in class individuals. We might all have climbed far up the career ladder in our past lives, but here we leave our titles at the door and work together to get shit done with clients like HBO, Michael Kors, Nasdaq, Samsung, Supercell, and Finnair.<p>Here’s what we can offer you:<p>- Teams that are totally autonomous and cross-functional.<p>- A community of amazing people who will both teach you and learn from you.<p>- Experimentation and continuous improvement of our skills and ways of working.<p>- A commitment to constant evolution (and the occasional revolution).<p>- A world without hierarchy—big ideas can come from anyone and anywhere.<p>- A ton of fun!<p>What We’ll Expect From You:<p>- A ton of skills and wisdom in working with tech that you consider useful. In no particular order, here are some things many of us like: functional programming, Node.js, Clojure, React, Swift, SQL, NoSQL, general bleeding edge stuff.<p>- Passion for:<p><pre><code>  - Agile and lean principles that actually work – not rituals for rituals’ sake.\n\n  - Solving really hard problems (and doing it with clean code).\n\n  - Learning, growing, and embiggening your mind!\n</code></pre>\n- Willingness to be responsible for your work, development and career path. Don’t worry: we’ll have your back in whatever you want to achieve, but it’s up to you to have the end goal in mind.<p>- Authorization to work in the United States.","time":1484234033,"type":"comment"}