{"by":"instamotor","id":13386706,"parent":13301832,"text":"Hi everyone,<p>Instamotor is one of the fastest growing peer to peer used car marketplace, with financial services coming soon in 2017. We are based in San Francisco and currently process over $300 million&#x2F;year worth of transactions, and projecting to reach $1 billion in 2017. Led by a team of industry veterans from Amazon, Google, Lending Club and Nest—we’re driven by the principle that buying a safe and trustworthy used vehicle is a fundamental consumer right. Instamotor currently has over $8 million in funding from top investors who successfully funded companies such as Airbnb, Square, Uber, Zappos and more.<p>We are looking for a technically solid, product-driven senior full-stack engineer to work on both our marketplace and lending platform.<p>Responsibilities<p><pre><code>  Drive company vision and technical execution            \n  Help gather technical requirements for new features\n  Work directly with backend and frontend teams to drive feature delivery, and occasionally with other cross-functional teams.\n  Lead feature development by working directly with management,        \n  Review pull request code, drive technical roadmap, and contribute best-practices to the engineering team                        \n Identify areas of the code base in need of refactor\n Monitor production system and identify performance improvements\n Be awesome, have fun, and enjoy the joys and tribulations of a fast-growth startup :slightly_smiling_face:\n                        </code></pre>\nPreferred Skillset:                                    \n-  Ruby &#x2F; Elixir &#x2F; Node            \n-  Html &#x2F; CSS                \n-  Reasonable UI&#x2F;UX skills and ability to work with our UX team                                                             \n-  Bonus: postgres &#x2F; newsql &#x2F; docker &#x2F; redis &#x2F; elastic search...etc, as well as SEO&#x2F;page-optimizations<p>Our Technical Stack<p>Our web frontend uses a react&#x2F;redux&#x2F;node stack with a slightly modified version of bootstrap for markup&#x2F;styling. Our backend API is written in Ruby &#x2F; Elixir, and we current use three different storage technology: (1) postgres for transactional; (2) redis for caching; (3) and elasticsearch to support search functionality in our app. Our services run on AWS, are dockerize, and get continuously integrated via a jenkin&#x2F;github setup. Lastly, we have monitor our infrastructure with tools such as New Relic, Rollbar, Papertrail, Cloudwatch...etc. Lastly, we also have native apps for both iOS (swift&#x2F;obj-c) and Android (java&#x2F;kotlin).<p>If you are interested, send your resume along with your Github account information  to <i>tina@instamotor</i>. Thank you and have a great day!","time":1484259737,"type":"comment"}