{"by":"liangzan","id":6475937,"kids":[6475989,6476601,6476177,6476130,6480337],"parent":6475879,"text":"Dropmysite is an internet company based in small and sunny Singapore. We want to back up The Internet and we need your help to do so. We have 2 web properties which is Dropmysite.com and Dropmyemail.com.<p>Our engineering team is expanding. We are looking for two polyglot programmers to join us. As our job title suggests, you will come across many technologies at Dropmysite. Our core code base is written in Ruby(Rails &amp; Padrino), Node.js and Scala. We have smaller projects in a variety of technologies including Python, PHP, R, etc. We also have mobile projects which are soon to be launched. Be it front-end, back-end, or rear-end, you will have plenty of opportunities to work on them.<p>We aren&#x27;t yet-another-webapp. If you want to learn data mining and data visualization, we are doing that. Our backup system is written in Scala with Akka actors. If you are interested in the business side of things, we happen to have the best in-house SEO-SEM team in Singapore. There are plenty of challenging problems to solve.<p>Like everybody, we write tests, manage our configuration with Ansible, do continuous integration with Jenkins. And we take security seriously.<p>Our engineering team composes of:\n- Several Vimers, two Sublime Texters and one Emacs user.\n- Two standing deskers, and many sitting deskers.\n- Android rooters and no iOS fanboys.\n- One Thinkpad and others all Macs<p>Join us and add to that variety.<p>We are based in Singapore, the tech capital of South East Asia. That police state with negligible taxes, crazy expensive cars, and cosmopolitan city state. The weather here alternates between Hot-And-Humid or Rainy-And-Humid. It is never cold. People come in shorts. We are located in the startup hub of Singapore: BLK 71. Developer meetups happen upstairs. There are no strict working hours. You can work at home, in shorts, no shorts, we don&#x27;t care as long as you ship.<p>If you are interested, please contact me at zan@dropmysite.com","time":1380634195,"type":"comment"}