{"by":"soniantalent","id":6476502,"parent":6475879,"text":"<i></i>REMOTE<i></i><p>Software Engineer – Ruby<p>Sonian is looking for a highly motivated, goal-oriented individual who will be responsible for designing and developing the Web components for our cloud-based application. The candidate for this position will come with a deep knowledge of HTTP and REST, a solid understanding of Ruby and Ruby on Rails, and be strong with JavaScript, HTML, and CSS. Sonian Web applications front petabytes of data, so the ideal candidate will have experience with building scalable, secure, resilient, and highly distributed applications. Sonian praises well-written, maintainable code, so you must be well versed in object oriented design, design patterns, automated testing, concurrency, and systems architecture. You will be joining a fully remote team, so location is not important.<p>Responsibilities<p>Design and deliver features that meet the business needs of our customers while maintaining a state of the art user experience\nProduce high quality software designs to support long term maintainability and extensibility of code\nDeliver software that supports a highly available, fault tolerant SaaS applicaiton\nProduce high quality and well-documented code\nDeliver within an existing Agile methodology<p>Requirements<p>8+ years commercial software development experience, with at least 4+ years delivering user interfaces for web-based application\n2+ years production Ruby and Ruby on Rails development\nDistributed source control experience with Git\nStrong organizational skills\nSelf-motivated and able to work independently\nExcellent interpersonal and problem solving skills\nGood understanding of Software as a Service and “white-labeled” Rails apps\nSolid knowledge and hands-on experience with Javascript, including jQuery and Ext JS\nProven track record building high-performance enterprise-grade systems that scale\nFamiliarity with cloud based offerings like Amazon’s EC2 &amp; S3 or Rackspace Cloud\nUS-based, capable of working in remote team\nBonus: Familiarity with and knowledge of Clojure<p>To apply please send a cover letter and your resume to jobs@sonian.net. Please provide links to your github account or open source projects.  Use subject line “Software Engineer, Ruby &#x2F; Backend”.","time":1380638722,"type":"comment"}