{"by":"nixy","id":6476414,"parent":6475879,"text":"Accedo.tv, Stockholm | Hong Kong | Madrid | Santiago<p>SOFTWARE ENGINEER\nJob Description<p>Accedo.tv is looking for experienced web developers who wants to join our team of talended developers to continue to build and deliver rich web apps for the TV.<p>The interactive TV space is growing rapidly and we are delivering rich media apps on multiple platforms ranging from Smart TVs, gaming consoles and media devices to smart phones and tablets.<p>At Accedo you will get the opportunity to utilize your skills in rich front-end web development skills to create exciting ways for consumers to access media on their TV sets. The working environment is international and challenging – giving you the possiblity to evolve your skill set while working with new technologies and exciting customers and partners like HBO, Fox, Viaplay, Spotify, Orange and DTAG.<p>So, if you are experienced in modern web technologies and rich front-ends, love working in an international environment and interact with customers – we would very much like to talk to you more about what we do and how you could help us transform people’s living room experience.<p>Skills &amp; Requirements:\n  Experienced in modern web development.\n  Experience of web services and application development in smart phone &#x2F; tablet space.\n  Knowledge in SCRUM and&#x2F;or other modern development methodologies.  \n  Experience from system&#x2F;solution architect responsibilities from non-trivial projects.\n  Experienced in the TV industry (IPTV, Connected TV) is certainly a plus but not a necessity.<p>About Accedo.tv<p>Accedo is the global market leader in TV application solutions. Accedo provides applications, tools and services to media companies, consumer electronics and TV operators globally, to help them deliver the next-generation TV experience. Accedo’s cloud-based platform solutions enable customers to cost-efficiently roll out and manage application offerings and stores for multiple devices and markets.<p>Accedo is a privately held company founded in 2004 by telecom and media entrepreneurs Michael Lantz and Fredrik Andersson. Accedo is headquartered in Stockholm, Sweden with branch offices in London, Madrid, Palo Alto, New York, Los Angeles, Hong Kong and Sydney.<p>Contact nik at accedo dot tv, put HN in the subject line.","time":1380638009,"type":"comment"}