{"by":"x2Opteron","id":6476614,"parent":6475879,"text":"Chatham Financial (Kennett Square, PA) - Full time <a href=\"http://www.chathamfinancial.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.chathamfinancial.com</a><p>We&#x27;ve got an awesome developer culture going inside of this financial company (~150 tech people). You can email our HR rep[1], or me[2] with your resume and a few words of what you&#x27;re looking for.<p>If you&#x27;re interested in .Net development using the latest technologies, and pushing our architecture forward, then this is probably a place you want to work. We do use other techs where it&#x27;s appropriate (or for internal or fun projects), such as last week when I worked on a Golang webapp. We have quarterly Hack Weeks, which gives us a chance to explore self-driven projects that make sense for the business.<p>Below are the open positions, but if you&#x27;re a passionate and qualified guy&#x2F;gal, don&#x27;t hesitate to see where you might fit into our team!<p>* Web developer - You get to take the process from the data and service design all the way to the implementation of the UI, but you&#x27;ll need to be well versed in some aspect of web development (MVC&#x2F;JS&#x2F;CSS&#x2F;etc).<p>* Models developer - Same thing as the web developer, but you&#x27;ll need a passion for services, and the technologies that it entails.<p>* Test automation developer - We have been pushing the limits of HP&#x27;s BPT software suite for years now, so we have been building our own services testing framework (one of the goals of which is to open source it). The test team supports all the development we do, at approximately a 2devs:1tester ratio.<p>* DBA - Our Data Team is lean and the individuals on the team wear many hats. Our daily responsibilities include everything from TSQL data access performance optimization, to automating SQL Server and Windows with PowerShell, to working closely with software developers and business leads to create High-quality data solutions.<p>[1] recruting at chathamfinancial . com\n[2] gfrank at chathamfinancial . com","time":1380639697,"type":"comment"}