{"by":"littlebridge","id":6476041,"kids":[6476133],"parent":6475879,"text":"Little Bridge World Senior Server Developer - London\n<a href=\"http://www.littlebridge.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.littlebridge.com</a><p>Come and help us revolutionize language learning for children and become part of an exciting, successful and rapidly growing company, based in a great riverside location in West London. Working here you will have the satisfaction of developing something truly worthwhile.<p>We’re looking for a senior&#x2F;lead backend programmer who can take on a challenge in developing a robust and scalable solution which includes messaging, scoring mechanisms, achievements and a whole lot more. As a team leader you will write software, use your experience to coach other developers towards delivering high quality work, and help with further hires. You will report directly to the CEO.<p>Skills and Requirements<p>We&#x27;re developing layered services using PHP and Zend Framework, MySQL, noSQL and message queuing among others and we are open to using other languages and technologies if you can justify the changes within technical and commercial constraints.<p>We don&#x27;t require a formal education in computer science but we expect a working knowledge in areas such as time and space complexity of common algorithms and data structures, operating systems and networking fundamentals, database theory, concurrency and experience with dynamically and statically typed languages.<p>Essential<p>* LAMP stack<p>* IP Networking<p>* Network&#x2F;Application security<p>* Software development best practices<p>* Team player<p>Highly Desirable<p>* Zend Framework<p>* Unit testing<p>* Clustering<p>* Replication<p>* Team leading experience<p>* Computer science degree<p>* Commercial experience with statically typed languages (Java, C# or C++)<p>* Excited about impacting education<p>About Little Bridge World<p>Little Bridge mixes video game sensibilities with language learning.\nWe specialise in education, win awards and have customers in over 40 countries worldwide.  We&#x27;ve got a unique mix of social networking with learning, where kids can make friends all over the world to practice their English, with enough help along the way that they&#x27;ll never get stuck.<p>The company is currently expanding from web clients onto tablet and mobile and is revamping its products to better fit how children learn today.<p>Please mail us at jobs@littlebridge.com for more information.","time":1380635052,"type":"comment"}