{"by":"bkirkby","id":6477404,"parent":6475879,"text":"las vegas, nv\nzappos IP inc. is hiring for several tech related positions: <a href=\"http://about.zappos.com/jobs/jobs-zappos-family/search-open-positions\" rel=\"nofollow\">http:&#x2F;&#x2F;about.zappos.com&#x2F;jobs&#x2F;jobs-zappos-family&#x2F;search-open-...</a><p>three years ago i decided to come work at zappos after reading tony hseih&#x27;s book &quot;delivering happiness: a path to profits, passion and purpose&quot; with my wife. we had a couple of job offers at that time and the book convinced me that zappos is where i should go. the focus on customer and employee happiness seemed almost too good to be true and something that was not even approached at any other company i&#x27;ve been with in ~20 years.<p>i have to admit that for the first year i experienced all the awesomeness that i had read about, but i was also waiting for the other shoe to drop. i really didn&#x27;t believe it could be as good as i was experiencing.<p>then i finally realized there was no other shoe. the thing that really drove the point home to me was when i overheard a tech VP and the CTO talking about the valve entertainment employee handbook that was posted online. the handbook explained a corporate structure that was so flat that people had no direct reports and there was no managers telling people what to do.<p>any other leadership in any other company i had been with would have just scoffed at the idea and dismissed it as internet fluff. these guys were talking about it and asking questions like &quot;how do you think they make something like that work?&quot;<p>just the fact that they were having a discussion about it made me realize they are different, but i really didn&#x27;t expect anything to be done about it. it IS a radical idea after all and would likely only work with very specific organizations (or so i thought). now, 1.5 years later we are instituting a new radical management structure focused around self organization and a flat management model.<p>this tells me that the focus on constant improvement and intrepid company building goes all the way to the top.<p>and that&#x27;s just part of the awesome experience here. i could go on and on and on.","time":1380646704,"type":"comment"}