{"by":"drags","id":6477194,"kids":[6478256],"parent":6475879,"text":"VERBA - San Francisco<p>* Rails&#x2F;JS Product Focus - HALF-TIME with benefits<p>* Rails&#x2F;JS Product Focus - FULL-TIME<p>* Product&#x2F;Infrastructure Reliability&#x2F;Performance Focus - HALF-TIME with benefits<p>I mentioned a couple months ago that we have a couple engineers who work half-time-ish (and do their own things the rest of the time) and it got some positive feedback: <a href=\"http://news.ycombinator.com/item?id=5235860\" rel=\"nofollow\">http:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=5235860</a><p>We&#x27;re looking to hire a couple more engineers who are interested in being part of a team but would prefer to work 24-40 hours per week instead of the usual 50+. We&#x27;re also looking to hire someone full-time (40ish hours per week). If this sounds interesting let me know (ragalie@verbasoftware.com)<p>=========<p>About us:\nThe college textbook market is currently being disrupted. Verba helps colleges and universities transform themselves so that they a) embrace the power of transparency and the internet, b) become agents of change in the textbook industry instead of agents of reaction and c) continue to make approximately the same profit margin from course material sales.<p>About 300 colleges and universities use our applications to acquire low-cost inventory and price textbooks competitively. Then millions of students visit our white-labeled sites to transparently compare the bookstore&#x27;s offers against online competitors, and around 80% of students choose to buy from their local bookstore.<p>We&#x27;re looking for people familiar with some of Ruby, Rails, Clojure, MySQL and JS who can help us grow faster. We have a great team, embrace new technologies (we just switched to Puma, we&#x27;re moving to the JVM so we can use Netflix&#x27;s Hystrix project to reduce API-related downtime), but also care a lot about producing and maintaining a stable, solid product for our customers.<p>The ideal person has strong Rails knowledge, solid testing practices, a good head for architecture and knows enough JS to help out on front-end. Additional pluses are a stats background, experience with Hadoop and knowledge of scheduling algorithms.<p>You can check out our website (<a href=\"http://www.verbasoftware.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.verbasoftware.com</a>) to read about our current products and hear people say nice things about us. :)","time":1380644963,"type":"comment"}