{"by":"ryanfitz1604","id":6477050,"kids":[6477965,6477557],"parent":6475879,"text":"SpaceX - Los Angeles, CA\n<a href=\"http://www.spacex.com/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.spacex.com&#x2F;careers</a><p>We seek to accelerate the course of human history by developing the technologies necessary for multi-planetary civilization.<p>We build rockets and spacecraft from the ground up, utilizing much of our own electronics, software, vehicle structures, and engine systems. The Falcon launch vehicle and Dragon spacecraft are among the most ambitious engineering systems in the world. Dragon holds the distinction of being the first commercially developed spacecraft to have achieved orbit, rendezvous with the International Space Station, and a safe return to Earth. SpaceX is advancing the state of the art in a field previously dominated by nation states.<p>Our next developments include a heavy lift launch vehicle, human transportation, and a reusable launch system that will drastically reduce the cost of access to space.<p>FLIGHT SOFTWARE DEVELOPER\nAs a software developer on the flight software team, you will be creating software that is used to design, develop, launch and operate SpaceX flight systems. You will engage with other SpaceX engineers to discover the needs of the mission and code highly reliable software that turns the mission into a reality. You will be responsible for the complete lifecycle of the software you create, from development to testing to operation during a mission. You will accept a large degree of personal responsibility, work on awesome stuff and every day be completely baffled as to how you ever worked anywhere else.<p>SPACEX SOFTWARE ENGINEERING\nThe flight software team is responsible for the software that runs on-board SpaceX rockets and spacecraft, but we do more than embedded software engineering: we also do simulations, distributed data management, and analysis tools used in preparation for a launch. Our problem domains span embedded, fault tolerant, flight control, web, mobile, cloud, and big data computing. The products that we develop run on low-power space computing platforms, mobile devices, desktop systems, and in data centers.<p>We are an organizationally flat group of a few dozen software engineers. Although we work on and support critical systems, you wouldn’t know it from observing our office. When it comes to the code we are unrelentingly meticulous and thorough, but when it comes to people we are big on open communication, flexible hours and a casual work environment.<p>When considering you as a candidate, we won’t be focused on specific experience, skills or keywords. We will be looking for evidence that you’re smart, adaptable and exceptionally productive. You will show us that you’re an accomplished programmer, capable of working in many problem domains, and that you can ship products. You’re the engineer that other engineers can count on—you’re highly technical, you attack every problem with enthusiasm, and you share the team’s passionate dedication to the mission.<p>At SpaceX, the problem domain is full of exciting challenges, and “launching” the product will be like no other product launch you’ve ever experienced!<p>Note for new or recent graduates: If you’re a new or recent graduate, show us you have some experience outside of your academic course work. Personal projects (web apps, mobile apps, electronics, etc.), or club projects (robotics clubs, programming clubs, etc.) are a strong indicator that you have an appetite to improve yourself as a professional engineer. This will go a long way with your application.<p>You can apply online or e-mail your resume to ryan.fitzpatrick@spacex.com. Thanks!","time":1380643783,"type":"comment"}