{"by":"kentf","id":6477635,"parent":6475879,"text":"Toronto, Canada - FULLTIME. VC Backed. Comp Salary + Benefits + Equity Opportunity.<p>Top Hat (<a href=\"https://tophat.com\" rel=\"nofollow\">https:&#x2F;&#x2F;tophat.com</a>). We build software for The Modern Educator.<p>Python, JS, RabbitMQ, AWS, Backbone, Real Time, Big Data, EdTech, Dent in the universe kind of stuff.<p>-----------------------<p>Looking for a brilliant software developer:<p>Does doin’ your thing in Django take you to your happy place? Does coding in JavaScript feel better than Christmas morning? Does programming in JavaScript bring you more satisfaction than rainbows and puppies combined? Read on, you Maniac Hack.<p>If you’ve been to university, you understand the nut Top Hat is trying to crack. Your professor starts to talk, and you really do have every intention of listening. But within about five minutes, your good intentions fly out the window and you begin to surf Facebook, catch some Zz’s, or if you’re feeling really ambitious start working on a problem set for a completely unrelated class. When you join our team, you’ll be working on classroom interaction software and help higher education find its mojo!<p>Your work will touch hundreds of thousands of paying customers (300,000 and growing every day). Plus, you’ll get to ship code on a weekly basis. We only officially launched a little over two years ago, but we’re already profitable and are growing like crazy! Lucky for you, we’re small but mighty. That means you get to touch everything—front-end, back-end, database code—whatever your little hacker heart desires! And what’s more? Everything you touch will be yours. Well, kind of. We follow the “Facebook approach,” meaning we give developers complete ownership of features.<p>The Fabulous Life of the Top Hat Developer comes with other sweet perks too. Every fifth week is hack-week, where you and your fellow developers get to spend a week working on pet projects. There’s also lots of free deliciousness. What’s up catered breakfast and unlimited snacks and drinks? Oh, and did we mention StarCraft throw-downs at lunch?\n<a href=\"https://tophat.com/about/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;tophat.com&#x2F;about&#x2F;jobs</a> Or email: matt [at] tophat dot com","time":1380648502,"type":"comment"}