{"by":"buf","id":6477388,"parent":6475879,"text":"Rentify - Fulltime - London - Front End Engineer&#x2F;Designer<p>We&#x27;re a small tight-knit team that wants to change how rentals are done. The rental industry is old, antiquated, and ready for a push. We think we have the right recipe, and so does Balderton Capital, who invested in us for our Series A.<p>We don&#x27;t do deadlines, or assign your day to day work to you, or tell you how to get it done, or make your decisions. You&#x27;re smart, professional. You don&#x27;t need us to tell you how to do your job. Of course, we don&#x27;t mind helping if you get stuck.<p>Read more about it here: <a href=\"http://engineering.rentify.com/post/47385480838/in-engineers-we-trust-to-get-shit-done\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.rentify.com&#x2F;post&#x2F;47385480838&#x2F;in-engineers...</a><p>And here\n<a href=\"http://www.bufordtaylor.com/post/62455729428/how-we-interview-engineers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bufordtaylor.com&#x2F;post&#x2F;62455729428&#x2F;how-we-intervie...</a><p>We&#x27;re all hungry for success.<p>Okay, now for the normal stuff:<p><i>Responsibilities</i><p>Lead by example - by being proud of your work, talking about how awesome your work is, and then drinking beers with the team about all the great work being done<p>Design and development of new product features and enhancements<p>Communicate with non-technical people to define requirements and deliverables<p>Know what technologies are out there in case you need to use them<p>Periodically teach your co-workers all the great stuff you learned via tech talks, brown bags, blogs, or open source<p><i>Requirements</i><p>You ideally have a design background and is equipped to wield Photoshop, Illustrator, whatever tool of choice<p>You want to work in a startup (a.k.a. a place that works hard and plays hard)<p>You can write for the front end of the web stack (html, css, javascript)<p>You have to be able to travel to central London every day<p>We&#x27;re a Rails shop. You don&#x27;t have to know it, but it&#x27;s a bonus if you do.<p>Be a part of a collaborative team that sits in an open environment (read: no politics) who previously worked at companies like Eventbrite, Uber, and Apple<p><i>Perks</i><p>Unlimited vacation<p>Equity in Rentify<p>Food and drinks available in the office 24&#x2F;7<p>Feel free to crush your co-workers on our N64 and pool table.<p>A nap room (doubles as a meeting room) for when you want a snooze.<p>If you&#x27;re interested, please email me (I&#x27;m the CTO) directly at buford@rentify.com","time":1380646600,"type":"comment"}