{"by":"t1m","id":6477986,"parent":6475879,"text":"Chango - <a href=\"https://www.chango.com/about/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.chango.com&#x2F;about&#x2F;careers</a> - Toronto, ON<p>We are hiring for quite a few engineering and non-engineering positions, but I would like to highlight the roles available on Chango&#x27;s Large Scale Data team where we have two open positions for intermediate&#x2F;senior software engineers.<p>At Chango, we process 20 billion or so unique data points per day, and are trying to minimize the latency between times when we collect the data and make it available for the real-time distributed systems that need to use it.<p>We use traditional SQL databases (Postgresql), columnar data warehouses (Vertica), networked&#x2F;local key&#x2F;value stores (AeroSpike, KyotoCabinet, LMDB, memcache), as well as a many node petabyte scale map&#x2F;reduce cluster (Disco&#x2F;DDFS).<p>You will be programming in Python, Cython and C with forays into Go and Erlang.  You are comfortable with your code running on 100s of nodes in multiple data centres.  You have solid knowledge of Linux internals and tools, networking, disk, cache and memory subsystems as well as techniques to measure and optimize all of the above.<p>You have thorough familiarity with relational technology&#x2F;theory, ACID, transaction processing, networked and local key&#x2F;values stores, data warehousing and columnar databases.  You should have experience with map&#x2F;reduce and distributed file systems (Hadoop&#x2F;HDFS, Disco&#x2F;DDFS).<p>You have a firm understanding of the various and sometimes exotic data structures and algorithms used for processing large data sets.  You will use bloom filters, hyperloglog, skip lists, b+ trees, prefix tries, hashing in all it&#x27;s multitudinous forms, MVCC, two-phase commit, data compression&#x2F;encoding, etc.<p>You are familiar with and are eager to build distributed systems.  You are familiar with shared-nothing architectures, replication, fault tolerance, queueing, messaging models, CAP theorem, and distributed locking.<p>Competitive salary, equity and benefits.<p>contact:  tim AT chango.com\nor on the site","time":1380651112,"type":"comment"}