{"by":"camara","id":6477396,"parent":6475879,"text":"CS Disco - Houston, Texas - FT, INTERN<p>Disco makes 10x faster, 10x cheaper ediscovery software for law firms and corporate legal departments. Try a demo with Enron&#x27;s emails at <a href=\"http://demo.csdisco.com\" rel=\"nofollow\">http:&#x2F;&#x2F;demo.csdisco.com</a>.<p>We are bootstrapped and have month-over-month recurring revenue growth of 35%, 150%, 40%, 114%, 30%, and 41% for the past six months. The team includes the youngest graduate of Harvard Law School, a cofounder of TrustEgg (YC W11), and the former CIO of publicly traded Sonic Foundry.<p>Engineering challenges include (1) scaling our infrastructure from 4 TB &#x2F; 20,000,000 document databases up to 40 TB, 100 TB, and larger sets; (2) automatically classifying documents (e.g., finding engineering documents related to safety tradeoffs) based on prior lawyer classifications within a database or in other databases and on automated analysis of primary law; (3) fully searchable logs of searching and tagging decisions and beautiful visual analytics from search results; (4) rendering native documents into PDF without information loss (e.g., track changes, hidden fields, etc.) and rendering PDF elegantly across browsers (non FF pdf.js issues) with support for selection-based and search-based highlighting, redactions, annotations, etc.; and (5) fraud, error, inconsistency, and document destruction or omission detection.<p>C#, .NET, RavenDB, Lucene.<p>ENGINEER -- For engineering roles, send a resume and examples of your work to Gabe Krambs (krambs@csdisco.com). We are hiring for both UI positions and infrastructure positions (see above).<p>SALES &#x2F; OPERATIONS &#x2F; MARKETING -- Working with channel partners, delivering demos and training, working with end users to receive and load new data, escalated support, work on collateral, etc. These are jack-of-all-trade positions at a quickly growing startup. Email a resume to CeCe Cohen (cece@csdisco.com) to apply.","time":1380646659,"type":"comment"}