{"by":"Placester","id":6477947,"parent":6475879,"text":"Senior PHP Engineer\nWe’re looking for a seasoned PHP engineer to take ownership over our stack and suite of tools. We run the most popular plugin in real estate and we’re dedicated to making it painless for real estate professionals to get their listings out on the web. Our tools are used by tens-of-thousands of professionals to manage millions of listings from around the world. We believe in building products that just work. We’re extremely passionate and you should be too.<p>Here’s a bit about the role-<p>About You as a Senior PHP Engineer:\n-Make (many!) daily pushes to our MS instance and WordPress.org\n-Squash bugs and support the QA and theme development team\n-Provide leadership and insight into product strategy\n-Take ownership over WPMS instance with thousands of sites and growing rapidly\n-Interact with the open source&#x2F;development community to fix bugs and and prioritize features\n-Help push the limit of what’s possible inside WordPress (like continue to extend our MVC plugin framework)\n-Understanding of MySQL and NoSQL databases\n-Help re-architect the current platform<p>About You:\n-Deep, working knowledge and application of PHP; 3 to 5+ years of PHP experience\n-Strong communicator, can effectively explain issues and solutions\n-Using a data-driven approach comes as second nature\n-Self starter and self motivated. Handles issues as they are found\n-Team player, knows what it’s like to effectively work and lead a team\n-Comfortable writing code that scales to millions of users\n-Experience with WordPress a huge plus\n-Passionate about great, easy to use software (we love what we do and you should too)\n-Generally happy person (we’re happy too)\nBenefits:\n-Competitive salary\n-Generous and early-stage equity\n-Full medical, dental, and vision\n-A highly motivated, brilliant and fun team<p>How to Apply\nJust drop a note to jobs@placester.com with &quot;Senior PHP Engineer&quot; in the subject line.<p>More about us - <a href=\"https://placester.com/careers/#senior-phpwordpress-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;placester.com&#x2F;careers&#x2F;#senior-phpwordpress-engineer</a>","time":1380650822,"type":"comment"}