{"by":"Placester","id":6477983,"parent":6475879,"text":"Seeking Full-time Senior Software Engineer\nThe Senior Software Engineer will directly impact the customers and deepen the value of our business. This position is responsible for working on the core components of Placester, which powers everything from our hosted services to real-time, high traffic ad services. We utilize massive sets of MLS data within real estate to deliver large, highly scaled multi-tenant web hosting. Our platform runs on a varied technology stack and we work within different engineering techniques, such as statistical analysis and machine learning. Since we are engineering focused, your ideas and opinions will help shape our company and our products, every single day.<p>Here’s a bit more about the role -<p>About You as a Senior Engineer:\n-You are a polyglot: Mastery of Java, Python, and&#x2F;or Ruby on Rails\n-2+ years of large-scale NoSQL experience (MongoDB, HBase, or Cassandra a big plus as well as experience with Hadoop)\n-Experience with traditional SQL databases and APIs\n-You know your way around an Unix command line, and have experience with managing Nginx\n-You know that sustainable systems win in the end, and sometimes a new feature means refactoring old code to help\n-Experience building web applications on the client-side, server-side, and&#x2F;or full-stack\n-You can work with other developers on a large code base\n-You aren’t a stranger to Jira or Asana<p>About You:\n-Thrive on collegial, collaborative, and focused team and be able to hold your own in a healthy debate\n-Strong communicator, can effectively explain issues and solutions\n-Proactive, self-motivated and comfortable leading teams\n-Comfortable writing code that scales to millions of users\n-Generally happy person (we’re happy too)\n-Passionate about great, easy to use software (we love what we do and you should too)<p>Benefits:\n-Competitive salary\n-Generous and early-stage equity\n-Full medical, dental, and vision\n-A highly motivated, brilliant, and fun team<p>How to Apply\nJust drop a note to jobs@placester.com with &quot;Senior Software Engineer&quot; in the subject line.<p><a href=\"https://placester.com/careers/#senior-software-engineer-rails\" rel=\"nofollow\">https:&#x2F;&#x2F;placester.com&#x2F;careers&#x2F;#senior-software-engineer-rail...</a><p>Our Mission: Make the web work for real estate.\nBridging the gap between real estate professionals and their clients.<p>Real estate is the largest industry in the world. It’s also one of the most important—after all, everyone needs a place to live. Millions of consumers are looking for their next home online, and they expect the same kind of browsing and buying experience they get on sites like Amazon and Facebook.<p>Unfortunately, real estate agents are struggling to provide that experience. That’s where Placester comes in. We’re creating an industry where it&#x27;s quick and simple for real estate professionals to get their information on the web.<p>Don’t let that simple description fool you. We’re addressing the hardest problem in the largest industry in the world. As you might have guessed, not everything is written on the home page yet.<p>Our Culture: Team.\nJoin the team that makes a difference in a big, complex industry.\nOur culture is all about teamwork. That being said, we&#x27;re composed of folks who are their own brand of brilliant, focused, fun, intense, and friendly. If you&#x27;ve ever worked on a high performing team you&#x27;ve experienced this mix before.<p>You’ll be expected to get things done and be responsible for making it happen, without any bureaucratical mess. You’ll be expected to identify problems and solve them on your own. But more importantly, you may need to rally a friend or team to overcome them. Both are key tools on your belt.<p>You’ll be expected to have an opinion because it will matter when shaping the outcome of your company. Opinions are about courage: to speak your mind and to change it.<p>Everyone laughs a lot over lunch. Topics range from the standard technical, tactical and whos-doing-what in the start up world; but they also weave through topics like the proper structure for the US debt, that great restaurant down the street or how to Sous-vide the perfect piece of meat. Brilliance isn’t one-dimensional.<p>There’s a local coffee shop that often serves as the perfect distance for discussing a hard problem. We deal with a lot of hard problems and really like great coffee. It’s a bit of a chicken-and-egg problem itself… which is a good reason to take a walk and discuss it over a cup.","time":1380651101,"type":"comment"}