{"by":"frederickcook","id":6477400,"parent":6475879,"text":"Moveline (<a href=\"https://www.moveline.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.moveline.com</a>) - REMOTE or Las Vegas, NV<p>Moveline is transforming an industry older than the internal combustion engine. We ship every day and play Settlers on Fridays.<p>We’re looking for a solid full-stack javascript engineer who loves Settlers of Catan, remote development, and can tell the difference between an IPA and a Lager.<p>About Us<p>- We’re passionate about building software that dramatically improves the customer experience, end-to-end, around moving. Our web product is at the heart of it.<p>- We are also working with a world-class set of investors and advisors, who you’ll have the opportunity to meet and interact with on a regular basis. (<a href=\"http://www.angel.co/moveline\" rel=\"nofollow\">http:&#x2F;&#x2F;www.angel.co&#x2F;moveline</a>)<p>About You<p>- You are fluent in Javascript – our stack is MEAN: Mongo&#x2F;Express&#x2F;Angular&#x2F;Node (and some Golang)<p>- You are passionate about code and elegant solutions, and want to work with others who are similarly so. You can’t sleep at night knowing you left something not DRY’d<p>- You have architected and developed end-to-end products that are currently running business applications on a production environment<p>- You have an obsessive attention to detail<p>- You thrive when you are working closely with others on a small team<p>- You want to build stuff that solves real human problems<p>- You can explain the differences, chemical and philosophical, between a lager and an IPA<p>- You have a panic attack if you don’t push code before noon<p>- You don’t care that the moving industry isn’t sexy<p>- You would rather make money than make the front page of TechCrunch (though we do that too)<p>Compensation<p>Market salary and meaningful equity is available. We’re primarily a remote engineering team, with the company (ops, marketing, customer service) based in Las Vegas in the heart of Tony Hsieh’s Downtown Project. Hackers in Vegas or remote in the US welcome. Full Time or Contract-to-Hire only please. No freelancers or recruiters need apply.<p>Check out <a href=\"https://www.moveline.com/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.moveline.com&#x2F;careers</a> or email founders@moveline.com to apply!","time":1380646682,"type":"comment"}