{"by":"pubnub","id":6478368,"parent":6475879,"text":"PubNub - <a href=\"http://www.pubnub.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.pubnub.com&#x2F;</a> - San Francisco, CA<p>In the future, we will all be speaking Bidirectional JSON.<p>Become the core part of the largest global real-time network -- the network one that is transacting billions of signals.  Our mission is to create the fabric that brings us (people of the net) into the next singularity, a point in time at which humans become ineffective.  That of course does not mean our society is lost, as in a dystopian view…  Rather, think of this opportunity as an effort to achieve a forever-vacation for everyone for the rest of time creating unlimited happiness; and through the power of PubNub we&#x27;ll convert your typical adventure into to living stardust, where your consciousness will be jettisoned into the infinite cosmos, in an infinite journey of dimensional wonder, and discovery!!!!!<p>That&#x27;d be pretty great as long as we do it in a good way, right?  Can you help us achieve this?  We need next gen developers who are good at being remarkably insightful into the new future of network paths, BGP routes, TCP packets and Earth Based Topologies and Orchestrations.<p>Here is our jobs link: <a href=\"http://www.pubnub.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.pubnub.com&#x2F;jobs</a><p>We&#x27;re also keeping an eye on the footprint of data that flows through PubNub, and we have a massively parallel MapReduce system written in Python&#x2F;PyPy&#x2F;Gevent&#x2F;HLL which can process massive amounts of data in a few moments.  Yah we use it for big brother type stuff but also for your metering data too so we can bill you.<p>More onto the future of things to come, we&#x27;ve created essentially the scaffolding which brings us the necessary tooling to create the next singularity.  But we still have more to do and we need your help to push us further into future of connectivity.  Device-to-device communication is key, and JSON is our language.  Also something new is on the way that has been unannounced which kinda annihilates most hindrances for out ultimate goal.","time":1380654307,"type":"comment"}