{"by":"RichardPrice","id":6478128,"parent":6475879,"text":"San Francisco, CA<p>Many problems and opportunities facing humanity require science-based solutions:<p>- Diseases: Curing Alzheimer&#x27;s, Parkinson&#x27;s, Cancer, HIV, Malaria\n - Energy: We need to to find cheap and clean sources of energy\n - Computing: Computers and robots can achieve so much more than they do now<p>The scientific process is much less efficient than it could be. Academia.edu&#x27;s goal is to fix the problems in science so that science becomes faster and more open. We want to get every science pdf ever written on the internet, accessible for free.<p>Academia.edu is a platform where a scientist can share their research with their followers, and track how many people are reading their research, and from which countries. These metrics help move the needle for scientists when they apply for jobs and grants, and motivate them to share more of their work.<p>A leading climate scientist in Germany wrote &quot;Academia.edu shows the impact of your work that is not covered by Web of Science and citation indexes of that sort. With Web of Science you only learn how many people have quoted what. But with Academia.edu I can see what is viewed, what is actually read or not. Here I learn something additional, something I would not know otherwise.”<p>4.5 million academics have signed up to Academia.edu, and around 1 million join every 3 months. Currently scientists have uploaded 1.6m papers, of the 57 million papers ever published. The number of papers on Academia.edu is doubling every 7 months. Come and help us get to 57 million papers.<p>Bijan Sabet from Spark Capital writes &quot;We believe open science is really important. We believe Academia.edu is going to have a profound impact on the world.&quot;<p>We are looking for full-stack engineers, and also designers. Technologies we use include Ruby, Rails, Postgres, Mongo and Varnish. We are a 10 person team based in downtown San Francisco. We just raised $11 million from Khosla Ventures, Spark Capital, and True Ventures.<p>Some key values we look for are: being motivated to open up and accelerate science, being a do-er (&quot;You must be the change you wish to see in the world&quot; - Gandhi), and having common-sense, boldness and humility.<p>Watch the founder, Richard Price being interviewed on Bloomberg TV yesterday <a href=\"http://www.bloomberg.com/video/academia-edu-scientific-research-available-to-all-14Q_Hj66RZqcSRlZ25spvw.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bloomberg.com&#x2F;video&#x2F;academia-edu-scientific-resea...</a>. Read coverage of the funding round here <a href=\"http://venturebeat.com/2013/09/26/meet-academia-edu-a-startup-that-wants-to-publish-every-science-pdf-online/\" rel=\"nofollow\">http:&#x2F;&#x2F;venturebeat.com&#x2F;2013&#x2F;09&#x2F;26&#x2F;meet-academia-edu-a-startu...</a><p>For more information, visit <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http:&#x2F;&#x2F;academia.edu&#x2F;hiring</a>. If you are interested to learn more, please email Richard Price at richard [at] academia.edu","time":1380652345,"type":"comment"}