{"by":"Spoon_Careers","id":6478199,"parent":6475879,"text":"Spoon.net - Seattle, WA - <a href=\"http://spoon.net/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;spoon.net&#x2F;jobs</a><p>Spoon.net is a revolutionary web-based desktop that lets you use software and files from any device.<p>Imagine simply installing a small plugin and being able to instantly run Photoshop, Excel, and StarCraft from the web. Add application state synchronization plus beautiful team collaboration tools, and you have an amazing new computing platform.<p>Spoon&#x27;s breakthrough technology enables this and more by combining virtualization with the web, and we need your help to scale the service, extend our technology to new platforms, and develop new features to amaze and delight.<p>Some of the positions you can find on <a href=\"http://spoon.net/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;spoon.net&#x2F;jobs</a> are:<p>* <i>Software Engineer - Virtual Machine Engine</i> - The Spoon Virtual Machine is a fully user-mode emulation layer for core OS filesystem, registry, and kernel subsystems. The Spoon VM allows applications to be deployed in ready-to-run virtual environments that execute in isolated virtual environments.<p>* <i>Software Engineer - Web &amp; Server Infrastructure</i> - Work on problems ranging from databases and large storage systems in our proprietary NoSQL database and distributed storage system; to networking and transport protocols, such as as our machine learning-based adaptive application delivery algorithms and hybrid physical&#x2F;AWS server infrastructure; to highly interactive, highly available web development employing cutting edge platforms such as Scala and Akka.<p>* <i>Product Manager</i> - Partner directly with Spoon&#x27;s Founder &amp; CEO to create and execute innovative marketing strategies that will take Spoon&#x27;s impressive growth to the next level. Big plus if you have experience building a product from the ground up, as this position requires someone who knows what it takes to create something special.<p>* <i>Program Manager Associate</i> - Rotational program for extremely bright, less-experienced tech lovers who want to hone their programming skills in a high-growth, zero-bureaucracy environment. You&#x27;ll take on as much responsibility as you can handle, and your career at Spoon will take the path of your interests and skill set development.<p>At Spoon, we like solving problems that nobody else takes on, and we like to have a good time doing it. You can get a feel for our culture on our blog at <a href=\"http://blog.spoon.net/category/misc/\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.spoon.net&#x2F;category&#x2F;misc&#x2F;</a>. Judge us as you will.<p>If you want to know more or are interested in joining Spoon, apply on our site or drop us a line at jobs@spoon.net. Thanks!","time":1380652915,"type":"comment"}