{"by":"martinshen","id":6478424,"kids":[6481192],"parent":6475879,"text":"UpOut - San Francisco, CA (SoMA) - Full-Time, On-Site<p>Why should you join us? We&#x27;re growing like a weed. We have revenue. Our dev team needs help to scale UpOut.<p>UpOut is a discriminating guide to the best weird parties, underground culture and unique happenings in your city. Our mission is to help make that epic night out, perfect first date or relaxing afternoon amazing.<p>We are a small tight knit team located in the heart of SoMA, San Francisco. Our environment is focused but we have loads of fun (after all, it&#x27;s what we do). If you&#x27;re passionate about helping people have fun, want to learn a lot and get in early at a growing startup, UpOut is a place where you&#x27;ll thrive!<p>WHAT YOU&#x27;LL BE DOING\nWe are looking for an experienced software engineer who is passionate about building high performance, scalable, and functional server-side applications. You will be a key part of the overall engineering organization, building a variety of services that support the overall UpOut platform.<p>Our service is built on PHP, MySQL, Apache, Nginx, Python, Elasticsearch, Java, and Memcached. We’re hosted on AWS (EC2, RDS etc.) and use Github.<p>- Build cutting-edge systems that move and process large volumes of data in an efficient, robust, and scalable fashion.\n - Collaborate as part of the Engineering team to architect, design, and build systems based on common standards and best practices.\n - Constantly monitor performance and other metrics to proactively identify issues and recommend changes and new features.\n - Become a domain expert on key technologies used by the UpOut platform.<p>SKILLS:\n - A BS degree in computer science&#x2F;engineering with a minimum of 1 year professional software development experience developing server-side applications.\n - Knowledge of SQL, and experience working with and writing high performance code optimized for transactional SQL databases.\n - Professional experience with Python and PHP of at least 1 year (If you don’t have experience either of these languages, please be willing to learn them and have professional experience of at least 1 year with either Java, C or C++)<p>Email Martin@UpOut.com for more information or call me personally at 415 404 5650.<p>Sorry but no new H1-Bs. TN (Canadians) are okay. No remote.","time":1380654821,"type":"comment"}