{"by":"danadams","id":6478034,"parent":6475879,"text":"CO Everywhere (<a href=\"http://coeverywhere.com\" rel=\"nofollow\">http:&#x2F;&#x2F;coeverywhere.com</a>) - Boston, MA<p>CO Everywhere is connecting people and businesses with locations through social data. Come work with the founders and core product team to build a disruptive, consumer-facing company in Downtown Boston.<p>We are hiring our core product team that will shape this product and company. This is a rare opportunity to be one of the first product team hires and be truly challenged building a very special product. Email me (co-founder &#x2F; cto) at dan@coeverywhere.com if you&#x27;re interested in one of these roles:<p>* Rails engineer - Design, test, and build features in the product across the web, the REST API, and a massive data platform<p>* Data platform engineer - Work with over 1,000 data sources on a single data platform to ingest, curate, enhance, and deliver the best social, location-based content to users<p>* Infrastructure &#x2F; OPS engineer - Scale a data platform serving users in nearly 100 countries<p>* iOS dev - Work across the range of iOS devices to push the limits of what can be done on mobile &#x2F; tablet devices<p>* Android dev - Set new standards on Android for app and UI&#x2F;UX quality<p>* GIS engineer - Create new ways of working with social data tied to location at scale<p>* API engineer - Create an API capable of delivering social &#x2F; location content across the entire social spectrum to users in nearly 100 countries. In real-time.<p>* Basically, if you&#x27;re awesome, I want to talk to you.<p>About us:<p>* Our product launched with rave reviews by press (TC, HuffPo, &amp; 20+ others) and consumers.<p>* We have strong growth in usage, around the globe (95 countries).<p>* We have a highly skilled and experienced team fanatically dedicated to building something awesome.<p>* We have an incredible team of investors and advisors.<p>* We are located in the PayPal Start Tank incubator space in downtown Bostonia.<p>See also: <a href=\"https://angel.co/coeverywhere/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;coeverywhere&#x2F;jobs</a>","time":1380651496,"type":"comment"}