{"by":"mattsprig","id":6478673,"parent":6475879,"text":"Sprig - San Francisco, CA<p>Senior Mobile (iOS) Engineer<p>Sprig aims to bring personal chef-style service to the people. As soon as you&#x27;re hungry, you can order a locally-sourced, well-balanced, awesome dinner directly from your smartphone. Meals cost between $10-15 and are delivered to your door in about 20 minutes. We&#x27;re well-funded and driving towards an SF launch in late October.<p>To that end, we’re looking for a senior engineer to help us build an amazing experience for Sprig customers. You’ll be the first engineering hire outside of the co-founders, so this is a great opportunity to help define our engineering culture and product focus.<p>Right away you’ll be working on:<p>- Our customer facing iPhone app (aka our &quot;front of the house&quot;)<p>- Mobile apps for our servers, helping them efficiently whisk meals from kitchen to table<p>- Our delivery dispatch algorithm, the key to getting food in people&#x27;s hands as fast as possible<p>In the future you might be working on:<p>- Making our app ordering experience even better<p>- Simulating delivery routing optimizations so we can tune our dispatch<p>- Scaling the backend to launch new cities<p>Our stack includes:<p>- iOS, Rails, Postgres, RabbitMQ, Heroku, AWS<p>You should have:<p>- Significant iOS experience, having shipped at least one app<p>- Some Rails or other backend experience<p>- Previous startup experience<p>- Passion for food! You’re joining our engineering team, but we are first and foremost a food company<p>- A sense of humor, and&#x2F;or a mild love of accidental food startup puns (too many cooks in the kitchen, let the idea simmer, put it on the back burner...list goes on)<p>If this whets your appetite, send an email to jobs@eatsprig.com. Let us know why you&#x27;re interested in Sprig and shoot us any relevant links (github, linkedin, blogs, roomba you rigged up to open doors for guests, whatever).","time":1380657324,"type":"comment"}