{"by":"akubicek","id":6478887,"parent":6475879,"text":"Subsidence - <a href=\"http://www.subsidence.io\" rel=\"nofollow\">http:&#x2F;&#x2F;www.subsidence.io</a> - Boston, MA<p>We are looking for:<p>* Backend Database Engineer\n* Frontend Visualization Engineer<p>Subsidence generates real-time, localized, atmospheric data, powered by its dense grids of proprietary weather stations. We are building the next generation of weather data and you can be an integral part of the team. Our weather stations are being carefully crafted for their first deployment and the atmospheric measurements are the most important asset.<p>We are currently working out of the Bolt (bolt.io) space in downtown Boston. It is a great office with great people, a ton of rapid prototyping equipment, idea paint conference rooms, full kitchen, and free coffee and beer. Come check it out!<p>------------------------------------------------------------------------------<p>Backend Database Engineer<p>Blend open-source technology with proprietary hardware to deliver real time data to customers quickly and efficiently. Build the robust interface between the weather stations and the web so that not a single data point is lost. And archive data so that it can be accessed years from now to lay the groundwork for some of the most detailed weather statistical models ever created.<p>Responsibilities:<p>* Build databases that scale to store and retrieve an enormous amount of data<p>* Provide pipelines for real-time data to flow both into a database and into a customer-facing interface<p>* Develop debugging and monitoring systems customized for a single piece of hardware<p>* Diagnose and solve hard problems in development and innovation<p>* Gain an understanding of the market to see the impact of the tools you develop<p>Requirements:<p>* Deep understanding of Linux file system architecture<p>* Knowledge of shell scripting and UNIX<p>* Proficient in one of the following: Java, Ruby, Python, C&#x2F;C++, or PHP<p>* Experience in databases such as MySQL, PostgreSQL, MongoDB, Hadoop, or Couchbase<p>------------------------------------------------------------------------------<p>Frontend Visualization Engineer<p>Build connections to a vast array of data stored on our network. Craft weather data visualizations to provide our customers with a detailed yet intuitive UI. Gain a deep understanding of our market to develop an interface that resonates with the customer.<p>Responsibilities:<p>* Take a large amount of data and produce the information for customers in real-time<p>* Build high-performing, efficient, and reusable front end abstractions and systems from the ground up<p>* Build user interfaces that are accessible and easy to use<p>* Work closely with our designers and engineers to bring a fluid and intuitive visualization experience to life<p>* Understand our markets and customers to provide a high value experience<p>Requirements:<p>* Expert knowledge of web technologies: HTML5, CSS, and JS<p>* Experience building web applications and server side frameworks (Ruby, NodeJS, Scala, etc.)<p>* Ability to write high-performance code to put life into UI frameworks<p>* Passion for debugging and iterating to make robust code<p>* Self-starter- learn new languages and techniques on the fly to account for new problems<p>To apply, please send a resume and a description of yourself to jobs@subsidence.io.","time":1380659375,"type":"comment"}