{"by":"silviogalea","id":6478976,"parent":6475879,"text":"WeWork - New York City - Ruby Developer<p>Who we are: \nWeWork empowers entrepreneurs and small businesses to succeed by providing beautiful workspace, a collaborative community, accessible services and benefits.<p>We&#x27;re a three year old company that is currently in three US cities and will be in 6 cities in the coming months. We&#x27;re looking to create a digital experience that enhances the physical WeWork environment and create a parallel digital business.<p>Our environment:\nWe work in an open space, collaborate on solving interesting problems.  We tackle problems ranging from how we bill and invoice our members, to developing a social network for our members, to developing custom mobile applications for our members, to near-field and touch prototypes to space specific applications that measure how much beer is left in the keg (of which we have on every floor of every WeWork building. yes, we&#x27;re that type of company).<p>Culture: \nQuarterly events (skiing, halloween party, summer camp). See here to get a vibe about our culture &amp; events: <a href=\"http://vimeo.com/48023398\" rel=\"nofollow\">http:&#x2F;&#x2F;vimeo.com&#x2F;48023398</a><p>The team:\nWorking with a team of developers who led initiatives at various web scale companies in rapid lean environment where ideas discussed one week are in front of our users in a few weeks.<p>What you&#x27;ll do:\nBe part of a team that is constantly experimenting with the latest touch, near field, mobile, and general &quot;Internet of Things&quot; technologies in our drive to make the WeWork environment feel alive.<p>What you&#x27;ll be using:\nMacbook Pros, as many monitors as you want, whatever tools you want centered around GitHub, Heroku, Ruby, Rails, Javascript and some Node.<p>Key Technical Attributes:\n- 1yr+ of Ruby on Rails development experience\n- 1yr+ of Ruby experience \n- Know more than 2 programming languages \n- Computer Science degree  \n- Full stack development expertise. Rails, Ruby, ORM, Database (any), HTML5, JS and 3rd party API integration\n- Mobile development experience (iOS, Android, PhoneGap or other)\n- Has developed and integrated with 3rd party RESTful web services\n- has developed complex algorithms \n- Has done systems integration \n- Self Starter. Takes initiative and ownership\n- Quality centric. It&#x27;s all about the little things<p>We’re looking for people with a: \n- Great team &#x2F; culture fit\n- Awesome problem solving ability\n- Has Raw intelligence\n- Gone through CS fundamentals\n- Have initiative &#x2F; enthusiasm &#x2F; passion\n- Can teach &#x2F; explain well\n- Can handle ambiguity\n- Have a solid past performance &#x2F; demonstrable skills<p>Reach us at careers@wework.com","time":1380660337,"type":"comment"}