{"by":"cnienaber","id":6478140,"parent":6475879,"text":"Senior Developer - San Francisco\n&lt;br&gt;\nWHO WE ARE\n&lt;br&gt;\nWe are a start-up located in San Francisco that curates modern designed products for 5-day sales for our members. Our goal is to help people discover unique and beautifully designed products while getting them at a great price. The site is growing extremely rapidly, adding thousands of users daily and dozens of design&#x2F;manufacturing partners each week. &lt;br&gt;\n&lt;br&gt;\nThe company is early-stage and VC-funded, looking to bring on sharp, hardworking talent with competitive salary. You&#x27;ll have a chance to work directly with the founders and be part of the core team. &lt;br&gt;\n&lt;br&gt;\nWHAT OUR TEAM  IS LIKE&lt;br&gt;\n&lt;br&gt;\n- willing to learn and grow quickly with our company&lt;br&gt;\n- able to multi-task and stay organized&lt;br&gt;\n- can work independently&lt;br&gt;\n- extremely proficient with computer software and web tools&lt;br&gt;\n- loves modern design&lt;br&gt;\n&lt;br&gt;\nEXPERIENCE YOU SHOULD HAVE&lt;br&gt;\n&lt;br&gt;\n+ this is not your first gig&lt;br&gt;\n+ you have experience with building end-to-end products &lt;br&gt;\n+ you are an expert in rails, jQuery, objective-c and MySQL&lt;br&gt;\n+ are experienced in scaling rails (1M+ visitors&#x2F;month) and building on the android platform&lt;br&gt;\n&lt;br&gt;\nWHAT YOU&#x27;LL BE DOING&lt;br&gt;\n&lt;br&gt;\n+ working across all channels including web, iPhone, iPad and android&lt;br&gt;\n+ driving operational efficiencies including fraud detection, logistics automation, advertising integration, improving metrics measurements, bug fixes, etc.&lt;br&gt;\n+ creating new features as the company grows including scaling the code base, a&#x2F;b testing, writing integration tests, setting up search servers, personalization, etc.&lt;br&gt;\n+ communicating directly with the CTO daily&lt;br&gt;\n&lt;br&gt;\nIf you fit the bill, please apply with:&lt;br&gt;\n&lt;br&gt;\n+ resume highlighting what you&#x27;ve been up to the past couple of years&lt;br&gt;\n+ cover letter explaining why you&#x27;re interested in e-commerce&lt;br&gt;\n&lt;br&gt;\n&lt;b&gt;Use Subject Line &quot;ToMo Senior Developer&quot;&lt;&#x2F;b&gt;&lt;br&gt;\n&lt;br&gt;\nSend your application to Steven at engineering-jobs[at]touchofmodern.com&lt;br&gt;\n&lt;&#x2F;div&gt;","time":1380652427,"type":"comment"}