{"by":"adam","id":6479134,"parent":6475879,"text":"Inkling Markets - Software Engineer - Chicago, IL<p>ABOUT US<p>Inkling (<a href=\"http://inklingmarkets.com\" rel=\"nofollow\">http:&#x2F;&#x2F;inklingmarkets.com</a>) is changing how decision-making works inside companies and government agencies using crowdsourced forecasting tools like prediction markets, opinion polls, and crowdfunding.<p>We’ve helped Ford and GM develop ideas for the future of American-made cars. We enable the US Government to plan for the future by forecasting world events. We’re even trying to prevent the Zombie Apocalypse - seriously, ask us about it.<p>We are a small, but profitable and growing YC company. We have thrived based on demand from our clients and haven’t had to take outside investment.<p>THE JOB<p>We’ve got a lot going on here at Inkling. We’re adding a ton of exciting new features to our flagship platform that our clients are going to love. We are expanding our mobile capabilities - which means continuing to improve our iOS app, developing an Android app, and making our HTML&#x2F;CSS more mobile friendly. We’re also developing a line of new products from the ground up to meet the evolving needs of our clients and to expand into new markets.<p>We’re looking for a well-rounded developer to join our team and help us grow. You’ll have the opportunity to work in many areas - with different technologies, on different products, and for multiple clients.<p>WHAT YOU&#x27;LL NEED<p>Above all else, we’re looking for smart people who have a passion for what they do and are excited about learning new things. Specifically, you’ll need:<p>* Real-world experience building non-trivial web applications<p>* Value teamwork and collaboration - we’re a small team and work very collaboratively<p>* You have opinions about UI&#x2F;UX design<p>* You know your way around a Unix shell<p>Bonuses:<p>* Rails experience. If you haven’t used Rails, you’ll need a willingness and capability to learn fast<p>* You have experience interacting with clients<p>* Front-end development skills, Javascript, HTML&#x2F;CSS<p>* Mobile (iOS or Android)<p>COMPENSATION<p>* A competitive base salary<p>* Revenue sharing<p>* Healthcare stipend if needed<p>* Training, tutorial, and books budget<p>* Attend a conference of your choice annually on us<p>* New laptop of your choice<p>* An opportunity to be a crucial member of the team. You’ll play a part in steering the direction of our products. You won’t be a cog in a wheel.<p>HOW TO APPLY<p>Send an email to jobs@inklingmarkets.com with whatever you think best represents you: your github repo, a blog you write, a resume, a portfolio, code samples, etc.","time":1380662154,"type":"comment"}