{"by":"mikepk","id":6479476,"kids":[6485914],"parent":6475879,"text":"Boston, MA - full time, internship - engineers<p>Smarterer\n<a href=\"http://smarterer.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;smarterer.com&#x2F;</a><p>Make a difference, change the world, have fun, do something important.<p>We&#x27;re looking for creative hackers and programmers to join our dev team.<p>Smarterer is doing something unique and important. We&#x27;re approaching a point where traditional university credentialing isn&#x27;t enough, skills are changing too quickly and what makes someone effective in a role or job is evolving. New roles appear daily that no (or few) traditional universities have courses for: e.g. growth hacker, social media evangelist, CNC machinist &#x2F; programmer. People are acquiring more and more skills through non-traditional means. Nascent &quot;education 2.0&quot; initiaitives are exciting, but they still face the problem of measuring and credentialing, especially those that learn online.<p>How do you show what you know?<p>Smarterer has created an innovative crowd-sourced testing system and scoring algorithm that allows rapid evolution of content, skill measurment, and question characterization. We&#x27;ve made it fun as well as rigorous, based on modern testing theories.<p>Putting my money where my mouth is, I&#x27;ve created a software concepts test:<p><a href=\"http://smarterer.com/tests/software-concepts\" rel=\"nofollow\">http:&#x2F;&#x2F;smarterer.com&#x2F;tests&#x2F;software-concepts</a><p>Give it a spin and see how you do. This is the debut of this test so the first few test takers will likely have an advantage. The more people that take the test, the more accurate it becomes. Leave feedback, add questions, share your score!<p>Smarterer is helping enable a revolution: in the changing job marketplace, in education and learning, and in the way people measure their own skills and share that knowledge.<p>Our mission: Measure the world&#x27;s skills<p>We&#x27;re funded by Google, True Ventures, as well as some amazing angel investors.<p>Interested? Contact me at mikepk@smarterer.com","time":1380666532,"type":"comment"}