{"by":"Eduardo3rd","id":6479153,"parent":6475879,"text":"Do you ever wish that you could control the physical world as easily as the virtual world? We do. At Oso Technologies we are building Internet-connected devices that can monitor and control the world around you. We&#x27;re looking for a top-notch Director of Business Development to take the charge in this new position on our team.<p>As part of our core team, the Director of Business Development will be directly involved with company decisions regarding the development of Oso’s business strategy including marketing, sales, and product distribution. Your voice will be a major part of what makes our company great in the coming months and years as we grow from a small team to a major technology company.<p>For the next few months we&#x27;ll be working to deepen our relationship with the 1,000 people who have backed our Kickstarter campaign and develop a marketing, communications, and business development strategy for future growth. After that we&#x27;ll be using the skills we have gained as a team to provide creative solutions for new problems and markets.<p>You are the perfect fit if you are…<p>Curious. You ask more questions than anyone else in the room and you aren&#x27;t ashamed of it. \nSelf-motivated. In school you were busy working on side projects during lectures. You enjoy being given an open ended task and defining success for yourself.<p>A problem solver. Bathroom door squeaky and annoying at your last job? You oiled it on your first day.  No experience creating an advertising campaign? You taught yourself how to do it in a week. There’s no problem  too big or too small for you to tackle.<p>Word-savvy. You can write a blog post, email a Fortune 500 executive, respond to tweets from customers, adjust a product description, and post on Facebook about last night&#x27;s shout out from Conan O&#x27;Brien without missing a beat. It&#x27;s happened to us before, and with your skills it is going to happen again.<p>Motivated. The idea of skipping the corporate ladder and building your own marketing, sales, and business strategy team would be a dream come true.<p>Fun. It&#x27;s a startup. We don&#x27;t really do lame stuff around here if we can help it.<p>Intelligent. Working with a team of engineers who have more degrees than a thermometer isn&#x27;t intimidating to you in the least. You&#x27;re probably better at your job than we are at ours.<p>Skills&#x2F;Requirements:\n- 2-5 years of experience. \n- Outstanding written and verbal communication skills. \n- Ability to pay attention to details while simultaneously managing numerous projects. \n- Familiarity with ad copy writing and creative design.   \n- Active online presence and familiarity with social media (Twitter, LinkedIn, Facebook, Wordpress, etc.).\n- Customer support experience.<p>The best candidates will have… \n- A college degree in Marketing, Communications, Public Relations or a similar field. \n- An MBA or equivalent experience. \n-Adobe Creative Suite experience.  \n- A successful track record at another company with recent product launches.\n- Past work experience at a major advertising agency or startup company. \n- Video production experience.<p>Compensation and benefits: \n- Competitive salary  \n- Ownership in the company\n- Paid healthcare allowance\n- Paid vacation\n- Allowance for self-directed professional development \n- Flexible work schedule - Generous bonuses \n- Yearly company retreat to somewhere cool in the US or abroad<p>We believe in building quality products quickly and keeping our development process lean. We value personal growth, so our employees have a high degree of autonomy and responsibility. As an early-stage startup company in a competitive market, expectations are high, but so are the rewards. Your decisions in this role will directly impact the company’s performance and success. If you’re up for the challenge, apply today!<p>To apply, please submit a brief cover letter and resume to jobs@oso.tc and include a link to some of your previous work.","time":1380662349,"type":"comment"}