{"by":"armaansarkar","id":6479516,"parent":6475879,"text":"LiveRamp | Multiple Engineering Positions Available | www.LiveRamp.com&#x2F;careers | San Francisco, CA | H1B, INTERN<p>About us: LiveRamp’s leading data onboarding solution empowers marketers to activate their CRM data in their choice of online advertising platform for targeting, attribution, content optimization and more.  We see relevancy as the world&#x27;s largest optimization problem, and are excited to contribute to building a future where marketing is predominantly informative, engaging, and even appreciated for their usefulness to consumers through the use of data. Imagine that!<p>We&#x27;re well funded, and steadily growing. Our employees enjoy weekly yoga, catered lunches, and unlimited PTO. But the best job perk is our awesome team -  we’ve got a staff of amazing people who just happen to be great engineers as well.<p>About you: Type S(tartup) personality is a must: smart, ethical, friendly, hard-working and proactive. You’re comfortable in multiple languages, frameworks, and environments. We are looking for full-time engineers and interns (summer or any time of year). If you think you’d be a good fit, consider joining our team!<p>We’re looking for smart and talented engineers for the following positions:<p>* I’ll Be Back-End Engineer<p>* Glass-Half-Full-Stack Engineer<p>* Maximum Security DevOps Engineer<p>* Statistically Significant Data Scientist<p>And for new grads and interns:<p>* Four Star Generalist Software Engineer<p>* public static final intern softwareEngineer = fall&#x2F;winter&#x2F;spring&#x2F;summer;<p>To apply:  Visit <a href=\"http://www.liveramp.com/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.liveramp.com&#x2F;careers</a> or send your resume to recruiting@liveramp.com. Tell us in three sentences why you&#x27;d like to join our team and what makes you a great fit, and show us what you’ve got. We’d love to see links to sites you have worked on or screenshots of your work.","time":1380666944,"type":"comment"}