{"by":"magic_at_enimai","id":6480472,"parent":6475879,"text":"ënimai - www.enimai.com - Mountain View CA - Full Time, no remote work.<p>ënimai develops hardware and software that pushes the boundaries of what is possible with computers. ënimai believes technology should be magic.<p>We are looking for extraordinary programmers. Programmers who, true to the spirit, can work with any programming language to solve the problem at hand. Generalists who can become specialists in any field.<p>The team has previously built very successful products at Apple, Amazon&#x2F;Lab126, Google, HP Labs, NASA, OLPC, etc.<p>If any of the following appeals to you, you would love what we do:<p>Implement atan2 in fixed point to 12 bits of precision, optimizing for space ? \nDo you love writing your own operating system? (Yes! we have our own - no it is not linux&#x2F;freebsd etc)\nCan you be a one man&#x2F;woman army to get our entire backend infrastructure running, sustaining ëillion queries per second? \nBeing responsible for every bit of memory you allocate and every CPU cycle you burn?\nWe iterate Hardware at the pace of Software (hence no remote work). You will need to be a master in getting work done even when all the pieces around you are moving.<p>Yes, we work hard (and smart). We don&#x27;t want the easy way out. We do it right. The team has stayed overnight at work multiple times, not because we had to, but because we wanted to. We are passionate about what we do. We know this will be our life&#x27;s work. There is nothing that can deter intense passion. This could be overwhelming and it isn’t for everyone.<p>You will be rewarded with better than industry pay and equity. However, the biggest reward will not have dollar figures attached to it. It is the feeling you get doing what you do best and making an impact in this world.<p>Apply at <a href=\"http://enimai.theresumator.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;enimai.theresumator.com&#x2F;</a> or drop us an email at stdin@enimai.com","time":1380685293,"type":"comment"}