{"by":"rvivek","id":6480218,"parent":6475879,"text":"Interviewstreet (<a href=\"http://www.interviewstreet.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.interviewstreet.com</a>) - Mountain View &amp; Bangalore, part of YC S2011.<p>Interviewstreet&#x27;s recruit product helps companies hire programmers using coding challenges. A ton of top technology companies like Facebook, Amazon, Adobe, Walmart-Labs, Evernote, Box, Quora and many more are our customers and it has proved to be insanely effective (saving ~50-60 hours for every developer hired)<p>We are a team of 28, well-funded by top-tier investors (YC, Khosla Ventures, Jawed Karim, SV Angel) and are growing really really fast. That statement of fast growth might sound cliched, but our revenue growth graph looks like this (<a href=\"http://linode.interviewstreet.com/rev.png\" rel=\"nofollow\">http:&#x2F;&#x2F;linode.interviewstreet.com&#x2F;rev.png</a>) and we have a ton of enterprise deals in the pipeline! Some of our recent customers include Square, Adobe, Chegg, etc.<p>While we continue to signup every technology company, we launched a new product (hackerrank.com) to build a community of programmers in different domains of Computer Science - AI, ML, Image processing, security, etc. The is a place to engage every problem solver in the world with an attractive layer on the top - contests, jobs, prizes, office hours (Eg: hackerrank.com&#x2F;quora) from companies who are our customers already.<p>How will the company look in 2 years?\nWe will be in a position to have 20-30k technology companies using our recruit product to make their interviewing effective and 100-150k active programmers&#x2F;day on hackerrank making it effectively a hugely powerful platform to connect programmers with right opportunities (jobs or contests or cash prizes to solve real-world problems or learning a new domain or inventing a new technique to solve a problem and many more) in the fastest way. And when this happens, it will help ship products faster thus accelerating the pace of the world.<p>It&#x27;s a tough mission ahead but something that&#x27;s worth achieving - a mission which can seriously move the world fast. Everyone is so passionate and hardworking that sometimes from an external view, you might find it hard to differentiate a founder from an employee. We are hiring for all the roles - PM, hacker, sales, marketing (hackerrank.com&#x2F;careers)<p>E-mail me: vivek [at] interviewstreet if you&#x27;d like to know more.","time":1380679971,"type":"comment"}