{"by":"toddatssm","id":6483061,"parent":6475879,"text":"Front End Developer<p>Location: Downtown St. Louis, MO\nPotential Other Titles: Javascript Developer, MVC Developer<p><i>About This Position</i>\nWant to make a killer platform for online games and promotions played by literally millions? Second Street is looking for a front-end developer that is passionate about their work and has a constant drive to make the user experience better and better.<p>This is a (contract and or full time position) which will work out of our Olive &amp; 10th Office in Downtown St. Louis MO.<p><i>Our Technology Stack</i>\n- JavaScript speaks to our back-end via a RESTful JSON API\n- Our partner administration tool is a front-end MVC application built in Ember.js\n- Our consumer sites are custom built for performance and user experience using jQuery for AJAX and DOM manipulation, Underscore.js for data manipulation, and a custom internal framework\n- HTML Templating in Handlebars\n- CSS written as Sass using Compass and customized ZURB Foundation components<p><i>Primary Job Responsibilities</i>\n- Be a key team member of our User Experience team and a development scrum team\n- Utilize your Javascript prowess to help develop our Ember web application\n- Interact with product owners to deliver a complete solution for our partner’s needs<p><i>Skills Required</i>\n- Extensive Javascript knowledge\n- HTML5, CSS3 knowledge\n- Responsive design experience using CSS media queries a plus\n- MVC experience a big plus\n- Experience developing web applications (not just brochure sites) a big plus<p><i>Personality Desired</i>\n- A drive for staying up to date in web technologies\n- Be able to hit the ground running on multiple ongoing projects - collaboration with others is vital\n- Passion for design and user experience\n- Likes to tackle problems in unconventional ways\n- Comfortable with a relaxed work environment and culture<p><i>About Second Street</i>\nWe are the leader in private-label web based SaaS promotions for media companies nationwide. Akin to Wordpress.com for the promotions space for media companies.<p>Some of our leading-edge products include online contests, daily deal software, photo e-commerce, email marketing and more. Our software solutions are relied upon by more than 3,000 media and marketing companies across North America, including CBS, Clear Channel, The Washington Post and hundreds of others.<p>This is a unique opportunity to obtain a vital role with a leader in the space as we re-invent our product line. We are seeking candidates that are tech savvy, learn quickly, are passionate about technology and are motivated to succeed. We’ve got a solid 11&#x2F;12 on the Joel Test, lacking only a quiet working environment as we value an open collaborative environment over it. If you are seeking an opportunity to build a career in a high tech organization with fun and exciting culture - this is your opportunity.<p>To apply contact todd@secondstreet.com","time":1380728280,"type":"comment"}