{"by":"madebymode","id":6489337,"parent":6475879,"text":"MODE – Interactive Developer – Charlotte, NC<p>MODE, a branding &amp; interactive agency, is seeking an mid-to-senior-level interactive developer with an excellent command of current web technologies and a thirst to learn more to join our growing interactive team.<p>Our needs focus on advanced PHP &amp; MySQL development, with front-end (HTML, CSS, JS, responsive design) experience and&#x2F;or the desire to learn. An emphasis on really understanding powerful JS frameworks and how they interact with an MVC back-end is hugely desired (e.g. AngularJS, Knockout). The ability to juggle multiple projects of varying magnitude, clean coding practices and strong organizational skills. Responsibilities will include development of sites ranging from single page teasers to full-featured custom CMS solutions. You will work with a wide variety of clients, across several different verticals.<p>All projects are team-based—you will be working closely with designers, developers and agency principals. This position a full-time position in our office in Charlotte, NC.<p>Our Stack:\nIt&#x27;s important for you to know our environment. These aren&#x27;t used on every project and you don&#x27;t need to know all of these things, but they&#x27;ll help you integrate better with us:\n* PHP (Lithium, older projects in Kohana &amp; Zend)\n* MySQL\n* Linux (CentOS)\n* Apache 2\n* nginx\n* Knockout\n* Sass with Compass\n* JQuery\n* Mixture\n* Adobe Edge Inspect\n* Grunt\n* Capistrano\n* Git (GitHub)\n* Rackspace&#x2F;Linode&#x2F;Peer1 hosting<p>Qualifications:\n* Serious PHP, MySQL &amp; JavaScript chops\n* Strong experience with jQuery, and JS libraries like AngularJS &amp; Knockout\n* AJAX skills (e.g. XMLHttpRequests, JSON,XML)\n* Experience consuming &amp; interacting with APIs (e.g. Facebook, Twitter)\n* Clear understanding of and experience in front-end development: HTML, CSS, JS, responsive design\n* Ability to accurately translate PSDs into code\n* Familiarity with cross-browser compatibility issues\n* Version control\n* A good ideology for writing &amp; managing maintainable &amp; scalable code\n* Constant desire to learn new technologies\n* You don&#x27;t have to be a designer, but you need to respect their craft\n* Maintaining &amp; configuring Apache&#x2F;MySQL web servers<p>Bonus Points for experience with:\n* Our stack\n* Performance (identifying bottlenecks)\n* Command-line\n* Other PHP MVC frameworks (Laravel, Zend, Kohana, Cake)\n* WordPress\n* Magento or other e-commerce platforms\n* Other JS MVC frameworks (Backbone, Ember)\n* Unit testing &#x2F; continuous integration concepts &amp; frameworks\n* Processing\n* Technical leadership—you can clearly communicate technical concepts to a non-technical audience<p>Education &amp; Experience:\nWe certainly value education, but skills, team-attitude, your portfolio of work, and work experience matter most. Therefore we don&#x27;t have any formal education requirements, but a bachelors degree in a related field is a plus. You should have at least 3 years of direct experience, ideally with an agency environment.<p>You should:\n* Provide a portfolio or list of web sites &amp; apps that you built\n* Link to your profile on one or more of the following: Github, Stackoverflow, Codepen or other open source sharing area\n* Have a strong sense of commitment and responsibility for your work\n* Have demonstrated prior career growth and a desire to learn\n* Have a keen interest in emerging technologies<p>Benefits &amp; Perks:\n* Actual work&#x2F;life balance (seriously)\n* Competitive salary (we know we&#x27;re asking for a lot of skills in one)\n* Vacation: total of 5 weeks off per year. 19 flexible days + 6 observed holidays\n* 401k plan with match\n* Pick your machine\n* 100% covered employee health insurance through BCBS\n* Flexible work from home: 6 days per year to work from home\n* Company sponsored events, holiday parties, happy hours, bday celebrations, “mirthday” celebrations for your MODE annual birthday\n* Casual dress\n* Stocked kitchen of drinks, coffee and snacks\n* Relocation bonus available for qualified candidates\n* Charlotte is beautiful nearly all year long<p>Email me @ jobs at madebymode dot com.","time":1380812372,"type":"comment"}