{"by":"cainullah","id":6542476,"parent":6475879,"text":"London UK: Red Badger - <a href=\"http://red-badger.com\" rel=\"nofollow\">http:&#x2F;&#x2F;red-badger.com</a><p>We&#x27;re a creative software workshop working on the leading edge of tech. We&#x27;ve been implementing Node.js projects for enterprise size clients for 2 years now. Our team is the perfect balance between creative and tech. Our UX people understand the technical limitations of what they are designing. Our techies understand UX. Everyone sits side-by-side and they talk, solving complex problems together.<p>We&#x27;re passionate about providing value to our clients. We use agile processes such as Scrum and Kanban to deliver quickly. We use lean startup principles to innovate, failing fast &amp; failing cheaply.<p>Most importantly, we have strong opinions, weakly held. We&#x27;re always adaptable to new ways of working, new technology and new ideas.<p>At Red Badger our tools are chosen to fit each project, not the other way around. We are technologists, geeks and polyglots.<p>Technology doesn&#x27;t stand still and neither do we. On a regular basis we get our whole tech team together (developers, testers, agile project managers) and review all the tech we&#x27;ve used across all our projects to derive what&#x27;s hot and what&#x27;s not in our world of tech.<p>Far from an exhaustive list, you can find the results of our most recent Tech Round Table with our favourites on our website: <a href=\"http://red-badger.com/services/tech/\" rel=\"nofollow\">http:&#x2F;&#x2F;red-badger.com&#x2F;services&#x2F;tech&#x2F;</a>.<p>We&#x27;re currently hiring into the following positions:\n* Technical Architect - leading interesting new projects across multiple enterprise clients. <a href=\"http://red-badger.com/about-us/join-us/senior-developer-technical-architect/\" rel=\"nofollow\">http:&#x2F;&#x2F;red-badger.com&#x2F;about-us&#x2F;join-us&#x2F;senior-developer-tech...</a><p>* Software Engineer - Working on the cutting edge with multiple languages, for enterprise clients. Strong Node.js or Ruby, JavaScript, HTML5 required. <a href=\"http://red-badger.com/about-us/join-us/software-engineer/\" rel=\"nofollow\">http:&#x2F;&#x2F;red-badger.com&#x2F;about-us&#x2F;join-us&#x2F;software-engineer&#x2F;</a><p>* UI Developer - Working on interesting new Responsive Web Design projects across multiple enterprise clients. Strong HTML5, CSS and Javascript required. <a href=\"http://red-badger.com/about-us/join-us/user-interface-developer/\" rel=\"nofollow\">http:&#x2F;&#x2F;red-badger.com&#x2F;about-us&#x2F;join-us&#x2F;user-interface-develo...</a><p>The full set of job listings you can apply to is at <a href=\"http://red-badger.com/about-us/join-us/\" rel=\"nofollow\">http:&#x2F;&#x2F;red-badger.com&#x2F;about-us&#x2F;join-us&#x2F;</a>\nYou can also email us directly at hello@red-badger.com\nOur stackoverflow page is here:<a href=\"http://careers.stackoverflow.com/uk/company/red-badger\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;uk&#x2F;company&#x2F;red-badger</a><p>We have won a few new key accounts so are looking to expand our team. Quality is of the upmost importance however. We will not hire for the sake of growth. We only hire great people.","time":1381669899,"type":"comment"}