{"by":"raamdev","id":17902932,"parent":17902901,"text":"Kinsta | Senior Support Engineer | Full-time | REMOTE | <a href=\"https:&#x2F;&#x2F;kinsta.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;kinsta.com&#x2F;</a><p>Kinsta is a modern cloud hosting startup focused on WordPress hosting. Our awesome, young, and motivated team is scattered across the globe: Europe, Asia, Australia, and North America.<p>Our client base is growing steadily and we’re looking for a competent support engineer with exceptional communication skills who can provide enterprise level technical support to our customers via our support system.<p>Our Support Engineers must know WordPress deeply. All we host is WordPress and we have the best support team in the business (even if we do say so ourselves). While you don&#x27;t have to be a full-fledged WordPress developer to be a Kinsta Support Engineer, you do need to know the WordPress database and file&#x2F;directory structure as well as the wp-config.php file like the back of your hand.<p>A basic understanding of or familiarity with the following technologies is also a must: Linux, Nginx, PHP, MySQL&#x2F;MariaDB, HTML, CSS, JavaScript, DNS, CDN, and caching (object and page).<p>This is a fully-remote role. Our Support Engineers can work from anywhere they have reliable Internet access. We always use the latest version of everything: PHP 7.2, NGINX, Ubuntu 18.04, Linux containers, Google Cloud and more, so you’ll be able to work with a bunch of exciting technologies and use them every day!<p>This position offers a great deal of flexibility, responsibility, competitive salary, and opportunity for growth for the right candidate.<p>Apply: <a href=\"https:&#x2F;&#x2F;kinsta.workable.com&#x2F;j&#x2F;31973E3EFD\" rel=\"nofollow\">https:&#x2F;&#x2F;kinsta.workable.com&#x2F;j&#x2F;31973E3EFD</a><p>Read more about Kinsta: <a href=\"https:&#x2F;&#x2F;kinsta.workable.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;kinsta.workable.com&#x2F;</a>","time":1535987121,"type":"comment"}