{"by":"erikrek","id":17904665,"parent":17902901,"text":"Streetbees | Junior &#x2F; Senior Data Scientists and Data Engineers | Full-time, ONSITE, London\n<a href=\"https:&#x2F;&#x2F;streetbees.workable.com&#x2F;j&#x2F;B0BC66BE9E\" rel=\"nofollow\">https:&#x2F;&#x2F;streetbees.workable.com&#x2F;j&#x2F;B0BC66BE9E</a><p>Come join our amazing data science team and help build the world’s intelligence platform.<p>If building a brand new ML stack from scratch, researching and developing state-of-the-art NLP and changing an established market with a well-funded company sounds like your cup of tea, then we would love to hear from you :-)<p>Streetbees is building the world&#x27;s first real-time platform for market data insights. We connect our clients with real time data on the behaviours and opinions of their customers. Using the Streetbees app, we broadcast our clients&#x27; requests to our thousands of &quot;bees&quot; on the ground in over 150 countries. Our bees reply with in the moment behavioural data, often in the form of text, images or video.<p>From this we extract deep insights into customer behaviour as captured at the moment of consumption, purchase etc. Our clients include some of the largest FMCG companies in the world and with the success of our product the company is growing rapidly.<p>Therefore, we are now looking to further expand our data science team with all levels of experience. This is a unique opportunity to be part of a growing, talented team that are building and inventing novel data science. As part of the team, you will be instrumental in shaping what Streetbees become, working alongside our engineers, product and business teams to architect and develop our innovative platform.<p>We are looking for Data Scientists and Data Engineers at all levels.<p>If you are interested ping me on erik@streetbees.com or follow either or these links:\n<a href=\"https:&#x2F;&#x2F;streetbees.workable.com&#x2F;j&#x2F;8888AE8BD1\" rel=\"nofollow\">https:&#x2F;&#x2F;streetbees.workable.com&#x2F;j&#x2F;8888AE8BD1</a>\n<a href=\"https:&#x2F;&#x2F;streetbees.workable.com&#x2F;j&#x2F;8888AE8BD1\" rel=\"nofollow\">https:&#x2F;&#x2F;streetbees.workable.com&#x2F;j&#x2F;8888AE8BD1</a>","time":1536005955,"type":"comment"}