{"by":"rickyyean","id":17903248,"parent":17902901,"text":"DIRT protocol | Mountain View, CA | Onsite, Full-time | <a href=\"https:&#x2F;&#x2F;dirtprotocol.com\" rel=\"nofollow\">https:&#x2F;&#x2F;dirtprotocol.com</a><p>DIRT is a protocol for decentralized information curation. Communities can crowd curate trusted data. DIRT defines a set of rules for writing and moderating data that uses token staking to incentivize honesty. We raised funding from Greylock, General Catalyst, Lightspeed, SV Angel, etc, and are hiring.<p>FULL STACK ENGINEERS<p>---------------------------<p>1. Our stack includes Solidity (protocol deployed as smart contracts on Ethereum), Typescript (developer libraries that interact with smart contracts), NodeJS + React (web apps for users).<p>2. Architect high level protocol designs. Build, test, and optimize protocol features.<p>3. Develop APIs to be consumed by web, mobile, and command line clients. Work with a high degree of autonomy on a small engineering team.<p>4. We are the first customer for the protocol. Work with data pipelines and front end development to build the first application that uses DIRT.<p>--------------------------------------------------------------<p>If you&#x27;re looking to learn about startups to start your own or want to work in the cryptocurrency space, we have some things you can&#x27;t find anywhere else.<p>- You&#x27;ll learn lots about startups from us. We&#x27;re currently a team of five that has 3 YC alumni.<p>- You&#x27;ll get autonomy to make decisions AND mistakes. We&#x27;re a team that biases towards shipping code and learning.<p>- You&#x27;ll find a team that trusts each other. We step up for each other to create space for the team to do their job.<p>- You&#x27;ll learn how to express your thoughts. We actively work on clear and succinct communication of ideas<p>- You&#x27;ll learn to build decentralized apps and be a early thought leader in the space.<p>Join us to build the data layer for the blockchain. Contact careers@dirtprotocol.com or apply at: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;dirt-protocol&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;dirt-protocol&#x2F;jobs</a>","time":1535990184,"type":"comment"}