{"by":"mindows","id":17906816,"parent":17902901,"text":"Brava Home, Inc. | Redwood City, CA | Full-Stack Engineer, DevOps | Full-time | Onsite | <a href=\"https:&#x2F;&#x2F;careers.brava.com\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.brava.com</a><p>Want to actually work on something your friends and family can understand and appreciate? We build kickass ovens with independently controlled, infrared heating lamps that can cook a full tray of different ingredients all at once, in less time, with less energy. check out brava.com for more technical info =)<p>Brava’s WOMP (Web, OvenUI, Mobile, and Platform) team is looking for passionate engineers that are not afraid to jump in and learn new technologies and push themselves everyday to change how we cook at home.  We build software that drives everything from the user interface on the oven’s touch screen to the k8s cluster that runs e-commerce, content management services, mobile backends, and device-to-device communication channels.  Perks? we don’t have a fancy gym or a michelin star cafeteria that serves sushi, but your desk will be equipped with a fully operational, dev oven you will use to develop and test your code. We also use ovens at home to come up with our own recipes, or find&#x2F;fix bugs.<p>We are actively looking for:<p>- DevOps engineers with k8s experience<p>- Full-stack engineers with nodejs&#x2F;python&#x2F;swift&#x2F;react(js&#x2F;native) experience <a href=\"https:&#x2F;&#x2F;careers.brava.com&#x2F;software-engineer-full-stack\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.brava.com&#x2F;software-engineer-full-stack</a><p>- Build&#x2F;Release engineer\n<a href=\"https:&#x2F;&#x2F;careers.brava.com&#x2F;build-release-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.brava.com&#x2F;build-release-engineer</a><p>We don’t phone screen our candidates with algorithm questions, but we do expect our candidates to show us how they code in real life.<p>Email min@brava.com to apply. Please include your resume, github handle, and anything interesting you’d like to share with us.","time":1536038436,"type":"comment"}