{"by":"fjahr","id":17902936,"parent":17902901,"text":"Smart Host | Berlin, Germany | Frontend, Backend, Product | Full-time | Visa | Onsite | <a href=\"https:&#x2F;&#x2F;www.smart-host.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.smart-host.com&#x2F;</a><p>Smart Host is giving independent hotels the digital marketing tools that help them stay relevant in the age of booking.com and Airbnb. Our CRM suite consists of 3 modules: Guests: giving the hotels insights about their in-house guests in order to tailor services to their needs. Campaigns: to send only relevant information to their previous guests and turn them into returning customers. Offers: to craft custom offers for potential guests who are requesting a stay. All our modules are using advanced statistical analysis hidden in the background to synthesize actionable information and give clear advice to our customers on how to treat and market to their guests while avoiding to spam them with irrelevant information.<p>We are handling customer data with all the care it deserves and are, of course, fully compliant with GDPR. We do not mine from any external data sources and instead solely rely on data the hotels are gathering during a guests stay as well as online surveys conducted directly with the guests. This leaves us with generally very high quality of data.<p>Smart Host is a two year old, VC funded startup that is run by two experienced entrepreneurs who each have successfully founded two companies previously. All the members of the technical team are highly experienced and are looking for support from other experienced and motivated individuals.<p>We are hiring for following positions:\n* Senior Backend Engineer (Java&#x2F;Spring Boot, Python), Salary: 60k - 85k\n* Senior Frontend Engineer (React&#x2F;Redux), Salary: 55k - 75k\n* Senior Product Manager, Salary: 55k - 75k<p>Full job descriptions and contact details at <a href=\"https:&#x2F;&#x2F;www.smart-host.com&#x2F;en&#x2F;about-us&#x2F;#careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.smart-host.com&#x2F;en&#x2F;about-us&#x2F;#careers</a>","time":1535987171,"type":"comment"}