{"by":"thenewwazoo","id":17903446,"parent":17902901,"text":"Zipcar | <a href=\"https:&#x2F;&#x2F;www.zipcar.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.zipcar.com</a> | San Mateo, CA | ONSITE Full-time | Firmware&#x2F;Embedded C&#x2F;C++ and Rust<p>Zipcar is the world’s largest shared-mobility company.  We are adding senior talent to our engineering team at our Silicon Valley office in San Mateo. We have a rich software stack with which we solve a wide range of challenges: embedded custom hardware and firmware, mobile-first user experience, analytics, scalable real-time scheduling and monitoring, etc.<p>We&#x27;re looking for an experienced firmware developer to maintain existing devices in the field, and develop our next generation of telematics devices. Come help us build connected-car technology for multiple product lines, including Zipcar and Avis. By putting our massive fleets behind an API, we are aiming to be the AWS of transportation.<p>Example of our connected car work for Avis: <a href=\"https:&#x2F;&#x2F;www.reuters.com&#x2F;article&#x2F;us-avis-budget-grp-tech-kans..\" rel=\"nofollow\">https:&#x2F;&#x2F;www.reuters.com&#x2F;article&#x2F;us-avis-budget-grp-tech-kans...</a>.<p>Overview of our partnership with Waymo: <a href=\"https:&#x2F;&#x2F;www.theverge.com&#x2F;2017&#x2F;6&#x2F;26&#x2F;15873236&#x2F;avis-waymo-googl..\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theverge.com&#x2F;2017&#x2F;6&#x2F;26&#x2F;15873236&#x2F;avis-waymo-googl...</a>.<p>News about our partnership with Lyft: <a href=\"https:&#x2F;&#x2F;money.cnn.com&#x2F;2018&#x2F;08&#x2F;06&#x2F;investing&#x2F;avis-budget-lyft-partnership&#x2F;index.html\" rel=\"nofollow\">https:&#x2F;&#x2F;money.cnn.com&#x2F;2018&#x2F;08&#x2F;06&#x2F;investing&#x2F;avis-budget-lyft-...</a><p>Our stack is PIC and ARM running embedded C&#x2F;C++, both bare-metal and RTOS, with Java and Rabbit MQ on the server&#x2F;data ingestion side, so you&#x27;ll need to be at-least-conversant all the way up the stack. When we say &quot;full stack&quot;, we mean it! :) We are also currently evaluating writing our next-gen firmware in Rust, so candidates who know Rust are desired.<p>Mission-driven. Small team. Flexible working conditions. No worries about funding. :)<p>I have never been happier at a job; this place is great. I build solutions that breathless news articles (still!) talk about happening in the future. I&#x27;d be one of your peers, and I&#x27;m happy to answer questions off-the-record (hn profile address) or on (bmatthews!zipcar,com)","time":1535992150,"type":"comment"}