{"by":"BRValentine","id":17904331,"parent":17902901,"text":"Voltaiq | Senior Interaction Designer | Berkeley, CA | Full-time | Onsite<p>The Role: At Voltaiq, we enable battery researchers and applications engineers to explore and visualize battery performance data, alongside metadata describing how those batteries were made and operated. As a Senior Interaction Designer, you will work with the Product Manager to design the user-facing side of a web application offering powerful data search, processing, visualization, and advanced workflow functionality. You will learn how battery data is used to improve the performance of mobile devices, electric vehicles, and the power grid. You will design dashboards and other interfaces presenting performance statistics to our customers. If you love data visualization and delightful user experiences, and want to have a positive impact on how the world consumes energy, then this is the job for you!<p>Responsibilities:<p>* Understand the evolving needs of our customers, and how these are served by the product.<p>* Collaborate with Customer Success and Engineering teams to assess effectiveness and feasibility of designs.<p>* Iterate with the product manager to define product features that are simple, coherent, and powerful.<p>* Design and maintain a UX system to collect and organize both the qualitative observations and the quantitative metrics of of user behavior.<p>* Work with product manager to develop user personas and user stories.<p>* Map out our users’ conceptual model and design the site information architecture.<p>* Create wireframes, mockups, screenflows, and clickable prototypes for new product features.<p>* Test and validate working hypothesis with users through usability testing of wireframes, clickable prototypes and published product, and participate in design critique.<p>* Help define and integrate a visual identity into the Voltaiq platform.<p>* Find creative ways to solve UX problems and display complex data visually.<p>Qualifications:<p>* Master’s degree in Information Management, HCI or related field.<p>* At least 5 years of experience in user-centered interface design for web applications.<p>* Proficiency with visual design tools, such as Sketch, Invision, and Adobe Creative Suite.<p>* Experience with data visualization, including charting libraries such as D3, C3, and Plotly.<p>* Experience designing interactions for enterprise workflows.<p>* Familiarity with HTML, CSS, and Javascript.<p>* Strong user empathy; ability to find creative solutions to UX problems and user pain points.<p>* Strong teamwork and mentorship skills.<p>* Strong communication skills both verbal and written.<p>* Comfortable with remote work and communicating effectively through real-time text, audio, or video chat.<p>Competitive salary plus equity and full benefits. The role is full-time in our Berkeley, CA office (3-4 days&#x2F;week on-site, the rest can be remote). Our company culture is mature, low-key and lighthearted, but serious about our mission and our work. No jerks, no insane hours, several of us have kids. All of us care a lot about advancing the global energy transition.<p>Voltaiq is an equal opportunity employer and is committed to achieving a diverse workforce through application of its equal opportunity and nondiscrimination policy, in all aspects of employment.","time":1536001632,"type":"comment"}