{"by":"thorsteneckel","id":17903698,"parent":17902901,"text":"Zammad | Frontend, Fullstack, UI&#x2F;UX | Open Source | REMOTE | FULLTIME | <a href=\"https:&#x2F;&#x2F;zammad.com\" rel=\"nofollow\">https:&#x2F;&#x2F;zammad.com</a><p>We&#x27;re Zammad - an Open Source Zendesk alternative. Our beautiful and award winning ticketing &#x2F; customer service system grows in numbers of users and supporters every day. So it&#x27;s time for our already international team to grow as well.<p>Zammad is made of a Rails (5.1, 5.2 soon) REST API backend which powers a SPA build with jQuery, Coffeescript, Spine.js, SCSS. Feel free to check it out over at <a href=\"https:&#x2F;&#x2F;github.com&#x2F;zammad&#x2F;zammad\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;zammad&#x2F;zammad</a><p>Frontend:\nWe started out with Coffeescript and jQuery (as may other Rails projects out there) but want to migrate our frontend over to a more modern approach. We&#x27;re looking for someone professional, reliable and experienced to support us with that with the option to take a leading role in the process and for the frontend in general.<p>Fullstack:\nWe&#x27;re in the final phase of completing our &quot;zero (known) bugs&quot; goal and already started working on refactoring the whole code base while providing new functionalities that our users and customers love. Help us with creating an exceptional Open Source developer experience, codebase and tool in general. We&#x27;d love to welcome someone with a strong Rails and&#x2F;or Javascript background to the team.<p>UI&#x2F;UX:\nOur beautiful and award winning UI &#x2F; UX is mentioned in all of the positive feedback we receive over various channels. It&#x27;s crucial to us that we keep that level as the application grows and extends. We&#x27;re still searching for someone who is willing to take over the responsibility and freedom that comes with it to make the UI &#x2F; UX of our SPA even better.<p>I&#x27;m looking forward to hear from you lovely people.<p>Get in contact via jobs@zammad.com and refer to Thorsten. Thanks!","time":1535994597,"type":"comment"}