{"by":"LightsCamera","id":17909357,"parent":17902901,"text":"Street Contxt | Toronto | DevOps Engineer | Full-time | ONSITE | <a href=\"https:&#x2F;&#x2F;streetcontxt.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;streetcontxt.com&#x2F;</a><p>Street Contxt is reinventing client coverage in capital markets. We enables sell side brokerages and independent research firms to efficiently and profitably cover their buy-side clients from every value segment with their research products, democratizing investor&#x27;s access to information. We leverage proprietary machine learning technology and patented systems to enable our customers to target the right client with the right content, giving both the research provider and consumer a competitive edge in the market. Street Contxt brings transparency, accountability, scale, and profitability to institutional research distribution and consumption, allowing firms to scale and stay ahead of changing regulations.<p>The term DevOps Engineer means many different things, to many different people. As a DevOps Engineer at Street Contxt, you will:<p><pre><code>  - Architect and deploy microservices, while continuing to maintain our production environment\n  - Help us continue to improve our continuous deployment system, increasing our deployment velocity\n  - Champion security, continually improving our security posture and integrate industry best practices in our work\n</code></pre>\nReporting directly to the CTO, success in the role requires a pragmatic approach. You will be encouraged to stay up to date with the latest tools, trends and techniques and will be tasked with recognizing when shiny, new things are right for the business - and when they’re not. We currently use AWS (primarily ECS with RDS for PostgreSQL), Ansible, Molecule, Terraform, Consul and Packer.\nWe offer:<p><pre><code>  - Competitive compensation\n  - Stock option grants\n  - Breakfast + lunch provided daily Monday -&gt; Friday\n  - $2500&#x2F;year for professional development\n  - An experienced, tight-knit engineering team\n</code></pre>\nTo apply - use the following link: <a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;fVLMJm\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;fVLMJm</a><p>If you have questions or are looking for clarification on any of the above - my name is Jackson Mullins and I can be reached directly at jackson@streetcontxt.com","time":1536072199,"type":"comment"}