{"by":"Propeller","id":17907547,"kids":[17911711],"parent":17902901,"text":"Propeller Aero | Sydney &amp; Denver | Onsite | Full Time | <a href=\"https:&#x2F;&#x2F;www.propelleraero.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.propelleraero.com&#x2F;jobs&#x2F;</a><p>Commercial drones have the potential to revolutionize mining, construction, and civil engineering. They reduce costs, improve worker safety, enable transparency and collaboration, and shave days or weeks off typical workflows.<p>We’re the technology company that’s already making that happen.<p>At Propeller Aero, we improve how worksites are managed around the world. We close the information gap between a physical worksite and the people who manage it. We believe that everyone should be able to measure and manage their worksite themselves.<p>Our top-tier team puts the power of drone imagery into a user-friendly toolkit. We do this through our 3D, cloud-based platform, where sophisticated engineering and photogrammetry meets intuitive design and simple workflows. Supported by our engineering team and AeroPoints hardware, we translate raw site data into readable, actionable information for our users.<p>Great engineering is our keystone. Without it, we couldn’t be good translators and our vision would be unworkable. It’s our practical, results-driven side. It’s the “how” of solving everyday problems. Propeller is comprised of tight-knit, decentralized teams.<p>* Senior Software Engineer (Sydney) - <a href=\"https:&#x2F;&#x2F;propelleraero.breezy.hr&#x2F;p&#x2F;55f906e5c9fb-senior-software-engineer?popup=true*\" rel=\"nofollow\">https:&#x2F;&#x2F;propelleraero.breezy.hr&#x2F;p&#x2F;55f906e5c9fb-senior-softwa...</a> Front End Software Engineer (Sydney) - <a href=\"https:&#x2F;&#x2F;propelleraero.breezy.hr&#x2F;p&#x2F;a479ae2db034-front-end-software-engineer?popup=true\" rel=\"nofollow\">https:&#x2F;&#x2F;propelleraero.breezy.hr&#x2F;p&#x2F;a479ae2db034-front-end-sof...</a><p>* Full Stack Software Engineer (Sydney) - <a href=\"https:&#x2F;&#x2F;propelleraero.breezy.hr&#x2F;p&#x2F;40ff87d504e0-full-stack-software-engineer?popup=true\" rel=\"nofollow\">https:&#x2F;&#x2F;propelleraero.breezy.hr&#x2F;p&#x2F;40ff87d504e0-full-stack-so...</a><p>* Data Success Engineer (Denver) - <a href=\"https:&#x2F;&#x2F;propelleraero.breezy.hr&#x2F;p&#x2F;5b8eb981e14a-data-success-engineer-denver?popup=true\" rel=\"nofollow\">https:&#x2F;&#x2F;propelleraero.breezy.hr&#x2F;p&#x2F;5b8eb981e14a-data-success-...</a><p>Our people have the freedom to approach, own, and solve problems creatively. We’re 100% about impact, and 0% about ego. Want to know what our team actually say about us? Check out our Glassdoor reviews.<p>Your gender, your religion, your sex life, or your skin colour won&#x27;t make a difference here. Propeller Aero is a progressive and open-minded employer. If you&#x27;re smart and good at what you do, come as you are.","time":1536050370,"type":"comment"}