{"by":"caydian","id":17906565,"parent":17902901,"text":"Honeylove | San Francisco, CA | ONSITE | Full-time | Customer service rep | www.honeylove.co<p>We are an SF fashion startup who designs and manufactures functional and stylish undergarments for women. We&#x27;ve experienced tremendous growth over the Summer, and are expanding our team in key areas to better serve our customers.<p>As an early team member, you will play an integral part in our success. Our goal is to build an environment where everyone can use their strengths and feel empowered to develop in new areas. You will be encouraged to share ideas and suggestions, and we will do our best to reward your hard work and exceptional contribution.<p>Job Description<p>We currently need support in various customer service duties. We have a lot of inbound interest and questions pertaining to how our product works, as well as an ever-growing list of customers who need different sizes and assistance in tracking their orders. This may sound easy, but when it is done well it brings a level of ease to the customer and builds their trust for our brand. We are looking for someone who can assess customer&#x27;s needs and be able to suggest the quickest&#x2F;effective solution, while positively representing our brand. Politeness, diplomacy, and efficiency are essential in doing this well.<p>In addition to communicating with customers who need help, you will also be asked to process exchanges and returns. Items arrive at our local post office daily, and you will collect these packages, open and review the items, and process the customer&#x27;s request (be it an exchange or refund). Attention to detail and the ability to neatly tie up loose ends is very important. If you are very organized, you will be great at this.<p>Other tasks may include taking support calls, answering calls from our website chat widget and responding to messages via email and Facebook. We will get you up to speed one skill at a time, and pretty soon you will know how to do everything.<p>Please note that you will be working out of an office in Hayes Valley, and therefore telecommuting is not an option for this job.<p>Job Type: Full-time<p>Salary: $15.00 to $20.00 &#x2F;hour<p>If interested, email andy@honeylove.co with your resume. Also, please tell us why you are interested in this job. Thanks!","time":1536034149,"type":"comment"}