{"by":"clinth","id":17905641,"parent":17902901,"text":"New York Genome Center | Princpal Software Engineer | New York, NY | Full-time | ONSITE<p>NYGC is not a software company; it is a sequencing lab trying to push science at scale, and needs software to do so. We are hungry to become the lead sequencing firm. We&#x27;re aggressively building our clinical services, so if you have even the smallest allergy to documentation or process, please stop reading now.<p>This position is for a Principal Software Engineer to serve as a project lead. This person should be able to work independently and in a team, from requirements through implementation&#x2F;iteration and testing and deployment. We use python and postgresql on the backend, we have just chosen React on the frontend. We&#x27;re looking for someone who has both python application development experience and javascript&#x2F;front-end experience.<p>We are intentionally boring (<a href=\"https:&#x2F;&#x2F;valdhaus.co&#x2F;writings&#x2F;boring-systems&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;valdhaus.co&#x2F;writings&#x2F;boring-systems&#x2F;</a>) in our technology choices because our goal is data analysis, not novel software work. We design everything for reliability, maintenance, low cost of ownership, and failure recovery. It is a combination of boring technology and fast pace: we are the computational pipeline team, the automation team, the LIMS team, the database team, and the data transport team (surprisingly fun at &gt;20PB), the customer delivery team. We don&#x27;t do genomic methods software (e.g. better variant calling) -- we have a great computational biology group for that. This group is focused on making a sequencing lab and automated analyses run at scale.<p>This position is for the Production Software Engineering group, which currently has thirteen people. We&#x27;re replacing prototypes with better solutions while rolling out new applications to help the organization with scale. People who join NYGC software are expected to learn quickly, be self-motivated, and be comfortable switching tracks. You don&#x27;t have to understand e.g. genome sequence alignment, but you do have to be able to read a manual on a tool&#x27;s use and learn enough vocabulary to have an intelligent conversation with an expert on the subject.<p>The lab and automation combined drive some really interesting real-world problems, particularly in the clinical space. How fast can we get first-order cancer screening to sick people? More formal description under &quot;Principal Software Engineer, Applications&quot; on our careers page: <a href=\"http:&#x2F;&#x2F;www.nygenome.org&#x2F;careers&#x2F;job-positions&#x2F;?sc=7389&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nygenome.org&#x2F;careers&#x2F;job-positions&#x2F;?sc=7389&#x2F;</a>","time":1536019233,"type":"comment"}