{"by":"pandemicsyn","id":17903302,"parent":17902901,"text":"Keen IO | San Antonio, TX | Solutions Architect | Full-time | ONSITE | <a href=\"https:&#x2F;&#x2F;keen.io\" rel=\"nofollow\">https:&#x2F;&#x2F;keen.io</a><p>We acquired Keen last December and have been carefully growing the team and getting the product in shape since then. We started with ramping up engineering over the spring&#x2F;summer and we just finished staffing up our CS org. We&#x27;ve got enough organic demand that a Solutions Architect is our next critical hire (our chief platform engineer and I have been splitting that work but its definitely a full time job at this point).<p>At Keen the Solutions Architect role is a bit different. Its a highly technical role and you work both pre-sales and on post sale implementation. Our analytics platform provides general purpose building blocks to solve a wide variety of challenges, we rely heavily on discovery and a deep level of analytics expertise to help our customers assemble exactly the solution they need.<p>What we’re looking for:\n- Experience in either a Sales or Customer facing engineering role.\n- Solid understanding of SQL or NoSQL concepts and implementations.\n- Technical background working with modern web technologies, stacks, and API’s.<p>You should have some familiarity with one or more of the following: Javascript, Ruby, Node, or Python, etc.<p>Ultimately, what we’re looking for is someone with familiarity implementing business or product performance analytics ( activation, engagement, retention, adoption), and that can help other companies use our platform to implement similar metrics and data models.<p><a href=\"https:&#x2F;&#x2F;hire.withgoogle.com&#x2F;public&#x2F;jobs&#x2F;scaleworkscom&#x2F;view&#x2F;P_AAAAAAEAAADBOhDbsbUcB0\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.withgoogle.com&#x2F;public&#x2F;jobs&#x2F;scaleworkscom&#x2F;view&#x2F;P...</a><p>If you&#x27;ve got any questions shoot me an email (florian.hines@keen.io).","time":1535990754,"type":"comment"}