{"by":"samgnesin","id":17910821,"parent":17902901,"text":"Cheetah | San Francisco, CA | Senior Product Designer | Full-time | Onsite | www.restaurantcheetah.com<p>Cheetah is the leading e-commerce solution for Small-Medium business supplies, a $1T market in the US with approximately $140B in purchasing coming online over the next 3 years.  Nearly every small business owner is struggling with the daily volatility and stress inherent to running their business.  Managing customers, labor and supplies is becoming ever more difficult.  Cheetah offers business owners a simple, affordable and fast solution for the procurement of their daily supplies.  With Cheetah, owners can reduce the costs and time involved in managing this process by 5-10x and instead focus on growing their business.  Cheetah’s go-to-market is centered around the independent restaurant and foodservice vertical, a $100B market that is still largely offline.  Today, Cheetah is serving more than 1,300 customers in the Bay Area, Los Angeles and Seattle and has reached nearly 10% of all Bay Area restaurants.  The company, which has been stealth so far, has struck partnerships with all major national wholesalers (such as Restaurant Depot, Smart &amp; Final and Sam’s Club), and is on track for $100M GMV run rate by end of Q3, having grown by 3x y&#x2F;y. Series A was led by Mike Maples of Floodgate Capital.<p>In your first 90 days, you will<p>- Work with a design agency on a new branding identity and style guidelines<p>- Build out a new UX for our customer facing iOS and Android apps<p>- Interview, prototype, and test user flows for our internal operations personnel<p>- Create a center of excellence around customer development<p>Apply below or send an email to sam@restaurantcheetah.com<p>Senior Product Designer - <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;cheetah-technologies-inc&#x2F;jobs&#x2F;408269-senior-product-designer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;cheetah-technologies-inc&#x2F;jobs&#x2F;408269-senior...</a>","time":1536081636,"type":"comment"}