{"by":"jayliew","id":17911159,"parent":17902901,"text":"A fast-growing YC company! (S17) | Full-Stack Web or Front-End Software Engineer | Full-Time | ONSITE | SF Bay Area<p>----------------------------------------------------------------------------------------------------------------------------------------<p>Hi! I&#x27;m one of the engineers on the team :)<p>If you&#x27;re interested in:<p>- An insider&#x27;s perspective of, nay, being an active participant in the decision-making process of a YC company rapidly capitalizing on an under-the-radar market opportunity<p>- Applying your technical skills to a meaningful domain outside of tech (while learning about industry insider nuances), that has real-world medical implications that touches us all<p>- Being part of a small engineering team that not only measures daily active users but also physical products shipped, revenues, and real profits<p>- Being part of a small engineering team that ships not only software products but also physical products<p>- Watching how changes in your code physically impacts the operation of not just machines but the IRL work-flow of real people (specifically, pharmacists and technicians)<p>- Hands-on shipping of product, end-to-end! Everything from ideation --&gt; coding --&gt; customer delight (&amp; wash-rinse-repeat)<p>then I&#x27;d love to hear from you!<p>----------------------------------------------------------------------------------------------------------------------------------------<p>Our stack: React, Node, GraphQL (+ Apollo), ES6, Raspberry Pi, AWS (RDS, ECS, CloudFront, EC2), Elasticsearch, Jenkins, Rails, Python, Linux (Ubuntu), Docker, and moar. Right tool for the job &gt; dogma.<p>We have deliberately avoided press coverage around our traction, investors, and market because we have been focused on taking over the market as quickly as possible, but we will going public with what we&#x27;re up to shortly in a few weeks! (I&#x27;m sorry there&#x27;s no web site or company name to google for just yet--but I promise this isn&#x27;t at all anywhere close to the pejorative &quot;stealth&quot; mode at work)<p>We&#x27;re in the pharmacy (not pharmaceutical) space and I&#x27;m happy to elaborate more in private for serious inquiries.<p>We&#x27;re looking for front end, back-end, full stack web, and strong generalist software engineers, for full time and internship positions. We offer competitive Bay Area salary, stock equity, healthcare insurance, and other employee benefits.<p>jay liew at jay liew dot com<p>p.s. A totally separate position we&#x27;re also hiring for is in product management: we need 1 strong product person","time":1536083432,"type":"comment"}