{"by":"kylixz","id":17929350,"kids":[17930534],"parent":17902901,"text":"Chesapeake Technology Intl. (<a href=\"http:&#x2F;&#x2F;ctic-inc.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;ctic-inc.com&#x2F;</a>) | Software Engineer (Any level) | Full-time, U.S. Only | Camarillo, Santa Barbara, Denver, NoVA, San Diego, SoMD, REMOTE<p>CTI is building the next-generation signals and electronic warfare platform comprising hardware, firmware, software, and user interfaces. Have experience with GNU Radio? You should apply! Have experience with Nasa Worldwind or Cesium? Apply! Want to work on CRDTs on Android over low bandwidth links? Apply! Have operational experience in the DoD and want to apply that to helping others? Shoot us your resume!<p>We are a growing company, with remote work policies and flexible schedules. We offer competitive salaries and an excellent benefits package. Please apply if you want a challenging opportunity where you can lead a team with tremendous autonomy delivering C4ISR solutions to better inform law enforcement and defense without harming people.<p>We are looking for motivated and self-directing software engineers with a desire to learn. You&#x27;re not a ticket popper. We need to work together to define the work and solutions. We&#x27;re predominantly a JVM shop distributed around the country. The culture is flexible and supports staying current in your career -- for example, many of us have attended conferences like StrangeLoop, have subscriptions to ACM or Safari Books, or have pursued graduate programs with CTI&#x27;s assistance.<p>We won&#x27;t whiteboard you. Check out our interview process here by searching for &quot;Chesapeake Technology&quot;: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;poteto&#x2F;hiring-without-whiteboards\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;poteto&#x2F;hiring-without-whiteboards</a><p>Sample projects:\n* Architect and build a cutting edge platform of APIs and services for desktop, mobile, and web applications to control airborne UAV payloads.\n* Architect a system to allow 3rd parties providing services such as computer-aided vision, machine learning, and data analysis in a pluggable GIS platform.\n* Build services that ingests streams of data from various sensors in real-time and correlates with other feeds\n* Create immersive 3D visualizations for cyber security and radio frequency domains.<p>If you are interested, please apply to any of the locations closest to you:\nSanta Barbara, CA - <a href=\"https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=3&amp;source=ycombinator\" rel=\"nofollow\">https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=3&amp;source=ycomb...</a>\nCamarillo, CA - <a href=\"https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=5&amp;source=ycombinator\" rel=\"nofollow\">https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=5&amp;source=ycomb...</a>\nCalifornia, MD - <a href=\"https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=7&amp;source=ycombinator\" rel=\"nofollow\">https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=7&amp;source=ycomb...</a>\nChantilly, VA - <a href=\"https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=6&amp;source=ycombinator\" rel=\"nofollow\">https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=6&amp;source=ycomb...</a>\nDenver, CO - <a href=\"https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=4&amp;source=ycombinator\" rel=\"nofollow\">https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=4&amp;source=ycomb...</a>","time":1536266166,"type":"comment"}