{"by":"derEitel","id":17934879,"parent":17902901,"text":"Charité Berlin | Berlin, Germany | PhD Candidate in machine learning applied on neuroscience | Full-Time<p>Interested in doing a PhD in machine learning for healthcare? We are offering a PhD position at Charité Berlin.<p>German is not required!\n______________________________________________________________\nDeep Learning in clinical neuroimaging<p>PhD scholarship (starting October&#x2F;November 2018, initially for 2 years; Promotionsstipendium II at Charité)<p>At the Berlin Center for Advanced Neuroimaging and Bernstein Center for Computational Neuroscience (Charité), we are looking for a motivated and highly talented PhD student for various research questions within the interdisciplinary field of deep learning and clinical neuroimaging. In particular, we employ convolutional neural networks for finding new representations from neuroimaging data in order to predict disease conversion and future clinical disability in neurological as well as psychiatric diseases. Whereas previous disease decoding approaches mostly relied on expert-based extraction of features in combination with standard classification algorithms and thus strongly depend on the choice of data representation, convolutional networks are capable of learning hierarchical information directly from raw imaging data. By this, they have a great potential for finding unexpected and latent data characteristics and might perform as a real “second reader”. A major focus will be on visualization techniques to make the learned content of convolutional neural networks visible.<p>Requirements for the PhD student:\n- Very good degree in computer science, mathematics, physics, psychology, computational neuroscience or related subject.\n- Very good programming skills (e.g. Python)\n- Experience in machine learning\n- Good writing and communication skills (in English)<p>Please send your application (motivation+CV) in one pdf-file (in English or German) to:<p>Dr. Kerstin Ritter\nBerlin Center for Advanced Neuroimaging,\nBernstein-Zentrum für Computational Neuroscience\nCharité - Universitätsmedizin Berlin\nSauerbruchweg 4, Charitéplatz 1, 10117 Berlin\nEmail: kerstin.ritter@bccn-berlin.de","time":1536333286,"type":"comment"}