{"by":"fbarletta","id":17960151,"parent":17902901,"text":"UPTOP | Full Stack Web | New York City | Onsite (want to relocate?) | Full Time<p><a href=\"https:&#x2F;&#x2F;angel.co&#x2F;uptop_&#x2F;jobs&#x2F;413457-full-stack-developer-net-core-focused\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;uptop_&#x2F;jobs&#x2F;413457-full-stack-developer-net...</a>\nUPTOP is improving the process of one of the most important parts of life: finding a home. Even though we&#x27;re in the real estate sector, we&#x27;re still a tech company and that means is we care deeply about our product, it&#x27;s performance, how it impacts people and those who build and maintain it.<p>We&#x27;re seeking a few people who care about their craft, want to keep growing, want to share their knowledge, and who want to contribute their time towards something that is used by many people.<p>What should you know about us?<p>1. We care deeply about what we do. \n2. We&#x27;re transparent. \n3. We value team contributions vs. sitting 9-5. \n4. We&#x27;re never bored.<p>We also understand this is real life and we try never to forget that. Our goal isn&#x27;t to find just another developer seeking a job either. We want talent in search of a home, where they can be themselves, fit well into our culture, and keep developing their talent together with us.<p>We have a culture of open discussion and dialogue. Every team members opinion counts and pushes us towards our goals.<p>What&#x27;s under the hood?<p>C#&#x2F; C Sharp, .NET Core, Entity Framework Core, Microsoft SQL, React.js&#x2F;React Native, LESS, and TypeScript.<p>What do we expect of you?<p>At least 3 years of experience in web development and&#x2F;mobile development. \nProficiency in the technologies mentioned above. \nThat you have the authorization to work in the U.S. \nThat you are able to work under pressure and get the job done. \nThat you live or want to relocate to the greatest city in the world, New York City!","time":1536677099,"type":"comment"}