{"by":"mikepalmer","id":17996849,"parent":17902901,"text":"HiQ Solar | Full stack database&#x2F;web for internet-of-things | Sunnyvale, CA | Onsite or Remote | Full-time<p>== Internet-of-things Full-stack Engineer Wanted ==<p>THE COMPANY AND THE PRODUCT<p>HiQ Solar, Inc. designs and manufactures internet-connected AC&#x2F;DC inverters for solar power and electrical storage solutions, in commercial and utility settings. The market for solar storage is hot, and we need our Internet-of-Things (IoT) database, customer web portal, and data mining systems, to scale up along with our surging sales volumes. If you have skills in building scalable databases for hardware IoT applications, keep reading.<p>THE POSITION<p>We are looking for a self-driven full-stack (database and web layer) software engineer for a redesign and re-implementation of our cloud database and data mining systems. All of our solar installations connect to the internet via our custom power-line communication gateway. You will be designing and implementing a scalable cloud database system that can handle connections from 30,000 gateways, which report their operational data (inverter status, power production, temperature, etc.) at one-minute intervals. Total data uploads will reach 150M records&#x2F;day.<p>In addition, you will redesign our external customer web portal, an internal support web portal, and automated systems for predictive maintenance of customer devices; these must run efficiently, reliably, and maintainably.<p>The goals for your design will be scalability, operational fault-tolerance, and software maintainability (modern unit testing is a must).<p>Management skills are a plus, as the software team is likely to grow in the future as our revenue grows.<p>We are agnostic as to the &quot;technology stack&quot; you select. Whatever you have used to handle similar data volumes successfully in the past would be great. Let&#x27;s discuss.<p>THE LOCATION<p>HiQ is in located in the heart of Silicon Valley, in Sunnyvale, CA right near the 101 freeway... we would consider remote work if you are experienced and can come to the office periodically.<p>APPLY TO HIQ<p>HiQ today is twelve employees delivering cutting-edge, efficient, connected devices for solar and battery storage applications. The company has just completed a $6m+ funding round, and we offer competitive salaries and stock options. Please send your resume and cover letter to: michael.palmer@hiqsolar.com. Tell us about your previous experience building IoT data systems on a similar scale to ours. Include your github &#x2F; stackoverflow. What technology stack would you propose?","time":1537060163,"type":"comment"}