{"by":"Kerrick","id":16494351,"parent":16492994,"text":"Second Street | Senior Front-End Developer | St. Louis, MO | Full Time | <a href=\"https:&#x2F;&#x2F;secondstreet.com\" rel=\"nofollow\">https:&#x2F;&#x2F;secondstreet.com</a><p>--<p>Are you looking to join a fast-paced team and help lead it to success? Are you an authority in front-end development that can work with the team to find the right solution, write the logic to make it work, and then make it beautiful with CSS? Do you want the ability to impact meaningful change where you work? Second Street could be exactly what you&#x27;ve been looking for!<p>You will be a member of our cross-functional product development team which is made up of designers, testers, developers. You&#x27;ll enjoy a high level of autonomy while also working very collaboratively in-person and remotely using Slack, Trello, and GitHub. We work together to ship code every day and are constantly looking for ways to improve. Developers at Second Street are fully involved in every part of the process, from planning, to developing, to testing, to launch. We do things right: version control, automated testing, code reviews, and occasional pair programming. As a senior developer you&#x27;ll help your teammates work through particularly vexing issues and guide them as they build larger projects, all while keeping an eye toward usability and user experience thanks to your front-end experience.<p>--<p>We use Ember.js (including Ember Data and ember-cli) to build most of our applications, backed by a RESTful JSON API. We use the latest JavaScript features, including stable TC39 proposals that are supported by Babel. We also have a few TypeScript projects, including some Node.js services.<p>--<p>To learn more about working at Second Street: <a href=\"https:&#x2F;&#x2F;secondstreet.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;secondstreet.com&#x2F;careers&#x2F;</a><p>To learn more about this position: <a href=\"http:&#x2F;&#x2F;info.secondstreet.com&#x2F;now-hiring-senior-front-end-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;info.secondstreet.com&#x2F;now-hiring-senior-front-end-dev...</a><p>If you have any specific questions, I&#x27;m another Senior Front-End Developer at Second Street and I&#x27;m always glad to field questions here on HN or via email (my HN username @ secondstreet.com).","time":1519926846,"type":"comment"}