{"by":"hganesan","id":16494890,"parent":16492994,"text":"TowerView Health | Philadelphia, PA | Full-Time | Remote and In Office | Back-End Engineering | <a href=\"http:&#x2F;&#x2F;towerviewhealth.com\" rel=\"nofollow\">http:&#x2F;&#x2F;towerviewhealth.com</a><p>TowerView Health is a rapidly growing, venture backed startup in Philadelphia looking for a creative, self-driven back-end engineer to help us scale up our service for patients.<p>We help chronically ill patients manage complex medication regimens in their home. We partner with pharmacies that send patients customized pre-sorted medication trays that insert into our custom-designed smart pillbox. Our pillbox can sense when medication is removed and send patients and&#x2F;or their caregivers automated reminders. Explainer Link: <a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;vWaBJVrSOiE\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;vWaBJVrSOiE</a><p>We sell to health insurance companies and hospital systems so  patients receive it for free. Our patients love us because we take away the complexity of managing medications and our customers love us because we keep patients healthy and out of the hospital--only 33% of patients take their medication as prescribed and 125,000 people die each year because of medication related errors. We’re on a mission to help patients and revolutionize the way that medications are taken in home.<p>Experience in&#x2F;with: Node.JS, Docker, microservices<p>Projects we work on: \n- IoT backend processing sensor data to help identify patients who need care \n- Microservice backend platform to manage data from multiple client web applications \n- Automated notification system to coordinate online and pillbox-centric alerts for patients<p>More info here: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;towerview-health&#x2F;jobs&#x2F;96130-backend-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;towerview-health&#x2F;jobs&#x2F;96130-backend-enginee...</a><p>Shoot me a message or an e-mail at hareesh@towerviewhealth.com if you have any questions or just want to learn more about the company.","time":1519930208,"type":"comment"}