{"by":"alexjg","id":16496202,"parent":16492994,"text":"Rover | Front End and Backend Engineers | Toronto | ONSITE Full-time | <a href=\"https:&#x2F;&#x2F;www.rover.io\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rover.io</a><p>Rover empowers brands and app publishers to create engaging, native mobile content without code. We reduce the resources required to create mobile campaigns and provide a powerful context engine to ensure the right user is engaged at the right time.<p>About the team:<p>Rover&#x27;s engineering team prides itself in always being able to use the latest and greatest tech. You&#x27;ll be part of a small and heavily focused engineering team that likes to move fast and get things done. Most importantly we love to teach each other and grow together.<p>Backend Engineer (1+ years experience):<p>Our backend is comprised of Go, Kubernetes, GRPC, GraphQL, Nodejs, Docker, MongoDB and much more. We are currently transitioning from a node.js data pipeline to Kafka being at the heart of our stack. You&#x27;ll have the opportunity to explore every piece of our backend and have immediate impact on our product serving millions of devices daily. Your responsibilities will be:<p>- Creating new scalable Go and GRPC services<p>- Developing new product features around our Kafka data pipeline<p>- Helping expand our Big data store &amp; customer data integration<p>- Optimizing existing services to squeeze out performance<p>Front End Engineer (1+ years experience):<p>This position focuses on building new products and maintaining Rover&#x27;s existing suite of web apps used by designers and marketers. Our frontend stack includes ES6+ Javascript&#x2F;Typescript, React, Redux and Relay. These apps communicate with our GraphQL Express API. You’ll be:<p>- Enhancing our current design application, Rover Experiences (<a href=\"https:&#x2F;&#x2F;www.rover.io&#x2F;features&#x2F;experiences&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rover.io&#x2F;features&#x2F;experiences&#x2F;</a>)<p>- Collaborating with the back end team to expand our GraphQL API<p>- Developing new apps from start to finish for the Rover ecosystem<p>Contact chris (at) rover.io","time":1519937504,"type":"comment"}