{"by":"skytrue","id":16497186,"parent":16492994,"text":"Truebase | Founding Member, Developer &#x2F; Architect | 50-100k + 0.5% - 4% equity | <a href=\"http:&#x2F;&#x2F;truebase.io\" rel=\"nofollow\">http:&#x2F;&#x2F;truebase.io</a> | Seattle, WA | Full-time<p>Truebase is a stealth startup in the blockchain space. This is a unique opportunity to be involved in the development of technology that will revolutionize the way we think about trust (obligatory hype sentence, but true!). You will be in on the ground floor, influencing the direction of the company. We are looking for a talented, distributed systems engineer with a proven record for building highly-scalable, service-based applications. You will need to be a quick learner that readily picks up new languages.<p>As a founding member, you will help define our engineering culture. You will work directly with our CTO to build the first generation of our protocol. Our ideal person is driven to excel and passionate about blockchain.<p>Some of the things you will be responsible for:<p>- Designing and building large-scale distributed services<p>- Taking end-to-end ownership of the service quality, support and deployments<p>- Contributing ideas to our technology, algorithms, and products by participating in brainstorming sessions<p>- Helping us build an awesome team through the hiring and interviewing process<p>The skills we are looking for:<p>- Extensive hands-on coding experiences with modern languages like Node, Scala, or Go<p>- Proficiency working with NoSQL storage services like MongoDB, DynamoDB, Cassandra, Couchbase or equivalent<p>- Track record designing and maintaining JSON-based RESTful APIs<p>- Proven experience building distributed services<p>- Experience with cloud technologies such as AWS, Azure or Google AppEngine<p>- Production experience deploying, configuring, and monitoring high availability and high traffic systems<p>Shoot us an email with your resume at recruiting@truebase.io, or apply on AngelList at <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;truebase&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;truebase&#x2F;jobs</a> -- mention that you came in through HN for fast track","time":1519945057,"type":"comment"}