{"by":"seregine","id":16493634,"parent":16492994,"text":"Outschool<p>SF: Principal Software Engineer, onsite<p>React, GraphQL, Node&#x2F;Express, Postgres<p><a href=\"https:&#x2F;&#x2F;outschool.workable.com&#x2F;j&#x2F;19ADD36740\" rel=\"nofollow\">https:&#x2F;&#x2F;outschool.workable.com&#x2F;j&#x2F;19ADD36740</a><p>Outschool is the marketplace of small-group online classes for K-12 learners. Our live video chat format transforms the diversity and quality of learning experiences available to kids around the world. Already, hundreds of independent teachers are offering thousands of classes in every subject: forensic science, competitive math, storytelling, anthropology, study skills, art, and many more. Parents love the selection: thousands of them are spending hundreds of dollars per month, and our sales are up 8x over the last year.<p>We are an accomplished team of four in SF, with experience in education, marketplaces, software, and operating online services at Udemy, Amazon, Airbnb, YC, Square, Google, and many startups. We are ambitious in the long term and pragmatic in the short term. We prioritize carefully, run experiments, start simple, then iterate. This gives us confidence at every step that we’re learning about our customers and building what they want. It also means we have less risk, randomness, and drama than most early startups.<p>We&#x27;re now looking for a senior software engineer to complement our team. This is the perfect opportunity for the right person to get involved early, contribute a lot to our success, and create awesome learning experiences for kids. Everything about our product will evolve, so you&#x27;ll work on a variety of projects: in-class interactions, teacher success, communication tools, marketplace discovery, metrics, internal process, infrastructure, and more. Our stack is modern JavaScript: React, Apollo&#x2F;GraphQL, Node&#x2F;Express, and Postgres.<p>We think the best candidates care about learning and education. You’ll need a mature perspective on engineering tradeoffs, product decisions, and teamwork. You must have been programming professionally and challenging yourself for at least 5 years. You have something to teach us.<p>Reach out to work@outschool.com or apply at <a href=\"https:&#x2F;&#x2F;outschool.workable.com&#x2F;j&#x2F;19ADD36740\" rel=\"nofollow\">https:&#x2F;&#x2F;outschool.workable.com&#x2F;j&#x2F;19ADD36740</a>","time":1519923167,"type":"comment"}