{"by":"adam-p","id":16493569,"parent":16492994,"text":"Psiphon | DevOps | Toronto | $60k-$90k | corp:&lt;<a href=\"https:&#x2F;&#x2F;psiphon.ca&#x2F;&gt;\" rel=\"nofollow\">https:&#x2F;&#x2F;psiphon.ca&#x2F;&gt;</a> product:&lt;<a href=\"https:&#x2F;&#x2F;www.psiphon3.com&#x2F;&gt;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.psiphon3.com&#x2F;&gt;</a> | &lt;info+hn@psiphon.ca&gt;<p>## Overview<p>* Live service management to ensure that the production stats system continues to service both indexing and query requests in a timely and error free fashion.<p>* Software engineering to support and enhance our internal and external stats systems, and business&#x2F;client facing interfaces to that system. The core technology stack for our stats system is ELK.<p>* Support for internal teams and their use of stats.<p>This role also includes monitoring, technical problem solving, root cause analysis, and documentation. Design and maintenance of automated monitoring solutions and identifying&#x2F;resolving performance issues across the infrastructure are also critical elements of this role. We are looking for people passionate about technology.<p>In return, you will gain exposure and experience working on a wide variety of exciting and key strategic projects as well as becoming an integral part of the team providing the world’s largest censorship circumvention platform, helping millions of people a day gain access to the full and uncensored internet-at-large.<p>## Experience&#x2F;Skills<p>### General<p>* Takes initiative and has desire to independently research solutions to complex problems<p>* Excellent verbal, listening and written communication skills.<p>* You thrive as both an individual contributor and team member, consistently taking accountability for results.<p>* Good organizational skills; Methodical and good attention to detail.<p>### Technical<p>* Experience with Amazon Web Services (AWS) and&#x2F;or other cloud services<p>* Experience with monitoring tools (nagios, prometheus, etc.) and&#x2F;or scripts<p>* Experience with scripting (shell&#x2F;perl&#x2F;python&#x2F;etc.), Linux system administration<p>* Ability to create “proof of concept” prototypes or models.<p>* Ability to research &amp; create tools to support development and test.","time":1519922786,"type":"comment"}