{"by":"ecometrica","id":16495315,"parent":16492994,"text":"Ecometrica | Dev Ops, QA Lead | Montréal, QC Canada | ONSITE | Full-time | <a href=\"https:&#x2F;&#x2F;ecometrica.com&#x2F;about-us&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;ecometrica.com&#x2F;about-us&#x2F;careers&#x2F;</a><p>Ecometrica is the global leader in downstream space information solutions. We turn the vast and growing streams of observation data from space, air and land into actionable insights for business, government and society. Our technology supports all aspects of sustainability planning, operations and reporting by businesses and public organisations. Our data and software services are available worldwide through offices in London, Boston, Edinburgh and Montreal.<p>Two positions have opened in our Montreal office - Dev Ops Developer and QA Lead. Deux postes sont présentement disponibles à notre bureau de Montréal : Développeur(euse) DevOps et Chef(fe), Assurance de la qualité.<p>- Dev Ops Developer&#x2F;Développeur(euse) Dev Ops (<a href=\"https:&#x2F;&#x2F;ecometrica.com&#x2F;about-us&#x2F;careers&#x2F;dev-ops\" rel=\"nofollow\">https:&#x2F;&#x2F;ecometrica.com&#x2F;about-us&#x2F;careers&#x2F;dev-ops</a>)<p>- QA Lead&#x2F;Chef(fe), Assurance de la qualité (<a href=\"https:&#x2F;&#x2F;ecometrica.com&#x2F;about-us&#x2F;careers&#x2F;qa-lead\" rel=\"nofollow\">https:&#x2F;&#x2F;ecometrica.com&#x2F;about-us&#x2F;careers&#x2F;qa-lead</a>)<p>By joining the Ecometrica dev team, you’ll also be working with a truly international group of amazing, fun, and bright scientists collaborating between our offices in London, England, the West End of Edinburgh and in the Mile End district of Montréal. We provide an excellent health and dental benefits package, an employer matched pension plan, sick and compassionate leave, as well as 27 days of paid holidays per year.<p>Ecometrica est une entreprise fantastique qui saura apprécier votre contribution au succès de ses produits. En vous joignant à notre bureau du Mile End, vous aurez la chance de collaborer avec une équipe accueillante, allumée et passionnée d’analystes en durabilité et de programmeurs, répartie entre Montréal à Londres et Édimbourg, et aurez accès à des avantages sociaux alléchants, dont un régime de retraite avec contributions de l’employeur, une assurance santé, des journées-maladie et 27 jours de vacances par année.<p>jobs@ecometrica.com or contact myself directly damon.rand@ecometrica.com | Development Manager","time":1519932662,"type":"comment"}