{"by":"kethinov","id":16493409,"parent":16492994,"text":"CACI International Inc. - Rome, NY<p>CACI&#x27;s Rome, NY office supports the Air Force Research Laboratory. We develop data visualization software and productivity tools supporting the United States military using a wide range of tech stacks. Basically we write cool software that ranges from bringing old pen and paper military processes into the 21st century to visualizing large data sets in ways that push the limits of modern computer hardware.<p>CACI employs a diverse range of talent to create an environment that fuels innovation and fosters continuous improvement and success. At CACI you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian clients. A member of the Fortune 1000 Largest Companies and the Russell 2000 Index, CACI provides dynamic careers for approximately 20,000 employees working in over 120 offices worldwide.<p>We&#x27;re looking for software engineers ranging from entry level to senior developers as well as current students looking for college jobs skilled in one or more of the following:<p>- JavaScript (full stack: client-side and Node.js)<p>- WebGL or OpenGL<p>- Java<p>- C++<p>- *nix skills<p>Must be a U.S. Citizen. Security clearance requirements per project&#x2F;team varies. Clearance must be obtained and maintained.<p><pre><code>     === Openings ===\n</code></pre>\n- Internships and college semester software development co-ops (INTERNS)<p>- Entry-level and mid-level full-time software developers (ONSITE)<p>- Senior software engineers (REMOTE welcome)<p>If this sounds interesting to you, apply at <a href=\"http:&#x2F;&#x2F;careers.caci.com&#x2F;ListJobs&#x2F;All&#x2F;Search&#x2F;location&#x2F;rome&#x2F;state&#x2F;ny&#x2F;country&#x2F;us\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.caci.com&#x2F;ListJobs&#x2F;All&#x2F;Search&#x2F;location&#x2F;rome&#x2F;st...</a> or ping me directly if you have questions at enewport@caci.com.<p>CACI also has lots of job openings in other locations too. If that sounds more appealing, I will be sad but my employer will be happy. You can find those openings (as well as our Rome, NY office openings) at <a href=\"http:&#x2F;&#x2F;careers.caci.com\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.caci.com</a>","time":1519921986,"type":"comment"}