{"by":"Formlabs","id":16496183,"parent":16492994,"text":"Formlabs | Somerville, MA | ONSITE | Full-Time | Software and Mechanical Engineers<p>Join Formlabs if you want to bring groundbreaking professional 3D printers to the desktop of every designer, engineer, researcher, and artist in the world. Formlabs also offers lunch 3 days a week, unlimited, flexible vacation time, and a comprehensive healthcare package.<p>LINUX ENGINEER: <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;35lg101\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;35lg101</a>\nCollaborate with a stellar multi-disciplinary engineering team to design and debug the embedded code that allows our 3D printers to work<p>UI ENGINEER: <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;frajd41\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;frajd41</a>\nDesign and code a consumer level UI experience that guides our users of all backgrounds seamlessly through our software<p>SOFTWARE ENGINEER: <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;ie7ubf1\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;ie7ubf1</a>\nWith a variety of products in the works you could have the opportunity to work on anything from creating factory calibration software to developing one of the most powerful and intuitive desktop print applications on the market: PreForm<p>FACTORY SOFTWARE ENGINEER: <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;ialojn1\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;ialojn1</a>\nPlay an integral role in bringing our printers into the hands of designers, engineers, and artists all over the work by developing the software that takes products from design to mass manufacturability<p>DEVOPS ENGINEER: <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;s3nhy71\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;s3nhy71</a>\nDevelop a fast and reliable build process to bring our Preform software to thousands of users, and manage internal and external beta testing<p>MECHANICAL ENGINEER: <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;5wxrgsve1\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;5wxrgsve1</a>\nWork on a variety of mechanical challenges including precise and low-cost machine design, tightly integrated optical and electrical systems, and dealing with unforeseen complications from thermal and material interaction.<p>R&amp;D ENGINEERING TECHNICIAN:<a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;foog32oj1\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;foog32oj1</a>\nDesign and run experiments on prototype and next generation printers. As well as, help debug mechanical issues on prototype hardware or instrumentation, fix them, or propose a solution.","time":1519937405,"type":"comment"}