{"by":"suhaasprasad","id":16494349,"parent":16492994,"text":"AspireIQ | Multiple Engineering Roles | ONSITE | Full Time | San Francisco, CA | $125k - $175k + generous equity + benefits<p>AspireIQ (<a href=\"http:&#x2F;&#x2F;aspireiq.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;aspireiq.com&#x2F;</a>) is a profitable, Series A funded enterprise SaaS platform that helps brands and marketers achieve one of the holy grails of marketing — personalizing branded content, which is the idea of showing every single person a different piece of content that resonates best with them by telling them the story they would care about most.<p>Our platform solves this with a novel, data-driven approach by making the process of collaborating with photographers, videographers, influencers and other content creators more seamless and scalable than ever before while also providing the infrastructure to constantly learn and target the right content for the right person through the right channel.<p>This is a unique opportunity to join as one of the first engineers at a fast growing and well funded startup with about 30 employees, where you can have the stability of a revenue generating company while also having the chance to have a big impact on a small core development team!<p>We’re looking for a variety of engineers that want to build a great product and aren’t afraid of learning new technologies. Our current tech stack includes Python, Google App Engine, Django, Postgres, and AngularJS (expected to migrate to React or latest version of Angular).<p>We’re looking to add 2-3 engineers to the team in the next few months, and plan to grow the development team’s head count to 6-8 by the end of the year. Check out some of our job postings here:<p>* Senior Full Stack Engineer: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;aspireiq&#x2F;748bd65f-f6ee-467b-aaa5-c7e306dcbafe\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;aspireiq&#x2F;748bd65f-f6ee-467b-aaa5-c7e30...</a><p>* Senior Backend Engineer: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;aspireiq&#x2F;c7b78555-be4c-4b24-b845-56532fd2ad4b\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;aspireiq&#x2F;c7b78555-be4c-4b24-b845-56532...</a><p>* Senior Frontend Engineer: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;aspireiq&#x2F;e0becd5d-87e8-44ee-b826-257e54e91769\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;aspireiq&#x2F;e0becd5d-87e8-44ee-b826-257e5...</a><p>* Full Stack Engineer:\n <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;aspireiq&#x2F;8fdb50f7-3b81-4263-b654-eac2977cd85a\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;aspireiq&#x2F;8fdb50f7-3b81-4263-b654-eac29...</a><p>Feel free to also send me an email with any questions! My name is Suhaas and you can reach me at sprasad@aspireiq.com","time":1519926840,"type":"comment"}