{"by":"indirectlylit","id":16493509,"parent":16492994,"text":"Learning Equality | Full-stack web developers | San Diego | <a href=\"https:&#x2F;&#x2F;learningequality.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;</a> | ONSITE | Full-time<p># Who we are<p>We&#x27;re a not-for-profit team that builds open-source educational software for communities with limited or no access to the Internet. We believe in the transformative power of learning, and are passionate about social justice and breaking down barriers that prevent people from reaching their full potential.<p>We started 5 years ago with KA Lite (<a href=\"https:&#x2F;&#x2F;learningequality.org&#x2F;ka-lite&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;ka-lite&#x2F;</a>), an offline-installable platform bundling Khan Academy content and our own student tracking tools, which is being used in nearly 200 countries and territories.<p>We&#x27;re now in the process of releasing our second-generation platform, Kolibri (<a href=\"https:&#x2F;&#x2F;learningequality.org&#x2F;kolibri&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;kolibri&#x2F;</a>), which empowers users to create, curate, share, and learn from diverse forms of openly licensed content, both online and offline. We&#x27;re building tools for authoring videos and exercises, an app ecosystem for embedding and distributing HTML5 educational bundles, features for discovering and communicating with other devices peer-to-peer over a local network, interfaces and web-based visualizations for exploring student data, and systems for motivating, engaging, and guiding learners. On the backend, we use Python&#x2F;Django, and on the frontend we use Vue.js and (in one project) Backbone.js.<p>We recently received significant funding from Google.org to support our work (<a href=\"https:&#x2F;&#x2F;www.google.org&#x2F;our-work&#x2F;education&#x2F;learning-equality&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.google.org&#x2F;our-work&#x2F;education&#x2F;learning-equality&#x2F;</a>), and our team has doubled from 10 to 20 full-time staff in the past year. We&#x27;re now building out further to support new initiatives, including a project for refugee education with UNHCR, and to continue to build towards our longer-term vision. It&#x27;s an exciting period of growth, both for our team and for our impact, and there are lots of ways you could make a difference!<p># Who you are<p>You care deeply about making the world a better place, believe in the power of learning, strive to promote equality, and resonate with our statement of core values (<a href=\"https:&#x2F;&#x2F;learningequality.org&#x2F;about&#x2F;values&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;about&#x2F;values&#x2F;</a>). You love to build things, and like to think carefully about how best to serve the needs of a diverse set of users.<p># Read more and apply<p>Application: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;4t6yqj1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;4t6yqj1</a><p>If you have questions, free to email me: &#x27;devon&#x27; at our domain name.","time":1519922502,"type":"comment"}