{"by":"coffeeking","id":16493270,"parent":16492994,"text":"Raising the Floor | Developer | REMOTE | Earth | full-time (12 months)<p>We&#x27;re looking for a developer good with node.js, .NET, Windows (client) and Linux (server) to work on our Installation on Demand project.<p>WHO WE ARE<p>Anytime, Anywhere, Any Computer Access. At Raising the Floor, we’re an international coalition of individuals and organizations dedicated to ensuring that the Internet, and everything available through it, is accessible to people with accessibility barriers due to disability, literacy, digital literacy, or aging, and regardless of their economic resources. Our vision is to revolutionize the landscape of assistive technology by creating an infrastructure to facilitate the development, distribution, and support of a wide range of affordable accessibility solutions around the world. That is, the Global Public Inclusive Infrastructure (GPII) - <a href=\"https:&#x2F;&#x2F;gpii.net&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;gpii.net&#x2F;</a><p>THE POSITION<p>You will help a team of bright and talented developers located across continents who are passionate about our vision, that of radically improving the access to technology. How? By helping to develop associated system that can cause ICT to instantly change into a form that each individual can understand and use. We are looking for a talented software engineer to lead and develop one of the associated systems of GPII called Installation on Demand (IoD). This system will allow GPII to install and use Assistive Technology (AT) software on demand, whenever required by a user.<p>WHAT YOU WILL DO<p>- Become a member of a small development team building applications and tools around GPII.<p>- Develop an Installation on Demand (IoD) system that stores and provisions Assistive Technology and other software on Windows computers.<p>- Integrate IoD with mainstream open source software distribution systems (Nuget, Chocolatey, etc.), developing a Windows service and Linux server&#x2F;repository.<p>- Work in and contribute to an open source project (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;GPII\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;GPII</a>).<p>- Be involved in all of the phases of the IoD project, from project inception to release phase.<p>WHAT WE ARE LOOKING FOR<p>- Experience in most of these areas: .NET, Windows, node.js, Linux, software installation&#x2F;packaging.<p>- Experience in systems programming.<p>- Experience with software distributions and&#x2F;or complex software deployment systems.<p>- Experience working successfully with a remote distributed team.<p>- Able to work independently to complete tasks on schedule without close supervision.<p>- Highly motivated, self-directed, and able to thrive in ambiguity.<p>This is a 12-month Contract Position.<p>Interested? Send your resume&#x2F;cv, with a little intro, to jobs at raisingthefloor.org","time":1519921392,"type":"comment"}