{"by":"skipwalker","id":16493691,"parent":16492994,"text":"Voyant Inc. | System Administrator&#x2F;Engineer&#x2F;DevOps | Austin, TX | ONSITE, FULL-TIME | <a href=\"http:&#x2F;&#x2F;www.planwithvoyant.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.planwithvoyant.com</a><p>System Administrator&#x2F;Engineer&#x2F;DevOps<p>Voyant is seeking a talented System Admin&#x2F;DevOps Engineer to help lead the evolution of our development and deployment systems.  The successful candidate will have expertise with Linux, and experience building, configuring, and maintaining production deployments, ideally using Amazon Web Services (AWS) EC2<p>Responsibilities\n* Leverage Amazon AWS services to design new and improve existing Voyant EC2 deployments.\n* Develop expertise in our current deployment solution, and continually design enhancements.  Technologies used include: EC2, RDS, VPC, CloudFormation, Route53, Jenkins, OpenVPN, Tomcat, Apache, Java.  \n* Develop tools (e.g. dashboards) to continuously improve DevOps processes around our AWS environments (We have at least 5 separate production environments).\n* Setup, configure, and maintain internal Linux and Windows virtualization environments.\n* Develop and implement disaster recovery planning for production environments.<p>Experience and Skills:\n* 5+ years experience as a system or devops engineer\n* Cloud computing administration - Amazon AWS preferred\n* AWS DevOps Engineering Certification (If not, we will encourage and sponsor your certification on the job)\n* Configuration management experience (Ansible, Chef, Puppet)\n* Automation scripting language experience\n* Experience or familiarity with Java application servers and servlet containers is a plus<p>What we offer:\n* Opportunity to gain AWS experience and AWS certifications\n* Small but profitable and stable company ... we are growing but not yet a big dumb company\n* Highly competitive salary with stock options\n* Full family medical and dental insurance<p>Location: Austin, TX (Relocation and visa sponsorship is not currently available.)<p>contact us at jobs@planwithvoyant.com","time":1519923422,"type":"comment"}