{"by":"bruth","id":16493630,"parent":16492994,"text":"The Children&#x27;s Hospital of Philadelphia | Arcus Data Platform Engineer | Philadelphia PA | ONSITE\nPlease visit: <a href=\"https:&#x2F;&#x2F;careers.chop.edu&#x2F;job&#x2F;Philadelphia-Arcus-AnalystProgrammer-III-PA-19146&#x2F;446166400&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.chop.edu&#x2F;job&#x2F;Philadelphia-Arcus-AnalystProgr...</a><p>The Children’s Hospital of Philadelphia (CHOP) Research Institute is recruiting a new team to build a data and informatics program called “Arcus” that will link clinical and biological data and provide world-class computational tools to solve the most challenging problems in child health. Recognizing the central role of data to the future of pediatric research, CHOP leadership and the Board of Trustees committed to a funding plan, and Arcus was launched in July 2017. The Arcus team integrates with major scientific initiatives in the Research Institute Strategic Plan: Lifespan, Rare Diseases, Novel Devices and Therapeutics, and Precision Health. We seek mission-oriented professionals with interest and expertise in the areas of biomedical science, library science, data education, data science, cloud computing, data privacy, and security.<p>This role will work on a small team focused on architecting and implementing a cloud-native “data platform” to support the goals of Arcus. We are looking for highly creative people who share our mission to advance child health and who will thrive in a continuous learning environment, acquiring and applying both new technical skills and biomedical domain knowledge.<p>More info about CHOP and our work: <a href=\"http:&#x2F;&#x2F;www.chop.edu&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.chop.edu&#x2F;</a> | <a href=\"https:&#x2F;&#x2F;dbhi.chop.edu&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;dbhi.chop.edu&#x2F;</a> | <a href=\"https:&#x2F;&#x2F;github.com&#x2F;chop-dbhi\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;chop-dbhi</a><p><i></i>Edited: fixed link<i></i>","time":1519923146,"type":"comment"}