{"by":"mattboyle","id":16499774,"parent":16492994,"text":"Crowdcube | Full Stack Engineer | Full-time | London&#x2F;Cardiff<p>We are hiring a Full-Stack Engineer with experience of modern javascript frameworks and an interest in API design to join our highly skilled engineering team. We’re enabling great businesses to succeed through equity crowdfunding. Come join us on the world&#x27;s leading equity crowdfunding mission!<p>Who we are :\nCrowdcube is the world&#x27;s leading equity crowdfunding platform. We enable everyday investors to invest alongside Europe’s venture capitalists and professional investors in start-up, early stage and growth businesses; in doing so we&#x27;re enabling entrepreneurs to raise funds for their businesses.<p>Tech Stack:<p>You will be working with our existing platform which is primarily PHP&#x2F;Nginx&#x2F;MySQL and we run Ruby, Python and Golang for solving specific problems. Client side, we use JavaScript and have been working with React. As we plan for the future of the platform, we&#x27;re interested in Node and Typescript. We&#x27;re advocates of using the right tools for the right job!<p>What we are looking for:<p>A solid understanding of javascript and another language like PHP, proficiency in react (or any equivalent modern framework), being up to date with new features and comfortable right across the stack. A keen eye for testing, performance and tidy APIs would be great and experience of working with a pattern library. For the rest, we believe it’s more important to be able to adapt and learn than to be an expert in any specific technologies.<p>Some of the things it would be nice to see:<p>React + Redux\nReact server rendering experience\nReact components testing\nOpen source experience\nGulp&#x2F;webpack&#x2F;grunt&#x2F;babel or other FE build tools<p>application link: <a href=\"https:&#x2F;&#x2F;crowdcube-ltd.workable.com&#x2F;j&#x2F;7A125082F1\" rel=\"nofollow\">https:&#x2F;&#x2F;crowdcube-ltd.workable.com&#x2F;j&#x2F;7A125082F1</a><p>If you want to have a more informal chat about the role, please feel free to e-mail me: matthew.boyle@crowdcube.com","time":1519975787,"type":"comment"}