{"by":"fa-ml","id":16494235,"parent":16492994,"text":"FlightAware | Machine Learning Engineer | Houston, TX | Full-time, ONSITE, <a href=\"https:&#x2F;&#x2F;flightaware.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;flightaware.com&#x2F;</a><p>This is an opportunity to have a potentially huge impact on machine learning not just at FlightAware but on the aviation industry in general. There are a lot of fascinating and challenging problems in this area: computing taxi times, landing times, departure times, airport congestion, flight delays, and more based on complex real-time contextual information. I honestly believe these are among the most interesting problems you&#x27;ll find to work on almost anywhere.<p>FlightAware has a vast amount of highly granular flight data going back many years to facilitate tackling these problems. For instance, we have detailed surface movement data for all aircraft on the ground at most major worldwide airports. We have detailed weather records and radar imagery. We have thousands of live ADS-B receivers around the world. And we&#x27;ve partnered with Aireon to deploy ADS-B receivers in space on dozens of satellites in orbit; this will allow us to achieve global tracking coverage, even over the oceans and other large bodies of water.<p>FlightAware wants to be on the forefront of tackling these problems using modern, sophisticated methods. We view this as a long-term strategic initiative for the company.<p>You&#x27;d be the first full-time machine learning engineer, so we&#x27;re looking for someone fairly senior and experienced. You won&#x27;t be a cog in the machine. This is not just a research position and will involve building end-to-end production systems, from training pipelines to real-time inference engines, so we&#x27;re ideally looking for someone with a demonstrated track record of doing so. With that said, we&#x27;re willing to consider less experienced candidates with exceptional backgrounds.<p>FA is a small company (currently 70-80 employees), but we&#x27;re not a startup. We&#x27;ve been around for over a decade and don&#x27;t rely on VC funding. The company is successful, profitable, and growing. And we just built out a brand new modern office space in Houston.<p><a href=\"https:&#x2F;&#x2F;flightaware.com&#x2F;about&#x2F;careers&#x2F;position&#x2F;ml_engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;flightaware.com&#x2F;about&#x2F;careers&#x2F;position&#x2F;ml_engineer</a><p>If interested, please email me through the address in my HN profile. Alternatively, please apply through the link above.","time":1519926187,"type":"comment"}