{"by":"think-cell","id":16500325,"parent":16492994,"text":"think-cell Software GmbH | C++ developer  | ONSITE  | Berlin, Germany  | <a href=\"https:&#x2F;&#x2F;www.think-cell.com&#x2F;career&#x2F;dev\" rel=\"nofollow\">https:&#x2F;&#x2F;www.think-cell.com&#x2F;career&#x2F;dev</a>\nJoin us as a C++ developer\nLocation: Berlin, Germany\nDo you believe in beauty when it comes to programming? Do you have a vivid interest in elegant algorithms? Are you fluent in C++? If so, we would like to meet you. Here is what we offer in a nutshell:<p>A wide array of extremely challenging C++ development tasks\nAn international team of brilliant minds\nA working environment that makes this team stay and grow\nEnough time to make sure that every detail of your solution is perfect\nA flat organization and plenty of room for your ideas\nNo scheduled meetings\nFamily-friendly working hours, no deadlines, no overtime\nSupport for relocation\nA competitive salary from the start and a raise to EUR 120,000 annually after only one year<p>About us\n Thank you, think-cell, for sponsoring the Standard C++ Foundation and challenging our Microsoft compiler team with complex C++ code.<p>Herb Sutter, President of the Standard C++ Foundation\nthink-cell is a fast-paced software company in Berlin, Germany, with a focus on developing graphics products that stand out from the crowd. More than 600,000 users world-wide rely on our software for their daily business as it makes creating graphical presentations so much easier, faster and more enjoyable. Among our customers are many renowned consulting companies and large international corporations.<p>We do not have to make compromises with regard to code quality and beauty, because think-cell is profitable and has no outside investors. We are willing to go the extra mile of developing sophisticated algorithms and refining our user interface, and we are proud of our many happy customers. The fact that the company is owned and managed by seasoned computer scientists certainly contributes to a working environment that makes exceptional developers come and stay.<p>Does that sound good to you?\nIf you are the one missing from our team then please send us your electronic application at hr@think-cell.com","time":1519985219,"type":"comment"}