{"by":"mparrott","id":16528830,"parent":16492994,"text":"Man AHL | Quant Platform Developer| London, UK | Onsite | Full Time<p>As a Quant Platform Developer at AHL you will be building the tools, frameworks, libraries and applications which power our Quantitative Research and Systematic Trading. This includes responsibility for the continued success of “Raptor”, our in-house Quant Platform, next generation Data Engineering, and evolution of our production Trading System as we continually expand the markets and types of assets we trade, and the styles in which we trade them. Your challenges will be varied and might involve building new high performance data acquisition and processing pipelines, cluster-computing solutions, numerical algorithms, position management systems, visualisation and reporting tools, operational user interfaces, continuous build systems and other developer productivity tools.<p>Our systems are almost all running on Linux and most of our code is in Python, with the full scientific stack: numpy, scipy, pandas, scikit-learn to name a few of the libraries we use extensively. We implement the systems that require the highest data throughput in Java. For storage, we rely heavily on MongoDB and Oracle.<p>We use Airflow for workflow management, Kafka for data pipelines, Bitbucket for source control, Jenkins for continuous integration, Grafana + Prometheus for metrics collection, ELK for log shipping and monitoring, Docker for containerisation, OpenStack for our private cloud, Ansible for architecture automation, and HipChat for internal communication. But our technology list is never static: we constantly evaluate new tools and libraries.<p>AHL has a small company, no-attitude feel. It is flat structured, open, transparent and collaborative, and you will have plenty of opportunity to grow and have enormous impact on what we do. We are actively engaged with the broader technology community.<p>o We host and sponsor London’s PyData and Machine Learning Meetups\no We open-source some of our technology. See <a href=\"https:&#x2F;&#x2F;github.com&#x2F;manahl\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;manahl</a>\no We regularly talk at leading industry conferences, and tweet about relevant technology and how we’re using it. See @manahltech<p>Essential Skills<p>o Exceptional technology skills; recognised by your peers as an expert in your domain\no A proponent of strong collaborative software engineering techniques and methods: agile development, continuous integration, code review, unit testing, refactoring and related approaches\no Expert knowledge in one or more programming languages, preferably Python, Java and&#x2F;or C&#x2F;C++\no Proficient on Linux platforms with knowledge of various scripting languages o Strong knowledge of one or more relevant database technologies e.g. Oracle, MongoDB\no Proficient with a range of open source frameworks and development tools e.g. NumPy&#x2F;SciPy&#x2F;Pandas, Pyramid, AngularJS, React\no Familiarity with a variety of programming styles (e.g. OO, functional) and in-depth knowledge of design patterns.<p>If you&#x27;re interested, please get in touch with Milly Parrott mparrott@ahl.com","time":1520344412,"type":"comment"}