{"by":"darrenhardy","id":16523797,"parent":16492994,"text":"SUPERSTAR DIRECTOR OF MARKETING remote\nDarren Hardy (www.DarrenHardy.com), mentor to top CEOs and business leaders, NY Times bestselling author, keynote speaker and former publisher of SUCCESS magazine, and his amazingly talented A-Team are looking to hire a Superstar Director of Marketing!\nWhat you will do:<p>You will be a leader and guiding force to our small yet mighty marketing team that includes a designer, marketing automation manager, content marketing manager, digital advertising manager, marketing project manager, a social media coordinator, and a expanding team of sub-contractors.\nYou will lead, manage, and continually train up the leaders of the various marketing channels to create a cohesive and powerful marketing machine.\nYou will collaborate with leadership to develop and constantly improve the marketing strategy needed to achieve our Big Hairy and Audacious Goals.\nYou will oversee the growth, nurturing, and program enrollment of our database of 500K+ high-achievers.\nYou will own and be tasked with continually improving on a ‘WOW!’ customer journey from initial point of opt-in, to purchase to brand advocate (repeat and referral purchases).  \nYou will serve as the final strategic and brand consistency oversight over all new marketing projects and promotions to ensure EXCELLENCE in all we do.\nYou will create the process bridge between the marketing team and the client experience team to ensure the client journey is excellent from start to finish.\nYou will research, identify, and suggest new marketing technologies and resources to aid our mission to scale our IMPACT.\nMore info: <a href=\"https:&#x2F;&#x2F;darrenhardy.com&#x2F;marketing-director&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;darrenhardy.com&#x2F;marketing-director&#x2F;</a>\nApply here: <a href=\"https:&#x2F;&#x2F;www.surveymonkey.com&#x2F;r&#x2F;B9NQ3VQ\" rel=\"nofollow\">https:&#x2F;&#x2F;www.surveymonkey.com&#x2F;r&#x2F;B9NQ3VQ</a>","time":1520279387,"type":"comment"}