{"by":"grabhiring","id":16527634,"parent":16492994,"text":"Grab | Product Analytics Manager Data-Analytics | Singapore, Indonesia<p>Grab is more than just the leading ride-hailing and mobile payments platform in Southeast Asia. We use data and technology to improve everything from transportation to payments across a region of more than 620 million people. Working with governments, drivers, passengers, and the community, we aim to unlock the true potential of the region by solving problems that hinder progress.<p>Get to know our Team: - Product Analytics cares about deeply understanding how users experience the Product\n- We enable Engineering, Product Management &amp; Design to focus on the right outcomes and feature set\n- We remain integral to the product process from hypothesis development, right through to post rollout optimization<p>The day-to-day activities: - Design, measure and recommend A&#x2F;B tests and multivariate experiments on the platform, including, but not limited to layout optimization, page level testing, UI&#x2F;UX efficacy, contextualization, algorithm effectiveness, API effectiveness, etc.,\n- Mine large amounts of clickstream and transactional data to develop a deep understanding of Grab users, both passengers and driver partners\n- Own and manage all instrumentation for clickstream events on the Product, across all Grab platforms\n- Own the prerogative for insight generation and support rapid prototyping within the Product function. This includes working closely with Product Managers to see through analytics projects &#x2F;product interventions from start to finish\n- Build and maintain self-serve solutions for stakeholder groups that are scalable and automated to handle a dynamic product environment<p>The must haves: - 4+ years of experience in Analytics, Business Intelligence or a Data Science role (we look at promising fresh graduates as well!) Prior experience with Product management will be a definite plus - Advanced SQL writing skills and experience in querying large relational databases\n- Hands on experience with data analysis &#x2F; scripting &#x2F; programming tools like R or Python and Data Visualization platforms like Tableau &#x2F; Qlikview &#x2F; D3.js, etc.,\n- Experience with designing, running and analyzing A&#x2F;B tests and product experiments. Should also have an understanding of hypothesis testing and the basic principles of DoE\n- Ability to distill data and articulate an actionable point of view to non-technical audiences and senior stakeholders using presentations, interactive visualizations, et al.\n- Ability to handle multiple priorities and solve ambiguous problems in a fast paced environment","time":1520324698,"type":"comment"}