{"by":"transmit101","id":5150933,"parent":5150834,"text":"London: C++, Dev ops/Sysadmin, Android, Ruby on Rails<p><a href=\"http://mixlr.com\" rel=\"nofollow\">http://mixlr.com</a><p>Our hiring post: <a href=\"http://devblog.mixlr.com/2013/02/01/were-hiring/\" rel=\"nofollow\">http://devblog.mixlr.com/2013/02/01/were-hiring/</a><p>Mixlr is a platform for live audio with nearing 1 million registered users. We've built a series of products based around an extensive live broadcasting infrastructure, all fully maintained and managed in house.<p>We have a strong sense of product and design, and an interesting and scalable technical architecture.<p>We've got to where we are as a team of four. Now we're looking to expand and would like to talk to smart and passionate engineers who want to join us.<p>--- C++ engineer (full-time, London)<p>Our cross-platform desktop app is written is C++, and is a core part of our service.<p>We're looking to find somebody who is comfortable with deploying (beautfully written, maintainable) C++ applications to multiple platforms, and has at least a working knowledge of audio or video callbacks and streaming techniques.<p>We make heavy use of the QT framework, so some familiarity here would be useful, and the standard Unix toolchain features heavily in our workflow (we currently build using MinGW for Windows).<p>At Mixlr, we debug multithreading problems before breakfast. And because our app is currently a web/native hybrid, being comfortable working with networking and a good knowledge of web development techniques would be an advantage.<p>--- Dev-ops/Sysadmin (full-time, London).<p>At Mixlr our product requires an extensive and occasionally challenging backend infrastructure.<p>We are looking to find an experienced backend engineer with deep knowledge of managing both virtualized and physical environments. A strong knowledge of Amazon Web Services is a must, as that's where our entire stack is deployed right now.<p>We use Puppet to manage and deploy our servers, Ruby for scripting and run a 100% Linux environment making strong use of the Unix tool chain.<p>Experience of deploying and monitoring Ruby on Rails applications: we currently extend Nginx with a Lua caching layer, to enable us to use full page-caching for the majority of our website traffic. Being comfortable debugging, maintaining and improving this layer will be essential. Knowledge of MongoDB, Redis and deploying various applications on the Java virtual machine would also be directly relevant.<p>As with all of our roles, a passion for music and/or audio is a plus!<p>--- Android developer (full-time, London)<p>We've already designed and released a successful and well-received mobile application for iOS, and now we are planning to bring the full Mixlr experience to Android devices.<p>We are looking for an experienced Android developer to join the team on a permanent basis, and design and build Mixlr's Android app - from the first Git commit onwards.<p>We're looking for somebody to hit the ground running, so were you to apply you should have prior experience in building a non-trivial Android app. You should be confident with advanced Java programming techniques including advanced multithreading techniques.<p>As with all of our positions, you'll be interacting extensively with our various web services and the wider internet, so being comfortable in the world of networking would be an advantage.<p>--- Rails developer (full-time, London)<p>Our website is still the core way in which our users interact with Mixlr, and we have big plans for it going forward.<p>The ideal candidate would have extensive Ruby on Rails experience and be comfortable working with an extensive Rspec test suite. We make heavy use of the jQuery and Backbone JavaScript frameworks, write our CSS using SCSS, and rely on MongoDB and Redis to store and cache our data.<p>We would like to meet a smart, passionate Rails developer who is eager to extend their skill set, working on a fast-growing product with thousands of daily users.<p>If you want to talk more to us, drop me a line: rob@mixlr.com","time":1359730014,"type":"comment"}