{"by":"lloyddobbler","id":5152346,"parent":5150834,"text":"FullContact - Denver, CO<p>Looking for a Senior AWS System Admin/DevOps Engineer and an Integration Product Manager.<p>-----------<p>About Us:<p>We’re solving the world’s contact information problem. As we like to say: “If you’ve got an address book, you’ve got an address book problem.” Most people have duplicate, partial, and out-of-date contacts - and they’re scattered everywhere. It’s a mess. Businesses have the same problem, but it’s actually worse when you consider that a company has a bunch of employees, CRMs, Marketing Automation systems, Billing platforms, Help Desk applications.<p>As Dropbox did for files and Evernote did for notes - FullContact is doing the same for contacts. And we’re providing it to Individuals, Businesses and Developers.<p>We were a TechStars Boulder 2011 company. We’re lean, mean and funded by Foundry Group, Tango Group and awesome investors like Brad Feld, David Cohen, Dave McClure, Howard Lindzon and Eric Norlin.<p>-----------<p>Some of the Perks:<p>- Competitive salary based on experience<p>- Generous stock options<p>- 100% paid Medical, Dental and Vision for you as well as Spouse or Family coverage for less than $125 per month.<p>- 10 paid holidays<p>- 15 days paid personal leave<p>- Paid, PAID vacation: in addition to paid personal leave, once a year we’ll actually PAY you $7500 to take an awesome vacation! (Yes, you read that right. More info: <a href=\"http://ful.lc/11p4NOa\" rel=\"nofollow\">http://ful.lc/11p4NOa</a>)<p>- Free Eco Pass<p>- Free Downtown Denver Parking<p>- Opportunity to attend industry events and conferences<p>- Stocked Fridge, Coffee, and Snacks<p>- Lots and lots of free Beer<p>-----------<p>If you're local to Denver and interested in tackling big problems in the contact management space, we want to talk to you. Get more info and apply here: <a href=\"http://ful.lc/YoVtoE\" rel=\"nofollow\">http://ful.lc/YoVtoE</a>.","time":1359742594,"type":"comment"}