{"by":"BrandonM","id":5153601,"parent":5150834,"text":"EasyESI (<a href=\"http://easyesi.com\" rel=\"nofollow\">http://easyesi.com</a>) - Berkeley, CA (SFBA) - full-time, US residents only<p>EasyESI is 7-person, tech-led startup that helps lawyers sift through mountains of evidence in a case to find the smoking gun. This is a good business to be in: the amount of data is only increasing, lawyers are willing to pay for better solutions, and we're good at applying cutting-edge CS to traditionally hard problems. As a result, we're cash-flow positive less than two years after our founding, and growing rapidly.<p>We have many challenging problems, including machine learning, visualization, search, and nifty user interfaces. We're looking for generalists; we'll teach you (or you'll teach yourself) what you need to know.<p>We're a fun company, with an awesome location in downtown Berkeley, foosball, game nights, and more. We'll offer you a great salary, equity, health care, retirement with company matching, and a generous vacation schedule.<p>We are looking to fill 3 positions:<p>Front-End/UI Engineer - Must have a good attention to detail and be able to use and contribute to a large, modular Javascript codebase (built on dojo). Good understanding of HTML/CSS/Javascript is a must, and a good eye for design is a nice bonus. We support only modern browsers (no IE6 headaches), so we have a very rich HTML/Javascript interface that relies on AJAX queries to pull down data and perform much of the work.<p>Software Engineer - We all wear many hats, contributing to a backend Java codebase that uses minimal XML. We use a lot of modern open source technologies: Lucene, Cassandra, AWS, etc. We have a separate Python codebase for performing offline work. We strive to write all of our code in a modular, reusable style that maximizes code-sharing and minimizes repetition. We schedule weekly time for refactoring so that we avoid the accumulation of technical debt. If you're sharp and you're interested in learning how to write performant code that uses modern academic research and operates on the latest infrastructure, you'll like this role.<p>Systems Engineer - We deal with many terabytes of data. We have our own 48-drive-bay fileserver to handle our expanding storage needs over the next couple years. We need someone with Unix experience who is comfortable in Python to help us work more efficiently. You'll manage our AWS installations, manage our internal systems, and help make our entire setup more robust. We're happy to hire someone with solid fundamentals who wants to learn on the job.<p>We consider all applicants; please apply for the position(s) you're interested in at <a href=\"http://easyesi.com/jobs.shtml\" rel=\"nofollow\">http://easyesi.com/jobs.shtml</a>.","time":1359754024,"type":"comment"}