{"by":"jxtx","id":5153406,"parent":5150834,"text":"Atlanta GA and State College PA<p>The Galaxy Project, Emory University and Penn State University<p><a href=\"http://galaxyproject.org\" rel=\"nofollow\">http://galaxyproject.org</a><p>Contact: jobs@galaxyproject.org<p>Working for the Galaxy team provides a rare opportunity to perform research and to develop software at the leading edge of life sciences, genomics, data intensive computing, and big data analytics.<p>We develop Galaxy, a platform that enables researchers to store, analyze, visualize and share genomic data; and provides genomic tool developers with the ability to deploy their tools within a complete analysis framework. Thousands of researchers worldwide use Galaxy on a daily basis. Galaxy is an open source project committed to the openness of scientific enterprise and is free for all.<p>Positions are available both at Emory University, Atlanta GA (in the lab of PI James Taylor) and Penn State University, State College, PA (in the lab of PI Anton Nekrutenko).<p><i>Software Engineers</i><p>We have a wide variety of active projects, current areas of expertise sought include:<p>- Web-based visualization and visual analytics. We are building novel interactive visualizations of next-generation sequence data that leverage cutting edge web technologies.<p>- Informatics and data analysis and integration.  We build and use tools to analyze large datasets generated by high-throughput sequencing of DNA to understand genomes and genome function.<p>- Distributed computing and systems programming. We are engaged in the development of workflow systems, cloud computing based solutions, and other projects involving high performance and data intensive computing.<p>- Bioinformatics application areas such as re-sequencing, de novo assembly, metagenomics, transcriptome analysis and epigenetics.<p>Regardless of your areas of expertise we seek talented, self-motivated individuals to join our team. Galaxy is developed in an academic research environment, and members of the Galaxy team work closely with researchers on projects at the leading edge of data-intensive biology.<p>Galaxy is written in Python, but also makes substantial use of JavaScript, canvas, and other modern web technologies. Many of the analysis components of Galaxy are performance critical, and are implemented in C and other languages as well.<p><i>Postdoctoral Scholars</i><p>We are also recruiting postdoctoral scholars with expertise in Bioinformatics and Computational Biology. Our work on Galaxy is driven by our biological and biomedical research programs, and we are interested in hearing from potential postdocs with a wide variety of research interests:<p>- Computational and HCI research on both the development of analysis and data management tools, and the development of novel user interfaces and interactive visualizations for analyzing large-scale data.<p>- Distributed and high-performance computing for data intensive science, specifically genomics.<p>- Vertebrate functional and evolutionary genomics, particularly through the development of novel machine learning, data mining, and data integration methods incorporating genomic sequence and experimental data.<p>- Numerous areas of biology including genomic and epigenomic mechanisms of gene regulation, the role of transcription factors and chromatin structure in global gene expression, development, and differentiation.","time":1359751965,"type":"comment"}