{"by":"dawson","id":5154703,"parent":5150834,"text":"To all exceptional Ruby engineers, Objective-C developers, Javascript developers, designers and sysadmins:<p>If you are ready to join a fast growing team of passionate engineers, designers and medical professionals wanting to address the clunky, legacy and vendor lock-in IT healthcare at a global level, we want to hear from you. Our take on the ePHR is <a href=\"https://howareyou.com\" rel=\"nofollow\">https://howareyou.com</a>, you can find out more about our company vision here <a href=\"http://cambridgehealthcare.com\" rel=\"nofollow\">http://cambridgehealthcare.com</a>.<p>You will be working on a service oriented architecture, completely API driven, running on the best hybrid infrastructure - our private Heroku for healthcare if you wish. You will be learning from the best in their field while working from our new, bespoke London office with great natural light and lovely period features. The office comes with a table tennis-table including weekly table tennis sessions with a professional coach, drinks vending machine and a retro arcade machine, all courtesy of How are you?. The Office is situated right in the middle of Silicon Roundabout, 5 minutes walking distance from Old Street station. You can find pictures of our office on our Twitter account <a href=\"https://twitter.com/howareyou\" rel=\"nofollow\">https://twitter.com/howareyou</a><p>All positions are full-time and on-site only, we are willing to help the right candidates in any way we can, regardless of their location. We reward talent, experience and commitment fairly, salaries range from £40k to £90k. All candidates are encouraged to get in touch with us on jobs.hn@howareyou.com<p>How are you? is a venture funded and internationally award winning healthcare startup, based in Cambridge, London and now Beijing. Winner of the most prestigious Institute of Engineering and Technology Innovation Award for best IT Technology and HealthInvestor Award for IT innovator of the year 2012.","time":1359768628,"type":"comment"}