{"by":"rAtClimateC","id":5160100,"parent":5150834,"text":"San Francisco, Seattle: JavaScript, Rails, and Clojure / Java engineers<p>The Climate Corporation’s mission is to help all the world’s people and businesses manage and adapt to climate change.  To achieve our mission, we have built a unique technology platform to enable, for the first time, the real-time pricing and purchasing of customizable weather insurance. Managing over 200 TB of data, including 34 trillion+ weather simulation data points, 150 billion soil type observations, and more than 3 million daily weather measurements, we are one of the largest users of Amazon Web Services.<p>The Climate Corporation is focused on the enormous challenge and opportunity of protecting the $3 trillion global agriculture industry from the financial impact of adverse weather – the cause of over 90 percent of crop loss – with fully automated weather insurance products. We are also building web and mobile applications that unleash the power of our unique data and analyses to help farmers manage their daily work with field-level weather and crop insights.<p>At The Climate Corporation, leaving a mark on the world is in our DNA; we want to make a lasting and meaningful real-world impact. We relish big problems because they are the most interesting to tackle, the most rewarding, and typically, the most valuable to solve. We also thrive on finding the possible in the impossible.<p>If you are the best at what you do, you like solving interesting problems, and you are looking for like-minded people dedicated to having a major impact on the world, we are eager to talk with you.<p>See our video about what it’s like to work at The Climate Corporation: goo.gl/lNVPS<p>We're an extremely well funded series C startup (~$110 million) with huge things in the works!<p>We're primarily looking for JavaScript, Rails, and Clojure / Java engineers. If you think the above sounds interesting and feel like you might be a good fit, send me your resume.","time":1359909765,"type":"comment"}