{"by":"200902","id":4053580,"parent":4053076,"text":"Cyrus Innovation - Boston, MA<p>Senior Developer<p>Cyrus Innovation (www.cyrusinnovation.com) is a Boston and NYC-based Agile development consulting firm that was founded in 2003. Since then, we have grown into a 45 person company that has never needed outside seed money and believes quality people, practices, and code are the foundation of success. For almost a decade we have been Agile pioneers that have helped both start-ups and enterprises embrace the latest technologies (Rails, Java, Scala, node.js, Groovy, MongoDB, HTML5) and strive for continuous process improvement.<p>So what makes Cyrus different from everyone else aside from competitive compensation, generous vacation, and other great benefits?\n - We believe in strict 40 hour work weeks. No late nights or weekends. Period.\n - We only hire 1% of all applicants and are not afraid to let the bad ones go\n - We give you 40 hours a quarter and a budget to learn and make yourself a better developer\n - We have a diverse set of clients that allow for you to work on many different projects\n - We like to have fun! (Bagel Fridays, Hackfests, Game Nights, and fridge full of beer!)<p>At Cyrus, we strive to continuously enhance our day-to-day methods that keep us at the top of our game and help everyone improve on what they already do so well. Because happy developers produce the best work, we do everything we can to find, hire and keep the most talented minds in our industry. Whether we are building web applications and products, introducing new technologies and development practices, or just helping a great team get their work done, our spirit of joyful collaboration inspires everything we touch. We are serious about our commitment to our employees and invite you to join our team.<p>If you are interested in learning more or would like to apply for a position, send an email with your resume and cover letter to Marc Rosenberg at mrosenberg@cyrusinnovation.com","time":1338561648,"type":"comment"}