{"by":"decklin","id":4053165,"parent":4053076,"text":"Sonian (Newton, MA) - Full time, local or remote<p>We're a funded (recently closed Series C) email archiving startup with many large corporate customers. We are looking for an additional engineer for our operations (or \"devops\" if you prefer) team, to take us from merely using configuration management and automated deploys to delivering our internal services as dependable, multi-IaaS-portable tools that empower everyone from support engineers to Clojure backend developers to solve customer issues without paging us and use our monitoring API to automatically spin up instances to process work.<p>We have offices outside of Boston (Newton), but our dev and ops teams are mostly remote, and we meet over VOIP and pair-program in tmux.<p>Some highlights of what we do:<p><pre><code>  +   We manage hundreds of compute instances across multiple clouds, including over a petabyte of data.\n  +   We write the code to help facilitate deploying our application to new public clouds.\n  +   We automate everything we possibly can\n  +   We build up awesome applications, and then opensource them (Perhaps you've heard of our monitoring framework Sensu - https://github.com/sensu )\n  +   We build applications to manage every aspect of our compute and storage infrastructure, from deploying code, to provisioning systems on multiple clouds, to securing access control.  For every problem - there is a code solution.\n  +   We have an awesome time working together on technologies that very few (if any) other companies are doing today.\n  +   We have days where all we do is hack on a specific project (http://blog.petecheslock.com/2012/02/13/why-your-company-should-have-internal-hackdays/) - leave the day-to-day tasks for the next day.\n  +   We meet up 2-3 times a year in Boston - with the rest of the company.\n</code></pre>\nWhat are we looking for in a new member of our team?<p><pre><code>  +   Excitement, energy and a willingness to learn something new.\n  +   The ability to take a task from idea to code to testing to deploy (all within a short amount of time).\n  +   Bring new ideas around project or processes to the team - if we like it - we'll do it.\n  +   You can work from home, from our Newton, MA headquarters, or your local coffee shop.  Anywhere with Internet access.\n  +   You'll be part of an on-call rotation with the rest of our team.\n  +   Flexible person who can work by themselves or pair with their team to teach or learn.\n</code></pre>\nWhat are some things you should know or have worked with before? (Some, many or all)<p><pre><code>  +   Ruby (must know or want to learn)\n  +   Not required, but pluses: Python (used by some parts of our infrastructure), Clojure (used by our backend team)\n  +   Chef (or other configuration management systems), Fog\n  +   Rails, Sinatra (both also used by our front-end team)\n  +   Git or other DVCS\n  +   System administration with Ubuntu (includes security, logging, monitoring, web/SQL admin, etc, etc)\n  +   Knowledge of Openstack (especially Swift) is a plus\n  +   A love for making complex configuration and systems simple via automation\n  +   Continuous Deployment, Agile Development/Kanban\n  +   Contributing to open source\n</code></pre>\nInterested? - Contact pete.cheslock@sonian.com or <a href=\"https://twitter.com/petecheslock\" rel=\"nofollow\">https://twitter.com/petecheslock</a>, and let him know you saw this post. Please include a short summary of why you think you would be a good fit, resume/blog/etc, and a link to a Github account or other code samples.","time":1338556161,"type":"comment"}