{"by":"jerryr","id":4054647,"parent":4053076,"text":"San Francisco, CA (25 Kearny St) - MindTribe Product Engineering, Inc.<p>Hi, I’m MindTribe’s CTO. I’m searching for people who enjoy learning and making embedded systems. MindTribe is a small company, and I am looking for people with whom I would personally like to work and who want to work with me and my team. We've moved from Palo Alto to SF and we're finally settled into our new location. Now, besides experienced SENIOR embedded software engineers, I am looking for JUNIOR engineers as well. If you enjoyed your microcontroller classes in school, come join us in SF for continuing education.<p>Here are the tools I use regularly: The C programming language (specifically ISO/IEC 9899:1990); Eclipse, Make, Subversion, Git, Python; Linux, Embedded Linux, Android, iOS; ARM processors (TI OMAP, TI Stellaris, NXP LPC); Atmel AVR/AVR32, Microchip PIC, TI MSP430, Cypress PSoC<p>Here is what I enjoy doing at work: Writing embedded software that runs on cool hardware; Figuring out how to apply agile techniques such as test-driven development to embedded product development; Reducing regressions and supporting customer development with agile techniques; Developing embedded libraries for things like USB, TCP/IP, graphics displays, sprites, fonts, encryption, etc.; Having long, dorky conversations with coworkers about programming languages, physics, DIY sous-vide setups, whether it should be called \"firmware\" or \"software\", etc.<p>Here is what I enjoy doing outside of work: Hiking, walking around San Francisco; Pseudonymous humor blogging; Cooking and baking; Photography; Reading. Recently: \"Test Driven Development for Embedded C\", \"The Clean Coder\", \"The Four Steps to the Epiphany\", \"Norwegian Wood\", \"The Mind's Eye\", and currently \"Sealab: America's Forgotten Quest to Live and Work on the Ocean Floor\"<p>You can see examples of how I’ve applied my tools and passion here: <a href=\"http://mindtribe.com/portfolio/\" rel=\"nofollow\">http://mindtribe.com/portfolio/</a><p>I ask that you bring some C and microcontroller experience--other than that, you don't have to use the same tools and you don't have to enjoy the same things. But if you're excited about similar stuff, drop me a line at hn@mindtribe.com to let me know.<p>We're also hiring ELECTRICAL and MECHANICAL engineers!","time":1338572757,"type":"comment"}