{"by":"dabent","id":4054857,"kids":[4055681],"parent":4053076,"text":"Los Angeles, CA - Full time<p>TrueCar is changing the way people buy and sell cars. We are well funded, earning revenue and growing. Most of our code is in Python, Java and Javascript.  We have a great work environment and some great problems to solve.  I love it here.<p>We have several openings right now.  If one sounds like it might be a fit, shoot me an email (address is in my profile)<p>* Senior Manager of Search Engine Marketing -  Responsible for the day-to-day management of the internal paid search program.  This includes everything from keyword expansion to weekly reporting as well as strategy and leading search meetings.  The ideal candidate will be well versed in the fundamentals of search and the ability to understand a purchase funnel and where it makes sense to drive investment.   3-5 years of search engine marketing experience required.ce building database-driven, web-based systems in a Linux environment.<p>* Senior Linux Systems Engineer - Will be involved from the design stage through production troubleshooting, from DNS to networking to application behavior and ultimately responsible for making sure our production systems are reliable and perform well. Redhat Linux administration, including configuration, troubleshooting, and automation. At least 5 years of experience with Linux/UNIX system administration.<p>* Director of Core Data Engineering - Lead major software and testing efforts on back end Core Data platform.  Work with CTO to define strategic direction for our data platform that drives our all of our products.  Proven success implementing Hadoop.<p>More positions:<p>* Java Architect<p>* Senior Java Developer<p>* Senior .NET Developer<p>* BI SQL Analyst<p>* Data Analyst (SAS/SQL - Looking for an MS in Statistics, Econometrics, Operations Research, Data Mining, or Math)<p>* Front End Developer<p>* Front End Engineer/Designer<p>* Statistician/ Data Mining Specialist<p>* Vice-President, Partner Development<p>I found TrueCar at PyCon, relocated across the country to join them in the fall and haven't regretted it once. Come join me by the beach: <a href=\"http://picplz.com/user/dabent/pic/tpc4v/\" rel=\"nofollow\">http://picplz.com/user/dabent/pic/tpc4v/</a>","time":1338575239,"type":"comment"}