{"by":"mbeebe","id":4055152,"parent":4053076,"text":"Mountain View, CA - Matterport is looking for a Full-stack Web Developer and Computer Vision Engineer<p>Web Developer:<p>Scanning is only half of the Matterport experience. What happens after scanning — viewing, annotating, and publishing scanned 3d content — is essential to giving users a seamless and pleasurable experience.<p>The Work:<p>Build out the Matterport website and server infrastructure, including both the database of scanned 3D content and the user interface for browsing it. You would be the first web developer we hire, so you will have a chance to set your choice of language, framework, and best practices for web development at Matterport.<p>Preferred Skills:<p>Well-versed in Ruby on Rails.<p>Past experience scaling a website from inception to large numbers of users while maintaining reliable performance.<p>Past experience doing user experience design for new categories of product.<p>---<p>Software Engineer with Computer Vision &#38; Algorithms focus:<p>A creative Engineer who can invent new algorithms, not just apply known techniques. There are still big, interesting problems to solve which are central to our product.<p>The work:\nYou will be working on 3D alignment and mesh reconstruction algorithms, improving robustness and quality. The ideal candidate is comfortable with messy data and uncertain results.<p>Preferred skills<p>Past experience in computer vision or a related field such as machine learning.<p>Experience with high-performance code (optimization, parallelization, CUDA) is a plus.<p>Very comfortable coding in C++.<p>---<p>A bit about us:\nMatterport (YC W12) creates a low-cost easy-to-use 3D scanner that lets you turn reality into 3D models.<p>We scanned Y Combinator shortly before demo day -- you can see the scanning process and the automatically generated 3D model on our demo video starting at 0:40  <a href=\"http://matterport.com/#video\" rel=\"nofollow\">http://matterport.com/#video</a><p>We're proud to be creating something incredibly <i>useful</i>.  This is going to become a vital tool for the millions of professionals who work with 3D spaces on a daily basis, including construction companies, film studios, building operators, real estate companies, industrial engineers, remodelers, architects, retail designers, insurance companies, and more.  Our site is being deluged by requests for new uses for the system every day.<p>We're starting our beta testing program with several large companies, and we've already finished raising a very sizable seed round.<p>We are all experienced founders and were previously early employees at PayPal and Google.  We like to work hard and get stuff done.  We are intellectual and curious.  We know how to communicate and get along. We have fun. We feature a brogrammer-free workplace. :-)<p>Most of all, we're driven to change the world in a deep and meaningful way.<p>We feel that it's worth giving larger than typical equity compensation for early employees -- we want you to do really well if the company does really well.<p>jobs@matterport.com - put a 1 in the subject for the vision position or a 2 for the web development position.","time":1338578155,"type":"comment"}