{"by":"jesseendahl","id":4055023,"parent":4053076,"text":"C&#38;T Publishing is looking for a Mac IT/IS Specialist in Concord, CA (East Bay--about 45 minutes from San Francisco).<p>About You: You have a passion technology, love to problem-solve, have a desire to grow and continue to improve your skill set, and understand how IT can impact the big picture. You have strong analytical and troubleshooting skills, especially under pressure. You have great communication skills with both technical and non-technical colleagues. Finally, you have a love for technology combined with curiosity and dedication. If this sounds like you, then you should apply.<p>About Us: We are an established craft book publishing company that understands the value of great IT. We are an all Mac environment, with some exceptions. We are an equal opportunity employer.<p>Description: The IT/IS Specialist person's primary area of responsibility is to support the staff by maintaining their computers and the servers that they work from, so that they can accomplish their work utilizing the tools provided as efficiently and productively as possible.<p>Ongoing Goals: Maintain computer systems (hardware and software) ensuring that all operate at maximum efficiency, and ensure that all data is accessible and secure.<p>Duties &#38; Responsibilities: This position is authorized to recommend purchases, make approved purchases and install approved hardware and software.<p>• Solve day-to-day help desk issues.<p>• Ensure all IT infrastructure and configurations are documented, create SOPs for help desk issues and position tasks, and post SOPs on file sharing server.<p>• Cross-train staff members to handle IT issues in absence.<p>• Software/hardware recommendations and make approved purchases.<p>• Maintain company hardware and software purchasing records and system inventory.<p>• Create annual IT budget with monthly and departmental breakdown. Reconcile actual spending with budget at end of each month and at end of year.<p>• Software updates, installation and troubleshooting for ~50 client computers and 4 servers.<p>• Perform hardware installations including replacing RAM and hard drives.<p>• Maintain all back-ups (tape and cloud) and hand off tapes to manager for offsite storage every week.<p>• Ensure that all servers, storage devices, internet, phone system, VPN access and firewall are operational.<p>• Troubleshoot printing devices as necessary.<p>• Responsible for new employee onboarding. Ensure that all accounts (email, file sharing, etc.), phone, and computer are work-ready by new employee start date.<p>• Reset all passwords, clear off and back up staff-member computer when employees leave the company.<p>• Maintain and troubleshoot PRI/VOIP based phone system (Fonality).<p>• Maintain filesharing server: FreeBSD/ZFS/Netatalk/LDAP.<p>• Work on strategic objectives and other duties as assigned.<p>• Must be available on-call for highly critical IT issues.<p>Knowledge &#38; Experience<p>Education/Experience: CS degree or 1-3 years experience.<p>Requirements:<p>• Thorough knowledge of OS X (10.6--10.7) required. We are an almost exclusively Mac based environment, so this is an absolute must.<p>• Experience with Mac based computer imaging.<p>• Some command line experience.<p>Pluses:<p>• Experience with imaging and/or configuration management software such as JAMF suite, Puppet, DeployStudio, or Radmind.<p>• Experience with FreeBSD.<p>• Apple Certified Technician.<p>• Experience with Nagios.<p>• Experience with HTML, CSS, and XML.<p>• Experience with Adobe CS Suite a plus--especially InDesign.<p>• Experience with Filemaker a plus.<p>• Experience with Acumen (4D) a plus.<p>• Experience with Universal Type Server or other font server software a plus.<p>Physical Requirements:<p>• Able to talk and hear.<p>• Able to work on computer for 40 hours per week.<p>• Able to walk up to 1 mile per day.<p>• Able to stand up to 2 hours per day.<p>• Able to lift up to 40 pounds (think 27\" iMac, or a server).<p>Please contact Jesse Endahl about this position by emailing it-position@ctpub.com<p>Please attach your resume, along with a cover letter outlining why you are the right person for this job.<p>Compensation: 40 hours per week. $40,000 - $45,000 annual compensation, plus benefits.","time":1338576954,"type":"comment"}