{"by":"paolodona","id":4055665,"parent":4053076,"text":"Dublin - Full time - Ruby On Rails Developer &#38; Lead Developer<p>We're a young and dynamic startup and are looking for  a talented developer capable of delivering large scale/high traffic webapps.<p>The developer will lead and play a critical role in the growth of the systems.<p>We're looking for:<p>+ 3/4+ Years Ruby/Ruby on Rails development\n+ Strong OO / Design patterns / refactoring skills\n+ Proficient in Javascript Prototype/jQuery\n+ Ability to scale high traffic web applications\n+ HTML/CSS design from scratch\n+ Good database design skills, SQL/MySQL\n+ Ajax / Memcached\n+ Git/GitHub – source code version control\n+ TDD/BDD with Rails/Rspec/Cucumber\n+ Experience with queuing systems, NoSQL databases, advanced caching &#38; key-value storage engines<p>Required skills:<p>+ Self starter &#38; self motivated – keeps up with the latest trends &#38; technologies\n+ Experience in designing/maintaining Rails applications in production\n+ Ability to be pragmatic and implement the right solution according to the business requirements / deliver within agreed timescales\n+ Ability to lead a team and manage/mentor junior developers<p>Why is Homestays.com a great place to work for:<p>We’re a young, well funded, startup and we just started growing. It’s a great environment with a friendly and supportive team, and this is an opportunity to join the team very early, so you get to contribute to the success of the company and shape how the technology stack will grow.<p>It’s an environment in which developers can do their best without the burden of heavy processes or hierarchies. You’ll get to work closely with the investors and the business side of the company to put you in the position to deliver the best code and architecture possible.<p>The Ideal Candidate:<p>+ Is passionate about clean, concise code that is readable and easy to maintain.\n+ Has designed and developed his own projects or products and understands what it takes to bring a product to life.\n+ Has a great GitHub profile – proven track record\n+ Has extensive experience with non relational databases (couchdb/mongodb), queuing systems, key-value storage engines (Redis/Riak)\n+ Can program in different languages\n+ Is entrepreneurial &#38; excited to make things happen quickly\n+ Has a strong work ethic. We’re a small team and you will be expected to work hard.\n+ Is a nice person, easy to work with<p>How to apply:<p>Send an email to jobs@homestays.com<p>Include a resume, and links to any projects (personal or commercial) and link to your github account &#38; personal blog if you have one.","time":1338583549,"type":"comment"}