{"by":"eisokant","id":4055101,"parent":4053076,"text":"Web developer for Tyba in Madrid, Spain (www.tyba.com)<p>(EU only)<p>Job description:<p>Do you think CVs are outdated and LinkedIn doesn't do a good job at presenting yourself professionally online? We do! At Tyba we have launched in March a website that let students and young professional easily create their page and show visually their curriculum, their personality and their portfolio with a creative but professional design. We want them to have a website they are proud of, they like to play with and that they can spread around , show to employers or that employers find when they google their name. \nWe want to give recruiters the possibility to browse through high-quality profiles and have a better overview of who they will hire or request for an interview.<p>We work with a freemium model and give the users the possibility to upgrade for TheirName.com and for additional features such as themes against a monthly or yearly fee.<p>We are lucky do all that from a bright and comfortable office located in the thriving and sunny city of Madrid, in the beautiful neighborhood of Salamanca.<p>We are now seeking an oustanding developer to join our international team of gifted talents. Our developers are responsible for exploring Tyba's potential and growing its user base, helping  them to get hired and companies to find talents. This is an amazing opportunity to be part of an exciting project, to grow with the company and have an impact on numerous people's lives.<p>Responsibilities<p>At Tyba, you will work on a fast evolving product  within our small team and together with our developer Tristan, our designer Zuri, our Manager Eiso and occasionally with our back-end developer Parminder located in the US.<p>Our work atmosphere is that of a startup, casual. Everybody is aware and sometimes involved in the startup different aspects : the sales to the public and to universities, our high-level customer service, the decision making and the product development.<p>As one of the two developers, you will have the chance to have a major impact on the product. We have a long list of small to large features and improvements we would like to implement and that you will work on. New ideas will be also coming on the way from the whole team. We will constantly test the product, try to get as much feedback as possible and think about ways to make it better.<p>On the technical aspect we use the best tools we find out there to date to develop the product. We work mainly with PHP on the server side, JavaScript using the jQuery library on the client side and MySQL for the database. We might have to use Python or Ruby on the server side in the future.\tOn the back end we run our nginx server with Amazon Web Services (EC2) and we store our files using their Content Delivery Network S3.<p>We work with several APIs, especially Google Analytics and Google Charts APIs to display the users' website analytics. Facebook API to allow the user to connect to Tyba with Facebook and to share or post content on Facebook. Namecheap and DNS Made Easy APIs to buy and propagate domains chosen by the users. In the future we will certainly use others. Since all of them have good libraries, there is usually a fast learning curve.<p>We use Github for version controlling to have a nice and clear workflow.<p>To give you an idea of what we are doing on a daily basis, here is a list of recent projects our developer has been working on:<p>- Creating a referral system that allow the user to select their Facebook friends who they want to post on their walls. We use a unique link for each user and award points for new visitors or users brought. \t\t\n- Building a search tool that allow users and potentially recruiters to browse through the users profile according to specific criteria.\n- Creating an expanding work module that let the user upload presentations, videos, documents or create an image gallery to illustrate their work experience.<p>Requirements<p>- Engineering or scientific studies.\n\t- Fluency in English.\n\t- Rigorous programming skills, the knowledge of a strict object-oriented languages such as C++ is a big asset.\n\t- Good knowledge of PHP, JavaScript (jQuery), AJAX and MySQL. Having worked with Github and with Google or Facebook APIs is an asset.\n\t- Fast learner, you should be willing to pick up a new programming language if we need it.\n\t- Showing flexibility in the work development, you should not be scared to restart part of the project from scratch if we realize there are better ways to go do it.\n\t- Being exited about the product, it can be in a critical way of course but you should believe in the potential of our startup.\n\t- Dedicated to make the Product better and get users excited about it.\t\n\t- Hard-working, good communicator and having excellent abstraction and critical skills.<p>To apply please create a profile on <a href=\"http://tyba.com\" rel=\"nofollow\">http://tyba.com</a> and send us your Tyba site with a cover letter. You can either upload your CV on your Tyba site or send it to us separately.","time":1338577665,"type":"comment"}