{"by":"kittkat","id":4075863,"parent":4053076,"text":"Jana (Boston,MA)-Full time\nFull-Stack Web Developers, Head of Engineering, Web Development Interns, Associate Product Manager (Mobile and Facebook), PR Specialist, etc.<p>We are a well funded startup that is building a new style of marketing and advertising company focusing on underserved, understudied communities in high-growth markets. We are actively recruiting individuals who share our passion for making a lasting, positive global impact while growing a thriving, exciting business.<p>We are changing century old industries in the developing world through cutting edge mobile technology. We help big players (like the World Bank, The Economist, Unilever) get feedback from hard to reach groups in days instead of months and test innovative products with the push of a button. We have a powerful mobile rewards platform to send free airtime minutes to more than 2.1 billion people around the world. We're earning revenue in 50 countries and have raised almost $10M from premier VC investors.<p>Our teams bursts with talent from MIT, Harvard, Stanford and Google but we're pretty relaxed, except during weekly Settlers of Catan battles in the office, ice-cream runs on Wednesdays or beer runs every Friday.<p>Interested in global + mobile + data? <a href=\"http://jana.com/about-us/careers/\" rel=\"nofollow\">http://jana.com/about-us/careers/</a><p>On the Web Developer front: \n    Early stage means you'll have major influence\n    We love Open Source (CouchDB, Flask, and more)\n    Roots from the MIT Media Lab\n    Global Impact (Asia, Africa, Latin America)\n    We gather and analyze massive amounts of data<p>Good candidates have:<p><pre><code>    Experience across the entire open source stack\n    UI/UX implementation, web design\n    Experience with web frameworks\n    Experience with Python - or very strong in at least two other web-related languages\n    3+ years of software development\n    Demonstrable analytic ability\n    Passion for web software development\n    Ability to both learn from and teach other engineers\n</code></pre>\nAny questions you can email me at katrina at jana.com","time":1339012695,"type":"comment"}