{"by":"johnkoscielak","id":4094685,"parent":4053076,"text":"1 point by johnkoscielak 0 minutes ago | link | edit | delete<p>Mobile Developer\nLocation: Malvern PA<p>Job summary:<p>Us: The emerging technologies group at FIS; the world’s largest global provider dedicated to banking and payments technologies.<p>You: Mobile developer, hacker, innovator.<p>Job: Work with a talented team of architects, U/X engineers and thought leaders to assist with ongoing proof of concepts and research.<p>General duties and responsibilities: • Researches, tracks and understands new technologies to provide technical leadership in developing service applications and analyzing business requirements as they pertain to intranet and external Internet-based systems. • Builds applications • Provides written design documents, test plans and test results. • Manages, develops, integrates and implements related applications components, including front-end development, server-side development and database integration. • Plays a direct role in programming, maintenance, technical support, documentation and administration of the applications. • Establishes and communicates standards to manage cost and ensure continuity of applications. • Suggests technical alternatives and improves/streamlines processes and systems • Completes project assignments and special projects commensurate with job expectations • Conducts planning, analysis and forecasting activities to plan projects and tasks • Performs other related duties as assigned.<p>Requirements: Bachelor's degree in Computer Science, Engineering or a related discipline; or equivalent combination of education and experience that is required for the specific job level. Post-graduate education is desired.<p>ADA Disclaimer: In developing this job description care was taken to include all competencies needed to successfully perform in this position. However, for Americans with Disabilities Act (ADA) purposes, the essential functions of the job may or may not have been described for purposes of ADA reasonable accommodation. All reasonable accommodation requests will be reviewed and evaluated on a case-by-case basis.<p>EEO/AA Employer<p>Please contact John Koscielak at john.koscielak@fisglobal.com<p>414-357-9199<p>www.fisglobal.com","time":1339424310,"type":"comment"}