{"by":"bb_mn","id":4102305,"parent":4053076,"text":"JAMF Software - Full Time - Minneapolis, MN and Eau Claire, WI<p>JAMF Software is the creator of the Casper Suite, the only suite of client management software developed exclusively for the Apple platform. We help thousands of customers to manage their Macs and iOS devices, and we're fortunate to work in a space that is evolving and growing at a fast pace. This is a great place to work, and we're conveniently located on the top floor of the Grain Exchange in downtown Minneapolis.<p>We're looking for a driven web developer (Symfony/Zend, jQuery, HTML5, CSS, PHP) to join our team. In this position, you will hit the ground running and help us build a better website, evolve and mature our development process, and integrate with internal and external systems using a variety of APIs. You'll also probably suggest some things we haven't thought of yet.<p>RESPONSIBILITIES<p>• Collaborates with communications team to create and publish timely, accurate information about products and offerings<p>• Manages and improves development and production environments<p>• Evolves development process to maturity through the use of content versioning systems, deployment tools, backup systems and increased redundancy<p>• Integrates with external systems (for example, Salesforce) using APIs<p>• Measures the success of web initiatives and campaigns<p>• Increases efficiency, improves processes and leverages emerging capabilities<p>We are growing quickly and are also hiring for a number of other positions, including Software Engineer (Objective-C or Java), Software Engineer - Test, and QA engineers. All jobs are listed on our careers page: <a href=\"http://www.jamfsoftware.com/about/careers\" rel=\"nofollow\">http://www.jamfsoftware.com/about/careers</a>.<p>Interested? The first step is to check out our careers page and submit your resume to our recruiting team. If you could mention that you saw the job posting here, I would appreciate it. I've asked them to keep their eyes open for resumes that mention HN.","time":1339529543,"type":"comment"}