{"by":"r4vik","id":6140177,"parent":6139927,"text":"London, UK - Pitchup.com - Python Developers<p>===================================<p>We&#x27;re looking for Python developers (one senior, one more junior) at our start-up in Chiswick, west London <a href=\"http://www.pitchup.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.pitchup.com</a> - we sell pitches at around 600 campsites in the UK, France and Ireland.<p>We receive around 60,000 visits per day, up 200% since last summer, and around 5,000 bookings per week. After celebrating our fourth birthday last Monday, we&#x27;ll be expanding into new markets during the autumn&#x2F;winter.<p>Our small team of developers work mainly in Python and Django, achieving multiple awards and great reviews for ease of use and speed <a href=\"http://www.reviewcentre.com/Travel-Agents/Pitchup-com-www-pitchup-com-reviews_1369575\" rel=\"nofollow\">http:&#x2F;&#x2F;www.reviewcentre.com&#x2F;Travel-Agents&#x2F;Pitchup-com-www-pi...</a>\nBehind the scenes we&#x27;ve built some pretty nice features to help campsite owners manage their vacancies and encourage them to sign up.<p>Pitchup.com was cited at the recent W3C&#x2F;ODI&#x2F;OKF Open Data on the Web event <a href=\"http://www.w3.org/2013/04/odw/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.w3.org&#x2F;2013&#x2F;04&#x2F;odw&#x2F;</a> : we&#x27;re aiming to go beyond the typical travel site by integrating POIs like public transport, tourist attractions and pubs. We were also among the early users of Twitter&#x27;s recently-launched product cards and autocomplete.<p>We&#x27;re looking for a couple of people to work on things like payments, international expansion, testing and personalisation, mobile and geo (backend stack is Python &#x2F; Django &#x2F; Postgres &#x2F; Celery &#x2F; nginx &#x2F; S3).<p>The business is profitable and was founded in 2009 by former lastminute.com staff with a background in the holiday park sector. We&#x27;re regularly featured in the national press, and our lively, friendly team is based at the Barley Mow Centre off Chiswick High Road in west London.<p>Please drop me a line if you&#x27;re interested in more information, or apply at <a href=\"http://www.pitchup.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.pitchup.com&#x2F;jobs</a> .<p>Requirements<p><pre><code>    * Expert in Python, with knowledge of at least one Python web framework (ideally Django)\n    * Good PostgreSQL experience\n    * Very strong JavaScript skills\n    * Familiarity with Linux server environments\n    * Willingness to undertake sysadmin work\n    * Some remote working is possible, and some on-call evenings and weekends will be required\n\n\n    </code></pre>\nSee our Stack Overflow page for office and team pics: <a href=\"http://careers.stackoverflow.com/company/pitchup-com/\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;company&#x2F;pitchup-com&#x2F;</a> .<p>Contact info<p>* Apply: <a href=\"http://www.pitchup.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.pitchup.com&#x2F;jobs</a><p>* Telephone: 0208 123 4450<p>* No full-time telecommuting<p>* No headhunters!","time":1375364136,"type":"comment"}