{"by":"nckpark","id":6140964,"kids":[6142877],"parent":6139927,"text":"Incomparable Things is looking for talented developers to grow our engineering team as first employees. Our mission is to inspire adventures that get people outside, active, and feeling alive. This drives our product as well as our lifestyle. We follow our sense of adventure in travel, recreation, and work, and are looking for teammates who do the same. We&#x27;re fresh out of the Nike+ Accelerator powered by TechStars and are moving quickly towards launch.<p>Read more about our product here: \n<a href=\"http://www.geekwire.com/2013/nike-accelerator-spotlight-totem/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.geekwire.com&#x2F;2013&#x2F;nike-accelerator-spotlight-tote...</a><p>We&#x27;re looking for people with the following skills:<p>- - -<p>iOS Developer w&#x2F; a Sixth Sense for UX \nYou will be responsible for leading development of our iOS application and contributing to product design and user interface decisions.<p>You should have:\n* Experience building and launching native applications on iOS. These should be available in the App Store or be personal projects that you can share and demonstrate.\n* Experience building apps driven by web services is a plus.\n* Strong user experience sensibilities. You will have significant influence in defining interface and interactions. \n* The flexibility to learn and implement new technologies.\n* The desire to collaborate, move fast, and build something meaningful to you and to the world.<p>- - -<p>Rails Developer + Scalable Infrastructure Architect\nYou will be responsible for maintaining and continuing development of our web API as well as designing our back end infrastructure to scale with growing demand.<p>You should have:\n* Significant experience developing web applications and API&#x27;s using Ruby on Rails.\n* Experience designing and scaling back end infrastructure on AWS or equivalent cloud services.\n* Knowledge to manage and optimize MySQL databases and queries\n* Experience in machine learning and statistical analysis is a big plus.\n* The flexibility to learn and implement new technologies.\n* The desire to collaborate, move fast, and build something meaningful to you and to the world.<p>- - -<p>We are offering competitive salary, meaningful equity, and the opportunity to step into leadership positions as our company grows. Please contact nick@incomparablethings.com with a short summary of your experience to start the conversation and learn more about us.","time":1375371101,"type":"comment"}