{"by":"lewisflude","id":6140195,"parent":6139927,"text":"East London, England — Tech Lead – Enthuse.me<p>Enthuse.me is a simple, elegant service that lets you showcase the best of your expertise in the most effective way – by cutting out the noise.<p>Give your online presence real focus and take people straight to the very best of what you do via your Enthuse.me profile.<p># About the company<p>We’re a young Silicon Roundabout start-up, passionate about intuitive UX, clean design, indestructible code and creating a truly useful product…<p>As a small, super-focussed team we thrive on generating ideas, pulling them apart, throwing away half the bits and putting them back together in leaner, meaner ways. We like to experiment, build, test and we’re constantly striving to be simpler, more elegant and more effective in the way we work. We want the same for everything we build.<p>The company was founded from the corner of someone else’s office at the start of 2012 by tech entrepreneur Dan Jacobs, whose previous exploits saw him surfing the first dot.com wave and working for the likes of Virgin.com, Lastminute.com and BBC Online before developing and launching the hugely successful Prime Card for IDT Global.<p>We’re now based in our own premises in the heartland of London’s bustling Shoreditch tech community, eating falafels on Fridays and drinking a lot of tea.<p># What we&#x27;re looking for:<p>We are looking for a senior developer who has experience architecting and building scalable, maintainable systems to join our team. The candidate will be taking on the role of tech lead, managing a close-knit team of developers and working alongside designers and a product manager to a create a compelling product.<p>Responsibilities of the candidate will include: \n- managing a small team of developers \n- implementing development best practices \n- day to day development of the application \n- making architecture and technology choices - recruiting other developers<p># Requirements:<p>- Proven experience building and maintaining great web applications \n- Solid knowledge of, and experience implementing, development best practice methodologies: TDD, OO \ndesign, refactoring. \n- Ability to work full stack web application development including complex JavaScript front ends. \n- Experience of agile and lean development practices.<p>Previous experience with the following technology is required:<p>- Ruby &amp; Ruby on Rails \na. Rspec \nb. Cucumber \n- JavaScript (Coffeescript) \na. jQuery \nb. Client side MV* framework (Ember.js &#x2F; Backbone &#x2F; Knockout) \nc. Jasmine \n- Postgres \n- Heroku \n- Git \n- Jenkins<p>To apply, please send your Github username and CV to info@enthuse.me","time":1375364335,"type":"comment"}