{"by":"sugnid","id":6140214,"parent":6139927,"text":"Rap Genius - Brooklyn, NY - <a href=\"http://rapgenius.com\" rel=\"nofollow\">http:&#x2F;&#x2F;rapgenius.com</a><p>jobs@rapgenius.com<p>Building the &quot;Internet Talmud&quot; to annotate and explain the world&#x27;s primary source text<p><pre><code>  * Front-end developer with an eye for design (UI&#x2F;UX&#x2F;CSS&#x2F;jQuery)\n  * iOS Developer (you know, iOS)\n  * Full stack software engineer (Rails)\n</code></pre>\nOver the past few years, Rap Genius has gone from tiny side-project to one of the biggest music sites on the internet. We’ve raised 15 mil from some pretty dope investors and grown to employ some of the most talented devs this world has ever seen. We’re expanding from explaining rap into ALL OF TEXT, starting with poetry, rock, and news. Now were looking for genius full-stack web and iOS developers to help build the “Internet Talmud”, the one platform for explaining the world’s primary source texts.<p>Why would you want to work for us?<p><pre><code>  * One of the fastest-growing sites on the internet, SERIOUSLY THIS IS BASED ON\n    ACTUAL NUMBERS.\n  * Tiny, quick-shipping team with a ton of autonomy – so you never think to yourself:\n    “what did i accomplish this year&#x2F;month&#x2F;30 seconds ago?”\n  * A development and design agenda that is led by developers and designers –\n    so no marketing or product people telling you how the image carousel should work.\n  * Gym in building, free food, sweet benefits, whatever computer you want, more\n    money than your last job, equity, etc.\n  * Live in New York, where a new restaurant is born every 1.5 seconds!\n</code></pre>\nA little about the dev team:<p><pre><code>  * Seven people total: five backend, one front-end&#x2F;design, and one TOTALLY\n    SICK intern.\n  * Independently led projects.\n  * We iterate quickly and push code to production constantly.\n    We&#x27;re not afraid to put the &quot;first draft&quot; of a feature in production\n    to see how it behaves in the wild before perfecting it.\n  * Projects and priorities are determined communally (usually over burritos).\n  * Ruby on Rails via Heroku + Sass, Compass, jQuery, Git, and more!\n</code></pre>\nMore about the positions:<p>Are you a boss front-end developer with an eye for design? Hit us up. A bomb iOS developer who wants to build the Rap Genius iPhone app from the ground up? An experienced and creative full-stack Rails engineer? We’ve been waiting for you. Send us your deets.<p>Interested? Hit us up at jobs@rapgenius.com with:<p><pre><code>  * Your name and online identity – i.e., your Twitter, Github, blog,\n    Stack Overflow account, personal website, etc.\n    The more info the better.\n  * Location – you can’t get the true RG cult effect working remotely, so only apply\n    if you live in NYC or are willing to relocate.\n    Our office is in Williamsburg.\n  * Educational background and&#x2F;or most recent job\n  * A little bit about your technical background,\n    including something brief about what you like\n    and dislike about the technologies you’ve used.\n  * If you come in for an interview, you’ll start by making a short\n    technical presentation to the team and taking their questions.\n    What will you present?\n  * THE MOST IMPORTANT: What have you built online that you’re proud of?</code></pre>","time":1375364554,"type":"comment"}