{"by":"TLCooksey","id":6140418,"parent":6139927,"text":"Badgeville is looking for a Senior Frontend Developer.<p>Why would you want to be our Senior Front-End Developer?\nWe sit right at the spot where websites, mobile apps &amp; enterprise SaaS smack full-speed into big data analytics. Gamification is the big idea of 2013 and it’s only getting bigger. At Badgeville, you’ll be surrounded by the speed and flexibility of a start-up team while working on projects that support some of the world’s biggest companies. Do you love brand-new offices featuring overstocked kitchens, games &amp; outings, bike &amp; jogging paths, unbeatable views and ridiculous gyms with climbing walls? Sure — we’ve got all of those. But you want all of that while you get to work with state-of-the-art technologies in one of the hottest emerging markets around. You want to be in a position where what you do directly affects company performance every day. That’s why you want to be at Badgeville.<p>Responsibilities: \nYou will collaborate to help specify, design, and develop software meeting company and product requirements, with lead responsibility for different areas of the architecture. You’ll also be responsible for communicating with senior leadership around these areas and projects.<p>Required Skills<p>4 - 6 years of proven, hands-on success in the front-end of large-scale web applications\nAt least 6 years experience in programming in JavaScript, HTML and CSS\nAt least 2 years experience with AJAX-based web applications\nAbility to provide concrete examples of user interfaces where you led design and development\nAbility to articulate the reasoning behind choices in the design and discuss alternatives\nKnowledge of full-stack web development\nDemonstrable experience taking significant projects all the way from spec to release<p>Benefits&#x2F;Perks<p>Competitive Salary\nStock Options\nFull medical, dental &amp; vision benefits\nBrand-new office space bursting with tasty treats, games, and jogging&#x2F;bike paths\nFully paid gym membership (for code-crushing forearms)\nCompany-provided CalTrain pass\nLots of fun team events &amp; outings\nCatered lunch 3 days a week<p><a href=\"http://www.jobscore.com/jobs/badgeville/senior-frontend-developer/cK7cuKSDOr4OOJiGakhP3Q\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jobscore.com&#x2F;jobs&#x2F;badgeville&#x2F;senior-frontend-deve...</a><p>If interested send an email to engjobs@badgeville.com.","time":1375366408,"type":"comment"}