{"by":"jconnolly","id":6141875,"parent":6139927,"text":"New York, NY - Full-time, H1B possible<p>TheLadders<p>---------------<p>TheLadders (<a href=\"http://theladders.com\" rel=\"nofollow\">http:&#x2F;&#x2F;theladders.com</a>) is hiring for a number of open roles to help us find the right person for the right job. We&#x27;re a growing team looking for front-end developers, designers, UX, devops--the whole gamut. We believe in our team, offering unlimited vacation, competitive salaries, and no cap on training and conference budgets. Here&#x27;s a brief description of the roles (as written by a software engineer, so keep that perspective in mind)<p><i>Devops&#x2F;Systems Engineer</i>: we use puppet. We have our own hardware, use VSphere, run mostly CentOS.<p><i>Designers</i>: we&#x27;ve redesigned our jobseeker-facing site to be completely responsive. We&#x27;re using sass and all that fun stuff.<p><i>Front-end developers</i>: we&#x27;re using backbone, mustache, sass to build a single-page application to help our jobseekers be as informed as possible when making their next career move. We&#x27;ve rolled our own graphics implementation for some visualizations, so if that sounds interesting get in touch.<p><i>Software Engineers</i>: our backend is written in java, scala, with some tools in python and other languages. We&#x27;re not married to any language, framework, or architecture, and many of us have been personally playing more with erlang and clojure in the hopes of using them in newer projects.  Check out a blog post I&#x27;ve recently written up about one of the more fun projects I&#x27;ve done recently: <a href=\"http://dev.theladders.com/2013/07/denormalize-the-datas-for-great-good/\" rel=\"nofollow\">http:&#x2F;&#x2F;dev.theladders.com&#x2F;2013&#x2F;07&#x2F;denormalize-the-datas-for-...</a><p>If these problems and technologies sound interesting to you, I&#x27;m John Connolly, and I can be reached at jconnolly@theladders.com<p>Review more information about our open positions here: <a href=\"http://careers.theladders.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.theladders.com&#x2F;</a>","time":1375377725,"type":"comment"}