{"by":"wensing","id":6141776,"kids":[6142104,6142494,6141879,6142059,6143025],"parent":6139927,"text":"Stormpulse – Austin, TX – Full-time, permanent – (<a href=\"http://www.stormpulse.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.stormpulse.com</a>)<p>Our mission: To interpret the Earth&#x27;s most threatening data.<p>-- Senior Python Developer --<p>About us:<p>We tell our customers when bad weather is going to disrupt, delay, or damage their business. Our product provides high-level intelligence and low-level analysis on weather risk for supply chain managers, business continuity professionals, commodity traders, and oil&#x2F;gas operators. Here&#x27;s President Obama looking at our map: <a href=\"http://news.yahoo.com/photos/u-president-barack-obama-looks-map-hurricane-sandy-photo-211917888.html\" rel=\"nofollow\">http:&#x2F;&#x2F;news.yahoo.com&#x2F;photos&#x2F;u-president-barack-obama-looks-...</a><p>We&#x27;re looking for a couple of developers to join our team. Tools we work with include Python, Celery, Redis, MySQL, Postgres, Backbone, nginx, AWS<p>About you:<p>* Able to rapidly gain (and enjoy gaining) new expertise in a previously-foreign, non-technical domain (e.g. weather, earthquakes, wildfires, solar flares)<p>* Derive joy from seeing huge leaps forward in the customer experience<p>* Mastery in a non-technical discipline (i.e. you are not only a great developer, but also a master at jazz music, mountain climbing, chess, skiing ... something that has taught you how to think beyond a keyboard).<p>* Ability to collaboratively apply the design principles of Stormpulse to new projects<p>* Not satisfied with a compromise -- always pursue the possibility that two seemingly contradictory goals can be simultaneously achieved through great feats of design &#x2F; engineering<p>* Derives pleasure from the final aesthetic<p>Requirements:<p>- B.S. in Computer Science, Electrical Engineering, Mathematics, or college degree with related technical experience required. (&quot;Hackers with Humanities degrees are awesome&quot; says Matt)\n- Strong experience with one or more of Python, Ruby or similar object oriented dynamic language required. Additional experience with Javascript, HAXE, HTML, or CSS is highly desirable.\n- Experience with GIS (PostGIS, ESRI, Mapbox) is preferred\n- Linux experience with knowledge of Linux internals and Distributed Systems preferred.\n- Self-motivated and driven to continuously improve personal and professional skills combined with openness to constructive feedback.\n- Strong communication and documentation skills.<p>Location:<p>3925 West Braker Lane\nThird Floor\nAustin, TX 78759\nUnited States<p>Contact:<p>resumes@stormpulse.com","time":1375377040,"type":"comment"}