{"by":"zt","id":6141914,"kids":[6209907,6143129],"parent":6139927,"text":"San Francisco, CA -- Standard Treasury -- Full-Time<p><i>Opportunity</i><p>Standard Treasury builds software for banks. That might seem boring, but everyone uses a bank and we dream of making their technology simple, beautiful, and intuitive. Think about your online banking system with its outdated, unpleasant UI and UX — we’re working to fix that. To get some idea of the market: U.S. banks spend $400 billion dollar per year on IT.<p>See <a href=\"http://techcrunch.com/2013/07/09/standard-treasury/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2013&#x2F;07&#x2F;09&#x2F;standard-treasury&#x2F;</a> for some more information.<p>Email us at hiring@standardtreasury.com<p><i>Product</i><p>Our first product is a white-labeled API interface and developer experience that we’ll sell to banks. Our technology enables banks to programmatically offer their services to their clients using modern, RESTful APIs. From here we plan on expanding into desktop online banking, mobile banking, and core banking (the systems that record teller transactions, and how much money everyone has in their bank accounts).<p><i>Traction</i><p>We have significant traction on our API product with several top-25 banks. The price points of these contracts range from $1 million to over $5 million per year. With these contract sizes and a growing customer base; we have an opportunity to avoid any significant equity dilution with a traditional fundraising round.<p><i>Team</i><p>We are a small team based in San Francisco focused on unsexy but incredibly valuable services that will change the face of banking and we are looking for the right people to join us. We are building a team of excellent people who work hard and don’t tolerate bullshit. We want passionate partners who share our desire to shake up banking software.\nWe practice internal transparency a la Stripe (<a href=\"http://bit.ly/VSv54h\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;VSv54h</a>) and corporate candor.<p>Email us at hiring@standardtreasury.com<p><i>Compensation and Perks</i><p>You can expect:<p>1. Great benefits. Medical, vision, and dental insurance for you and your dependents.<p>2. Great comp. Salary and equity. Critically, we’re interested in finding the right balance for you. We know there are some people who have a greater risk appetite than others.<p>3. Great perks. Free lunch and dinner, snacks, a stocked fridge, laundry service, gym membership, Clipper card, house cleaning by Exec or Homejoy, and delivery errands by Postmates.<p>4. Great flexibility.\n(a) Flexible hours. So that you can live your life.\n(b) Open vacation policy. We all need to recharge. We mean it — there is a two week minimum and we’ll send you home in December if we have to.\n(c) Paid maternity and paternity leave.<p>5. Great tools. Build your ideal workstations so you can have the tools you want and need. Buy the books you need or want on Amazon. Need a Kindle for your commute — get it. The corporate Amex can be used for all expenses under a standard of trust &amp; reasonableness.<p><i>Roles</i><p>We are hiring as quickly as we can find good people in a large number of roles.<p>1. Platform and APIs. For those who think they can build something as beautiful and durable as Twilio, Stripe, or Facebook Connect.<p>2. UI, UX, and design. This will start with easy-to-use API documentation and intuitive websites. In the future it will expand into the future of online (and mobile) banking.<p>3. Bank integrations. Half our job is taking pre-modern internal banking systems and making them disappear for our users. This requires patience and, fortunately or unfortunately, a deep love of puzzles.<p>4. Systems and security. We integrate with some of the most sensitive and secure systems in the world. We need to be even better. A security breach will kill our company.<p>5. Define your own role. Let us know what you want to work on to disrupt banking software.<p>Email us at hiring@standardtreasury.com","time":1375377998,"type":"comment"}