{"by":"ajayrinse","id":6141311,"parent":6139927,"text":"Rinse - San Francisco - Full Time – Technical Lead (VP of Engineering)<p>Rinse (www.rinsenow.com) is creating a seamless dry cleaning &amp; laundry experience through a combination of technology, incredible customer service, and strong back-end partnerships (an easy way to think about it is as an &quot;Uber&quot; for dry cleaning).  We launched service in May, have generated revenue since day 1, are well capitalized, and are building our customer base and team fast.<p>We are looking for a TECHNICAL LEAD to help us build an incredible company.<p>What does that mean?\n- You are excited to join a start-up at the ground floor and HAVE A MAJOR IMPACT within the first couple months;\n- You CRAVE FREEDOM TO OPERATE and decide how you want to build the core technology that supports the business;\n- You LOVE BEING HANDS ON when it comes to development, but also HAVE THE ABILITY TO RECRUIT and manage a world-class team of engineers;\n- You WANT A SEAT AT THE TABLE...you want your voice heard in major strategic discussions and board meetings...and you want to contribute with way more than just beautifully written code; \n- You have a Bachelors or Masters in Computer Science from a leading institution.<p>Who are we?\n- We are led by two co-founders (Ajay Prakash and James Joun) with substantial experience in start-ups, dry cleaning, and consumer focused companies;\n- We have a strong group of advisors, including a Technical Advisor who has substantial experience in start-ups, is a former CTO, and is currently a Senior Software Engineer at Google; \n- We plan to invest heavily in technology to streamline business operations, in addition to having a world-class consumer-facing mobile application;\n- Are based in SF, which is where we have initially launched…but our ambitions extend well beyond the Bay Area;\n- Are moving quickly, are well capitalized, and want someone who will come in and hit the ground running.<p>We are looking for someone who is strong technically but who can also be a leader and culture carrier for Rinse. The right person will be granted a substantial equity stake, cash compensation, and will have the chance to help build an amazing company from the ground up.<p>If you are interested, e-mail your resume to Ajay Prakash at ajay@rinsenow.com to learn more.","time":1375373700,"type":"comment"}