{"by":"probst","id":6141214,"parent":6139927,"text":"Kaiserslautern Germany, Software Engineer at Aircloak - REMOTE ((UTC +2)  +- 2)<p>My name is Sebastian, and I am the CTO at Aircloak. Aircloak is a young and well-funded startup working on privacy preserving data processing and analytics. We are a spinout from the German Max-Planck Institute for Software System research institute, where we also currently have our offices.<p>Our technology allows us to process highly private streams of data and only ever make fully anonymous data available to our customers. One of the features that make our system unique is that no one, including operators, customers, and ourselves, ever has access to the sensitive raw data. This property holds true even after we update the software running on the machines processing the sensitive data!<p>You should:<p><pre><code>    - be intelligent\n    - have a good sense of humour\n    - be an amazing programmer\n    - wish to change the world\n</code></pre>\nOur system spans many machines and services, with major components written in Erlang and Java, in addition to components written in C, C# and ruby. Knowledge of functional programming is a plus. Experience with web development is not going to hurt either.<p>We are:<p><pre><code>    - recent University of Cambridge graduates \n    - one director at the Max-Planck Institute\n</code></pre>\nThe work environment is highly international and diverse, and we would like to keep it that way. We are looking to hire two more full time engineers. You can either work on site with us in our offices in Kaiserslautern, Germany, or, for the right candidate, remote. We offer good and stable salary, generous equity and great facilities.<p>We hope to hear from you. Please email us at jobs@aircloak.com if you have any questions!\nYou can find more on our website: <a href=\"http://www.aircloak.com/join.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.aircloak.com&#x2F;join.html</a>","time":1375372871,"type":"comment"}