{"by":"knurdle","id":6142117,"parent":6139927,"text":"Los Angeles(Culver City), CA - Full-time, permanent - eSalon.com <a href=\"http://www.esalon.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.esalon.com</a>\nLooking for a junior to senior developer. Someone who gets stuff done, all around developer.\nPHP, javascript, Mysql, apache, nginx, redis, potentially some hardware programming...<p>We&#x27;re an ecommerce site that sells custom haircolor. Doesn&#x27;t sound too techy I know but there&#x27;s more to it. \nShort summary, someone comes to our site, fills out a profile&#x2F;sends a picture. We send them custom haircolor. When I say custom, I mean really custom. We manufacture and ship everything ourselves and we&#x27;ve built the whole system to do it ourselves. Every bottle of haircolor has the client&#x27;s name on it, instructions are personalized, it&#x27;s all made one off for the client.<p>More details..\nWe&#x27;re an ecommerce site that sells a completely custom product that we manufacturer ourselves. \nThings that you might be working on..\nFront end consumer facing website.\nBack end CRM customer service site. We use zendesk and custom software. Looking to integrate twilio for phone calls and build a custom call center solution.\nHelping automate our production line some more. Mix of hardware and software. We have an arduino powering some stuff, potentially more.\nData mining, we&#x27;re a very data driven company, constantly A&#x2F;B testing and trying to make our colorists&#x2F;customer service more efficient.<p>It&#x27;s a really small team and you&#x27;ll get to work on a lot of different things and have a big say in things. If any of this sounds remotely interesting, shoot me an email. I think we&#x27;re quite different from any other internet startup because we produce something tangible.<p><a href=\"http://www.esalon.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.esalon.com&#x2F;jobs</a> or email me at aaron@esalon.com","time":1375379823,"type":"comment"}