{"by":"amial","id":6142220,"parent":6139927,"text":"Los Angeles, CA - Auryn, s&#x2F;w engineer, mobile - [FULLTIME, H1B]<p><a href=\"http://www.auryn.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.auryn.com</a><p>Kids’ picture books are being redefined as a mix of animation, story telling, interactivity and a social networking experience between parents, children and teachers. We are looking for one strong, generalist developers who can help us realize the vision of the next generation kids’ app.<p>Main responsibilities include<p>- Design and build a platform for kids’ storybook apps based on the Unity3D game engine and targeting Android and iOS tablets.\n- Use the storybook platform to create immersive storybook apps combining gaming, animated story telling and reading.\n- Use and extend Auryn’s non-photorealistic rendering technology to create unique visuals and experiences for storybook apps.\n- Write tools to streamline the storybook app production pipeline using Python, Unity3D and other technologies.\nDevelop the client side of a storybook app distribution platform including storefront apps written using native Android and iOS APIs.<p>Skills and Requirements<p>- Ability to learn new technologies and problem spaces quickly.\n- Strong computer science background.\n- Strong experience developing software for mobile devices.  Knowledge of C&#x2F;C++, Objective-C (for iOS), Java (for Android), Unity3D, and&#x2F;or Python a plus.\n- Strong system design experience. Knowledge of game engine design a plus.\n- Strong background in computer graphics, image processing and mathematics. Knowledge of OpenGL, image processing toolkits, and&#x2F;or physics simulations a plus.\n- Commitment to creating the best storybook app experience for kids.\nStrong written and oral communication skills.<p>Who we are<p>We are passionate about creating the best storybook apps for children. We have a flat, open company where engineers and artists work under the same roof and have a blast doing it. Excellent benefits including health, dental, vision, 401K, friday donuts, lunches and a well stocked liquor cabinet. <p>If you are interested, please write to me at amit at auryn dot com.","time":1375380604,"type":"comment"}