{"by":"meganap","id":6142147,"parent":6139927,"text":"San Francisco, CA - Full-time, permanent - MuleSoft<p>Node.js Developer<p>Mulesoft is looking for node.js Developers to join our award winning Cloud Platforms team in San Francisco.<p>You will get to pioneer a greenfield JavaScript&#x2F;Node.js project with a growing team creating brand new services and features for our CloudHub Platform - our Integration Platform as a Service (iPaaS) which recently won the SIIA Software CODiE Award for Best Integration Solution.\nYou will have the opportunity to apply node.js to develop high-performance and highly-scalable event-driven components which will provide the backbone for the CloudHub platform, and a set of shared services across the Anypoint cloud platform. This is a greenfield project so there is tons of room for you to be creative, solve impossible problems, try new technologies and make your personal mark on things. In addition you have the opportunity, client-side, to use JavaScript and frameworks like Ember and Angular for developing Single Page Applications.<p>You’ll get to work with a great team of smart and talented engineers in San Francisco, as well as plenty of opportunity to travel to our engineering team in Buenos Aires, Argentina. We have a really nice office space with lots of company perks, and we run regular meetups and hackathons. Most importantly you’ll have a lot of fun doing this.<p>Some of the things that would make you a great fit for this exciting role:\nYou are excited about node.js and could explain to a room full of engineers why it’s such a compelling and powerful technology.\nYou are active in the open source community. You have a github account and would be happy to share with us some of the projects you have started or contributed to. MuleSoft is an open source company and most of our team are open source contributors.\nYou are constantly trying out new languages and frameworks on your own time - Ruby, Scala, Clojure, Akka, Angular, Ember, etc.\nYou are interested in APIs, big integration and big data challenges. A lot of what we are building involves scaling to massive volumes of web transactions and analytics&#x2F;metrics which will require technologies like AWS, Hadoop, and real-time event processing.\nStrong JavaScript knowledge and development best practices including unit testing and continuous integration of JS applications. You should feel passionate about this and have pretty strong opinions on why it is so important.\nYou probably have a Web&#x2F;UI JavaScript background and are comfortable working up and down the full stack and contributing to our SPA if needed (in fact this is probably one of the reasons you are excited about node.js).\nYou know when to choose appropriate technologies for the team to use; iterate quickly on ideas and push them out to customers in a continuous fashion; assist junior members of the team by performing code reviews and providing technical advice.\nMultiple openings at various levels (junior, senior, principal).<p>Click here if you&#x27;re interested in learning more:\n<a href=\"http://hire.jobvite.com/j/?cj=orGEXfws&amp;s=ycombinator\" rel=\"nofollow\">http:&#x2F;&#x2F;hire.jobvite.com&#x2F;j&#x2F;?cj=orGEXfws&amp;s=ycombinator</a>","time":1375380144,"type":"comment"}