{"by":"jkeesh","id":6143746,"parent":6139927,"text":"CodeHS is hiring in San Francisco, CA!<p>CodeHS is the best way for beginners to learn how to program. We focus on working with schools, and work with hundreds of schools and thousands of students all over the world. CodeHS focuses on making online education about the community, as you work through the program, you get help from real people.<p><a href=\"http://codehs.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;codehs.com&#x2F;jobs</a><p>=====\nHead of Sales, Business Development\n=====\nDescription\nWe’re looking for someone to run our sales efforts. You’ll be in charge of keeping on top of our pipeline, emailing and calling teachers and principals, and closing deals. You should be passionate about education and excited about helping educate students in computer science all over the world.<p>Responsibilities\nRespond to inquiries from teachers, principals, and superintendents\nQualify leads and prioritize your time\nWork with a team and individually\nExplain the features and benefits of CodeHS<p>=====\nTutor Experience&#x2F;Community Manager\n=====\nDescription\nCodeHS has a global network of tutors helping students learn to program all over the world. You will be in charge of managing the tutors and tutor recruitment process, helping maintain tutor quality, and making the tutoring experience fun and rewarding.<p>Programming experience required, or ability and desire to pick up programming quickly!<p>Responsibilities\nManage current tutors on site\nReview tutor performance\nFind College CS Majors to hire as remote tutors\nCommunicate between students, schools, and tutors to see how tutor feedback is working<p>=====\nLead Content&#x2F;Curriculum Developer\n=====\nDescription\nCodeHS is always looking to expand and improve our content. Help lead efforts to teach new concepts, new languages, and new tools to students all over the world. Significant programming epxerience required, and experience teaching computer science at the high school or college level is a signifiant bonus.<p>Details of Role\nDegree in computer science\nExcited about learning and teaching programming\nWants to be creative about making learning progamming fun and engaging\nTaught computer science at high school or college level, or significant experience creating learning materials or tutorials<p>=====\nShort Term Sales Job\n=====\nDescription<p>This job pays hourly. Help us sell CodeHS to schools.\nRespond to inquiries from teachers, principals, and superintendents\nQualify leads and prioritize your time\nWork with a team and individually\nExplain the features and benefits of CodeHS<p>=====\nCodeHS Tutor\n=====\nPART TIME\nDescription\nHelp out students all over the world who are learning to program. You will be a member of the CodeHS tutoring community, and help answer questions, give feedback, and do grading. This job is open to college computer science students, and in limited cases high school students or other programmers.<p>Details of Role\nCurrent computer science student at a university\nFluent in English\nExcited about learning and teaching programming\nGet paid to help others\nFlexible hours, remote working","time":1375393375,"type":"comment"}