{"by":"SocialAlex","id":6143730,"parent":6139927,"text":"San Francisco, CA; Full-time, permanent<p>&lt;--Ruby&#x2F; JavaScript Polyglot--&gt; \nSocialChorus         \nwww.SocialChorus.com\n-----------------------------------------------<p>You:\nYou are a Senior Software Developer interested in Ruby and JavaScript, who enjoys being challenged daily and always wants to improve your programming skills. You do agile (concentration in Extreme Programming), test-driven, and pair programming to ensure you find great solutions quickly.<p>The Position:\nOur stack consists of two user-facing Rails applications with Backbone on the client. We also have a series of services written in both node.js and pure Ruby. This means our days are a combination of green-field work and legacy code refactoring. A lot of our challenges are around managing the asynchronicity of service-oriented architecture and we are starting to have opinions about how to make that easier, as well as the young gems to support those opinions: <a href=\"https://github.com/socialchorus/cumuli\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;socialchorus&#x2F;cumuli</a>, <a href=\"https://github.com/socialchorus/superbolt\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;socialchorus&#x2F;superbolt</a>. We’re also starting to tackle our big data problem and our design is moving more and more toward the hexagonal side of Rails.<p>Us:\nAt SocialChorus, we want to invest in our devs and give them the opportunity to become stronger by offering them courses, taking them to conferences (in &amp; out of the Bay Area), and bringing in industry gurus, like Sandi Metz, to mentor the team.<p>We believe that people should be dedicated to their jobs, but also lead a balanced work&#x2F;personal life. Our development environment is casual, flexible and full of people who are passionate about their job. The office is located on one of the busiest streets in San Francisco, allowing access to various cafes and places to grab a bite. We also have a stocked fridge and a never ending shelf of snacks, so you will not go hungry.<p>Perks:\nOther than having all the fun stuff that a start up has, we also offer great benefit packages. This is a full-time, salaried position offering stock options, paid vacation, and benefits: medical, dental and 401k. The position is located onsite at our office in San Francisco, CA. We actively promote diversity and encourage all qualified candidates to apply.<p>If this sounds like your type of job and SocialChorus is the next place you want to work, please send us an email at alexandra@socialchorus.com","time":1375393260,"type":"comment"}