{"by":"manolofan","id":6143401,"parent":6139927,"text":"NewsCred - NYC - Full-time, permanent - (www.newscred.com)<p>Our mission: To build the conduit through which every piece of journalistic content in the world flows. We&#x27;re doing this by reinventing the way content is distributed, consumed, and shared across the social web.<p>About the company:<p>NewsCred is the world’s leading syndication platform for high quality journalism.  Our mission is to build the conduit through which every piece of journalistic content in the world flows.  We&#x27;re doing this by reinventing the way content is distributed, consumed, and shared across the social web.  Along the way, we&#x27;re breathing new life into the news industry, an institution with fundamental importance to our lives.<p>The Work<p>NewsCred was founded by three engineers; our commitment to pushing the technology envelope is encoded in our DNA.  Whether you&#x27;re:<p>•\timproving our search infrastructure using the latest techniques in information retrieval and natural language processing, or\n•\tanalyzing terabytes of usage logs to discover what content performs best for our customers, or\n•\tbuilding a revolutionary content consumption UX,<p>you&#x27;ll get to pick the best tools for the job.  We encounter unprecedented challenges everyday.  You’ll be the architect and implementer of the solution.<p>The Stack<p>We’re not dogmatic about specific technologies but here’s a list of some of the stuff we’re using:<p>•\tPython\n•\tSolr\n•\tDjango\n•\tBackbone.js\n•\tMySQL\n•\tMongoDB\n•\tPuppet<p>The Team<p>The engineering team at NewsCred consists of some of the most brilliant, considerate, and fun-loving people you’ll ever meet.  We’re really diligent about who we hire so we can be sure that everyone has a great shot at being both successful and happy.<p>We organize ourselves into small, autonomous teams that are as self-sufficient and independent as possible.  This allows us to maintain our scrappy, entrepreneurial culture as we grow.<p>About You<p>You love creating software so much that it’s disconcerting to your family and friends.  You’re an expert in your favorite technologies. You find few things as satisfying as reading and writing beautiful code. You want to push some code on your first day. You’re irresistibly curious about the latest emerging technologies.  You may or may not have a computer science degree.<p>The Perks<p>•\tCompetitive salary \n•\tInsurance - medical, vision, and dental\n•\tFree monthly metro cards\n•\tAwesome office in the Flatiron District of Manhattan\n•\tHappy hours on Thursday\n•\tFree lunch on Fridays\n•\tOutings with the team - karaoke, bowling, funky formal, kickball team\n•\tSimple vacation policy: “Be reasonable”","time":1375389966,"type":"comment"}