{"by":"leif","id":6143833,"parent":6139927,"text":"Tokutek is hiring in Lexington, MA - Full Time - Technical Support Engineer<p>Tokutek delivers next generation storage technology for the database world.  We develop the open-source, high-performance Fractal Tree indexing library (<a href=\"http://github.com/Tokutek/ft-index\" rel=\"nofollow\">http:&#x2F;&#x2F;github.com&#x2F;Tokutek&#x2F;ft-index</a>) and its integration into MySQL as TokuDB (<a href=\"http://tokutek.com/tokudb-for-mysql\" rel=\"nofollow\">http:&#x2F;&#x2F;tokutek.com&#x2F;tokudb-for-mysql</a>) and into MongoDB as TokuMX (<a href=\"http://tokutek.com/tokumx-for-mongodb\" rel=\"nofollow\">http:&#x2F;&#x2F;tokutek.com&#x2F;tokumx-for-mongodb</a>).<p><a href=\"http://tokutek.com/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;tokutek.com&#x2F;careers</a> (the QA position has been filled and will be taken off this page soon)<p>We are looking for a full-time Technical Support Engineer to join our product development team. This position interacts directly with customers, troubleshooting issues and working closely with engineering to resolve bugs. Ideal candidates have 5+ years experience in software support and a background in databases. The position reports directly to the VP of Engineering.<p>Responsibilities<p>- Work with customers, community users, and evaluators to resolve issues<p>- Create issue reproducers for internal test&#x2F;fix process<p>- Identify areas of needed improvement in product features, usability, and documentation<p>- Participate in our ongoing development process improvements (CI, release engineering, etc.)<p>Requirements<p>- Experience using&#x2F;testing relational databases (SQL, architecture, schema), MySQL is a plus<p>- Ability to work independently in an entrepreneurial, start-up environment<p>- Comfortable in Linux (usage and scripting)<p>- Excellent verbal and written communication skills<p>- Solid testing skills<p>Desirable<p>- Experience with MongoDB<p>- Application development skills (C, C++, Python, Perl, Java, Ruby, PHP)<p>Location: Lexington, MA","time":1375394092,"type":"comment"}