{"by":"justinsw","id":6144737,"parent":6139927,"text":"Solum, <a href=\"http://solum.ag/\" rel=\"nofollow\">http:&#x2F;&#x2F;solum.ag&#x2F;</a> -- San Francisco, CA (SOMA) -- full-time, permanent, local<p>Solum is looking for talented and passionate senior engineers to design and build our data management systems, develop advanced analysis tools to leverage this data for agricultural management, and create great user interfaces for customer-driven data analysis and visualization.<p>We&#x27;re creating new technology to make the business of agriculture simpler and more productive. We develop software, analysis services, and new soil measurements to help growers and their advisors manage farms efficiently, improve crop yields, and optimize use of inputs. Solum is bringing the best of cloud, mobile and big data analytics technology to agriculture.  There&#x27;s a huge need for better software services to be developed for agriculture, to help them better manage their data, incorporate new data layers, and make more informed data-driven decisions.  Come help Solum make agriculture more efficient and better for the environment while increasing grower&#x27;s profits.  We&#x27;re a small team and this a great time to be joining!<p>Feel free to email me (address in profile), or apply directly via <a href=\"http://www.indeed.com/cmp/Solum/jobs/Senior-Web-Developer-8f0c59771f0ccf46\" rel=\"nofollow\">http:&#x2F;&#x2F;www.indeed.com&#x2F;cmp&#x2F;Solum&#x2F;jobs&#x2F;Senior-Web-Developer-8f...</a> .<p>=====================================<p>Senior Web Developer:\n - Work closely with other developers, product management and data scientists to design and develop high performance, scalable web-based applications for analysis and visualization of agricultural data as well as large scale crop planning and management.\n - Develop tools to support internal data analysis and R&amp;D\n - Passion to do something new and different with your hard-earned software development skills!\n - deep experience with at least one common web stack, willingness to learn new technologies.  Our stack is mostly python &#x2F; django &#x2F; postgres &#x2F; jquery at the moment.\n - Experience designing relational database schemas to support high performance, scalable web applications\n - iOS &#x2F; Android experience a plus\n - geospatial data experience a plus<p>About Solum:\nSolum is a venture-backed start-up headquartered in the SOMA district of San Francisco. The company also has a significant presence in Ames, Iowa, where it operates a state-of-the-art soil testing laboratory. The company is backed by Khosla Ventures, Andreessen Horowitz and Google Ventures. Our team of 25 people are experts from a broad set of disciplines -- software development, data science, chemistry, physics, agronomy, and business.<p>Since the introduction of precision farming technology and techniques over 15 years ago, advanced growers and their advisors have generated significant volumes of geospatial data about their soils, crops and yields. However, the current industry desktop software packages make it difficult to manage this data and turn it into actionable information. Solum is developing a cloud and mobile-first software platform that will greatly simplify the transport, storage, analysis, and sharing of precision agriculture data. Solum&#x27;s intuitive interface gives crop advisors and growers access to the information they need to make critical agronomy and farm management decisions in the field.","time":1375404785,"type":"comment"}