{"by":"clogan","id":6144282,"parent":6139927,"text":"<i>Boston, MA</i> - Associate Software Engineer (Local, Full-time) - Communispace (www.communispace.com)<p>We are a small team within a medium-sized company looking to deepen our bench and increase our capabilities through the addition of great engineering talent.<p><i>A bit about us:</i><p>* We&#x27;re the leader in market research online communities and develop software to enable consumer collaboration.<p>* We use the latest tools, in the past few months the biggest focus has been on JavaScript, ASP.NET MVC, and Objective-C, but Java (Android) is getting added to the mix soon. We operate in a continuous integration environment, and we have a passion for  writing beautiful code validated by automated tests. If you have used GitHub, Jenkins, Selenium and Visual Studio in the past you&#x27;ll be very comfortable here.<p>* We apply Lean-Agile principles (specifically Kanban) to a large extent, and though we are diligent we are far from dogmatic; getting stuff done is job #1.<p>* We hold two hackathons per year: one for engineering and one for the entire company!<p><i>A bit about you:</i><p>* You&#x27;re interested in joining a small team of experienced software engineers and want to touch lots of different parts of the product and platform.<p>* You always want to get up to speed quickly and constantly challenge yourself to learn new things.<p>* You love solving interesting problems with technology.<p>* You just plain love technology!<p>* You want a work environment characterized by a strong culture where you are expected to lean-in but it&#x27;s okay to kick-back (usually with a good beer in hand).<p>We are located near <i>Boston&#x27;s Innovation District</i> and just a short walk from South Station. We offer a competitive salary and great benefits. I can honestly say that I love coming in to work every day and I think most HN readers would find likewise. If you are interested, learn more about us and submit an application here: <a href=\"http://www.communispace.com/careers/careers.aspx?jvi=oVyIXfwS\" rel=\"nofollow\">http:&#x2F;&#x2F;www.communispace.com&#x2F;careers&#x2F;careers.aspx?jvi=oVyIXfw...</a>. You can email me with questions specific to the role at clogan [at] communispace.com. Please use the subject line: &quot;Associate Engineer - HN&quot;. Applicants only. No recruiters!","time":1375399093,"type":"comment"}