{"by":"dougMarttila","id":6144816,"parent":6139927,"text":"Cambridge MA Ruby on Rails developer.\nPatientsLikeMe is looking for a Senior Software Engineer to join our team. If you want to work with great people for a well-funded startup on a web app that that matters, we want to talk to you. Come make a difference in patients&#x27; lives with us!<p>You should have at least 5 years web application development experience. We use Ruby on Rails, PostgreSQL, CoffeeScript, Sass, jQuery, and Haml. While Rails and PostgreSQL knowledge is desirable, familiarity with other object-oriented web frameworks (Python, Java) and databases (MySQL, Oracle) is fine. Experience beyond coding, such as leading teams and working with internal or external customers, is also a plus.<p>In this position, you will be expected to:  \nParticipate in all stages of software development - from early brainstorming to coding and bug fixing  \nWrite excellent, performant code and associated tests\nDiscuss product requirements with others, both inside and outside of engineering<p>Requirements:  \n5+ years developing web applications  \nExperience with object-oriented application frameworks (Ruby on Rails, Python, Java, C++, .NET)  \nExperience designing database schemas and writing queries (PostgreSQL a plus)\nExperience working with software teams and using source control. We use Git.\nBe a good teammate. We&#x27;re a team that really likes working together. No jerks, please.<p>Other desirable experience:  \nUI or graphic design skills\nHealthcare, patient services, or biostatistics background\nExperience building web communities<p>Benefits: \ncompetitive salary, stock options, 20 days vacation, 10 holidays, telecommuting two days a week, flexible schedule, health and dental, ping pong, darts, yoga, weekly free lunch and a company discussion&#x2F; presentation - usually by industry leaders in health and technology. Your teammates are also musicians, homebrewers, artists, gardeners, athletes and all-around great people.<p>Learn more about life at PatientsLikeMe here (<a href=\"http://www.patientslikeme.com/about/careers/22\" rel=\"nofollow\">http:&#x2F;&#x2F;www.patientslikeme.com&#x2F;about&#x2F;careers&#x2F;22</a>).  This job is eligible for the $2,000 referral bonus.<p>To apply for this position, please email your resume to careers@patientslikeme.com.","time":1375406337,"type":"comment"}