{"by":"Christine_Ren","id":6145930,"parent":6139927,"text":"Wiredcraft - Shanghai, China &amp; San Fransisco - Full-time &amp; Intern - (<a href=\"http://www.wiredcraft.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.wiredcraft.com</a>)\n--sales--<p>We&#x27;re a fast growing team with a presence in Shanghai and SF helping startups, Fortune 500 and governments tackle technological challenges. Our clients include the United Nations, CNN, Nvidia, Popcap Games, Axel Springer and the World Bank among others. We are working with cutting edge technology and at scale. Part of our team is also working on our own product (<a href=\"http://devo.ps\" rel=\"nofollow\">http:&#x2F;&#x2F;devo.ps</a>), building a SaaS solution to a very complex and ambitious problem.<p>Our team is mostly composed of engineers and we are currently looking for people to help us scale our sales effort. We are looking for both full time and interns to join us starting now.<p>----------<p>What you would do<p>Depending on your skills and interest, you would be involved with the following sales responsibilities:<p>-Scale our existing sales channels,\n-Develop new sales channels,\n-Build up new partnerships,\n-Develop new business opportunities,\nKeep in mind that we provide both services and product, both of which you would likely get a chance to help us with.<p>----------<p>What we expect from you<p>More than anything else, we are interested in hiring smart and motivated people. You background is secondary (one of our staff used to be a fireman), but it would be nice of you to:<p>-Not be an arse,\n-Have a broad understanding of our space (technology, data and large organizations),\n-Want to be challenged and learn (which probably imply failing at first),\n-Speak English fluently (native English speaker would be preferable).\n-Bonus points for people with experience in online sales and online marketing, especially with analytics tools.<p>Why joining us?<p>* Our clients rock.\n* Our team rocks.\n* We build awesome technology (not that you would care that much).\n* We take extremely good care of our colleagues.\n* We&#x27;re very much a startup: you&#x27;ll get to actually build stuff and take decisions, having an impact on the future of our company.<p>Send us your Github profile at bot@wiredcraft.com or ping us on Twitter and Weibo.\nWant to know more? Check out <a href=\"http://wiredcraft.com\" rel=\"nofollow\">http:&#x2F;&#x2F;wiredcraft.com</a> and <a href=\"http://devo.ps\" rel=\"nofollow\">http:&#x2F;&#x2F;devo.ps</a>.","time":1375432292,"type":"comment"}