{"by":"jingsong","id":6145597,"parent":6139927,"text":"Sr Software Engineer | SF | Full-time | H1B | FiveStars (<a href=\"http://www.fivestars.com/story/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fivestars.com&#x2F;story&#x2F;</a>)<p>Apply here: <a href=\"http://hire.jobvite.com/j/?aj=oj3TWfwV&amp;s=Hacker_News\" rel=\"nofollow\">http:&#x2F;&#x2F;hire.jobvite.com&#x2F;j&#x2F;?aj=oj3TWfwV&amp;s=Hacker_News</a> or email: dev(dot)jobs(at)fivestars(dot)com<p>Why you should apply:  \nHere at FiveStars, we take pride in that we&#x27;re not your typical web company.  Our product faces both business owners and users, which places unique demands on our engineering team.  Our web developers have built an API that interfaces with our desktop application, an analytics and tool-based dashboard for business owners and managers, and a consumer facing web application.  The breadth of challenges we face is unparalleled -- whether that be handling and analyzing immensely large and interesting datasets or developing user experiences for millions of individuals.<p><pre><code>  You&#x27;ll be responsible for the following:\n  + Plan, architect, develop, release and iterate on web features\n  + Work across the entire web stack, from frontend to backend to database\n  + Learn quickly and adapt to the rapidly changing web environment\n  + Maintain, administer and improve system, network, and deployment infrastructure\n  + Love to pair program and don&#x27;t mind reviewing code (maybe even enjoy it)\n\n  Why we should want you:\n  + 3+ years of experience developing and releasing web applications\n  + Expert knowledge using MVC frameworks in rapid-iteration environments\n  + Experience with open source database technologies in production environments\n  + Familiarity with MongoDB&#x2F;Redis\n  + Direct experience scaling application code and databases for millions of users\n  + Making pages with HTML&#x2F;CSS isn&#x27;t a problem\n\n  Why we should really want you:\n  + Expertise in Django and Python\n  + Developed scalable RESTful APIs for production use\n  + Knowledgeable about web security and authentication protocols like OAuth\n  + Experience with managing asynchronous job queues and workers\n  + Experience setting up, configuring, and managing replication on Postgres&#x2F;MongoDB&#x2F;Redis</code></pre>","time":1375424715,"type":"comment"}