{"by":"Christine_Ren","id":6145038,"parent":6139927,"text":"Wiredcraft - Shanghai, China &amp; San Fransisco - Full-time &amp; Intern - (<a href=\"http://www.wiredcraft.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.wiredcraft.com</a>)<p>-- Web developer --<p>We are a mix of specialists and jack-of-all-trades working on challenging projects. We focus on technology, but are problem solvers before anything else. Depending on your interests and skills, you may work on one of our products (like devo.ps) or with our partners at Wiredcraft, building solutions for the World Bank, the UN, CNN or MTV.<p>Either way you will be challenged on a day-to-day basis, working with cutting edge technology within a great team. All of that out of our awesome Shanghai office (yes, in China).<p>What we&#x27;d like you to have?<p>- Serious programming skills. We&#x27;re not focused on one technology in particular (we can train you), but be prepared for a    lot of Javascript: node.js, express.js, backbone.js, marionette.js...<p>- Passion for learning and shipping. We constantly challenge our own positions on development and spend a good deal on experimenting with new things, but at the end of the day we focus on shipping. We apply our own flavor of scrum and encourage high participation and collaboration.<p>- We could go on and on about all kinds of other traits that job ads usually mention (&quot;attention to detail&quot;, &quot;team player&quot;...), but we&#x27;re convinced that if you&#x27;re good at what you do and love practicing your craft these are more or less incidental.<p>- Bonus points if you have experience with Open Source, UI and UX, data visualization, DevOps, performance or scalability.<p>Why would you want to join our team?<p>- You&#x27;ll have great colleagues and work out of an awesome office in downtown Shanghai,\n- You&#x27;ll learn a ton, working with great technology on challenging projects,\n    * We&#x27;ll make sure you have the right tools and throw in a few perks:\n    * A Macbook Air and additional displays,\n    * A Ergohuman chair (or an exercise ball if that&#x27;s your thing),\n    * Flexible hours (and no overtime),\n    * Free snacks and drinks,\n    * Weekly team lunch and monthly team dinner,\nAgain, we&#x27;re based in Shanghai, China. We&#x27;re currently establishing our US presence in San Francisco. Don&#x27;t worry, we all speak English - French and Chinese staff included.<p>Send us your Github profile at bot@wiredcraft.com or ping us on Twitter and Weibo.","time":1375411322,"type":"comment"}