{"by":"ayers","id":6147669,"parent":6139927,"text":"Who we are:\n<a href=\"http://www.intelligentreach.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.intelligentreach.com</a><p>Intelligent Reach is a market leading on-line Digital marketing agency and technology vendor.  Through direct client relationships with leading retailers such as Debenhams, House Of Fraser, Argos, Shop Direct, Carphone Warehouse, Halfords and through top media agency partnerships Intelligent Reach manages and optimises over £3bn in client revenue across Shopping Comparison, Affiliates, Marketplaces (eBay, Amazon and Play), Paid Search and Display channels. Intelligent Reach now has over 75 clients in the UK, US, Germany, France and Australia and is growing at a phenomenal rate.<p>==================================<p>Currently looking to fill two roles:<p>Victoria London, UK | Full-time | QA Developer<p><i>You will work closely with the QA Project Manager and development team to ensure delivery of high quality work.  You will be working on new and exciting projects using the latest Microsoft Technologies.  This position is open to all experience levels as we are looking for the right person above all else.  You will have the help and support to learn new skills on the job.</i><p><i>Tools you will be using\nC# .Net 4.5 | Microsoft Coded UI Tests | TFS 2012 | PowerShell | MSBuild</i><p>==================================<p>Victoria London, UK | Full-time | Software Developer (Full stack, with main focus on the front end)<p><i>You will be working directly on our client tools and platform.  You will need to be comfortable switching from JavaScript to C# to SQL to MDX to get the job done.  Most of the work in this role will be front end focused but you will need to be able to work on all the layers and implement these along the way.</i><p><i>Advantageous to have experience with SQL Server Analysis Server and MDX queries.</i><p><i>JavaScript | jQuery | HighCharts | TypeScript |\nASP MVC 4 | C# .Net 4.5 | MS SQL Server 2012| SSAS | SSIS | MS Testing Framework |\nTFS 2012</i><p>==================================<p>Applying:<p>When applying please put in the subject which job you are applying for.\nDeveloper HN Aug 2013 or QA Developer HN Aug 2013<p>jobs@intelligentreach.com<p>I am one of the developers you will be working with, so please feel free to contact me personally with any questions or to find out more about the roles.\nsteve.ayers@intelligentreach.com<p>edit: formatting","time":1375458520,"type":"comment"}