{"by":"ryguytilidie","id":6149322,"parent":6139927,"text":"Optimizely - San Francisco, CA - Fulltime, Permanant.  Intern&#x2F;H1-B okay as well.<p>Optimizely is a website optimization platform. We enable businesses to show the right thing to the right person at the right time.<p>Our first product makes A&#x2F;B Testing easy. In 2 years we’ve grown to become #1 in the category with 4,000+ paying customers including Starbucks, Disney, and Marketo.\nWe&#x27;re profitable and our revenue is growing 400% year-over-year.<p>Join us in our mission to empower businesses to make better data-driven decisions.<p>About the Job:<p>We have scale: 4,000+ customers (including 100 of the top websites in the world); 15 billion server requests&#x2F;month\nYou’ll work on our amazing visual editor - a cutting edge tool that is the core of our product - and will enable it to do even more awesome things for our customers\nWork in small teams, in a continuous integration environment; we’re fast and nimble: 1-2 deployments every day<p>About Us:<p>You’ll work on our amazing visual editor - a cutting edge tool that is the core of our product - and will enable it to do even more awesome things for our customers.<p>Requirements:<p>A track record of being able to ship product, independently and&#x2F;or as part of a small team\nA strong body of prior front end work, including significant projects written in JavaScript\nMastery of JavaScript; expertise in most of the following technologies, and proficiency in all of them: jQuery, CSS, HTML5, AJAX, Google Closure tools\nDeep understanding of closures, prototypal inheritance, DOM manipulation, HTTP, web security, cross browser compatibility challenges<p>Bonus Points:<p>Passionate about front end technologies, you have a curiosity that motivates you to experiment and keep on top of technical trends\nPractitioner of progressive enhancement, and responsive UI design\nGood at debugging using dev consoles, firebug, firecookie, or any of your favorite tools\nFearless - you’ll tackle a massive JavaScript codebase, and are willing to prototype crazy, awesome ideas\nPerks:<p>Free city-wide Gym membership at any Crunch Fitness.\nFree Clipper Card to pay for your commute from anywhere in the bay area.\nCatered in-office lunch and dinner on weekdays.\nFull medical insurance with very low co-pay and deductible. HMO, PPO, and HSA options available.\nFull dental coverage including orthodontics.\nFull vision coverage including contacts.\nDependents 100% covered for medical, dental, and vision.\nUnlimited vacation policy.\n401k benefit.\nTop-of-the-line MacBook Pro or MacBook Air and 30&quot; monitor.\nWorking with a great team and having a huge impact!<p>If you&#x27;re interested, please shoot me an email at Ryan.Jordan@optimizely.com!","time":1375473714,"type":"comment"}