{"by":"jacobcohen","id":6157608,"parent":6139927,"text":"David Yurman -- New York, NY -- Full-time contract, 3 months+\n<a href=\"http://www.davidyurman.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.davidyurman.com</a><p>Project Manager (mid-level)<p>David Yurman is in search of a project manager experienced in e-commerce to manage the re-platforming of our main site.<p>The main responsibilities of this position will be to manage the day-to-day workflow and production of digital creative projects including but not limited to davidyurman.com e-commerce re-platform, site refreshes, campaigns, homepages, landing pages, mobile &#x2F; tablet, e-mail marketing, and managing creative development of assets such as photography and video.<p>•\tProject management - Candidate should be comfortable managing projects from concept to execution, and should have past experience managing the launch of online product as part of a team. Successful candidates will have experience with e-commerce platforms and workflow as well as interest in the fashion&#x2F;luxury space.<p>•\tTechnical Team Management - Candidate should be comfortable managing a mix of UX and front-end and back-end development teams working remotely. This includes being familiar with HTML&#x2F;CSS &amp; JS. A basic understanding of Java and Java-based platforms is a plus.<p>•\tUser Experience - Candidate should be familiar with reviewing user flows, wireframes and functional spec documentation. Experience with large-scale e-commerce sites (3,000+ SKUs) is a plus.<p>•\tCreative Management - a creative background would be ideal, however the candidate should be familiar enough that he&#x2F;she can communicate creative needs to our agency partners.<p>•\tFamiliarity with Photoshop and Illustrator - Position does not require previous Photoshop&#x2F;Illustrator design work, but a familiarity with these programs is helpful in our everyday handling of assets.<p>resumes and introductions:\njacobcohen [at] davidyurman [dot] com","time":1375660401,"type":"comment"}