{"by":"emcienjobs","id":6173498,"parent":6139927,"text":"Emcien - Vinings, GA (Atlanta) - Full-time, Permanent - Frontend Engineer<p>Emcien offers a suite of analytical applications that reveal patterns in data streams and actionable\ntasks for fun and profit. Emcien&#x27;s analytics are based on innovative technology that leverages\nproprietary graph algorithms to eliminate the need for tedious data modeling and long implementation\ncycles. Our stack is primarily Ruby&#x2F;Rails, Coffeescript&#x2F;Backbone, and C with a smattering of other\ntech where useful.<p>We are seeking a frontend developer to add to our engineering-centered organization — Ideal candidate\nis mid-level and comfortable using their own judgment to work from loose specifications. You will\nmostly be working in CoffeeScript: creating visualisations in D3.js, or building frontend interactions\nin Backbone.js.<p>As a frontend engineer, a good understanding of backend and api development is required - your role will\nfrequently involve altering and understanding json endoints within Rails. Prior experience with Ruby or Rails is\nnot required; we are happy to teach you the language and framework.<p>Requirements:<p>- 1 year of professional experience with JavaScript or CoffeeScript<p>- Experience with a framework like Backbone.js, Angular.js, or Ember.js<p>- Basic experience with bumper pool, the game of kings<p>Attributes of a successful candidate:<p>- Experience with a backend framework like Rails, Sinatra, Express.js, Django, CakePHP, etc.<p>- Experience with a data visualization library such as D3.js<p>- Experience with Leaflet, Mapbox, or Open Street Maps<p>- Experience with a templating language (we use HAML and HAMLC) such as HAML, Handlebars, Mustache, etc.<p>- Experience with a dynamic stylesheet language such as Sass or Less (We do not expect you to be a designer)<p>- Experience working with databases (We use Mysql and MongoDB)<p>- Experience with Unix command line tools<p>- Experience with a (D)VCS (We use git)<p>Emcien offers a suite of analytical applications that reveal patterns in data streams and actionable\ntasks to maximize profit. Our apps are built on modern technology and focus on the use of\nproprietary graph algorithms to eliminate clients&#x27; needs for tedious data modeling and long implementation\ncycles.<p>Check out our Engineering Team:\n - <a href=\"https://engineering.emcien.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;engineering.emcien.com&#x2F;</a>\n - <a href=\"https://github.com/emcien\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;emcien</a><p>All about Emcien:\n - <a href=\"http://emcien.com\" rel=\"nofollow\">http:&#x2F;&#x2F;emcien.com</a><p>Notes:\n- Emcien does not sponsor any Visas.\n- All web developers must work out of our Vinings, GA headquarters.<p>To apply, please send:\n- Your resume\n- A list of any open-source projects you have contributed to, and the name under which you contributed","time":1375889887,"type":"comment"}