{"by":"jrfdiffeo","id":6173207,"parent":6139927,"text":"Diffeo -- Cambridge, MA -- Full-time, permanent -- <a href=\"http://diffeo.com\" rel=\"nofollow\">http:&#x2F;&#x2F;diffeo.com</a><p>-- Senior Python Engineer --<p>Diffeo is a big data startup building an entity-centric search engine. Instead of searching by keyword, Diffeo brings you updates about entities that you identify by URL, such as home pages of companies and online profiles.<p>Diffeo is developing novel machine learning algorithms and software to perform entity disambiguation on unbounded streams of text.<p>We seek talented researchers and software engineers who love Python and want to build self-tuning database middle-ware that runs probabilistic models on large clusters using NoSQL databases, like Cassandra and Accumulo.  For example, we are working on adding Salt Stack to our enterprise product, and use it to manage our own clusters.<p>We are applying state-of-the-art methods from natural language processing and information retrieval, including hierarchical probabilistic graphical models and inference algorithms such as MCMC. We have built a scalable tree-based architecture in Python to perform massively parallel computation over these models and processing large streams of data.  Diffeo&#x27;s products are focused on identifying structured entities (persons, organizations, etc.) in streams of unstructured text, enabling entity-based search and making it easy to monitor long-tail entities, such as companies in emerging markets or proteins relevant to your biomedical research.<p>Diffeo was founded by MIT people in Kendall square and actively collaborates with leading machine learning researchers.  We are funded entirely by customer revenue and are targeting government, financial, mobile, and pharmaceutical institutions.<p>Requirements:<p>-  Python<p>-  Passion for automation<p>-  Interest in machine learning<p>-  Desire to build the coolest tools<p><pre><code>  ****   See positions at  http:&#x2F;&#x2F;diffeo.com&#x2F;jobs  ****\n</code></pre>\njobs@diffeo.com","time":1375887069,"type":"comment"}