{"by":"jchoong","id":6184271,"parent":6139927,"text":"Booster.com – Boston,MA – Full-time, permanent – <a href=\"http://www.booster.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.booster.com</a><p>Booster is the new way to raise money for your cause, passion, or project. There are few startups that actually have a good cause, a sound business and great backing. We have all 3.<p>Join us to build a rapidly scaling platform that inspires and enables people to raise dollars and awareness for their passions and causes with custom merchandise.  We are a spin-out backed by our parent sponsor – CustomInk, a profitable, fast growing, top 200 e-tailer, and a top 500 places to work employer - we expect to grow rapidly, building both a brand and direct marketing strategy on a flexible technology stack that requires a sophisticated and ambitious coordinated effort.<p>Key Hires<p>-- Product Manager --\nA multi-talented product person with the vision to bridge business and engineering. Requires a person both detail oriented yet with a wide understanding and view of the business.  Requires you to be data driven as well as capable of making intuitive calls.<p>-- Engineering Lead, Senior Engineer, Engineer (Rails &amp; JS) --\nLooking for smart engineers. We’re on CoffeeScript, Rails, Jenkins, Capistrano, New Relic and deploy multiple times a day. \nEveryone pushes to production supported by a clean stack and a solid process.\nOur MVP has done well. But now, we need you to help build the next version and fill out the vision (hint: it’s much more than what you see!).<p>-- Visual Designer with an understanding of UI&#x2F;UX --\nIt’s one thing to make things look good. But if you can make it look AND work good, that’s where we should talk. You will play a role in helping shape the voice, tone and feel of the site while ensuring the brand is integrated and interweaved on the site.<p>If you’re interested, please send your resume, sites,  linkedin, dribbble, github or equivalent as applicable to<p>jchoong@booster.com<p>Janssen Choong\nCTO, Booster.com","time":1376034834,"type":"comment"}