{"by":"stavrospap","id":17444099,"parent":17442187,"text":"TileDB, Inc.  | Senior Software Engineer | Cambridge, MA or REMOTE (US)  | tiledb.io<p>TileDB, Inc. leads the development of the open source TileDB array data management software. The company closed a $1M seed in May 2017 led by Intel Capital and Nexus Venture Partners (<a href=\"http:&#x2F;&#x2F;www.businesswire.com&#x2F;news&#x2F;home&#x2F;20171019005449&#x2F;en\" rel=\"nofollow\">http:&#x2F;&#x2F;www.businesswire.com&#x2F;news&#x2F;home&#x2F;20171019005449&#x2F;en</a>), and is looking to raise a Series A round in the upcoming months.<p>TileDB has been featured on HN: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=15547749\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=15547749</a>.<p>TileDB GitHub repo: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;TileDB-Inc&#x2F;TileDB\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;TileDB-Inc&#x2F;TileDB</a><p>Array data volumes are increasing in genomics, earth science, imaging, and other sensing applications, and TileDB is meeting the challenge head-on. We are a small distributed team looking to aggressively adapt TileDB to better take advantage of distributed storage and compute backends in the hybrid local-and-cloud domain.<p>We are primarily looking for someone to help us transition scientific data storage and analysis to the cloud.  Anyone who has experience in the following areas is welcome to apply:<p><pre><code>  - Cloud object storage and compute\n  - Spark &#x2F; Arrow integration\n  - Scalable REST server &#x2F; services and APIs\n  - SaaS services around access control, data sharing, and encryption\n</code></pre>\nAdditionally, we would be interested in a candidate with experience in one or more of the following areas: Scientific data storage &#x2F; analysis, modern C++ (C++11 and later), parallel and&#x2F;or distributed programming, compute or I&#x2F;O performance optimization, genomic data formats &#x2F; libraries (such as bam, vcf, htslib, bcftools, etc.), encryption &#x2F; security.<p>Our headquarters are located in Cambridge, MA. To cope efficiently with the different time zones and hiring processes, priority will be given to candidates that are located in the US, and are US citizens or permanent residents.<p>Apply at <a href=\"https:&#x2F;&#x2F;tiledb.workable.com\" rel=\"nofollow\">https:&#x2F;&#x2F;tiledb.workable.com</a><p>Contact us at careers@tiledb.io with questions.","time":1530555344,"type":"comment"}