{"by":"bellwether","id":17448794,"parent":17442187,"text":"CareerBliss | Irvine, CA | Growth Hacker Lead | REMOTE, Full-time | <a href=\"https:&#x2F;&#x2F;www.careerbliss.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.careerbliss.com&#x2F;</a><p>CareerBliss is a resource and community for job seekers. We provide users with career research, company reviews, job postings and email alerts.<p>We are comprised of an entrepreneurial team looking to expand its reach into F1000 companies and agency accounts in the talent acquisition space.  The Growth Hacker Lead will be an integral component in CareerBliss’ next growth phase.  We are looking for professionals that have successfully implemented a research and test-based growth strategy at previous companies. While the near-term goal for this position is to identify key ways to improve engagement with our existing user base, we are looking to this candidate to take ownership of our long-term growth strategy, including new user acquisition and project direction.<p><i>Responsibilities</i>\n- Create a growth strategy for existing email and website users\n- Identify and become an advocate for the features users love the most\n- Create a growth equation that balances traffic, non-monetized content, and monetized content across email, web, and mobile platforms\n- Take ownership over reporting and growth timelines<p><i>Skills</i>\n- Experience leading growth strategies at small to mid-size companies\n- Proven track record of conducting surveys and running growth experiments\n- Strong written and verbal communication skills\n- Demonstrate leadership qualities and ability to produce in an independent environment\n- Experience using GrowthHackers.com<p><i>Qualifications</i>\n- BA&#x2F;BS degree (or equivalent training and experience)\n- 2-3 years experience leading growth experiments\n- Outstanding organizational skills, attention to detail, and the ability to handle multiple tasks in a fast-paced environment\n- Excellent data analysis and problem-solving skills\n- Strong SQL skills required; ability to right custom queries and reports in Microsoft SQL Server to expose “hidden” metrics<p>Come join a growing company with a great corporate culture and a passion for innovation. We are looking for someone who enjoys the startup atmosphere and is willing to rise to the occasion on new challenges.<p>If you are interested, PM me or send your resume to nadeem {dot} chaudhry {at} careerbliss {dot} com","time":1530610972,"type":"comment"}