{"by":"tnmade","id":17445231,"parent":17442187,"text":"MadeBeauty | Remote, anywhere in the world | Data Scientists and Software Engineers | Full-time<p>Position: Data Science Lead<p>I am looking for a senior data scientist who is highly proficient in economics, preferably with experience in price and revenue management. You will work on a completely new application of dynamic pricing technique and help create innovative pricing and utilization optimizations to small businesses, starting with the $60B beauty services industry. See more details about the position here: <a href=\"https:&#x2F;&#x2F;www.madebeauty.com&#x2F;data-science-lead.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.madebeauty.com&#x2F;data-science-lead.html</a><p>Compensation: $60-120K depending on experience + stock options.\nLocation: anywhere in the world.<p>Position: Frontend Engineer<p>I am also looking for a non-junior frontend web developer who will develop our website, our web-based booking system and our iOS and Android mobile apps for stylists and clients. You will be creating exciting new features, aesthetically appealing and easy-to-use UIs using modern web and mobile frameworks such as Angular and Ionic. \n<a href=\"https:&#x2F;&#x2F;www.madebeauty.com&#x2F;frontend.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.madebeauty.com&#x2F;frontend.html</a><p>Compensation: above market rate + stock options.\nLocation: anywhere in the world except USA.<p>Who am I:<p>I am the CTO and co-founder. I have been a remote worker, a full-stack developer and a head of a successful fully distributed Engineering team for the last 3 years. If you are looking for an interesting work in a company with great engineering and R&amp;D culture, in a team that is highly experienced in remote work then you probably cannot find a better place. Email me tigran@madebeauty.com and mention HN.<p>About the company:<p>We are MadeBeauty Inc, a remote-first technology-driven startup set to disrupt the beauty salon market in the US. We are bringing dynamic pricing and price segmentation to optimize supply&#x2F;demand and utilization of salons. We are creating the leading client facing booking application through the application of dynamic pricing, ultimately expanding and disrupting the multi-billion dollar market. The company is led by experienced technologists and entrepreneurs, we have reputable seed investors.","time":1530564552,"type":"comment"}