{"by":"misternugget","id":17447946,"parent":17442187,"text":"Deutsche Bahn &#x2F;&#x2F; ioki (ioki.com) | Backend Software Developer | Frankfurt am Main, Germany | ONSITE | Full-Time | Junior, Senior | <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;ioki-junior-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;ioki-junior-developer</a> and <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;ioki-backend-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;ioki-backend-developer</a><p>ioki is a complete service provider for digital forms of mobility on the road. We enable third parties, such as cities, transport companies or municipal authorities, to operate new types of demand responsive transport (DRT) mobility in public transport under their own name and design. To achieve that, we provide the ioki platform and mobile apps.<p>We are looking for software developers, from junior to senior, to join our Backend team, which builds the platform that helps our customers launch and scale their mobility products. We are a team of four that is central to ioki’s product development and wants to grow with its young codebase, which has seen a lot of production use already but is carefully maintained and free of technical debt.<p>Our main stack consists of Ruby and Ruby on Rails, but experience in the language or the framework is not a hard requirement. Much more than that, we care that you have general software engineering skills, high standards and take pride in your work.<p>If you want to read more about the job and how we work in our product company, check out the full job descriptions here:<p>- Junior Backend Software Developer - <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;ioki-junior-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;ioki-junior-developer</a>\n- Backend Software Developer - <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;ioki-backend-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;ioki-backend-developer</a><p>Interested? Send us an email with your CV&#x2F;GitHub&#x2F;StackOverflow and a few words about yourself: jobs@ioki.com<p>We&#x27;re also looking for Senior Android Developers, Project Engineer Autonomous Driving, Operations Managers and much more. You can find the rest of the job descriptions here: <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;hello-ioki\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;hello-ioki</a>","time":1530598285,"type":"comment"}