{"by":"abaron","id":17442467,"parent":17442187,"text":"LendKey | New York, NY or Cincinnati, OH | Full-time | ONSITE | $100k - $150k+ | Senior&#x2F;Lead Software Engineer, Platform Engineer, Data Engineer, UX Director | <a href=\"https:&#x2F;&#x2F;www.lendkey.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lendkey.com&#x2F;</a><p>Come help us build the next generation Lending as a Service platform.  We&#x27;re in an exciting transition phase where we need some key people to help break down our monolith into services.\nLendKey is a growth-stage lending technology firm that partners with credit unions and community banks to allow them to offer some of the most borrower-friendly loans in the industry (mostly in student loan &#x2F; student loan re-fi space).  LendKey enables these community financial institutions to bring loans to consumers online, making the end-to-end lending process easy &amp; simple for both borrowers and lenders.  Because we&#x27;re growth stage (founded in 2009, Series C) the team has the advantage of being at a stable company but still have elements of a start-up (115 employees currently).<p>What we offer:<p>•    Competitive Salary<p>•    Stock options<p>•    Unlimited Vacation Policy<p>•    Flexible work environment<p>•    Startup culture<p>•    Employee events&#x2F;activities<p>•    Good benefits<p>We&#x27;re looking for top tech talent in software, platform, data engineering, and UX.  \nWhat we&#x27;re seeking in all of these roles:\nTeam-members who are open to learning new technologies.  Brave enough to implement solutions to challenging problems.  Can be hands-on but also strategic.  Willing to speak your mind but kind to others when doing it.\nWe&#x27;re Ruby on Rails, Linux, Docker, but we&#x27;re actively searching for the next tool for the job.  For data&#x2F;reporting we are a SQL Server and MySQL shop, looking for Apache Hadoop, Kafka, Airflow and Amazon Redshift experience.<p>Shoot me an email at tony (dot) baron at lendkey.com with resume or questions! Don&#x27;t quite fit a defined role and things sound interesting?  Let&#x27;s see if we can work something out anyway.  I&#x27;m an engineer here.","time":1530545245,"type":"comment"}