{"by":"WonderKatalin","id":17448602,"parent":17442187,"text":"Wonderflow is a company based in Amsterdam (HQ) and Trento (R&amp;D) that aims to become the first worldwide supplier of consumer feedback analysis. Wonderflow has already helped several Fortune500’s to integrate consumer feedback analysis into their business processes from all over the world. Wondeflow’s clients are world-leading companies such as Philips, J &amp; J, Nestlé,\nTomTom, KLM, Beiersdorf, Samsung, De&#x27;Longhi, etc.<p>Wonderflow is looking for an experienced senior full-stack software developer for the Trento office for a full-time position, ONSITE. Applicants seeking remote or part-time employment and citizens outside the EU-zone won’t be considered for this position.<p>The candidate will work on scalable projects, in the context of integration, analysis and visualization of data, with particular attention to data security. Wonderflow prefers and pursues the use of Agile methodology and modern technologies.<p>The successful candidate is familiar with the following programming languages:\n● Languages: NodeJS, Javascript (ES5, ES6, ES7)\n● Database: MongoDB (or other NoSQL databases), Redis\n● Frontend: AngularJS, Angular, Redux, HTML, CSS preprocessors (SASS, LESS), build\ntools (Webpack, browserify)\n● Backend: Express, GraphQL &#x2F; REST APIs\n● Devops: Ansible, Docker, Kubernetes\n● OS: Linux<p>At least 3 years of experience is required with the following technical skills:\n● Development of end-to-end applications (planning, frontend, backend, testing, deployment,\nMaintenance and documentation)\n● Experience in the design of applications with particular attention to scalability, reliability, safety and performance\n● Knowledge and use of agile methodologies<p>Particular preference will be given to candidates who have experience with the technologies\nmentioned above and with projects concerning the integration, analysis and visualization of data. Strong motivation is required, problem-solving propensity, good written and spoken knowledge of the English language. It guarantees fast professional growth in a dynamic environment.<p>Salary range: 40k&#x2F;45k, on full-time bases, 40 hrs a week.<p>Are you interested, please email your CV to hr@wonderflow.co<p>Have a great day!","time":1530608895,"type":"comment"}