{"by":"apaugh","id":17442595,"parent":17442187,"text":"Recursion Pharmaceuticals | SLC, Utah | Onsite, full-time | We have raised over $80M to apply machine learning to one of the most unique datasets in existence - tens of millions of images of cells under a huge number of biological and chemical perturbations, generated in our own labs - in order to find treatments for hundreds of diseases. Our long term mission is to decode biology to radically improve lives - we want to understand biology so well that we can fix most things that go wrong in our bodies. Among other awesome folks, Yoshua Bengio is one of our advisors, and helps our ML team come up with novel ways of tackling these problems.\nWe’re looking for:\n* ML researchers: Looking for a highly experienced senior&#x2F;principal-level machine learning researcher who wants a challenging problem, lots of rich data, and knowledge that their breakthroughs will seriously help people. No bio background needed.\n* Biologists, computational biologists, automation scientists, and drug discovery experts.\n<a href=\"http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;careers</a> for more details and to apply.\nLogistics: Salt Lake City, Utah. Hiking&#x2F;running&#x2F;biking is literally out our back door, and it&#x27;s half an hour to 5 ski resorts. Great pay, health insurance, 401k, relocation assistance (onsite is required), equity, a top-caliber team, and help make a massively positive impact. Happy to sponsor&#x2F;extend visas, but you need to already be authorized to work in the US--we can’t handle the lottery at this stage.\nTech: Data science: python scientific stack (pandas, numpy, scikit-learn, matplotlib, bokeh, etc). Software engineering: go, python, angular.js, react, javascript on aws and gce. Deep learning (e.g. convolutional networks) we&#x27;re mainly using the python frameworks (keras, theano, tensorflow, etc).\nOur team of 99 so far: <a href=\"http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;team\" rel=\"nofollow\">http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;team</a>","time":1530546043,"type":"comment"}