{"by":"rwhitman","id":17442648,"parent":17442187,"text":"UpTrending | Front-end and Sr. Full Stack PHP Developers | Westlake Village, Los Angeles, CA | Full-Time | Remote<p>UpTrending is a technologist-centric digital agency, originally founded in Silicon Valley to service the marketing needs of venture-backed B2B software startups. Our clients include SAAS products, big data, AI and data security companies. We are experts in the marketing of B2B technology businesses, with our core service offering of strategy, website design, development and marketing integrations.<p>UpTrending has been a globally distributed team for our entire history. Though our HQ is now planted in Southern California, we have core team members across the globe from engineering to leadership.<p>We are growing our expert team to support the increasingly complex needs of enterprise-scale clients, and incubating game-changing data products of our own.<p>We are looking for a full-time experienced Front-End Web Developer and a full-time Senior PHP (Wordpress) Developer, to work with our clients in building their web presence. This is primarily PHP Wordpress, HTML, CSS but also looking for strong skills in Marketing Automation &#x2F; Integrations, Javascript, DevOps, Laravel, React, Vue, Angular devs as well.<p>Remote is OK as long as you are within a 5 hour time difference of USA Pacific timezone.<p>Details for Sr. Full-Stack Developer: <a href=\"https:&#x2F;&#x2F;uptrending.recruiterbox.com&#x2F;jobs&#x2F;fk01pem?source=HN\" rel=\"nofollow\">https:&#x2F;&#x2F;uptrending.recruiterbox.com&#x2F;jobs&#x2F;fk01pem?source=HN</a><p>Details for Front-End Web UI Developer: <a href=\"https:&#x2F;&#x2F;uptrending.recruiterbox.com&#x2F;jobs&#x2F;fk01pef?source=HN\" rel=\"nofollow\">https:&#x2F;&#x2F;uptrending.recruiterbox.com&#x2F;jobs&#x2F;fk01pef?source=HN</a><p>Also seeking to build out a bench of freelancers in PHP, frontend, Django, Python, Ruby on Rails, React and software architects &#x2F; data engineers to work on our homegrown BI tools. Details here: <a href=\"https:&#x2F;&#x2F;uptrending.recruiterbox.com&#x2F;jobs&#x2F;fk01peq?source=HN\" rel=\"nofollow\">https:&#x2F;&#x2F;uptrending.recruiterbox.com&#x2F;jobs&#x2F;fk01peq?source=HN</a><p>Or reach out to me at ron+hn@uptrending.com .<p><i>Please</i> if you email me, make sure to put &quot;HN&quot; + who you are in your subject, with a description of who you are and a resume &amp; profile.","time":1530546391,"type":"comment"}