{"by":"mands","id":17449639,"parent":17442187,"text":"NStack | London | FULL TIME, INTERNS | ONSITE, REMOTE<p>NStack provides an interface for analysts to build data science workflows in the cloud from a library of reusable predictive models. Our product powers predictions for millions of users each month, and our customers range from e-commerce businesses to F250 companies.<p>We’re primarily based in Central London, but have a mixed remote and onsite team. We’re funded by top-tier infrastructure investors from the West Coast, and the founders are both technical and ex-YC &#x2F; PhD. Salaries are competitive and include stock options.<p>We’re a tech heavy team with a flat structure and friendly atmosphere. We’re big believers in self-organising teams within an agile environment that put a heavy focus on creating user value first.<p>Our tech stack: Kotlin &#x2F; Java 8, Python 3, numpy&#x2F;scipy, Django, Typescript &amp; React, Apache Big Data projects, Linux &amp; Kubernetes<p>We’re hiring for the following roles:<p>- Frontend Developer (ONSITE) - We are looking for someone to lead the development of the front-end, developing on our existing workflow builder. We are open-minded in terms of technologies, but would be most comfortable architecting the product using React and TypeScript along with modern CSS UI libraries, so experience with these would be ideal. This will be a flexible role with a really unique scope for ownership and growth.<p>- Devops Engineer (ONSITE &#x2F; REMOTE) - We’re developing the NStack PaaS to run on top of Kubernetes and many Google Cloud services, and are looking for a DevOps engineer with a focus on data engineering, CI&#x2F;CD and deployment. The core NStack platform runs on the JVM using many tools from the Apache Big Data stack, along with large amounts of Python. We’re also heavy users of Linux containerisation, and NStack workflows are distributed on Kubernetes.<p>- Data Scientist (ONSITE) - We’re looking for an amazing Data Scientist to join our current data team to build reusable data-driven components and applications on the NStack platform. Ideally you’d have experience working as a data scientist in a team using Python (pandas, sklearn, numpy). Knowledge of the Big Data world (e.g. Hadoop, Spark, etc.), alongside an understanding of cloud and data infrastructure would be a bonus, as would experience with Bayesian statistical models and AutoML systems.<p>- Data Science Intern (ONSITE) - To join our growing Data Science team as described above<p>We’re looking at a range of positions and experience levels - whether you’ve just left uni or been hacking for 20 years, if you’re interested please get in touch. Any questions please comment, DM, reach out on email (jobs at nstack dot com) or at <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;nstack&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;nstack&#x2F;jobs</a>. Cheers!","time":1530621564,"type":"comment"}