{"by":"chenadmin","id":17445413,"parent":17442187,"text":"Chenmark Technology | Technology Associate&#x2F;Full Stack Developer | Portland, Maine | Full-Time | ONSITE<p>Chenmark Technology’s mission is to bring the best of modern technology to the world of small business. We’re looking for someone to join our small (but growing!) team to modernize the way our small businesses work, grow, and bring value to their customers. We&#x27;re highering for a full time Technology Associate &#x2F; Full Stack Developer.<p>Our current initiatives cover the range of API development&#x2F;integration, security and administration automation, data warehousing&#x2F;analytics support, custom line-of-business web application development, streamlining customer interaction, digital marketing and data analysis, and ongoing project support specific to individual companies (computer vision, stochastic modeling, and IT automation). We hope your experience would both add to this list and help support efforts already underway.<p>Chenmark Technology is a part of Chenmark Capital Management, a family-operated organization that acquires small businesses indefinitely to help them develop and grow. As part of the ownership team, our success is rooted solely in the success of the businesses we serve. We consider the development and use of technology to be a modern competitive advantage in the world of small business. As such, we are looking for someone that can communicate this passion and can share their expertise to help our companies innovate to the next level.<p>Our tech rides mostly on PostgreSQL, Python, R, Linux, some AWS&#x2F;Docker virtualization as well, in addition to supporting end users driving Windows&#x2F;Macs and some others. This list isn’t restrictive. We’re happy to consider the right tool for the job.<p>Our offices are in Portland, Maine, which you probably think is a bit north of the wall, but our weather is actually pretty comparable to Boston. As a popular vacation spot, we have every outdoor activity you can think of within a 20 minute drive, a renown local microbrew scene, and phenomenal downtown restaurants. Most importantly, work-life balance to be able to enjoy it all.<p>Competitive compensation, health, dental, 401k, daily lunch, and more. If you have professional front&#x2F;backend developer, automation, devops, and&#x2F;or sysadmin experience and are interested in making a tangible impact in small and growing businesses, please email us at: apply@chentech.io","time":1530566465,"type":"comment"}