{"by":"masonhensley","id":17442537,"parent":17442187,"text":"Vivante Health | Backend (junior), Android (mid-level), QA | Athens, Greece | ONSITE | Full-time | <a href=\"https:&#x2F;&#x2F;www.vivantehealth.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.vivantehealth.com</a><p>Vivante Health is a US-based and capitalized start-up healthcare company that has a core team in Athens that addresses the healthcare needs of large US companies. We are looking for teammates that are passionate about changing people’s lives, by providing these people and their families with the support and tools and to make significant impact on the quality of their lives. We are harnessing the talent and passion of our team in Greece by “Made in Greece.” Management of the company has years of experience in developing successful healthcare companies, including the most recent company Livongo Health, a $1B valued company which is the leader in digital health in diabetes.  \nWe offer competitive salaries, equity participation in the company, and competitive benefits in a working environment which is hard driving but flexible.\nVivante Health’s mission is to fill the unmet need of those people living with chronic diseases that are invisible, neglected, or stigmatized. We provide a health management ecosystem that is powered by personal data intelligence so that people are empowered to spend less time managing their disease and more time living life with the mission of improving their quality of life.<p>======<p>Backend Developer (Junior)- <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;vivantehealth&#x2F;jobs&#x2F;171910-back-end-web-developer-in-greece\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;vivantehealth&#x2F;jobs&#x2F;171910-back-end-web-deve...</a><p>QA Tester - <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;vivantehealth&#x2F;jobs&#x2F;388281-qa-tester\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;vivantehealth&#x2F;jobs&#x2F;388281-qa-tester</a><p>Android Dev (Mid Level) - <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;vivantehealth&#x2F;jobs&#x2F;388282-mid-level-android-developer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;vivantehealth&#x2F;jobs&#x2F;388282-mid-level-android...</a><p>======<p>Interview Process:<p>1. Application review.<p>2. Call with a team member<p>3. On-site (or remote) culture conversation with the team + face to face interviews.<p>4. Complete a take home work sample project (within a couple of days) that is representative of the kind of projects you&#x27;ll be working on.<p>5. Call with our Texas based CEO and&#x2F;or VP Technology<p>Keywords:\nGreece, PHP, Angular, Docker, Kubernetes, Node, Quality Assurance, Kotlin, Java","time":1530545672,"type":"comment"}