{"by":"jsmeaton","id":17446819,"parent":17442187,"text":"Kogan.com | Full Stack Developers, Front End Engineers, Back End Engineers | Full Time | Melbourne, Australia | ONSITE | <a href=\"https:&#x2F;&#x2F;careers.kogan.com&#x2F;software-devs-engineering&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.kogan.com&#x2F;software-devs-engineering&#x2F;</a><p>Kogan.com is a pioneer of Australia&#x27;s online retail industry and Australia’s largest pureplay online retailer.\nOur software engineering team have end-to-end responsibility from idea to launch for all kogan.com built apps - including Kogan.com and dicksmith.com.au as well as purchasing optimisation and other internal applications.\nWe see our high volume, large scale apps as an exciting opportunity for innovation and revolution - both in technology and business.\nWe welcome new technologies, ideas and ways of working.<p>To give you an idea on our stack we use Python and Django on the backend; React on the frontend and tools&#x2F;technologies such as: Elasticsearch, AWS, Trello, Docker,\nPostgres, Redis and eClaire (our open-source Trello card printer for our physical wall <a href=\"https:&#x2F;&#x2F;github.com&#x2F;kogan&#x2F;eClaire\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;kogan&#x2F;eClaire</a>).\nWe run an Agile practice - adhering to our processes and refining them through retros.<p>Check out what some of our engineers have written: <a href=\"https:&#x2F;&#x2F;devblog.kogan.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;devblog.kogan.com&#x2F;</a><p>Our careers page has a pretty good rundown on our team and hiring process: <a href=\"https:&#x2F;&#x2F;careers.kogan.com&#x2F;software-devs-engineering&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.kogan.com&#x2F;software-devs-engineering&#x2F;</a>\nOur in person interview is generally focused on debugging a python script or javascript on a laptop, with full access to google&#x2F;docs&#x2F;tools you prefer.\nWe want you to succeed. We&#x27;re interested in how you get there.<p>If you&#x27;ve got any specific questions about our team or process I&#x27;ll be happy to answer below.<p>We&#x27;re looking for juniors, seniors, and everything in between. If you’d like to apply, send an email to dev.jobs@kogan.com with the subject line beginning with &quot;HN: &quot; and some content about who you are.","time":1530582049,"type":"comment"}