{"by":"daveungerer","id":17447810,"parent":17442187,"text":"SimplePay | Analyst Developer | Cape Town, South Africa | REMOTE<p>The story (skip this paragraph if you don&#x27;t like stories in your job posts): I founded and continue to run this startup. Most of the team works from our office in South Africa. However, 2 months ago I moved Singapore for work &#x2F; personal reasons. I used to be quite averse to the idea of remote workers, but seeing as just about everyone will now be remote from my perspective, I decided it&#x27;s a good time to start focusing on hiring for remote work. We&#x27;ve already hired 3 remote developers though HN!<p>SimplePay is online payroll software for South Africa, Ireland, Singapore and Hong Kong. Our software lets thousands of small business owners (and their accountants) run their payrolls without headaches, so they can focus on the challenge of building their businesses.<p>This month we&#x27;re not looking for regular developers, but rather something I&#x27;ve often seen referred to as an Analyst Developer. This position is much more focused on requirements, but you&#x27;ll still need solid programming skills. If you think you&#x27;d enjoy researching tax &#x2F; employment compliance issues for different countries, speccing out a design and then moving to implementation, this position would suit you.<p>The work will include: Doing research on tax &#x2F; employment laws and procedures for new markets we want to enter. Speccing the implementation for a country and doing most of the implementation, with help from more technology-focused developers for the more complicated parts. Doing updates for our existing markets as legal requirements change over time.<p>Experience: You&#x27;ll need a lot of experience in gathering requirements and creating specs. Most of your requirement-gathering will involve research, but there will be some human interaction too - there will be a lot of debate about the best way to help our clients be compliant in the most user-friendly way! As such, a good feel for UX will come in handy too. Any programming experience is OK, but Ruby is preferred.<p>Location: Most of the team is in GMT+2, and I&#x27;ll be in GMT+8 going forward. So anything from GMT+0 to GMT+8 should be OK, unless you keep unusual working hours. We are a registered employer in South Africa and Singapore, so it would be hassle-free if you&#x27;re based in those countries. If not, and if you&#x27;ve never done remote work for a foreign company before, please be sure to find out how to legally do this iin your particular country (it may involve registering as self-employed, for example).<p>Please mail careers@simplepay.co.za and put &quot;Hacker News&quot; somewhere in the subject. I look forward to transforming the company to being more remote-friendly.","time":1530596218,"type":"comment"}