{"by":"lambdawitch","id":17444666,"parent":17442187,"text":"The New York Public Library | Senior Mobile Engineer | NYC<p>The New York Public Library is reshaping the world of e-books and library lending with its SimplyE and Open eBooks mobile applications. These e-reading apps let people connect to their local libraries, check out e-books free of charge, and begin reading effortlessly.<p>Our small and dedicated team is looking for a mobile software engineer who shares our passion of improving public access to information. At the main NYPL branch near Bryant Park, you&#x27;ll experience the pleasure of working full-time on open-source software, enjoy a healthy work-life balance, and be proud to know you&#x27;re improving the lives of users around the country.<p>While we offer the opportunity to learn and develop for both Android and iOS, only knowledge of one platform is necessary when coming in:<p>– If you&#x27;re an Android developer, you should have a strong command of Java and Gradle, be intimately familiar with Google&#x27;s Material Design guidelines, and know your way around the usual SDKs. While our existing codebase is primarily written in Java, we make use of Kotlin for new development whenever possible.<p>– If you&#x27;re an iOS developer, you&#x27;ll need to be competent with both of Apple&#x27;s languages: We&#x27;re using Swift for all new development, but we have an existing codebase that makes heavy use of Objective-C too. You should also have experience with Apple&#x27;s SDKs, be able to effortlessly apply Apple&#x27;s human interface guidelines, and be comfortable doing library-based development via Carthage or CocoaPods.<p>In addition to one or both of the above, you should:<p>– have an interest in working with the open-source community,<p>– be willing to participate in a mutual code review process with your peers,<p>– understand how to build responsive user interfaces via concurrency, and<p>– be proficient with Git, GitHub, and related workflows.<p>Special consideration will be given to candidates with:<p>– knowledge of the EPUB format,<p>– experience building accessible applications, or<p>– a solid understanding of functional programming.<p>Send your résumé to nypldigitaljobs@nypl.org and let us know why you&#x27;re eager to join our team!","time":1530559750,"type":"comment"}