{"by":"khalilravanna","id":17444563,"parent":17442187,"text":"The Predictive Index | [UI Designer, Software Engineer] | Westwood, MA | ONSITE<p>The Predictive Index (PI) is an award-winning workforce assessment platform. 60 years of proven science, assessment software, and our curriculum of management workshops make PI the perfect option for any company looking to assess, predict, and better manage their people anywhere in the world.<p>[GRAPHIC DESIGNER]<p>- Specialize in interactive design and flow.<p>- Cares about the little things that make MVP into MLP (M-Lovable-P).<p>- Appreciates and understands UX research, but isn&#x27;t primarily focused on it.<p>- Designs grounded in reality: Engineers can ship the things you design.<p>- An arbiter of preferences: Take in feedback from multiple stakeholders, craft a vision, and get people bought in on it.<p>What you&#x27;ll be building:<p>We have a newly designer application that needs its potential unlocked by skilled UI&#x2F;UX designers. This is ground floor, a chance to create new patterns and leverage an awesome engineering team to make customers&#x27; lives easier.<p>[SOFTWARE ENGINEER]<p>If you are comfortable working with ambiguity and enjoy the challenge of tempering your technical chops with a desire to get features out to customers on a regular basis please reach out to us.<p>Our current stack is .NET backend with Angular&#x2F;TypeScript on the frontend but we&#x27;re open to people trying out new technologies if it enables them to iterate faster and provide more value to customers.<p>[APPLY]<p>- UI Designer: <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;g7yy88hu2\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;g7yy88hu2</a> (Please include portfolio)<p>- Software Engineer: <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;27d456a52\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;27d456a52</a><p>If you like you can also hit me up on LinkedIn directly. Please include &quot;Hacker News&quot; in your message.<p>www.linkedin.com&#x2F;in&#x2F;stefan-valentin","time":1530558887,"type":"comment"}