{"by":"zclarke1","id":17449687,"parent":17442187,"text":"Sightworthy | Full Stack Engineer | 100K-200K + equity | New York, NY | Full-time | Onsite | <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;sightworthy&#x2F;jobs&#x2F;380944-lead-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;sightworthy&#x2F;jobs&#x2F;380944-lead-engineer</a><p>Hi! My name is Zuley Clarke and I’m cofounder of Sightworthy. Sightworthy is a venture backed content recycling platform helping world-class customers such as Mercedes, Nike, Guardian, New York Times, Shiseido, Sotheby’s, Trello produce short-form video at scale.<p>In this role, you’ll have the opportunity to: \n- work with visual media like images and video \n- ingest and store content from DAMs \n- search and select media from public libraries \n- intelligently slice long form video \n- determine what’s trending on social media<p>This job is perfect for you if you’re: \n- a full stack engineer with a love for building new products \n- excited about understanding customer problems and creating technologies to solve them \n- stoked to build the first pass of a system \n- comfortable with moving fast and failing fast \n- pragmatic at the core; values working code over perfect code \n- into storytelling and manipulating media \n- looking for an opportunity to flex your knowledge of various APIs and open source technologies<p>Would be cool if you were interested in or had experience with: \n- APIs (Vimeo, YouTube, Twitter) \n- AWS technologies (S3, Rekognition) \n- Video&#x2F;image processing \n- Google Cloud Video Intelligence \n- Code deployment (Heroku or other hosted solutions) \n- Node.js, PostgreSQL, React<p>My cofounder and I previously led growth and UX at Shutterstock, Economist and Showtime. We’ve worked with some of the biggest brands in the world and are eager to start scaling our tech this summer. \nApply here: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;sightworthy&#x2F;jobs&#x2F;380944-lead-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;sightworthy&#x2F;jobs&#x2F;380944-lead-engineer</a>\nLearn more about us: <a href=\"https:&#x2F;&#x2F;sightworthy.com&#x2F;about-us&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;sightworthy.com&#x2F;about-us&#x2F;</a>","time":1530622084,"type":"comment"}