{"by":"mpetrovich","id":17451785,"parent":17442187,"text":"REMOTE or NYC | Senior Data Engineer | Next Big Sound @ Pandora<p>---\nAbout Next Big Sound<p>Next Big Sound (<a href=\"https:&#x2F;&#x2F;www.nextbigsound.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nextbigsound.com</a>) is the leading provider of online music analytics and insights, tracking hundreds of thousands of artists around the world. We use our expertise in prediction research and cross-network performance measurement to deliver analytics and insights to music makers as well as Pandora&#x27;s listeners and advertising partners.<p>Next Big Sound operates like a startup within Pandora: autonomous and self-directed with the freedom to explore novel directions and to experiment with the way we work. We&#x27;re a geographically distributed and interdisciplinary team of data scientists, designers, engineers, client services, and product leads who are passionate about solving challenging problems with data at a massive scale.<p>---\nAbout the role<p>We&#x27;re looking for a senior data engineer to work directly with our science and product teams to ingest and integrate large volumes of disparate music and social data from a variety of sources. This involves rapid innovation in large-scale data pipeline design and development to ensure critical datasets are audited, normalized, and made available to our users and predictive models in a timely manner.<p>This role might be for you if:<p>- You have experience with and enjoy designing, building, and owning data architectures and ETL pipelines end-to-end<p>- You can work effectively on small, interdisciplinary teams with other data scientists, data engineers, web engineers, designers, and product managers<p>- You&#x27;re hungry to learn new technologies and teach us a thing or two about building world-class data platforms<p>- You&#x27;re excited by the challenge of extracting value and insights from large, disparate music and social data sets at scale<p>Our team is based in New York City but working remotely is an option. In fact, one third of our team is remote.<p>Apply here: <a href=\"https:&#x2F;&#x2F;pandora.com&#x2F;careers&#x2F;position?id=oJaQ6fwz\" rel=\"nofollow\">https:&#x2F;&#x2F;pandora.com&#x2F;careers&#x2F;position?id=oJaQ6fwz</a>","time":1530637085,"type":"comment"}