{"by":"mikehauschild","id":17453082,"parent":17442187,"text":"ASAPP - solving complex and frustrating real-world problems with AI(ML&#x2F;NLP)-backed software products. Check out our team at <a href=\"http:&#x2F;&#x2F;www.asapp.com&#x2F;team\" rel=\"nofollow\">http:&#x2F;&#x2F;www.asapp.com&#x2F;team</a><p>Product Traction: Our products are deployed with multiple Fortune 100 companies that spend billions on the problems we&#x27;re solving<p>Funding: One of the highest-funded startups in NYC (led by John Doerr)<p>Stack: React&#x2F;Go&#x2F;Node<p>Office Location: NY (1 World Trade Center, 80th floor) &lt;&gt; San Francisco (SoMa area)<p>Open Roles: \n&lt;&gt; Research Scientists (PhD with focus in ML&#x2F;NLP)\n&lt;&gt; Frontend &#x2F; Backend &#x2F; Fullstack Engineers  (all levels, from 0+ years xp)\n&lt;&gt; Solutions Engineer (for someone who wants to move away from hands-on coding and instead would like to be client-facing to to help them client-side engineers through our SaaS integration complexities) \n&lt;&gt; Devops Engineers \n&lt;&gt; Security Engineers \n&lt;&gt; Technical Project Managers \n&lt;&gt; iOS Engineers \n&lt;&gt; Android Engineers \n&lt;&gt; Data Scientists \n&lt;&gt; ML Engineers \n&lt;&gt; Product Designers<p>Interview Process: Phone Call &gt;&gt; Onsite Meeting Day &gt;&gt; Work at ASAPP!<p>Research: For the past ten years, members of our research team have earned top awards and distinctions at the most prestigious conferences in computational linguistics, and remain important contributors to the global research community. Recently, Regina Barzilay, one of our closest academic collaborators, was awarded a MacArthur Fellowship for her contributions to the field of NLP.<p>Perks: Generous Base Salary &lt;&gt; Equity &lt;&gt; 401K &lt;&gt; Excellent Health Benefits &lt;&gt; Daily Catered Lunch from NYC&#x27;s Best Restaurants &lt;&gt; Wellness Perks &lt;&gt; Amazing office and View<p>Contact us: please email me at mike@asapp.com to setup a time for a chat!","time":1530647018,"type":"comment"}