{"by":"runtasticcareer","id":17469897,"parent":17442187,"text":"Open Jobs at Runtastic<p>We believe in supporting people to improve their fitness and overall health. With more than 220 million downloads of our apps and 115 million registered users on Runtastic.com, we face unusual and fascinating challenges everyday. == ONSITE | VISA ==<p>We offer jobs in various fields, check out our career page <a href=\"https:&#x2F;&#x2F;www.runtastic.com&#x2F;en&#x2F;career\" rel=\"nofollow\">https:&#x2F;&#x2F;www.runtastic.com&#x2F;en&#x2F;career</a> and see if any of our open positions match with your interests and background (i.e. Senior Software Testers, Test Automation Engineers, Frontend and Backend Developers, Mobile Developsers).<p>Interested in becoming a Mobile Developer iOS at Runtastic?<p>YOUR MISSION<p>As part of our young, smart, and motivated iOS team you will write code used daily by millions of users worldwide. You will be mainly responsible for:<p>- Development on the cutting edge of iOS frameworks<p>- Usage of and contribution to open source projects, such as Matrioska, fastlane, and CocoaPods<p>- Conception and implementation of mobile apps<p>- Technical architecture decisions<p>- Mentoring of junior developers<p>- Implementation of innovative ideas to challenge yourself and others<p>- Furthermore, you can benefit from the company&#x27;s contacts to Apple and Facebook<p>YOUR PROFILE<p>- At least 2 years of practical experience with iOS development<p>- Expert knowledge of (ObjC || Swift)<p>- Excellent skills in writing clean and maintainable code<p>- Preferably, a degree in (Mobile) Computing, Information Technology, Computer Science, or a related field<p>- Very good English skills<p>- Self-starter, fast learner, and motivated team player willing to work in beautiful Austria<p>Apply for this position at: <a href=\"https:&#x2F;&#x2F;www.runtastic.com&#x2F;en&#x2F;career?jh=brftbpf9qlen7gzop21cak1376b6dlp\" rel=\"nofollow\">https:&#x2F;&#x2F;www.runtastic.com&#x2F;en&#x2F;career?jh=brftbpf9qlen7gzop21ca...</a>","time":1530866564,"type":"comment"}