{"by":"kobigurk","id":17496225,"parent":17442187,"text":"QED-it | Tel Aviv | Software Engineers (Protocol, Delivery, Backend) | Full-time | ONSITE, REMOTE<p>QED-it, a funded Tel-Aviv based startup, is looking for experienced software engineers to join its core team. We are tackling the hardest and most interesting problems in the Blockchain space - solving the consensus&#x2F;privacy paradox, using zero-knowledge-proofs. ZKP is a new technology, that up until recently was solely explored in academia.<p>We are funded by smart money from top tier angels, and have assembled a team of experts in cryptography, computer science, security and distributed systems. We’re at the heart of the private Blockchain industry. The founders built and sold successful businesses in the space, and are focusing on privacy as the key to Blockchain deployment, impacting industries from banking to aerospace.<p>QED-it is building a unique product combining cutting-edge technology, design and implementation of cryptographic protocols and user&#x2F;developer-facing APIs. We’re looking to expand our team with great individuals!<p>-Positions-<p>* Protocol - <a href=\"https:&#x2F;&#x2F;qed-it.breezy.hr&#x2F;p&#x2F;cc072d5f4fda-software-engineer-protocol\" rel=\"nofollow\">https:&#x2F;&#x2F;qed-it.breezy.hr&#x2F;p&#x2F;cc072d5f4fda-software-engineer-pr...</a><p>* Delivery - <a href=\"https:&#x2F;&#x2F;qed-it.breezy.hr&#x2F;p&#x2F;8e71a2050560-software-engineer-delivery\" rel=\"nofollow\">https:&#x2F;&#x2F;qed-it.breezy.hr&#x2F;p&#x2F;8e71a2050560-software-engineer-de...</a><p>* Backend - <a href=\"https:&#x2F;&#x2F;qed-it.breezy.hr&#x2F;p&#x2F;e9a34e9a0893-software-engineer-backend\" rel=\"nofollow\">https:&#x2F;&#x2F;qed-it.breezy.hr&#x2F;p&#x2F;e9a34e9a0893-software-engineer-ba...</a><p>-About you-<p>* Enjoys being part of the whole product life-cycle up until the end-user<p>* Entrepreneurial spirit and a hacker mentality<p>* Without using Google, you know what Q.E.D. means, possibly even 2 different meanings<p>-OK, fine, how do I join?-<p>* If you feel this is for you - use the above links to apply or send your CV to jobs@qed-it.com!","time":1531210537,"type":"comment"}