{"by":"speek","id":7507785,"kids":[7508229,7511959,7509127],"parent":7507765,"text":"Weft - <a href=\"http://weft.io\" rel=\"nofollow\">http:&#x2F;&#x2F;weft.io</a> - Boston, MA (LOCAL) + San Francisco, CA (LOCAL) + Eastern Europe (REMOTE).<p><pre><code>   ===========================\n   ====== What we do =========\n   ===========================\n</code></pre>\nWe&#x27;re a logistics visibility platform (read: Waze for Cargo). Weft tracks shipping containers using low-cost hardware to make sure that shipments get to where they&#x27;re supposed to be on time and intact, saving billions in lost value due to cargo shrink and disrupted supply chains. We take the info we get from the hardware and figure out where the bottlenecks in the supply chain are, predict whether or not a shipment is going to make it to its destination on time, and dynamically reroute&#x2F;reschedule shipments so that we can optimize the system as a whole. Really neat stuff. We&#x27;re working on a lot of the things that happen once you have that data, but I can&#x27;t share much about it here<p><pre><code>   ===========================\n   ===== How we do it ========\n   ===========================\n</code></pre>\nWeb stack -&gt; clojure (immutant) + postgres&#x2F;cassandra&#x2F;riak -- we use middleman + enlive (and a bit of hiccup) for templating, meaning that we&#x27;re pretty flexible about frontend tech.<p>Algorithms -&gt; a dizzying mixture of oldschool and newschool techniques ;-)<p>Hardware -&gt; think cell phone on crack (atmel avr xmega, a bunch of sensors, gps, gsm, etc). Working integrated chip in the sub-$5 price point now! Have some pilots running with v1 hw.<p><pre><code>   ===========================\n   ====== And the rest =======\n   ===========================\n</code></pre>\nWe&#x27;ve got some very interesting partners and customers (ranging from telcos to enterprise software providers to regional and international logistics companies). We also have some top tier investors!<p>Looking for help on mobile, frontend, and data science sides!<p>I should also probably mention that we have a team with a bunch of industry vets!<p>If this sounds interesting, please shoot me an email at marc@weft.io!","time":1396357851,"type":"comment"}