{"by":"wdhaines","id":7507769,"kids":[7507977],"parent":7507765,"text":"Indiegogo (www.indiegogo.com)—San Francisco, CA<p>We&#x27;re a team of engineers, musicians, tri-athletes, designers, activists, filmmakers, and writers, united by a shared passion to empower people across the world to turn their dreams into reality.<p>Realities like:\n* Helping the Oatmeal’s Matthew Inman to open a Nikola Tesla Museum: <a href=\"http://igg.me/p/204900/\" rel=\"nofollow\">http:&#x2F;&#x2F;igg.me&#x2F;p&#x2F;204900&#x2F;</a>\n* Rallying the YouTube community to increase nonprofit awesomeness in the world: <a href=\"http://igg.me/at/p4a2013/\" rel=\"nofollow\">http:&#x2F;&#x2F;igg.me&#x2F;at&#x2F;p4a2013&#x2F;</a>\n* Building a 13-foot high statue of a T-Rex with Christopher Walken’s head: <a href=\"http://igg.me/p/390984/\" rel=\"nofollow\">http:&#x2F;&#x2F;igg.me&#x2F;p&#x2F;390984&#x2F;</a><p>Over the last few years, we’ve turned our vision of building the world’s funding platform from the dream a scrappy team of 5 into the reality of a 90-person team and $40 million plus in VC backing. Mo’ money, mo’ problems, eh? Our newfound scale has set us up to succeed as the open crowdfunding platform for the whole world—and scale brings a whole new set of engineering challenges that might interest you.<p>Do any of these challenges grab your attention? Let us know!\n* Dev&#x2F;Ops Engineer (<a href=\"http://www.indiegogo.com/about/careers?jvi=oGtsYfwj,Job\" rel=\"nofollow\">http:&#x2F;&#x2F;www.indiegogo.com&#x2F;about&#x2F;careers?jvi=oGtsYfwj,Job</a>): help us build out the infrastructure that’s serving millions of dollars in funds raised each month\n* Software Engineer, Web (<a href=\"http://www.indiegogo.com/about/careers?jvi=oB0oYfwH,Job\" rel=\"nofollow\">http:&#x2F;&#x2F;www.indiegogo.com&#x2F;about&#x2F;careers?jvi=oB0oYfwH,Job</a>): we’re a Rails shop at heart; let’s scale that codebase to support the world\n* iOS Engineer (<a href=\"http://www.indiegogo.com/about/careers?jvi=oLSGYfw1,Job\" rel=\"nofollow\">http:&#x2F;&#x2F;www.indiegogo.com&#x2F;about&#x2F;careers?jvi=oLSGYfw1,Job</a>): help us build our first-gen mobile app!<p>Our engineering approach:\n* Tech stack: Ruby on Rails, iOS 7 SDK, Backbone.js, AngularJS, LESS, Elasticsearch, Amazon Redshift, Chef\n* We’re an agile shop (somewhere between XP and scrum), and our project teams decide their own working standards\n* We already have one of the most diverse engineering teams in San Francisco, and we’re working to change the tech community as a whole (see <a href=\"http://igg.me/at/LesbiansWhoTech/\" rel=\"nofollow\">http:&#x2F;&#x2F;igg.me&#x2F;at&#x2F;LesbiansWhoTech&#x2F;</a>  and <a href=\"http://igg.me/at/BGCTheRemix/\" rel=\"nofollow\">http:&#x2F;&#x2F;igg.me&#x2F;at&#x2F;BGCTheRemix&#x2F;</a>)\n* We’re language agnostic when we hire—we&#x27;re open to talking to engineers with strength in Python, PHP, Java, Perl, etc., as long as you enjoy working with RoR and are willing to learn!<p>Our next year is all about execution—there’s never been a better time to join the team.","time":1396357752,"type":"comment"}