{"by":"kmano8","id":7508302,"parent":7507765,"text":"Monetate - Conshohocken, PA (Philly suburbs) - No remote, but we will relocate.<p>Monetate helps digital marketers make their content more relevant. We turn data into action on our clients&#x27; sites by doing real-time data analysis and DOM manipulation to put the right experience in front of their users. We’re looking for engineers who want to do highly visible work on great brands and solve tough problems with great coworkers.\nWhat we&#x27;re looking for:<p>* People who like to ship - we&#x27;re focused on building and shipping great products - if you like to see your work in production quickly you&#x27;ll see it here. We ship often (every two weeks), and iterate.<p>* People who like hard challenges - we have great problems across our products - huge data sets, UX, 3rd party Javascript, high volume &#x2F; low latency APIs - we have no shortage of fun problems to work on.<p>* Problem solvers who like to code - we take things apart, figure out how they work, then build software to solve our users&#x27; problems.<p>About us:<p>* Founded in 2008<p>* Respect - it&#x27;s our core value. We have a great team and we work well together. Our vacation policy is the same as Netflix (we don&#x27;t have one). Our technical project teams are self-organizing and have full authority over (as well as responsibility for) the problems they work on.<p>* Open source - Google Closure, Python, AngularJS, Pandas, Redis, Hadoop, Mahout, Solr and Lucene - we&#x27;re open source across our stack<p>* Market rate salaries<p>* Funded by First Round Capital and OpenView<p>We&#x27;ve hired great people from HN before, and we&#x27;re looking for people not positions. We have people who have joined the team with no background in our primary languages and people from non-traditional backgrounds.<p>Check out our blog at <a href=\"http://engineering.monetate.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.monetate.com&#x2F;</a> Send me a message if you have questions or want to apply: karl at monetate dot com","time":1396361756,"type":"comment"}