{"by":"ljf","id":7508185,"kids":[7551954,7558535],"parent":7507765,"text":"Gamesys - London UK<p>--------------------------<p>Good morning, Hacker News! Gamesys is hiring across the entire business.<p>We’ve been around since 2001, and have quietly grown to more than 900 people in 7 locations worldwide, with our headquarters in London, United Kinfdom. We’re one of the world’s most successful online entertainment businesses, with total wagering across all our games exceeding $6.4 billion in 2012.<p>Facebook chose us as the first company to launch a cash gaming application on their platform, and our latest success story is the hugely popular multiplayer adventure game ‘Here Be Monsters’.<p>2014 is set to be a great year. We’ve partnered with Tropicana Casinos and Caesar’s Palace, and recently acquired the Virgin Games brand.<p>We’re a big company with a strong focus on our Developers, who make up well over half of the workforce. Whichever team you join we follow an AGILE methodology, and there are lots of different projects to keep you interested. We launch a new game somewhere in our empire every 2 weeks, so there is always something to do!<p>If you’re interested, please send your CV to liam.ford@gamesys.co.uk and I&#x27;ll pass it on to the team.<p>---<p>Games Developers with experience developing games for mobile or the web. You’ll need to have worked with either Lua, AS3 or JavaScript and be comfortable switching between scripting languages. Eclipse and Intellij IDEs are also essential, as is a thorough grounding in OOP best practice.<p>-<p>Flash Developers who are comfortable building games, promotional tools or landing pages. You’ll be a master with Flash ActionScript 3, HTML5, JavaScript, CSS as well as design  packages like Photoshop or Illustrator. MVC like robot legs or pureMVC are also a must-have.<p>-<p>Java Developer (Poker &amp; Games Platform) is one of our critical roles. The team are re-architecting our Poker &amp; Games Platforms to modernise some legacy systems, and we need plenty of new breed OO Java developers who are focused on the server-side with a thorough understanding of message driven architecture. Experience with MongoDB, Neo4j, Hazelcast or ActiveMQ would help.<p>-<p>Java Developer (Core Platform) to work on the re-architecting project from a different angle. The Core Platform is a high-volume distributed system, managing up to 140,000 transactions per second at peak times. Core Java, Hadoop and NoSQL are all essential.<p>-<p>Java Developer (Third Party Integration) is a great role for a junior Java Developer looking for a role where they can keep adding new skills. You’ll need experience with RESTful APIs and caching technologies like Memcache or Ehcache and Persistent Disks.<p>-<p>Software Build Engineers who can manage and troubleshoot our virtual environments. We’re looking to introduce some automation to our systems, and need hands-on engineers who can use Puppet, Bamboo, Nexus and Git.<p>-<p>Datawarehouse Developers to fit into one of our strongest teams. You’ll have SQL or Oracle DB skills, and will be working with the IBM DB2 data warehousing suite. Very strong SQL skills and experience are an absolute requirement.<p>-<p>iOS Developers to work in our Games Studio and the Social Gaming division. We’re open and flexible about your skills, as long as you’ve got professional experience building and releasing web apps.<p>-<p>QA Engineers across the entire business, working in the Games Studio, Social Gaming, on the Core Platform and everywhere else that code is being written!<p>-\nAny questions just let me know.","time":1396360694,"type":"comment"}