{"by":"sparkman55","id":7508391,"parent":7507765,"text":"Rinse - www.rinse.com - San Francisco<p>Rinse is a fast-growing Technology-Enabled Dry Cleaning and Laundry Delivery Service based in the design district in San Francisco.  This is a chance to join a &#x27;rocket ship&#x27; startup pre-venture capital.  We&#x27;re currently hiring people of all types:<p>* We&#x27;d like to hire a <i></i>Senior Software Developer<i></i> to join our small team and build mobile apps for our customers and drivers, sophisticated internal processing tools, and a robust and polished customer-facing web presence to further burnish our brand.  Our stack is built on Django, with a healthy amount of HTML5 and Backbone.js, but we&#x27;re more interested in hiring someone with mature development practices, mentorship experience, and strong analytical capability.  Knowledge of any new tools   will come easily to the right person.<p>* As this is an operationally-focused business, we&#x27;re also looking for a <i></i>&#x27;Swiss-Army Knife&#x27;<i></i> generalist to join our high-caliber team and own whatever parts of our operations, marketing, or social media need attention on a given day.  This is a chance for a smart person to join a tech startup in a critical role, even if that person isn&#x27;t a software developer.<p>* We&#x27;re also looking to hire a <i></i>Director of Marketing<i></i> to help us accelerate  growth as we optimize our operations.  With a great domain, solid product, tech-savvy customer base, and growing ad presence, this is a great opportunity for a consumer-focused marketing professional.  A job description is at <a href=\"https://rinse-cdn.s3.amazonaws.com/assets/docs/Rinse%20-%20Director%20of%20Marketing%20-%20Job%20Description.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;rinse-cdn.s3.amazonaws.com&#x2F;assets&#x2F;docs&#x2F;Rinse%20-%20D...</a><p>* Last but definitely not least, we&#x27;re hiring individuals with a clean driving record for part-time evening work delivering and picking-up laundry and dry cleaning as a <i></i>Rinse Valet<i></i>.  This is a great way for students to pick up some extra cash a couple of nights a week.  Apply via <a href=\"https://docs.google.com/forms/d/1kWZYu1kg1r8kxdDC9ObKdgQP_1NYcX7ZDEaa3dQxr6E/viewform\" rel=\"nofollow\">https:&#x2F;&#x2F;docs.google.com&#x2F;forms&#x2F;d&#x2F;1kWZYu1kg1r8kxdDC9ObKdgQP_1N...</a><p>Interested?  Email jobs@rinse.com for more information.","time":1396362396,"type":"comment"}