{"by":"czarneckid","id":7508279,"parent":7507765,"text":"Agora Games - Troy, NY. Full-time.<p>## Job Summary<p>As a Software Engineer at Agora Games, you will be working on our online game services platform called Hydra. You will be responsible for creating complex data processing and presentation tools that integrate tightly with some of the industry&#x27;s biggest game franchises (Evolve, Saints Row, Injustice: Gods Among Us, Mortal Kombat, and more). You will work as part of a highly talented team of producers, engineers, and business specialists to expand the Hydra platform.<p>We are looking for a candidate with the ability to quickly learn new platforms. We use many different technologies within Hydra, and while we don’t expect you to know them all coming in, we need a candidate who can quickly learn and be proficient with them!<p>## Job Requirements<p>Job Requirements:<p>Experience delivering large, complex, highly available software systems<p>Experience developing and operating distributed systems<p>Knowledge and practical application of design patterns, SOA, refactoring and software testing<p>Experience with web application servers, web development frameworks, proxy servers and relational databases<p>A detail-oriented, organized thought process and the ability to act decisively under stressful conditions<p>A proactive mindset and the ability to multitask and prioritize requirements<p>A self-motivated work process and excellent communication skills<p>An understanding of system optimization issues<p>## Technologies We Use:<p>Languages: Ruby, Python, C++, C#, Java, Objective-C<p>Databases: PostgreSQL, MongoDB, Redis<p>Web: Rails<p>Misc: SaltStack, node.js, git, Chef<p>## Links<p>Work at Agora Games - <a href=\"http://www.agoragames.com/work-at-agora/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.agoragames.com&#x2F;work-at-agora&#x2F;</a><p>Agora Games Portfolio (games we&#x27;ve worked on) - <a href=\"http://www.agoragames.com/portfolio/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.agoragames.com&#x2F;portfolio&#x2F;</a><p>Agora Games GitHub - <a href=\"https://github.com/agoragames/\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;agoragames&#x2F;</a><p>Agora Games Blog - <a href=\"http://www.agoragames.com/blog/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.agoragames.com&#x2F;blog&#x2F;</a>","time":1396361570,"type":"comment"}