{"by":"courtewing","id":7508402,"kids":[7513066],"parent":7507765,"text":"Engine Yard - Fulltime, REMOTE<p>Frontend Engineer<p>We&#x27;re one of the oldest PaaS&#x27;s out there, with support for PHP&#x2F;Ruby&#x2F;Java&#x2F;node.js and both AWS and Azure. Earlier this year we launched a brand new user experience from the ground-up -- a new website and a completely new client-side interface. As a Frontend Engineer, you&#x27;d be working primarily on the latter.<p>The UI is written using angular.js served up by a lightweight node.js api proxy server. We use mocha&#x2F;selenium web driver for our tests and only accept green builds via travis to be merged to master. Through our &quot;eybot&quot; on slackhq, we deploy stable code to production multiple times a day.<p>The UX engineering team at Engine Yard consists of 3 UI designers and 4 engineers (including myself). We&#x27;re spread out across 8 timezones (Dublin through San Francisco), so experience working in a distributed team is key.<p>You&#x27;ll get:<p><pre><code>    * Competitive salary\n    * Full medical, dental and vision benefits\n    * 25 paid days off per year\n    * 401(k)\n    * We take care of your phone bill\n    * Paid travel to conferences\n</code></pre>\nMust haves:<p><pre><code>    * A passion for writing great software to solve real problems for real people\n    * Demonstrated experience building complex client-side applications in\n      JavaScript, preferably with angular.js\n    * Experience working in a distributed team\n    * The strong belief that a feature isn&#x27;t finished until it&#x27;s tested and, where\n      appropriate, documented\n    * A fantastic sense of sarcasm\n    * Ability to travel occasionally (at least once or twice a year)\n    * Somewhere between UTC and UTC-8\n</code></pre>\nGreat to have:<p><pre><code>    * Thorough understanding of git\n    * Experience building REST apis\n    * Experience with multiple languages (and an understanding of their tradeoffs)\n    * Previously worked at a startup\n</code></pre>\nIf you&#x27;re interested, shoot me your info at cewing@engineyard.com.","time":1396362456,"type":"comment"}