{"by":"jaymod","id":7509407,"parent":7507765,"text":"Epoxy (<a href=\"http://epoxy.tv\" rel=\"nofollow\">http:&#x2F;&#x2F;epoxy.tv</a>) in Venice, CA (Los Angeles; full time ideal, intern, remote and h1b considered)<p>Senior Node.js, Rails, Front-end and Data Engineering<p><a href=\"http://epoxy.tv/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;epoxy.tv&#x2F;jobs</a><p>Epoxy builds exceptional software for online video creators and viewers. Our tools help YouTubers and networks optimize their businesses and deepen the relationship with their audience. Our channel experiences provide viewers with new ways to connect with and experience the content they love.<p>Epoxy was founded by designers, engineers and entrepreneurs who are passionate about product and solving problems. Our backgrounds include Stanford, Brown, IDEO, Adobe, Mixpanel, Google&#x2F;YouTube and Team Downey.\nThere are a number of senior engineering positions we&#x27;d like to hire for specifically, but we&#x27;re absolutely interested in hiring smart people who don&#x27;t exactly fit any of those particular positions. In general, we look for:<p>* BS or MS in Computer Science, a related degree from a top-tier program or the equivalent experience and mastery in industry<p>* Substantial real-world engineering experience with products shipped<p>* Strong, well articulated opinions on product design and engineering issues along with genuine flexibility and enthusiasm for approaches other than your own<p>* Preference for fast-moving markets, products, teams and the sometimes-ambiguous and fickle nature of early-stage startups<p>* High personal value on culture and culture fit in a job<p>* Deep sense of personal product ownership and long-term interest in developing technical and soft skills<p>We&#x27;re building on a thoroughly modern stack including Ruby, Rails, Node.js, MongoDB and friends.<p>Sound like something for you? Check out more complete descriptions at <a href=\"http://epoxy.tv/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;epoxy.tv&#x2F;jobs</a> or drop us a line at jobs@epoxy.tv. Thanks!","time":1396369090,"type":"comment"}