{"by":"james_gancos","id":7509588,"parent":7507765,"text":"West Hollywood &#x2F; Los Angeles, CA - www.universalpoints.com - FULL TIME<p>About Universal Points:<p>Mission: To improve the travel experience by bringing independent hotels and guests closer together.<p>Product: Universal Points is a turn-key points platform for independent hotels offering 5% rewards that are automatically redeemable via PayPal or other options. Participating hotels will be able to drive more direct bookings, attract new business guests, and deliver more personalized service.  We have a product in the market with clients and are in rapid growth mode.<p>Team: Small startup team located in West Hollywood on Sunset Blvd.  Angel investors include the CEO of Yelp, Social+Capital VC firm, a Harvard Business School professor, and multiple hotel owners.<p>Hiring for 3 Full Time positions:<p>1) Ruby on Rails Developer<p>Who we’re looking for: You’re passionate about coding and learning new technologies. You’re looking to expand the depth of your experience and knowledge in the best practices for software engineering and development. You want to learn more about startups and want to be a part of a small team.<p>Experience we’d like to see: \n•Experience in another language other than Ruby or Javascript\n•Front-end skills including: Javascript, JQuery, Bootstrap, HTML, CSS\n•Ability to design software with ERD, Class, Flow, and Sequence diagrams\n•Github\n•PostgresSQL<p>More on this position at: <a href=\"https://angel.co/l/pGbbg\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;l&#x2F;pGbbg</a><p>2) Director of Sales<p>We are looking for an individual to lead the sales efforts of our organization.<p>This position is our first internal sales hire, so we are looking for the candidate that can hit the ground running &amp; CLOSE BUSINESS while at the same time take our sales processes to the next level and shape &amp; grow our sales platform.\nWe value intelligence, curiosity, drive, creativity, persistence, coach-ability, and above all PRIOR PROVEN SUCCESS.   Qualified candidates need to be HUNTERS and eager to make cold calls at all times.  They must have an enthusiastic approach and be described by friends as no less than ALWAYS OPTIMISTIC.<p>This position will report to the CEO and will require close coordination with our CTO, development team, and our Marketing &amp; Social Media Manager, among others. This is a great opportunity to make a significant contribution to our business and to change the hotel business for the better.<p>More on this position at: <a href=\"http://www.linkedin.com/jobs2/view/13096390?trk=job_nov\" rel=\"nofollow\">http:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs2&#x2F;view&#x2F;13096390?trk=job_nov</a><p>3) Marketing &amp; Social Media Manager &#x2F; “Growth Hacker”<p>We&#x27;re looking for a SAVVY, PASSIONATE, INTELLIGENT, FLEXIBLE, POSITIVE and EXCEPTIONALLY CREATIVE Marketing &amp; Social Media Manager &#x2F; “Growth Hacker” who wants to help transform the world’s hotel business.<p>If you are sharp and looking for a fun, fast-paced, supportive environment, this is a great opportunity to make a significant contribution to our business.   This role is responsible for:  Growing our business from a member&#x2F;guest perspective, helping to fine-tune our products for maximum effectiveness, reaching out to potential new clients and partners, and building exciting campaigns to share our story and grow our member base.<p>More on this position at: <a href=\"http://www.linkedin.com/jobs2/view/12953227?trk=job_nov\" rel=\"nofollow\">http:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs2&#x2F;view&#x2F;12953227?trk=job_nov</a><p>Thanks for your interest, and feel free to contact us directly if you&#x27;re interested in a position.<p>-James Gancos (CEO &amp; Co-Founder; james.gancos@universalpoints.com)\n-Michael Chu (CTO &amp; Co-Founder; michael@universalpoints.com)","time":1396370462,"type":"comment"}