{"by":"spicyj","id":7509597,"kids":[7512948,7555449],"parent":7507765,"text":"Khaaaaan! Academy — Mountain View, CA (we also love interns, and remote is a possibility)<p>We&#x27;re a small, non-profit tech startup trying to give a free, world-class education to anyone, anywhere.<p>Here&#x27;s a testimonial we received this week:<p>==================================<p>Two year ago, I would never have imagined that any 13-year-old could be in Calculus BC. Today, I am 13 and wrapping up my second semester of it, and with an A+, too, thanks largely in part to this site. Sal, I would say you are the best teacher I ever had. Teachers in school just don&#x27;t seem to have the time or, in some cases, even the knowledge to pay as much attention as you do to the actual intuition of the material being taught. How am I supposed to understand a theorem if I don&#x27;t know where it came from, why it works, or even what it really means? Khan Academy also seems to explain everything in a very easy to understand, and even fun, manor. You make calculus almost as easy as simple arithmetic. Anyway, thank you very much.<p>==================================<p>Every month we get hundreds of letters like this from people in all walks of life who&#x27;re thankful for our free, high-quality educational content.<p>Most of you reading this are familiar with Sal&#x27;s videos, but we also have hundreds of videos by other teachers, partnerships with organizations like MoMA and the California Academy of Sciences, and a huge library of interactive exercises. Over 20 million math problems are done every week on our site.<p>And now we&#x27;re doing a big mobile push. Around 20% of our traffic comes from phones and tablets. We&#x27;re totally overhauling our iOS app and we now need a great mobile designer. (We&#x27;ve got some good leads for good devs already, but if you&#x27;re a dev please do apply too.)<p>We need a great mobile designer, one who lives and breathes mobile and really understands what works and what doesn&#x27;t. If you join us now, you can be a major influence on an app that is guaranteed to have millions of users. We have loads of high-quality educational content just waiting to be shared within a great product. We have partnerships lined up around the block to promote your work. We just need you.<p>You&#x27;ll be part of a small team working alongside both &quot;celebrity&quot; devs (like jQuery creator John Resig and Google&#x27;s first employee Craig Silverstein) and many more who you haven&#x27;t heard of but who are also really awesome.<p>Apply at <a href=\"https://www.khanacademy.org/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.khanacademy.org&#x2F;careers</a> and be sure to mention that you&#x27;re coming from HN. Feel free to email me at alpert+HN@khanacademy.org if you have questions about applying or about KA in general. Unfortunately we can&#x27;t sponsor visas right now unless you&#x27;re from Canada, Australia, or Mexico.","time":1396370529,"type":"comment"}