{"by":"Ovid","id":7509617,"kids":[7512124],"parent":7507765,"text":"Search scientist. Amsterdam. Relocation and Visa provided. And I mean <i>real</i> search scientist, not just someone who put together Solr that one time.<p>We have a client who has a fantastic position which has opened up. They’re searching for you because you’ll be searching for them: they need an expert search engine&#x2F;data mining specialist and very few people can fill this role.<p>You’ll have several years of experience with search engines and (preferably) e-commerce, a proven capability to mine data and a Master’s or Doctorate in Statistics, Math, AI, Computer Science or a comparable background. This isn’t for someone who’s just set up Elasticsearch, Solr, or some other search engine (though that helps). It’s for someone who can mine the data of customer searches and provably demonstrate they can create better search results for customers. You won’t be waiting for tasks to do: you’ll be deciding the tasks and how to do them.<p>How do you exclude a location 500 meters away from the one a customer is searching for but it’s across an international boundary or a river with no bridge? How do you do that in a performant manner? Or maybe searches in different languages should be treated differently based on cultural preferences? And do different categories of customers have different search needs? How would they be categorized and how would different search results impact them? Or maybe you can demonstrate that the above wouldn’t impact sales and you have a better solution?<p>The possibilities are endless and the position itself is very high level within the company. They’re offering a generous salary, an awesome work&#x2F;life balance, a generous vacation package and a catch: you have to let them pay to relocate your household (even rats, if you want to) to the heart of Amsterdam, one of the most beautiful cities in the world. If you’re going to be sitting down sketching out how to group customers using adaptive resonance theory, wouldn’t it be lovely to do that while sipping a Grolsh, eating bitterballen, next to a beautiful Dutch canal?<p>And with 26 days of vacation and 9 public holidays, you’ll have seven weeks off a year to enjoy. Take a relaxing two-week road trip across Europe and return to work with several weeks of holiday left.<p>Given the extremely high level of expertise needed for this role, our client realizes that the few people who are both capable and willing to accept this role will need a relocation package. And if you have a family, our client will take care of them, too. Have special relocation requirements? As long as you are willing to work in Amsterdam, bring them up and the company will see what they can do. On top of that, you’ll probably qualify for something called the 30% ruling. This is a law passed by the Dutch government to attract top experts like you. When you qualify, you’ll be taxed on only 70% of your salary. The other 30% will be handed to you tax-free, effectively giving you a huge pay rise on top of an already generous salary.<p>This is a high level position in the company and you’ll be given a lot of autonomy to make things happen. Further, the success criteria for the job are extremely clear and you’ll be given all the tools you need to directly measure your success. The exact nature of the role can potentially be tailored to meet your personal preferences.<p>The work environment is laid-back, English is the working language, and you’ll be working with other expats with a sense of adventure. Amsterdam is a friendly, low-crime city and almost everyone speaks English fluently, but if you want Dutch lessons, our client will help. Heck, if you have other requirements, bring them and get them on the table. For the right candidate, everything’s open to discussion.<p>If this sounds interesting and you want more information, contact us at jobs@allaroundtheworld.fr.","time":1396370646,"type":"comment"}