{"by":"azth","id":7510314,"parent":7507765,"text":"Exabeam, Platform Engineer (fulltime), San Mateo, CA<p>===================<p>You will be responsible for designing and implementing a brand new data processing system to detect advanced security threats using the latest stream processing and machine learning techniques. As part of the founding team you will have the opportunity to define and work in various areas of the platform including data ingestion, data processing, algorithm design, machine learning, reporting, visualization, etc. You will also have the opportunity to contribute to all aspects of product definition and system architecture.\nYou are a strong software engineer who is passionate about large-scale systems. You care about producing clean, elegant, maintainable, robust, well-tested code; you enjoy collaborating with others to come up collectively with the best possible solution. You have experience with performance, scalability, and reliability issues of large 24x7 systems.\nResponsibilities:<p>• Design and develop various platform components using latest technologies and coding in Scala.\nRequirements:<p>• Experience in Scala or other functional programming languages (Haskell, Scheme, Lisp, Ocaml, F#). Alternative deep Java expertise and strong desire to learn Scala.<p>• Strong Object-oriented experience, for example in Java, Scala, Ruby, or C++.<p>• Experience building complex systems with high performance, scalability and reliability requirements • Experience with distributed data processing system (Kafka, Storm, Spark, Shark, Akka, Hadoop, others.)<p>• B.S. in Computer Science or related disciplines.\nWhy work at Exabeam?<p>• Unique opportunity to be part of a founding engineering team to help define and shape a brand new product for a huge business problem. Unique chance to start writing code from scratch.<p>• Work with a top-notch team of smart, motivated engineers, pushing the envelope to produce the most advanced real time security data processing engine<p>• Technically challenging and very interesting problem. Opportunity to work with the latest technologies in distributed systems, machine learning and high volume data processing<p>• Strong team with deep security and technology expertise<p>• Well funded company<p>Email me at: ziad@exabeam.com","time":1396375234,"type":"comment"}