{"by":"michaelhoffman","id":7510045,"parent":7507765,"text":"Princess Margaret Cancer Centre: Postdoctoral fellowships in computational biology and machine learning - <a href=\"http://pmgenomics.ca/hoffmanlab/join/\" rel=\"nofollow\">http:&#x2F;&#x2F;pmgenomics.ca&#x2F;hoffmanlab&#x2F;join&#x2F;</a><p>Toronto, ON<p>The Hoffman Lab at the Princess Margaret Cancer Centre, seeks new members for our team. We develop machine learning techniques to better understand chromatin biology. These models and algorithms transform high-dimensional functional genomics data into interpretable patterns and lead to new biological insight. A key focus of the lab is to train a new generation of computational biologists.<p>We seek postdoctoral fellows for several projects in computational genomics and machine learning. Selected projects include:<p>1. Integrating epigenomic and sequence data to better understand human gene regulation.<p>2. Developing deep learning techniques to find novel behavior in multiple functional genomics datasets.<p>3. Creating models of transcription factor binding that allow us to predict the effects of perturbations.<p><i>Required qualifications:</i> Doctorate in computational biology, computer science, electrical engineering, statistics, or physics obtained in the last five years. Submitted papers in genomics or machine learning research. Expertise in Python and Unix environments.<p><i>Preferred qualifications:</i> Experience with epigenomics and graphical models. Published papers in peer-reviewed journals or refereed conference proceedings. Expertise in R, C, and C++.<p>We will consider candidates who need a VISA to work in Canada.<p><i>To apply:</i> We will accept applications until the position is filled. Please submit a CV, a PDF of your best paper, and the names, email addresses, and phone numbers of three references to the address at <a href=\"http://pmgenomics.ca/hoffmanlab/join/#postdoc\" rel=\"nofollow\">http:&#x2F;&#x2F;pmgenomics.ca&#x2F;hoffmanlab&#x2F;join&#x2F;#postdoc</a>","time":1396373451,"type":"comment"}