{"by":"rosy720","id":7511993,"parent":7507765,"text":"Menlo Park, CA - Full Time Venture Capital Analyst at Canaan Partners<p>APPLY HERE: <a href=\"http://boards.greenhouse.io/canaanpartners18/jobs/9243#.Uzs0Sa1dXOU\" rel=\"nofollow\">http:&#x2F;&#x2F;boards.greenhouse.io&#x2F;canaanpartners18&#x2F;jobs&#x2F;9243#.Uzs0...</a><p>Canaan Partners is seeking an analyst who is energetic, passionate about technology, and intellectually curious to join its Menlo Park, CA Information Technology team.<p>You:<p>-Are extremely passionate about, excited by, and steeped in technology. Our team covers a broad landscape from mobile apps and social media to enterprise SaaS and datacenter infrastructure (and everything in between). While the firm has a Health Care team, this opening is specifically for the Information Technology team<p>-Are based in the Bay Area and have a strong network in the startup community<p>-Have an undergraduate degree from a top university in a technical field: engineering, CS, math, computer science, physical science, or a related field. Strong quantitative and technical chops are very important. If you don’t have a technical degree, you must be able to demonstrate how you’ve gained technical experience<p>-Have 1-3 years work experience at a startup, in tech banking, or tech management consulting. Candidates should have a good business toolkit and a strong grasp of technology and tech business models<p>-Have strong interpersonal skills and a creative problem solving style<p>-Enjoy working in a small team environment<p>-Willing to articulate opinions on investment decisions and be outspoken if necessary<p>-This is a particularly exciting time to join a Venture Capital firm. It has never been easier spin up a startup, and there is more data available about markets, trends, and young companies than ever before. Our new analyst will have the opportunity to tackle this mountain of data and design and influence how we use new public data sources and our own proprietary data.<p>The analyst role is a 2-3 year position that is traditionally followed by business or graduate school or an operational role. Past Canaan analysts have gone on to top b-schools, to start their own companies, or to join tech companies.<p>The analyst will work with Canaan’s senior IT investment professionals to assist in:<p>-Analysis and assessment of markets and competitive landscapes<p>-Development and management of new data sources<p>-Due diligence of potential investments<p>-Development of investment theses<p>-Preparation of advisory meeting presentations<p>-Sourcing of new deals<p>APPLY HERE: <a href=\"http://boards.greenhouse.io/canaanpartners18/jobs/9243#.Uzs0Sa1dXOU\" rel=\"nofollow\">http:&#x2F;&#x2F;boards.greenhouse.io&#x2F;canaanpartners18&#x2F;jobs&#x2F;9243#.Uzs0...</a>","time":1396389194,"type":"comment"}