{"by":"wbailey","dead":true,"id":7511715,"kids":[7511855],"parent":7507765,"text":"San Francisco, CA<p>Are you excited by the opportunity to revolutionize an industry?<p>InvestCloud, born in a garage (it&#x27;s what Californian companies do, after all), is driving a high-speed design and technology revolution that is transforming the way the financial industry uses, processes and interacts with data.<p>Today, any investment manager can have access to a first-class integrated investment platform through the cloud, with InvestCloud. We are the first true cloud platform for the securities market. Since the launch in January 2012, we have over 100,000 users in excess of 1 trillion assets, accessing information securely from any location with any device.<p>We are looking for bright and talented individuals as we advance our cutting edge proprietary technology.<p>JOB DESCRIPTION<p>The Candidate:<p>The InvestCloud team is looking for a creative and analytic product developer in the San Francisco Bay Area with the technical skill, architectural acumen, and the drive to deliver innovative solutions to the challenges today’s investment managers face. You are a full stack developer, with experience in modern web frameworks and are passionate about owning the design and implementation of feature set as a whole. You enjoy not only coding in all layers of the stack, but care deeply about code quality, performance, and execution. Additionally, you are a skilled technologist with an interest and experience in the asset management industry, and you are excited by the opportunity to change the way that the global finance industry uses and interacts with data.<p>Key Responsibilities:<p>- Designing, developing, automating, and executing new server-side features.<p>- Drive and deliver the next generation of features and functions to expand the InvestCloud product offering.<p>- Find ways to leverage new technologies to increase the scalability and performance of the platform.<p>- Recognize opportunities to expand the product suite to capitalize on new market opportunities.<p>- Develop and architect new product features.<p>- Working with other teams at InvestCloud to implement the operations plan for our applications.<p>- Ensuring that we are continuously raising our standard of engineering excellence by implementing best practices for coding, testing, and deploying.<p>- Make informed decisions, and be comfortable with celebrating your successes and learning from your failures.<p>QUALIFICATIONS<p>- Experience with highly available, multi-tenant, cloud-deployed applications.<p>- Commitment to a high standard of software quality and best practices.<p>- A BS&#x2F;BA in Computer Science, or related field, and a strong interest in investment management.<p>- Experience in multi-threaded application environments.<p>- Knowledge of modern web frameworks like Ruby on Rails and Django.<p>- Experience with Git.<p>- Expertise in object oriented programming languages (Java, C#, C++, etc.)<p>- Proven track record of willingness and ability to learn and master new languages and frameworks.<p>View other job openings here: <a href=\"https://www.smartrecruiters.com/InvestCloud/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.smartrecruiters.com&#x2F;InvestCloud&#x2F;</a>","time":1396386741,"type":"comment"}