{"by":"dave1010uk","id":7511570,"parent":7507765,"text":"<p><pre><code>    Senior PHP Engineer\n    We Are Base\n    Bournemouth, United Kingdom\n    Full time, in house \n</code></pre>\nA bit about the role <p>This is a genuine opportunity to work alongside talented people to innovate and build digital services that make a difference to people every day, including an exciting product spin out. Working in an increasingly connected life, the role looks a little something like this:<p>1st class engineer <p>You will be used to working as part of an unsilo’d production team, where designers work alongside developers, in agile sprints where they’re useful. Your main skill set is writing PHP but you may have experience with other languages (like JavaScript&#x2F;Node.js, Go, Objective C or Java) that has influenced how you code. You’ll be familiar with PHP frameworks, such as Symfony, Laravel, Aura &amp; Zend, and building on top of content management systems, such as WordPress. You’ll be comfortable with object orientated design patterns, unit testing, APIs &amp; databases. Every pony at Base is capable of more than one trick. You’ll have an understanding of usability and how that works with functionality<p>Data hungry <p>You’ll have a keen interest in datasets, with good skills in filtering the signals from the noise. You’ll have an eye to the future and know that tracking something now will make for way more interesting times later. You’ll be comfortable integrating 3rd party systems through APIs you’ve helped architect.<p>Open all hours <p>You’ll have a keen interest in the way openness in technology (and in particular open data) can change things. And you’ll have ideas that mash one set with another, whether you’ve realised them yet or not. Our developers come up with projects for our clients, rarely the other way round.<p>Solver of riddles <p>You won’t know the answer to every question that comes your way, but you’ll be someone who knows how to hunt it down. This job isn’t forensic science, but being able to piece the jigsaw back together and crack the nut is your daily bread. Inquisitive by nature you, like us, want to understand what makes things tick to make them better.<p>Getting shit done <p>You’ll understand technical debt and be acutely aware that most pieces of code aren’t perfect, but you’ll be good at balancing the need to do something beautifully and the need to do it fast, including both where you can. You’ll regularly use Git, bash scripting and Sass, or similar, because of what they bring to the table.<p>Commercially aware <p>You will be able to develop a genuine understanding of our client businesses, allowing you to identify opportunities for and with them. The best developers understand the end goal, not just their role in a project. You’ll be able to think commercially about the client business, as well as deliver work that doesn’t fall over as its user base scales. You’ll be expected to apply innovation to solve challenges, remembering that the best solutions are often beautiful in their simplicity.<p>Keen eye, tuned ear <p>An eye for detail and a high standard of output is important to the success of the role. We’ve developed a code standard that gives us a bar to reach for. You’ll play a part in developing and guiding it as we grow. You’ll know that most project budgets don’t allow interface designers to cover every inch of an application, so you’re good at communicating with them and finding ways to smartly join the dots with a minimum of fuss.<p>Security and speed <p>You’ll be hot on security too. The one thing that no one sees, until it goes to the wall. Then everyone knows about it. You’ll know how to react when an overseas friend tries to gain access to one of your servers from your years of ethical hacking. Creating applications that are quick is fundamental to the role too. An understanding of devices, connections and optimisation is key to delivering the quality we’re after. But then you already know that.<p>About We Are Base<p>We&#x27;re a digital service design company that builds user-centred digital services for businesses, using data they already have.<p>We help our clients realise opportunities by transforming their data into something new and valuable. Clients include Timex, Garmin and Nottingham City Transport.<p>At Base you will be part of a team of makers and doers, working across a variety of projects and clients. We’re agile, but not dogmatic about it. Our process evolves to suit our needs.<p>We value and support CPD, actively seeking clients with a like-minded desire to push boundaries, providing you with an opportunity to build your experience and skills.<p>We practice a sustainable pace, recognising that we each have lives and families outside of work. Late nights and &gt; 40 hour weeks are rare by design.<p><a href=\"http://wearebase.com/hiring\" rel=\"nofollow\">http:&#x2F;&#x2F;wearebase.com&#x2F;hiring</a>","time":1396385488,"type":"comment"}