{"by":"wbailey","dead":true,"id":7511723,"parent":7507765,"text":"San Francisco, CA<p>Are you excited by the opportunity to revolutionize an industry?<p>InvestCloud, born in a garage (it&#x27;s what Californian companies do, after all), is driving a high-speed design and technology revolution that is transforming the way the financial industry uses, processes and interacts with data.<p>Today, any investment manager can have access to a first-class integrated investment platform through the cloud, with InvestCloud. We are the first true cloud platform for the securities market. Since the launch in January 2012, we have over 100,000 users in excess of 1 trillion assets, accessing information securely from any location with any device.<p>We are looking for bright and talented individuals as we advance our cutting edge proprietary technology.<p>JOB DESCRIPTION<p>The Candidate:<p>The InvestCloud team is seeking a talented print reporting specialist in the San Francisco Bay Area with the technical skill, architectural acumen, and the drive to deliver innovative solutions to the challenges today’s investment managers face. You have the experience of delivering simple, smooth design solutions that dramatically improve the usability and productivity of our software. Additionally, you are a skilled technologist with an interest and experience in the asset management industry, and you are excited by the opportunity to change the way that the global finance industry uses and interacts with data.<p>Key Responsibilities:<p>- Drive and deliver the InvestCloud print reporting suite.<p>- Find ways to leverage new technologies and plugins to increase the scalability and performance of the platform.<p>- Develop and maintain InvestCloud library of reports.<p>- With limited direction, prioritize, organize, and schedule work assignments and projects.<p>- Quickly analyze and recommend solutions that accommodate technical requirements&#x2F; limitations.<p>- Participate in brainstorming and other idea-generating team sessions.<p>- Multi-task and work efficiently under pressure.<p>- Make informed decisions, and be comfortable with celebrating your successes and learning from your failures.<p>QUALIFICATIONS<p>- Experience with highly available, multi-tenant, cloud-deployed applications.<p>- Proficient understanding of a variety of reporting technologies (BIRT, Excel, SQL, SSRS, Tableau, Crystal Reports, etc.)<p>- Understanding of Service Oriented Architecture and experience generating print reports using one of the above technologies with services.<p>- Experience working in an Agile development environment is preferred, e.g., Scrum or Kanban.<p>- Experience developing end-to-end Business Intelligence solutions is desired.<p>- Knowledge of SQL and NoSQL database architectures.<p>- Must be attentive to details.<p>- Ability to complete multiple projects simultaneously within specific time frames.","time":1396386834,"type":"comment"}