{"by":"amitt","id":7511892,"parent":7507765,"text":"Hi! We’re Red Hot Labs from San Francisco and we&#x27;re looking for a FULL-TIME DEV (authorized already to work in the US, no remote, no interns, thanks!)<p>We&#x27;re on a mission to revolutionize how mobile developers harness their data.  Our product, still in beta, functions as the central hub for all the services mobile developers already use.  By weaving together the data from these disparate services, we gain a comprehensive view of the app and are uniquely positioned to deliver insights and value back to the developer.<p>This isn&#x27;t our first trip around the block.  Our previous startup was acquired by Zynga and our core technology turned into FarmVille and the rest of Zynga’s most successful games.  It was a wild ride and now we’re full steam ahead on a new adventure. We&#x27;re well backed by folks such as A16Z, Greylock, SVAngel, DCVC, and more.<p>We&#x27;re looking for passionate, energetic, highly talented engineers to join our team.  By becoming a foundational member of our team you will help shape the direction of our product, company and culture.  We’re believe in constantly challenging ourselves to learn new things and would love to teach you what we know and learn from you as well.<p>We want all engineering members of the team to be full-stack engineers and well-rounded individuals.  But, we&#x27;re especially excited about the following engineering profile:<p>THE ROLE:<p><pre><code>  Senior Systems Engineer: You&#x27;ve architected and scaled backend systems to \n  millions of users.  You&#x27;ve put out every kind of fire and learned a lot in the \n  process. You understand the tradeoffs of different data stores, server \n  architectures, and low-level services. \n\n</code></pre>\nOUR STACK:<p><pre><code>  - Redis, MySQL, Rails for our backend API.\n  - Mostly AWS with a little bit of Heroku for our hosting.\n  - AngularJS, jQuery, Underscore, Node.JS with D3 for our dashboard and web apps.\n  - 3rd party services: Facebook, Mixpanel, Stripe, Mailgun\n</code></pre>\n==================================<p>Do any of the above profiles sound like you? Send us an email at: jobs@redhotlabs.com<p>Or, learn a little more about us here: <a href=\"http://www.redhotlabs.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.redhotlabs.com&#x2F;jobs</a>","time":1396388161,"type":"comment"}