{"by":"toconnor","id":7512879,"parent":7507765,"text":"Wingspan Technology - Philadelphia Suburbs (Blue Bell, PA)<p>We are expanding our cloud operations team and looking to fill several fulltime positions.  See <a href=\"http://www.wingspan.com/career_open_positions\" rel=\"nofollow\">http:&#x2F;&#x2F;www.wingspan.com&#x2F;career_open_positions</a> to apply.<p>PostgreSQL Database Administrator<p>---------------------------------<p>You would be responsible for maintaining and expanding the databases in our privately hosted cloud solution.  This would include participation in database design, performance tuning, developer support, and system configuration.<p>Required Skills<p>- Experience managing a production PostgreSQL system<p>- Strong SQL query analysis skills<p>- Working knowledge of Linux environments (CentOS preferred)<p>Bonus Skills<p>- Experience in a highly available cloud environment<p>- Knowledge of Apache Solr and Apache Lucene<p>- Solid understanding of networking concepts and troubleshooting<p>Network Administrator<p>---------------------<p>You would be responsible for maintaining and expanding the network in our primary office and in the data centers of our privately hosted cloud solution.  This would include participation in network design, performance tuning, and system maintenance.<p>Required Skills<p>- Experience managing wired and wireless networks with Linux, Mac and Windows clients<p>- Working knowledge of Dell PowerConnect and Cisco switches<p>- Experience configuring WANs, LANs and VLANs<p>Bonus Skills<p>- Experience in a highly available cloud environment<p>- Solid understanding of WatchGuard firewalls and VPNs<p>- Knowledge of the ShoreTel IP PBX phone system<p>Senior DevOps Engineer<p>----------------------<p>You would be responsible for improving and maintaining the infrastructure of our privately hosted cloud solution.  This would include participation in architecture design, software deployment, developer support, and system configuration.  We expect this person to also contribute to the mentoring and training of the more junior members of the team.<p>Required Skills<p>- Experience managing a production Linux environment (CentOS preferred)<p>- Working knowledge of automation and management software like Puppet and Spacewalk<p>- Experience with virtualization platforms like VMware, Vagrant and Hyper-V.<p>Bonus Skills<p>- Experience in a highly available cloud environment<p>- Programming experience in Python and Bash<p>- Solid understanding of networking concepts and troubleshooting<p>DevOps Engineer<p>---------------<p>You would assist in improving and maintaining the infrastructure of our privately hosted cloud solution.  This would include participation in architecture design, software deployment, developer support, and system configuration.  We value a strong work ethic and the desire to grow over current knowledge, but prior relevant experience has an obvious advantage over those without.<p>Required Skills<p>- Working knowledge of Linux, Mac and Windows operating systems<p>- Understanding of the concepts of software deployment and automation<p>Bonus Skills<p>- Experience in a highly available cloud environment<p>- Programming experience in Python or Bash<p>- Understanding of networking concepts and troubleshooting<p>About Wingspan...<p>Wingspan Technology has been providing industry-leading technology solutions since 1996.  Our latest product is a cloud-based document management system for some of the world’s largest pharmaceutical companies.  Because of our small size your daily impact is noticeable and expected.  Wingspan believes that its growth as a company is dependent on each employee’s professional and personal growth.  We help this through one-on-one mentoring sessions, lunch and learn presentations, and social events like happy hours, our annual chili cook off, and a rather boisterous cornhole tournament.  Flexible work hours and telecommuting are also options to help maintain that work&#x2F;life balance.","time":1396400258,"type":"comment"}