{"by":"johnurbanik","id":7512119,"parent":7507765,"text":"Poptip (<a href=\"http://poptip.com\" rel=\"nofollow\">http:&#x2F;&#x2F;poptip.com</a> &#x2F; jobs@poptip.com) -- NYC (Gramercy&#x2F;Flatiron) -- FULL TIME &#x2F; INTERN -- Engineering &#x2F; Design &#x2F; Sales -- (We’re in the process of becoming H1B friendly)<p>OPEN POSITIONS<p>Engineering\n -  Engineer, Engineering Intern, Product Engineer, Streaming Data Engineer, NLP Engineer, Infrastructure Engineer, API Engineer, Mobile Engineer\nDesign\n -  Product Designer\nBusiness&#x2F;Sales\n -  Account Executive, Inside Sales Dev Manager, Account Manager<p>Poptip is an information discovery and modern market research company focused on social conversation analysis. Most recently, we were featured in the WSJ (<a href=\"http://on.wsj.com/1oQlv1E\" rel=\"nofollow\">http:&#x2F;&#x2F;on.wsj.com&#x2F;1oQlv1E</a>) in an article on how marketers understand what you really mean online. Shortly before that, we authored a twitter card for the Oscars (<a href=\"http://mashable.com/2014/03/02/kelsey-falter-poptip-oscars/\" rel=\"nofollow\">http:&#x2F;&#x2F;mashable.com&#x2F;2014&#x2F;03&#x2F;02&#x2F;kelsey-falter-poptip-oscars&#x2F;</a>), the first ever in-app voting experience on twitter.<p>-  We have a proven revenue model (with clients like CNN, Budweiser, L&#x27;Oreal, and the NFL) and are growing rapidly.<p>-  Our stack includes Go, Node.JS, AngularJS, Redis, DynamoDB, Kafka, Socket.io&#x2F;Engine.io, Vagrant, and Postgres,  and we’re constantly evaluating technologies like Docker,  CoreOS, Cap’n Proto, InfluxDB, Storm, and Spark.<p>-  We apply natural language processing and machine  learning techniques to millions of social posts to wrangle  actionable insights out the data, all in real time.<p>We are hiring for a wide range of positions spanning all aspects of the business. For more details about the individual positions head to <a href=\"https://poptip.com/careers/\" rel=\"nofollow\">https:&#x2F;&#x2F;poptip.com&#x2F;careers&#x2F;</a>.<p>Engineers:<p>We value the ability to communicate ideas clearly. You should be able to write well, speak your mind, and take feedback with humility. Engineers drive product decisions just as much as any other member of the team.<p>We’re hiring all across the board, so check out our careers page for more details about specific positions. In general, if you’re someone who likes thinking about the challenges of processing, storing, or displaying large amounts of data in real time you might be a good fit.<p>Designers:<p>Poptip was founded and is led by a designer. An exceptional customer experience has been the heart of this company’s success since inception. As a member of the design team, you would hold a high level of responsibility by leading the development of new products, visual standards, and features.<p>Business&#x2F;Sales:<p>We have been selling our products from the beginning. Customers rely on Poptip&#x27;s suite of products on a daily basis to help drive their businesses forward. Our sales team exists to help businesses better understand consumers and maintain two-way relationships with them. We are building a world class sales team with opportunities in sales, account management, and sales development.","time":1396390469,"type":"comment"}