{"by":"enoren","id":7513736,"parent":7507765,"text":"StepOne, Inc (<a href=\"http://www.steponeinc.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.steponeinc.com</a>) - Austin, TX - INTERN, FULLTIME<p>Come be employee #5 before we get to #18 by the end of the year!  We have been in stealth mode and under the radar in Austin, but are going to grow in a big way fueled by determination, investment and, yes, even revenue(Redbull doesn&#x27;t hurt either).  We are looking for leaders to help us build out the future and this is the perfect opportunity for someone wanting to make a big splash for themselves.<p>We are a funded (<a href=\"http://www.liveoakvp.com/past-investment.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.liveoakvp.com&#x2F;past-investment.html</a>) SaaS company that is simplifying customer support through personalized help via machine learning(ML), natural language processing(NLP), effortless identity and analytics.<p>Our stack is Django&#x2F;Python, Postgres, Redis, Angular and Salt, but are also looking to expand this as we expand the solution. We believe in constantly learning, so if you have any great ideas about new tools that we should be using then we will certainly listen. We are not quite continuous deployment(currently on weekly schedules), but are working towards that. We practice TDD, code reviews and believe in automating everything.<p>We are currently hiring for:<p>* Django&#x2F;Python developers to help us build out some immense backend services as well as dabble in mounds of machine learning.  You will have the opportunity to jump around to all aspects of the stack if you want or you can sink your teeth into areas such as large scale data pipelines, data analysis and visualizations, sentiment analysis of content through natural language processing, sub-second real-time highly dimensional recommender systems or an intelligent SLA bound context discovery engine.  We also have REST APIs if you&#x27;re into that kind of thing.<p>* Dev Ops engineer(Junior or Senior) to help us evolve our international multi-datacenter deployment and operations by helping to develop new internal tools alongside Salt Stack.  You will have the opportunity to work with one of the first Salt Stack certified engineers(<a href=\"http://www.saltstack.com/salt-blog/first-ever-saltstack-certified-engineers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.saltstack.com&#x2F;salt-blog&#x2F;first-ever-saltstack-cert...</a>) on the team who is leading our direction and worldwide server domination.  We don&#x27;t have walls up between operations and development so this is a perfect role for those developers out there wanting to dip into DevOps or the DevOps engineers who like to stretch their development side as much as their operations side.<p>* Client side developers to help us build out both our worldwide mobile web application presence as well as our web based management tool.  We leverage Backbone, Angular, SASS, Bootstrap and D3.js in our tool belts.  You would have a strong role in defining the future for these applications as they are both in their early stages and are in strong need of a passionate developer who wants to build a critical piece of our solution from the ground up.  In the next year you will also have the opportunity to build highly interactive data visualizations using D3.js to help bubble insights up out of both ad hoc data queries as well as offline analytics from the data streams from our systems as well as our large scale enterprise customers.<p>We offer the following:<p>*  Competitive salaries<p>*  Equity<p>*  Health Insurance<p>*  Equipment budget<p>*  Flexible vacation schedule<p>*  A flexible working schedule<p>*  Education&#x2F;conference opportunities<p>*  A passionate team<p>*  And more...<p>If you are interested, please send an email to erik@steponeinc.com and come help us build the next Austin success story!","time":1396416631,"type":"comment"}