{"by":"chlee","id":7513488,"parent":7507765,"text":"Course Developer  \nUdacity’s Course Developers are dedicated, talented, and technical teachers. They are movers and shakers who thrive on solving problems big or small. They are innate helpers and they will always find a way to come up with creative solutions for their students and peers. Course developers create and record classes, develop exercises and challenges, help students, and push the limits of teaching and learning online.<p>Responsibilities:  \n1. Work with exceptional instructors to generate high quality creative courses targeted to a wide range of students.\nLead and contribute to class discussion, providing timely responses to students, and understanding what problems students are having.  \n2. Write quizzes, homework assignments, and exams.  \n3. Record lessons, explanations, and content on camera and on the tablet.  \nWork as liaison between students, professors, engineers, and video editors to help guide the future of the course and company.  \n4. Work on a wide range of projects, including ones you develop yourself, from content production to instructional design to software development.<p>Desired Experience:  \n1. Be proficient with python  \n2. Clearly and accessibly explain course material to a wide range of students.  \n3. Ability to connect with and motivate students.  \n4. Resourceful - you naturally know how to find answers and are not afraid to ask for help.  \n5. Technical background, specific skills required differ based on the class.  \n6. Excellent critical thinking skills, including the ability to accurately link cause and effect and to generate relevant 7. solutions to problems.  \n8. CS or related experience teaching CS material is required!<p>What we look for:  \n1. Love of teaching, learning, and&#x2F;or a passion for education!  \n2. Demonstrated excellence as a teacher in some context.<p>Other details:\nThis position is located in Mountain View, CA - You must be open to working in this location to be considered.<p>Ready to apply?  \nSend us your updated resume and cover letter on what you like about Udacity.<p>Check out <a href=\"https://www.udacity.com/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.udacity.com&#x2F;jobs</a> for more details on perks and benefits!<p>We have lots of fun here!","time":1396411149,"type":"comment"}