{"by":"fan","id":7513411,"parent":7507765,"text":"Hiring: Full Stack Engineer in Cambridge, MA for www.PrepScholar.com<p>- We&#x27;re an education technology company based in Boston looking for good, all-around engineers working on both frontend and backend. You&#x27;ll be creating new product features to improve our students&#x27; learning and create a compelling educational experience.<p>* About Us<p>- We’re making education more effective through customization. We learn the strengths and weaknesses of learners and create tailored learning programs through advanced statistics. We create compelling educational experiences for our students by truly understanding their problems. We’re starting off with test prep, a $4 billion+ industry, and want to expand to education at large.<p>- In addition to the founders, our company currently has two software engineers and seven instructors in a mixture of part-time and full time roles.<p>- We have over a thousand users and hundreds of paying customers and are growing quickly. We recently reached gross profitability.<p>- The founders are two Harvard&#x2F;MIT grads who have started previous companies backed by Y Combinator and brought in over seven figures in revenue.<p>- We care about culture and a great work environment. We’re flexible with schedule, have efficient meetings, and want minimal hierarchy.<p>* We&#x27;re Looking For<p>- Full stack development skills – you should have past experience on web backends (Django or similar, MySQL or similar) and frontends (JavaScript, HTML, CSS).<p>- Familiarity with web operations (Linux, Apache&#x2F;nginx, AWS EC2) and our frontend stack (Backbone, SASS, Dust), and an eye for a design are large pluses.<p>- Willingness to try new things and pick up new technology quickly.<p>- We prefer an employee located in Massachusetts (we’re in Cambridge) or willing to RELOCATE (we will cover fees); however REMOTE working can be considered for strong candidates.<p>* Why Join Us?<p>- You’ll be a head engineer with an impact on company direction and culture. You’ll have the opportunity to lead the tech team and technical aspects of the company.<p>- We offer competitive market-rate pay with option for serious equity.<p>- Above all, you’ll be building something meaningful. Education is a linchpin of our country’s economy and empowers people to improve their own lives. For many reasons, education suffers throughout the country – class sizes too large, methods outdated, teachers underpaid. Here’s your chance to build a scalable solution that can disrupt education and leave a legacy.<p>* How to Apply<p>Send an email to jobs@prepscholar.com with your resume and cover letter. We&#x27;d love to see your work and personal projects, especially full-stack samples, so include any of these: your GitHub, project pages, or other portfolio.","time":1396409844,"type":"comment"}