{"by":"perplexes","id":7513054,"parent":7507765,"text":"VERBA - San Francisco, CA | INTERN, VISA\n<a href=\"http://staging.verbasoftware.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;staging.verbasoftware.com&#x2F;</a> (we&#x27;re mid-refresh) | jobs@verbasoftware.com<p>* Rails&#x2F;JS Product Focus - FULL-TIME or HALF-TIME with benefits\n* Analysis&#x2F;Infrastructure&#x2F;Performance Focus - HALF-TIME with benefits<p>Verba believes in challenging the status quo of college textbooks. As it stands, every participant in the market lacks information, and the textbook market is even the basis for the definition of &quot;Broken Market&quot;.<p>By injecting information at precisely the right places, Verba is changing the landscape of higher education affordability: Getting professor book adoptions in faster; Giving recommendations on close-to-market bookstore prices; Helping students compare their bookstore&#x27;s prices to those of its online competitors; Sourcing cheaper books from online markets; Selling them back to multiple wholesalers <i>and</i> online markets.<p>We guide every stage of a book&#x27;s life. We help students save money, and bookstores become and stay relevant, competitive, and transparent.<p>Numbers: 350 colleges and universities, tracking ~200k unique ISBNs, serving millions of students, raising the &quot;win rate&quot; for bookstores to 80%, and dropping prices across the board. 17 employees, 3 part-time. 2 dogs. 5 cats. 3 children.<p>Code: Ruby, Rails, JS, Clojure for Hadoop, MySQL on AWS w&#x2F; Chef. We love experiments and go with what works! We also love making a stable, solid product which is why we have a ton of metrics and a one-click build pipeline.<p>What&#x27;s in it for you: A great team and company culture, benefits (even for part time!), laptop, books, BART pass, pool table, somewhat healthy office snacks, great conversation during our yearly company work-cations, and hard, challenging, fulfilling work.<p>Message us if: You want to help make education better. You&#x27;ve got strong Rails knowledge, solid testing practices, a good head for architecture, and know enough JS to help out on front-end. A stats background, experience with Hadoop and knowledge of scheduling algorithms would be awesome, but not required.<p>How to get the job: Write a cover letter to jobs@verbasoftware.com that speaks to why this job might fit with you, and how you could help us out. The first step is a phone screen to solve a small programming problem. Then we&#x27;ll schedule an on-site interview for a few hours, and have you walk through some of our code with us. Also we&#x27;ll ask you some historical behavior questions, not logic puzzles. Then we&#x27;ll make you an offer, and you&#x27;ll accept and we have a new employee party!","time":1396403148,"type":"comment"}