{"by":"claytoncorreia","id":7519645,"parent":7507765,"text":"Vancouver, Canada - Chimp.net Hiring a Front End Developer, Ruby on Rails Developer, and more (all full-time).<p>## ABOUT US<p>Chimp is a small but growing technology company in downtown Vancouver. Our product is basically a bank account that&#x27;s only used for charity. Chimp is short for CHaritable IMPact. The team here has shipped products at places like Apple, EA, MySpace, ESPN and many more. Our site is Chimp.net where you can find out more about what we do.<p>-----------------------------<p>### Lead Front-End Developer<p>You’ll work with a passionate team of developers, designers and product managers to develop interfaces, applications and marketing sites that help people make smarter charitable decisions.<p><a href=\"http://blog.chimp.net/job/front-end-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.chimp.net&#x2F;job&#x2F;front-end-developer</a><p>-----------------------------<p>### Ruby on Rails Developer<p>Working as part of a team, you develop software solutions that help make giving part of every day life.<p><a href=\"http://blog.chimp.net/job/full-stack-ruby-on-rails-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.chimp.net&#x2F;job&#x2F;full-stack-ruby-on-rails-developer</a><p>-----------------------------<p>### Digital Writer<p>You love the written word for its power to persuade, and you know how to simplify complex ideas into pithy, action-oriented content.<p><a href=\"http://blog.chimp.net/job/digital-writer\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.chimp.net&#x2F;job&#x2F;digital-writer</a><p>-----------------------------<p>### Marketing Web Developer<p>Translate design into clear, user-friendly online experiences that drive user action. Our ideal candidate will have a complete understanding of contemporary web standards and browser compatibilities, and thrives in a collaborative, fastpaced, entrepreneurial environment.<p><a href=\"http://blog.chimp.net/job/marketing-web-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.chimp.net&#x2F;job&#x2F;marketing-web-developer</a><p>-----------------------------<p>Apply and more info: jobs[at]chimp.net and <a href=\"http://blog.chimp.net/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.chimp.net&#x2F;jobs</a>","time":1396479365,"type":"comment"}