{"by":"shad42","id":7519322,"kids":[7522558],"parent":7507765,"text":"Docker inc - <a href=\"http://www.docker.com/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.docker.com&#x2F;jobs&#x2F;</a> - San Francisco, CA<p>Software Engineer, Infrastructure Engineer, Web Designer\nAt Docker Inc, we believe that containerization will soon become the next big thing, the next tool which will be part of every developer and sysadmin toolbox. What&#x27;s &quot;containerization&quot;? The name comes the LXC technology (Linux Containers), and the technique is also known as &quot;Lightweight Virtualization&quot;.<p>That&#x27;s why we launched Docker (<a href=\"http://www.docker.io/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.docker.io&#x2F;</a>), an Open Source tool enabling anyone to run those Linux Containers very easily. Containers boot 1000x faster than virtual machines; their disk and memory footprint are also much lower; and they work on virtually all current platforms (from physical servers to public cloud instances). We think that they are the future of virtualization, and will soon become ubiquitous.<p>Convinced? Then fork the repo on github (<a href=\"https://github.com/dotcloud/docker\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;dotcloud&#x2F;docker</a>) and have a look at the code. Not convinced? Then check the website (<a href=\"http://www.docker.io/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.docker.io&#x2F;</a>), which contains more details, demos, and screencasts. Excited about this? Then join our engineering team!<p>Your responsibilities will include:<p>- being a contributor to the Docker project, which means contributing patches, and reviewing and merging pull requests from the community;<p>- working on some server-side applications; participate in product discussions, influence the roadmap, and take ownership and responsibility over new projects to make them happen.<p>You can qualify if you...:<p>- can read and write Go code (because docker itself is in Go);<p>- can read and write Python code (because many tools and services built around Docker are in Python);<p>- are familiar with network protocols: the lower layers like IP, TCP, and UDP; and the higher layers like HTTP;<p>- have experience in scaling large applications;<p>- believe that writing unit and functional tests is important.","time":1396475397,"type":"comment"}