{"by":"dpickett","id":7531058,"parent":7507765,"text":"Boston, MA - Launch Academy - <a href=\"http://www.launchacademy.com/careers/senior-experience-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;www.launchacademy.com&#x2F;careers&#x2F;senior-experience-engin...</a><p>Do you enjoy mentoring other developers? Are you passionate about sharing your knowledge with others? Help aspiring software engineers change their careers and their lives as a Senior Experience Engineer at Launch Academy.<p>As a Senior Experience Engineer, you will both develop Launch Academy software and mentor aspiring web developers. You will help 35 eager learners through coding challenges and will build cool software, both with the students and with the other founding members of a new, exciting, edTech business. In addition, you will have the rare opportunity to deploy an app and have a direct conversation with its primary users, our students, 3 minutes later.<p><i></i>Help our team:<i></i><p>-Refine and deliver the Launch Academy curriculum - an aggressive amount of full-stack development education packed into a 10-week program<p>- Assist us in the improvement of our proprietary learning management system, Apollo<p>- Mentor, advise, and coach 35 eager learners<p><i></i>Help our students (aka Launchers):<i></i><p>- Learn the basics and fundamentals of programming<p>- Learn best practices in web standards and front end development<p>- Develop skills as future architects of object oriented, database backed applications<p>- Grow and develop as technology professionals<p>- Become involved members of the Ruby community<p>- Acquire the skills they need in their future jobs as junior Rails developers<p>The ideal candidate gets excited about sharing new things they&#x27;ve learned and working with various parts of the Rails stack. Your goals should include establishing yourself as a helpful and integral member of the Web Development community at large.<p>This is a full time position with a highly competitive salary and performance bonuses, benefits package, paid holidays, and more. Get paid like a developer, and work as an educator! We have a great team and regularly admit an impressive group of students.<p>We do not work with third parties or agencies. If you are a recruiter or third party, please do not solicit or respond to this post.<p><i></i>About the Company:<i></i><p>Launch Academy offers intense, 10 week, educational programming that transforms 30-38 eager learners into rising stars within the web development community. Our immersive, learn by doing approach sets us apart from traditional education models. Through our program, students develop real software that solves real problems. We then help them to find jobs and provide support once they&#x27;ve &quot;Launched.&quot;<p>We need your help to make the Launch Academy experience remarkable! Find out more at <a href=\"http://www.launchacademy.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.launchacademy.com</a>","time":1396616548,"type":"comment"}