{"by":"tashian","id":7550175,"parent":7507765,"text":"yerdle - San Francisco<p>We&#x27;re hiring a whole-stack web developer. We&#x27;re a new kind of store—stocked from people&#x27;s closets and garages—where everything costs $0.<p><a href=\"https://yerdle.com/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;yerdle.com&#x2F;jobs</a><p><pre><code>    === About yerdle ===\n</code></pre>\nWhy should we always buy new, when there are millions of perfectly great items sitting in closets and garages? How can we liberate these items and put them back into good use? How can we make sharing the new shopping?  This is why yerdle exists.  We help the world exchange second-hand goods for free. 80% of things in our homes are used once per month or less. The average power drill sees 6 minutes of use in its entire lifetime. There&#x27;s 3 billion ft² of self-storage space in the United States. That&#x27;s, like, two San Franciscos of usable stuff—just sitting there.  Yerdle is changing that. People on yerdle give away everything from kid’s clothes to kitchen tools and electronics. And we make it easier to get something re-used rather than buy new. We aim to replace 25% of new purchases with free, second-hand goods from others. In the process, we&#x27;re helping people save money and encouraging manufacturers to make better products.  We&#x27;re looking for people who are passionate about our vision and who want to use their skills to make the world a better place.<p><pre><code>    === Team and Culture ===\n</code></pre>\nWe&#x27;ve been called &#x27;unrepentant hippies&#x27;—and that&#x27;s fine with us. This is a top-shelf engineering team building a great product in a fast-paced environment. We have developed deep trust and a lot of love as we&#x27;ve worked together. It&#x27;s a close-knit team, we like to pair, and we teach each other every day.  We have solid funding through incredible firms such as The Westly Group and Claremont Creek as well as angels with deep expertise such as Lisa Gansky, Adam Lowry and Andy Rappaport.<p><pre><code>    === Workflow and Process ===\n</code></pre>\nWe&#x27;re agile, we do daily standup, regular one-on-ones and project retrospectives, and we have fun together—rock climbing, surfing, and hanging out after work over beers. As an engineer at yerdle, you&#x27;re more than a coder. You will influence the product&#x27;s direction, bring brilliant ideas and execute them.  We are polyglots, and most of our software is in Ruby, Objective-C, and JavaScript. We love to pair and we often let tests drive our development. And we code small (see our blog: <a href=\"http://codesmaller.com\" rel=\"nofollow\">http:&#x2F;&#x2F;codesmaller.com</a>).<p><pre><code>    === Hours and Schedule ===\n</code></pre>\nThe day starts around 9am and we have a standup meeting at 10. We try to schedule any other meetings early or late in the day, so the middle of the day can be a great time to get the meat of the work done. Most people head out around 6pm, but some nights we work a little later. Though yerdle is a 24&#x2F;7 marketplace and we all have responsibilities in keeping it running smoothly, we try to keep our weekends clear as a time for R&amp;R.","time":1396910829,"type":"comment"}