{"by":"hyperlogic","id":7556246,"parent":7507765,"text":"San Francisco, CA<p>DeNA West<p>DeNA - Mobile Innovation with a Smile<p>size: 201-500<p>status: Public<p>founded: 1999<p><a href=\"http://www.denajobs.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.denajobs.com&#x2F;</a><p>We are...<p>Mobile. Games. San Francisco. Global. Entrepreneurs.\nPlease call us ‘D-N-A’: we make games, a social games platform, e-commerce products and other services for mobile devices.<p>We believe mobile is the future of human communications and entertainment: we aim to impact and delight this mobile world.<p>...and...<p>We have an entrepreneurial office culture. We work hard, we push ourselves to excel, and we smile in the face of the impossible.<p>We&#x27;re building things that have never been built, learning together how to delight a rapidly evolving mobile app market. At DeNA you have the potential to reach tens of millions of people with your work.<p>What we&#x27;re working with...<p>ios android unity node.js go objective-c java ruby sinatra ruby-on-rails javascript git github google-app-engine aws redis mongo cassandra fabric cucumber rspec jenkins linux osx<p>We develop backend systems to power hundreds of iOS, Android and Unity games. The backend API services are written in Ruby, which we are transitioning to Go. The native iOS and Android client SDKs we produce call directly into the backend services, often via a proxy layer in Google App Engine. We use enterprise Github to manage our code, and regularly contribute to numerous open source projects.<p>We are constantly iterating towards higher availability, scalability, and performance within all our services and components. We strive to serve more requests, faster, and on fewer servers.<p>We have great benefits:<p><pre><code>  * Breakfast, lunch &amp; dinner. Snack wall (healthy &amp; junk).\n  * Beer on tap\n  * Weekly yoga.\n  * Gym reimbursement.\n  * Intramural soccer, softball, basketball &amp; more.\n  * Customizable ergonomic set-up.\n  * Apple portable computer &amp; Apple Cinema Display.\n  * 13 paid holidays.\n  * 120 hours accrued PTO.\n  * Flexible work schedule.\n  * Standard HMO&#x2F;PPO &amp; company covers 100% of premiums.401k.\n  * Stock-based benefits.\n  * 2 performance reviews&#x2F;yr.\n  * Paid maternity and paternity leave.\n  * Off-site dinners, milestone celebratory outings, regular happy hours.\n</code></pre>\n185 Berry Street<p>Suite 3000<p>San Francisco, CA 94107","time":1396993836,"type":"comment"}