{"by":"__derek__","id":7578704,"parent":7507765,"text":"Seattle (Kent, WA) - REI - various positions [relocation]<p>---<p>REI is a major outdoors retailer whose e-commerce sales continue to grow rapidly. We use an Agile Scrum methodology and work in three-week sprints. Our code is in Git, and everything runs through CI (with automated PR builds and unit&#x2F;integration tests). We embrace code-reviews and continuous learning wholeheartedly (if it works better, let&#x27;s use it!).<p>Oh, and did I mention that we&#x27;re REI? The two major initiation steps are your first Pro Deal and your first short Friday as you get out to use that purchase. We <i>love</i> the outdoors here.<p>---<p>Front-End Developer<p>You&#x27;ll work with architects, interaction&#x2F;UX designers, and other developers to develop and implement new features on REI.com. We&#x27;re in the process of refreshing everything front-end around here, and you&#x27;ll be able to explore new tools. Standards like jQuery dominate, with Knockout, Angular, and Handlebars playing a role as well. We have worked hard maturing our front-end build system, using Gulp, Browserify, Less, Mocha, Istanbul, etc. You will be able to have a major impact as a FED at REI.<p>---<p>Software Engineer<p>As a back-end developer, you&#x27;ll work alongside other developers along the stack to develop new features for REI.com and services to be consumed on REI.com and by REI&#x27;s mobile and in-store apps. Unit testing is the name of the game. You&#x27;ll have the opportunity to do interesting work as we start to take advantage of the member data that we have to deliver a more personalized experience to REI customers. Plus, the FEDs will love you.<p>---<p>Interaction Designer<p>If you&#x27;re an experienced designer in the digital space who loves to think about users in all kinds of contexts, then REI might be the place for you. Working with UX designers, copywriters, and developers, you&#x27;ll have the opportunity to create, design, and prototype experiences on the web, in mobile&#x2F;tablet apps, and for in-store technology. You will also have the opportunity to influence and help flesh out REI&#x27;s design standards.<p>---<p>For more information on any of these, get at me (@derekpetey) or check out <a href=\"http://rei.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;rei.com&#x2F;jobs</a>.","time":1397327968,"type":"comment"}