{"by":"benkross","id":7587002,"parent":7507765,"text":"crowdtap is hiring!! Please use the links below to apply for your functional area.<p>We are a 4 yr old and profitable startup. We are #3 on Crains NYC best places to work and # 6 on Mashables best places to work, among a host of other awards. We also are very proud of our open-source contributions.<p>We work in small autonomous teams where the engineers are involved from the very beginning and are expected to heavily influence the product and see it through from idea to validation and optimization. Finally, and most importantly, we value work-life balance by working reasonable hours and encourage side projects.<p>We need<p>-Engineering Interns for the summer\n-Sr Full Stack Ruby Engineers\n-Full Stack Ruby Engineers (Ruby not required)\n<a href=\"http://crowdtap.theresumator.com/apply/6XhXnB/Software-Engineer-all-Levels.html\" rel=\"nofollow\">http:&#x2F;&#x2F;crowdtap.theresumator.com&#x2F;apply&#x2F;6XhXnB&#x2F;Software-Engin...</a><p>-DevOps engineer <a href=\"http://crowdtap.theresumator.com/apply/6Mt0co/DevOps-Engineer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;crowdtap.theresumator.com&#x2F;apply&#x2F;6Mt0co&#x2F;DevOps-Enginee...</a><p>Also hiring<p>Business Development <a href=\"http://crowdtap.theresumator.com/apply/AkOcKS/Business-Development-Associate-New-York-NY-And-Chicago-IL.html\" rel=\"nofollow\">http:&#x2F;&#x2F;crowdtap.theresumator.com&#x2F;apply&#x2F;AkOcKS&#x2F;Business-Devel...</a><p>Client Services\n<a href=\"http://crowdtap.theresumator.com/apply/FsfH6X/Supervisor-Client-Success.html\" rel=\"nofollow\">http:&#x2F;&#x2F;crowdtap.theresumator.com&#x2F;apply&#x2F;FsfH6X&#x2F;Supervisor-Cli...</a><p>About Us<p>Crowdtap is the collaborative marketing platform, allowing marketers to unlock real value by partnering with their most engaged consumers throughout the marketing process. With Crowdtap, brands can learn, ideate and market with their consumers on-demand.<p>Crowdtap works with leading brands including Verizon, Reckitt-Benckiser, Old Navy, AT&amp;T, ConAgra and Sony. Headquartered in New York, Crowdtap is funded by The Foundry Group and Tribeca Venture Partners.<p>Due to the large volume of received applications, we are only able to respond to applicants who possess the experience and qualifications that closely match the requirements of the above position. No Recruiters please.","time":1397491906,"type":"comment"}