{"by":"DLarsen","id":7601137,"parent":7507765,"text":"Connexity (online advertising) - Los Angeles area, Camarillo, CA<p>As a division of Shopzilla, we help advertisers reach their audience with less money. We help publishers make more money by better selling their audience. Everybody wins.<p>We&#x27;re looking to add a talented, highly motivated DevOps engineer.  You&#x27;ll build automation into processes that are unnecessarily manual, identify opportunities to improve redundancy&#x2F;fail-soft capability, and extend our already comprehensive system monitoring.  You&#x27;ll coordinate the test and release of code developed by company engineers at remote locations while working co-located with the core team of system developers.  On days when not everything is running smoothly, we’re looking for someone that can develop a solid understanding of triage options and trade-offs, and eventually call the shots in bringing everything back in line.<p>We are searching for an engineer that likes a challenge, wants an opportunity to work with cutting edge technologies, and thrives in small teams. We do a fair amount of big data streaming and reporting. Our architecture is unique and our software stack purposefully diverse.  Everyone on the team possesses a strong sense of ownership of their work.  Your contributions will be immediate and will be felt through out the company.<p>I can vouch for the fact that working at Connexity is fun, fast-paced, and open-ended.  No dogma here.  We&#x27;re all about choosing the best tools and processes to get the job done.<p>If you don&#x27;t already have intimate knowledge of Hadoop, Hbase, and Redis... you will.  It could be a great chance to grow your skill set.<p>The company believes that happy employees make for great work and a family atmosphere.  Our locations feature breakfast bars, free lunches, etc.  Shopzilla has offices in LA, San Diego, Camarillo and London.<p>Reach out to acastaneda@aislea.com for more info.","time":1397690683,"type":"comment"}