{"by":"alc277","id":7627565,"parent":7507765,"text":"Herndon, Virginia - PHP Web Application Developer - Marine Spill Response Corporation (MSRC)<p>Not Your Average Job<p>As an employee of Marine Spill Response Corporation (MSRC), supporting oil spill and emergency response operations will be the most important part of your job.  However, it will likely only comprise a small amount of your time.  The majority of your time will be working with a small team of developers managing a number of mission critical web applications and websites.  We are looking for a creative and innovative full-stack developer who can help us build and maintain our Intranet, company website and various other applications.  If you are looking for an interesting place to work this may be the job for you!<p>Skills and Requirements<p>* Advanced Object Oriented PHP<p>* Proficient in HTML, CSS, Javascript, AJAX, jQuery, MooTools, JSON<p>* Experience in UX&#x2F;UI Design<p>* Knowledge of Application Architectures and Design Patterns<p>* Proficient in MySQL and Relational Database Design<p>* Experience with Linux Server Administration and Shell Scripting<p>* Experience with Git Source Control<p>* Image Editing Skills<p>* Ability to work well independently and as part of our team<p>* Strong desire to learn<p>* Can take direction and provide constructive feedback<p>* A minimum of 4 years of extensive hands-on experience in a multidiscipline Information Systems Department including software programming and traditional computer data infrastructure support a must<p>Requirements Specific to Oil Spill Response<p>* During oil spill and emergency response operations the candidate could be called on to assist setting up, operating, and maintaining the Emergency Communications Package (ECP).  Additional response assignments may include operating the communications command center of an Oil Spill Response Vessel (OSRV). To fulfill these requirements, the candidate is required to:<p>* Be on call and ready to respond 24 hours a day, 7 days a week<p>* Have sufficient credit to meet travel requirements<p>* Travel to emergency response locations<p>* Be subject to MSRC’s Medical Surveillance Program and random drug screens.<p>* Must meet the physical requirements of the job, including the ability to lift 35 pounds<p>Benefits<p>* MSRC offers a competitive benefits package, to include a 401(k) company match.<p>About MSRC<p>* MSRC is the largest, dedicated oil spill and emergency response organization in the United States and a not-for-profit organization.  For more information about MSRC please visit our website at www.msrc.org.<p>Apply Here: <a href=\"http://msrc.theresumator.com/apply/yI6ynJ\" rel=\"nofollow\">http:&#x2F;&#x2F;msrc.theresumator.com&#x2F;apply&#x2F;yI6ynJ</a>","time":1398174254,"type":"comment"}