{"by":"ninefold_ben","id":7871376,"parent":7507765,"text":"Cloud Network Engineer - San Francisco<p>•\tExciting start-up venture - funded by enterprise company<p>•\tCutting edge technology – Linux&#x2F;Networking&#x2F;Ninefold platform<p>This exciting start-up venture, which is being heavily invested in by a leading enterprise organisation, is looking for a Network Engineer with a can do mindset. You will be cutting your teeth with the latest cutting edge open-source technology, on the Ninefold platform, working with a team of like minded passionate people here and in Australia.<p>You are the sort of person that loves technology - for you, IT is a way of life, not a job, and you regularly attend local tech meet-up groups.<p>We’re breaking new ground and challenging the status quo, this is a superb opportunity to join a tight team that is supportive and likes lots of interaction. Being a rapidly growing company, the opportunity is yours to develop your skills, add to your responsibilities, and build your career. You will be working as part of a US based team while keeping correspondence with your Australian based counterparts. If this appeals to you, and you are looking to join an interesting company that innovates and is different from the rest, please apply.<p>Key responsibilities:<p>•\tDay to day administration and support of the Ninefold network and systems in a mixed Linux&#x2F;Windows environment<p>•\tExecuting network maintenance and management.<p>•\tEnsuring a smooth running of the complex Ninefold platform.<p>•\t2nd&#x2F;3rd level incident requests<p>•\tWorking in synergy with your overseas counterparts<p>•\tScripting&#x2F;Automation tasks (Ruby experience preferred)<p>•\tActing as a key team member on critical company projects&#x2F;implementations<p>Skills and Experience required:<p>•\tStrong Linux Administration skills (RHEL, CentOS, Ubuntu) – essential<p>•\tModerate networking skills – OSPF, Firewalls, Vlans<p>•\tJuniper networking experience – highly regarded<p>•\tXenserver and Cloudplatform experience - desirable<p>•\tExperience with online web environments - highly desirable<p>•\tExperience with Cloud platforms – a must<p>•\tSolid scripting skills in at least one language - Ruby, Python, Bash<p>•\tChef - highly desirable<p>•\tBasic understanding of Windows Server&#x2F;Exchange - desirable not essential<p>About Ninefold:<p>Ninefold believes developers should spend more time coding and less time deploying and monitoring their apps. We provide a platform for deploying and hosting your Ruby on Rails apps with the option of your own virtual servers. We built it on our own infrastructure, optimized it for performance and are backed by a publicly listed parent company.<p><a href=\"https://ninefold.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;ninefold.com&#x2F;</a><p>To apply please send your CV to benjamin@ninefold.com","time":1402362107,"type":"comment"}