{"by":"bbgm","id":11012763,"kids":[11023906],"parent":11012044,"text":"Amazon Web Services | Seattle | Full Time | ONSITE<p>The AWS Container Services team is hiring for a number of roles including engineers, managers, and product managers. The Container Services team at AWS owns Amazon EC2 Container Service (ECS) and Amazon EC2 Container Registry (Amazon ECR) and is tasked with enabling AWS customers and AWS service teams who want to build applications and services using Docker and other container technologies. Over the past few years, we have built a number of core systems designed to run and operate distributed applications built on top of Docker. We continue to enhance our platform by improving our existing systems and building new systems to solve our next set of problems and challenges.  If you are interested in Linux, Docker, networking, building very large scale cluster management systems, schedulers, and the future of computing in general, we are interested in talking to you. We are also looking for engineers who are interested in making these applications ridiculously easy to use via our management console and CLI.  We are a fast growing team that writes code in Go and Java (for the most part), is relentlessly focused on scalability, and gets to work with some of the most forward thinking customers on AWS.<p>Some of our open source projects:<p>* Amazon ECS Agent: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;aws&#x2F;amazon-ecs-agent\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;aws&#x2F;amazon-ecs-agent</a><p>* Amazon ECS CLI: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;aws&#x2F;amazon-ecs-cli\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;aws&#x2F;amazon-ecs-cli</a><p>A high level overview of the ECS architecture: <a href=\"http:&#x2F;&#x2F;www.allthingsdistributed.com&#x2F;2015&#x2F;07&#x2F;under-the-hood-of-the-amazon-ec2-container-service.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.allthingsdistributed.com&#x2F;2015&#x2F;07&#x2F;under-the-hood-o...</a><p>If you are interested, please email aws-ecs-jobs at amazon dot com or contact me directly (address in my profile)","time":1454344275,"type":"comment"}