{"by":"kingrolo","id":11014886,"parent":11012044,"text":"Django Tech Lead at Wildfish (<a href=\"http:&#x2F;&#x2F;wildfish.com\" rel=\"nofollow\">http:&#x2F;&#x2F;wildfish.com</a>) | London | UK applicants only. Mostly remote, but some London meetings.<p>We&#x27;re a London based consultancy specialising in building web apps for startups using Django.<p>We&#x27;re looking for a Technical Lead. You&#x27;ll need to be someone who is an enthusiastic and experienced hands on developer when required, but also comfortable managing and scheduling a team of developers and their workload, and happy to be a point of contact for the client or product owner for your team&#x27;s projects. You&#x27;ll need to be able to work autonomously so it&#x27;s important that you&#x27;re the sort of person who has attention to detail.<p>We all work remotely via Slack, but we&#x27;ll need you to be in or near to close enough to London to come in for meetings as required.<p>Everyone in our organisation has a background in code so it&#x27;s at the core of our organisation, so we&#x27;d like you to be someone who is passionate about their craft, and eager to share and learn with others who feel the same. We&#x27;d encourage you to be contributing to our open source projects and blogging as a regular part of your work.<p>Some of the skills which would be useful:<p>- Python &#x2F; Django<p>- Ubuntu Server Administration (AWS &#x2F; Linode &#x2F; Docker)<p>- Project Management<p>- HTML &#x2F; CSS &#x2F; Javascript<p>- React (plus npm, browserify and associated JS tooling)<p>- Twitter Bootstrap<p>- PostgreSQL, Redis, Nginx, Elasticsearch<p>- Testing &#x2F; TDD<p>- Docker &#x2F; Ansible &#x2F; Terraform<p>We&#x27;ve also recently finished a couple of projects in React Native, so any interest or experience in that would be a bonus. Please email work@wildfish.com, and let us know 3 of your favourite Django apps along the salary or rate you&#x27;re looking for. As this is a fairly key position ideally we&#x27;re looking for someone permanent but we&#x27;ll also consider someone who might like to freelance to start with.","time":1454356685,"type":"comment"}