{"by":"nd2","id":11013753,"parent":11012044,"text":"DriverMetrics | London, UK | Lead Rails Developer | Full Time | REMOTE<p>DriverMetrics was founded over a decade ago at Cranfield University to tackle the problem of driver safety by focusing on what over 25 years of our research shows is the main contributor to road crashes – driver behaviour. We provide the world’s most scientifically validated commercial fleet risk management tools, used in over 50 countries worldwide by organisations including Shell, Unilever, Greyhound and AkzoNobel to help keep their drivers safe on the roads.<p>We are currently in the process of significantly modernising our offering and expanding our business and sales operations. Product modernisation will include significant UX and design improvements as well as incorporating more advanced data analysis (machine learning) and integration of real-time fleet telematics data to help us even more accurately predict and mitigate driver incidents.<p>We’re currently looking for a Lead Rails Developer to work alongside the CTO to build a strong engineering and design team and develop the next generation of our software platform.<p><i></i>* Your Responsibilities <i></i>*<p>- Working with the CTO to manage the design, build and maintenance of a new software driver risk management platform\n- Working with the CTO to build a strong engineering team to develop the platform\n- Day-to-day responsibility for the management of the software spec, build and progress\n- Implementing and enforcing a secure development policy (and ultimately aiming to achieve PCI compliance)\n- Working across multiple disciplines (Front-end, Back-end, interactive educational content, cross-platform, HTML5 mobile)<p><i></i>* Our Stack <i></i>*<p>- Ruby &#x2F; Ruby on Rails\n- React.js, Coffeescript, Sass, Slim, Gulp \n- PostgreSQL, Redis, Elasticsearch \n- Nginx, Ubuntu \n- AWS (EC2, ELB, RDS, VPC, S3, Cloudfront, Route 53) \n- Mandrill, New Relic, Airbrake, Gitlab<p>For more information or to apply please email ndaniels AT drivermetrics . com","time":1454350106,"type":"comment"}