{"by":"andrewforee","id":11012483,"kids":[11014059],"parent":11012044,"text":"Salt Lake City, UT - Lucid Software (<a href=\"http:&#x2F;&#x2F;www.golucid.co\" rel=\"nofollow\">http:&#x2F;&#x2F;www.golucid.co</a>)<p>Lucid Software is building world class graphical applications in the browser and on mobile devices. Our first product, Lucidchart (<a href=\"http:&#x2F;&#x2F;www.lucidchart.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.lucidchart.com</a>), is an online diagramming application with 4M+ users. We recently launched our second product, Lucidpress (<a href=\"http:&#x2F;&#x2F;www.lucidpress.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.lucidpress.com</a>), which is an online layout and design application. Lucid is a startup founded by Karl Sun, a former Google exec, and Ben Dilts, our CTO. We&#x27;re profitable and rapidly growing in every dimension of the business and need people to join our team. For fun we raft river rapids on company retreats, have Friday BBQs, and eat lots of pizza. Talent and ability to learn are more important than specific skills.<p>BACKEND SOFTWARE ENGINEER (all experience levels) - Lucidchart and Lucidpress run with various decoupled services in a Linux environment using Scala, MongoDB, AWS, and MySQL. At Lucid your responsibilities would include enhancing existing services, building new services, integrating with 3rd party applications and ensuring services are highly available, secure, and scalable. Requirements: - Talent - BS degree Recommended experience: - Building large products &#x2F; applications - Scala or Java - MySQL or other relational database - NoSQL databases - Cloud computing (AWS) Apply here: <a href=\"https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j?aj=oa2cZfw7&amp;s=Hacker_News\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j?aj=oa2cZfw7&amp;s=Hacker_News</a><p>FRONTEND SOFTWARE ENGINEER (all experience levels) - Lucidchart and Lucidpress are powered by one of the largest Javascript codebases on the Internet (about 250k lines of JS), optimized so that the user experience is indistinguishable from an installed native application. Come help us show the tech world what can be done on the web. Requirements: - Talent - BS degree Recommended experience: - Building large products &#x2F; applications - Javascript - Google Closure compiler&#x2F;library - CSS&#x2F;HTML&#x2F;DOM manipulation - jQuery - Native app development on Android and&#x2F;or iOS Apply here: <a href=\"https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j?aj=odrjZfwG&amp;s=Hacker_News\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j?aj=odrjZfwG&amp;s=Hacker_News</a>","time":1454342378,"type":"comment"}