{"by":"ILIKEPONIES","id":11012723,"kids":[11014193,11018073],"parent":11012044,"text":"Underdog.io | New York, NY | <a href=\"https:&#x2F;&#x2F;underdog.io\" rel=\"nofollow\">https:&#x2F;&#x2F;underdog.io</a> | Full-Time | ONSITE or REMOTE<p>We’re looking to hire two full-stack engineers. Ideally, one would be a Python or JavaScript&#x2F;Node.js Engineer. The other would be a Ruby Engineer.<p>Today, Underdog.io is a curated marketplace for talent. We connect amazing people with founders, hiring managers, and recruiters at top technology companies.<p>We’re building technology to reduce the noise of the job search and match. We started Underdog.io because we experienced the pains associated with (1) hiring while working at top startups and (2) looking for new opportunities.<p>Our platform is currently live in SF, NYC, and for remote companies. We work with over 200 awesome companies. Quality is key to our model -- we turn away one of every two companies that have tried to join the network. We&#x27;ve proudly bootstrapped and profitable.<p>As we scale, we’ll focus on building tools for candidates to organize, search, and discover new job opportunities. In our view of the future, job candidates don’t receive as much unsolicited outreach from recruiters. Job search is organized and talented candidates have more high-quality options.<p>We use Python&#x2F;Flask, JavaScript&#x2F;Node.js, PostgreSQL, Elasticsearch, AWS. We&#x27;re also working on a project in Ruby&#x2F;Sinatra. And we&#x27;re big supporters of open source.<p>Link to GitHub: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;underdogio\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;underdogio</a><p>Link to recent Medium post: <a href=\"https:&#x2F;&#x2F;medium.com&#x2F;@cmuir&#x2F;lessons-from-sixteen-months-of-bootstrapping-at-underdog-io-6deb98344d31\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;@cmuir&#x2F;lessons-from-sixteen-months-of-boo...</a><p>Email chris@underdog.io to apply.<p>If you&#x27;re interested in working remotely, we&#x27;d ask that you&#x27;re located in the U.S. or Canada because of language and time-zone constraints. And, because we&#x27;re still a small team, we&#x27;re not able to accommodate recent bootcamp graduates. No recruiters or dev shops, please.  =&#x2F;<p>Keywords: NYC, Brooklyn, Developer, Dev, Engineer, Python, Flask, JavaScript, Node.js, Ruby, Sinatra, PostgreSQL, Elasticsearch, Open Source, <a href=\"https:&#x2F;&#x2F;underdog.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;underdog.io&#x2F;</a>","time":1454344065,"type":"comment"}