{"by":"repspark","id":11013985,"parent":11012044,"text":"RepSpark Systems | Costa Mesa, CA | Full-time | ONSITE<p>Do you change your variable names until your code reads like poetry? Do you debate Single Responsibility Principle with your friends over a frothy beverage? Do you like to deliver software that matters? Do you like to learn new things? Do you like to teach others?<p>If you answered yes to many of these, come practice the Art of Software Craftsmanship at RepSpark Systems.<p>We are looking for talented engineers who have very strong skills in &quot;application level&quot; JavaScript (sometimes called object oriented JavaScript); engineers who have done this for the browser or they may have done this on the server side via Node.js with experience applying coding patterns to their code (Module, Sandbox, etc.), valued modularization, written unit tests, and optimized for performance. In other words, your experience using JavaScript as a first class coding language is exactly what we’re looking for.<p>Other notables are advanced knowledge of JavaScript, including prototype-based inheritance, promises, event delegation, DOM queries, closures, callbacks, AJAX, JSON, and understanding of the JS memory model. Ideally, you’d have shown the ability to lead an effort, promote best practices, and help the rest of the team grow in their JavaScript ability.<p>As JavaScript becomes more and more prevalent, web applications become richer and richer. There are a large number of frameworks that are being developed in this space to assist with writing solid object oriented applications in JavaScript. Engineers who have the experience we are looking for often have experience with various JavaScript frameworks, such as Backbone.js, Node.js, React.js, Angular.js, Ember.js, Polymer.js, etc.* and in Test Driving Applications. You will work in a highly collaborative, cross functional and Agile team and may take a lead role on various software components.<p>RepSpark Systems is a boutique and rapidly growing software company based in Orange County, CA. Our sales force automation platform is best in breed and an industry leader. Our mission is to produce cutting-edge technology, design and back-end functionality. We have a driven, talented development team that takes pride in the platform.<p>Please email either luis.ortiz@repspark.com or joshua.jones@repspark.com. We&#x27;d love to hear from you!","time":1454351407,"type":"comment"}