{"by":"majormazer","id":11014151,"parent":11012044,"text":"Riot Games | <a href=\"http:&#x2F;&#x2F;www.riotgames.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.riotgames.com&#x2F;careers</a> | Los Angeles | Full Time<p>TL&#x2F;DR: I&#x27;m looking for any engineer that has mastery of CS fundamentals and loves games. Junior, senior, doesn&#x27;t matter. What matters is that you&#x27;re smart, knowledgeable about CS, and incredibly passionate about games. Message me via jmazer@riotgames.com if you want to chat.<p>I search for people who are passionate about games. Not the kinds that just dabble, and who sometimes reminisce about that time that they played Mario back in the day. I look for the kinds that can literally count their play time in years rather than days. Notice - I&#x27;m not talking about League... That&#x27;s because R&amp;D is focused on making Riot&#x27;s NEXT game. We&#x27;re looking at several different spaces and we need talent with as varied a palette of interests as our development interests.<p>I&#x27;m not only looking for industry veterans. If you come from a Google, Amazon, Facebook, etc., and want to keep your standard of living, work on games, and also keep a high level of stability, Riot is a great place to consider making an industry change.<p>Reasons you might want to chat:<p>1.) Riot believes in delivering genre-defining content that delights players. The R&amp;D group&#x27;s charter is to flesh out and eventually ship the game(s) that put the &#x27;s&#x27; in Riot Games. If you want to build new stuff this is the place to be.<p>2.) We’ve only got a few R&amp;D projects going at a time, with a handful of people on each team. Joining the team now means playing a seminal role in developing and leading the downstream organization.<p>3.) Riot landed as #13 on Fortune&#x27;s top 100 companies to work for.<p>4.) We’re exploring some familiar genres and some experimental ones, but all of them are genres we expect core gamers love. It&#x27;s likely you&#x27;ll be excited by at least one of our current projects.","time":1454352240,"type":"comment"}