{"by":"DLarsen","id":11013752,"parent":11012044,"text":"Connexity - Santa Monica, CA (Los Angeles area) | on-site | <a href=\"http:&#x2F;&#x2F;connexity.com\" rel=\"nofollow\">http:&#x2F;&#x2F;connexity.com</a><p>We did it.  We ran like mad and survived startup infancy; and now we&#x27;re growing.  Now we&#x27;re eager to bring a diligent QA Engineer aboard to help batten down the hatches.<p>#About Connexity<p>Our team is sharp and works well together. We enjoy perks such as daily paid lunch and unconstrained vacation (don&#x27;t worry about having to build up enough vacation days for the family reunion); the culture of our team recognizes and respects the importance of your non-work life.  You&#x27;ll fit in well if you bring a strong interest in learning display advertising (banner ads, RTB) inside and out. Attitude, ambition and sound judgement trump experience with a specific set of tools. We&#x27;re a small team within a medium-sized organization, and we work hard to keep the small-team vibe.  Folks tend to enjoy a great deal of ownership and can work with independence to build excellent systems.  By that I simply mean that I think we strike a good balance between coordination&#x2F;collaboration and giving folks a chance to take tasks and run with them to completion.<p>#Position: QA Engineer<p>We&#x27;re looking for someone that enjoys tracing problems through a complex business and technical environment to improve correctness.  You ought to be comfortable traversing both internal and 3rd party integrations.<p>Our tech stack inclues (but is not limited to):\n- CSS, HTML5, Javascript\n- C, Scala, Java\n- Hadoop MR, Storm, Spark<p>Experience with adtech is obviously a plus.  JVM&#x2F;GC tuning is highly valuable.  Performance analysis is useful throughout our stack.<p>In the last 24 hours, we processed 11.2 billion transactions.  Sound like fun?<p>-- Unless you prefer to start with a HR-oriented chat, you can reach me (a lead engineer on the team for ~5 years) at david.larsen@connexity.com.","time":1454350105,"type":"comment"}