{"by":"tptacek","id":11012912,"parent":11012044,"text":"iOS Lead | OPEN WHISPER SYSTEMS | San Francisco, CA OR REMOTE<p>Moxie Marlinspike and Open Whisper are the author of Signal, widely regarded as the most trustworthy secure messenger available to the public. &quot;Use anything by Open Whisper Systems&quot;, says Edward Snowden. &quot;My first choice for an encrypted conversation&quot;, says Bruce Schneier. &quot;When I read code, lines of drool run down my face&quot;, says Matthew Green. Also, he likes Signal a lot.<p>If you really believe that we&#x27;re entering a pitched battle between states and technology providers over encryption; that NSA and GCHQ are turning the world&#x27;s best-funded best-staffed signals intelligence agencies into instruments of domestic surveillance; that giant corporations (and aspiring giant corporations) are doing everything they can to ensure that users <i>think</i> they&#x27;re safe while their messages are scanned for ad targeting or censored and traced by despotic regimes; if these are real concerns for you, then this is one of the most important jobs on the Internet.<p>Until very recently, the iOS version of Signal was managed by Frederic Jacobs. Signal for iOS is a flagship Whisper offering. It should by rights be the most widely used tool for journalists, activists, and researchers to communicate confidently on an insecure Internet. Jacobs is amazing, but he&#x27;s off to other adventures in Switzerland, and Whisper needs someone to take the reins on iOS Signal.<p>This is not the most highly-paid role on the Hiring Thread, but it&#x27;s probably the one that stands to make the biggest dent in the universe. Why else would you consider joining Moxie and his crazy pirate crew of crypto developers?<p>* Because you&#x27;re not a cryptographer but want to be engaged with serious cryptography, of the kind that will be in the academic cite record a decade from now, in a role where you&#x27;ll make an enormous difference deciding how best to get strong crypto into the hands of everyday people.<p>* Because Moxie and his team are simply excellent people to work with, doing inspiring stuff that is <i>actually inspiring</i>, not cat-sharing.<p>* Because there are worse things to have on your resume than &quot;product lead for the most important product by a tiny team that took on multi-billion dollar world government spy agencies and won&quot;.<p>* Because you relish the opportunity to be on an HN NSA thread with &#x27;tptacek and be able, at any point, to say &quot;shut up, Thomas, I work for Whisper&quot;.<p>I don&#x27;t work for Whisper, Whisper will never pay me a dime. I just love what they do, know that they&#x27;re trying very hard to find this particular person, and want to do whatever I can to help (and to ensure I&#x27;ll be able to keep using Signal).<p>Full time role. Very strong iOS application skills needed. No cryptography experience needed at all (if you take this job, you&#x27;re going to have crypto coming out of your ears either way). <i>The right candidate does not need to be in San Francisco</i>.<p><a href=\"https:&#x2F;&#x2F;whispersystems.org&#x2F;workworkwork&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;whispersystems.org&#x2F;workworkwork&#x2F;</a><p>If you know iOS developers who are interested in the problem Whisper is working on, please let them know about this.<p>Thanks!","time":1454345223,"type":"comment"}