{"by":"robmixlr","id":11012173,"parent":11012044,"text":"London, UK | ONSITE | Full-Time | Web developer (Ruby&#x2F;Rails)<p>Mixlr (<a href=\"http:&#x2F;&#x2F;mixlr.com\" rel=\"nofollow\">http:&#x2F;&#x2F;mixlr.com</a>) is the biggest platform for live music and audio content, now with over 4 million registered users and 40,000 active broadcasters each and every month.<p>With our desktop, tablet and mobile apps our community can broadcast live to the world with one hit of a button. Once live, it’s easy for friends and followers to chat, heart and share - becoming a part of the live event themselves.<p>Founded in 2010 by Greg Lloyd and Rob Watson, we are an established startup and growing fast. You would join us as the fifth engineer in our team, and as such have a great impact not only on the code but also on the future of our product, and company.<p>Part of our product lineup:<p>* Web application (Ruby on Rails, Ruby, RSpec, Resque, JavaScript, Backbone)<p>* Desktop app for Windows and Mac (C++, Qt, QML)<p>* Native Android and iOS apps (Objective-C, Java, Android Studio, Gradle)<p>* Embeddable player (HTML5, JavaScript, Flash)<p>* Real-time messaging system (NodeJS, Redis, WebSockets)<p>* Streaming backend infrastructure (NodeJS, JavaScript, Java, Icecast)<p>We are looking for a Ruby&#x2F;Rails developer who is proficient, can work in a fast-paced environment, but is also passionate about learning new skills. We use agile methodologies to guide our development process, and we’ll aim for you to deploy to our live site on your very first day.<p>We are hiring for frontend, backend and full-stack roles.<p>---<p>More information:<p>Company info: <a href=\"http:&#x2F;&#x2F;tech.mixlr.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;tech.mixlr.com&#x2F;jobs&#x2F;</a><p>Job posting: <a href=\"http:&#x2F;&#x2F;tech.mixlr.com&#x2F;jobs&#x2F;webdev.html\" rel=\"nofollow\">http:&#x2F;&#x2F;tech.mixlr.com&#x2F;jobs&#x2F;webdev.html</a>","time":1454339911,"type":"comment"}