{"by":"bernardom","id":11017580,"parent":11012044,"text":"Insikt- San Francisco, Austin, Los Angeles<p>ONSITE<p>Insikt (pronounced “in-seekt”) is a white label loan origination and investing platform that enables any brand to lend to its customers and any accredited investor to invest in consumer loan portfolios.<p>Insikt was born out of our realization that banks will not be the lenders of tomorrow – brands will. Traditional banks, saddled with new rules and regulation, are no longer in the business of taking risk and making loans and cannot be relied on to deliver credit access and opportunity to the masses. Instead, tomorrow’s lenders will be media companies, retailers and prominent brands that have deep relationships with their customers and want to step in to help their customers get a fair loan. But, to do it right, they need scoring, servicing, technology and capital — all of which are expensive and difficult to build. So, why build it if you don’t have to? This is the future of lending. Any brand or company can be a lender. We’ve launched “Lending as a Service” (LaaS) to power this transformation. We are bringing together the best and brightest to solve real problems in the financial industry. We are looking for diverse talent across many different domains including designers, front end and back end development, product management, analytics and data science, credit, operations, and capital markets.We want passionate, fun-loving people who can contribute positively to our company and our culture. Let us know if this sounds like you.\n<a href=\"http:&#x2F;&#x2F;www.insikt.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.insikt.com</a><p>Technologies: front-end: angular, react back-end: java(finagle), node, groovy, postgres\nwe run on AWS and we use chef for deployment.<p>Beyond developers, we&#x27;re also looking for product managers, business analysts, you name it!<p>Shoot me a note at bernardo [at] with the subject &quot;HN&quot; and I&#x27;ll connect you to the right person. It works: I joined because @jlisam posted this on the September Who&#x27;s Hiring.","time":1454385808,"type":"comment"}