{"by":"alexzoltano","id":11014820,"kids":[11022578,11017651],"parent":11012044,"text":"PayScale is hiring junior, senior, and lead full-stack software engineers and interns in Seattle, WA, onsite, full-time.<p>We have a service that tells you how much you should be paid in real-time and we&#x27;re building it with Amazon Web Services (AWS), React, ES6, and more. You&#x27;d be working alongside me (@alexzdangelo, Software Development Manager).<p>SDE, Consumer: <a href=\"http:&#x2F;&#x2F;jobs.payscale.com&#x2F;apply&#x2F;me73AR\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.payscale.com&#x2F;apply&#x2F;me73AR</a><p>Lead SDE, Conversion: <a href=\"http:&#x2F;&#x2F;jobs.payscale.com&#x2F;apply&#x2F;H8TLRh\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.payscale.com&#x2F;apply&#x2F;H8TLRh</a><p>Sr. SDE, Conversion: <a href=\"http:&#x2F;&#x2F;jobs.payscale.com&#x2F;apply&#x2F;8ejo4j\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.payscale.com&#x2F;apply&#x2F;8ejo4j</a><p>SDE, Conversion <a href=\"http:&#x2F;&#x2F;jobs.payscale.com&#x2F;apply&#x2F;UtOwOs\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.payscale.com&#x2F;apply&#x2F;UtOwOs</a><p>What&#x27;s it like to work at PayScale? \nLots of laughter. People have lunch together. Wine and board games on Fridays. There is a buzz in the air. Feels like a startup with the stability of an established company.<p>What does the team do? \nWe’re building significant new features and products on PayScale.com’s public-facing site and services. Lots of opportunities to work and learn alongside experts in UX, big data, distributed systems, machine learning, search, and econometrics. You&#x27;ll help us empower employers, employees, and job seekers with real-time data, compellingly and entertainingly presented. Your ideas are valued, your voice is heard and your work has immediate impact.<p>What we&#x27;ll do \nHelp you grow in your career. Offer mentoring. Encourage normal work hours. Hackathons every three months. Lots of fun activities.<p>What you&#x27;ll do \nFull-stack development. Build public APIs. Build significant and fundamental new features and products. Work across teams and products alongside a highly functional, world-class development team","time":1454356250,"type":"comment"}