{"by":"chollida1","id":8822997,"parent":8822808,"text":"Where: Toronto, Canada, no remote workers. We all sit on the trading floor.<p>You must be eligible to work in Canada.<p>Who: K2 and Associates. We&#x27;re one of Canada&#x27;s more successful hedge funds over the past 13 years.<p>----------------------------- What you&#x27;ll do -----------------------------<p>We are building out our algorithmic trading infrastructure and you have a chance to get in at the ground floor. \nCome help us turn our technology team from an integral part of how we do business into a profit center with its own PnL.<p>We&#x27;ve got the first iteration working and its making money. You&#x27;re going to make it more efficient.<p>----------------------------- Who you are -----------------------------<p>You are a developer who can take an academic paper and turn it into a working prototype because what you are designing won&#x27;t have been done before.<p>If you draw a triangle and place computer science, statistics and finance at each of the corners, you&#x27;re area of expertise is right in the middle. If you don&#x27;t know finance, don&#x27;t worry, we&#x27;ll teach it to you.<p>You value correctness above all else because when you send 100,000 orders a day if you get 1% of them wrong, bad things will happen...<p>You are comfortable with F# or C++.<p>If you love a challenge please reach out to me at cholliday@k2.ca or my email in my profile.<p>----------------------------- What&#x27;s in it for you... -----------------------------<p>- a hedge fund is just like a startup except that everyone gets a market salary and bonuses. If&#x27; you&#x27;ve always wanted to join a startup but you&#x27;re too good&#x2F;in demand to take a pay cut then let&#x27;s chat.<p>- work with a very talented and small team<p>- get paid to learn algorithmic trading<p>- be able to invest in our fund<p>- onsite chef for lunches<p>- choose your own hours<p>- you&#x27;ll learn more in a year than most people learn in 10.","time":1420122620,"type":"comment"}