{"by":"xenadu02","id":8823518,"kids":[8850388],"parent":8822808,"text":"San Francisco - PlanGrid (YC12). Near 16th Street Mission BART. VISA, INTERN, FULL-TIME.<p>We sell an actual useful product for money (think version control for blueprints but our ambitions are much larger). We intend to own the construction software business, which is vastly under-served. The market is huge; construction is a multi-trillion dollar industry globally that still operates like they did in 1950. Our customers are so happy that up until the past three months we&#x27;ve had no marketing or sales whatsoever - we were profitable in year one just from word of mouth.<p>Our primary hiring philosophy is as follows: Wicked smart, NO DICKS.<p>We are looking for engineering and non-engineering positions.  You can see the jobs and&#x2F;or apply here: <a href=\"http://grnh.se/r1nhcp\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;r1nhcp</a><p>* Senior iOS. We are shipping Swift code this month (see my Swift blog at <a href=\"http://russbishop.net\" rel=\"nofollow\">http:&#x2F;&#x2F;russbishop.net</a> ).<p>* Android. Small but growing team.<p>* Backend&#x2F;API. Python and mongo, but we&#x27;re investigating alternatives (Postgres? FoundationDB?) because we are steam-rolling to the trillion-with-a-capital-T mark on records.<p>* Windows. We are just starting this team so you have complete freedom. Will probably be C# with a shared library supporting a Desktop app and RT app.<p>* Data Science. You would think blueprints were created by professionals with standards. You&#x27;d be wrong. Put your machine learning skills to work on real world problems where a 1% improvement saves man-years of effort.<p>* Web. We do some real magic on the web; check out our blueprint annotating. This team is about to do some major re-factoring&#x2F;re-writing with a focus on speed and maintainability.<p>Also hiring an IT Manager, Customer Support Heros, Marketing specialists, a Marketing Director, Field Sales, Biz Ops, and more.<p>Feel free to get in touch via my blog. I&#x27;m happy to answer any questions about what it&#x27;s like to work at PlanGrid.","time":1420133527,"type":"comment"}