{"by":"chriswoodford","id":8823985,"parent":8822808,"text":"Gobble (YC W14) is looking for foodie+techie folks that love a Hell&#x27;s Kitchen style challenge. We&#x27;re a small but well seasoned team looking for the creme de la creme of designers and engineers. Join us in solving the problems that busy people face when trying to eat healthy and fresh meals daily. Our &quot;full stack food&quot; company makes easy one pan dinner kits, so anyone can make a Michelin-worthy dinner in under 10 minutes. You&#x27;ll get to taste everything - whether it&#x27;s Shepherd&#x27;s Pie, Miso Salmon, or Butternut Squash Ravioli - and be one of our Master Chef judges every day.<p>From short stacks on the menu to technologies in the full stack, you’ll make key decisions across the company. We do not have too many cooks in the kitchen, as you’ll be one of the first five engineers. Think you can handle the heat? We’ve got wild organic growth and lots of meaty problems.<p>Lead Designer (Graphic Design, UI&#x2F;UX Design)<p><pre><code>  * Strong visual, interaction, and UX design experience \n    (web and mobile applications) (3+ years)\n\n  * Data driven design \n    (create and runs A&#x2F;B tests to increase conversion and engagement)\n\n  * Strong experience with HTML&#x2F;CSS(&#x2F;Sass)\n    (skip the PSD and get right in between the braces)\n\n  * Been through the Javascript grind? That&#x27;s a plus!\n</code></pre>\nSenior Full Stack Engineer<p><pre><code>  * SOLID experience with Ruby&#x2F;Rails&#x2F;Backbone.js \n    (5+ years)\n\n  * Experience with TDD (RSpec&#x2F;Jasmine)\n\n  * Experienced with Chef or Salt, and the server side of things? \n    That&#x27;s a plus!\n</code></pre>\nMobile Engineer<p><pre><code>  * Experience developing consumer applications for iOS&#x2F;iPad  \n    (3+ years)\n\n  * Strong understanding of latest developments in the iOS world\n    (iOS8 + Swift)\n\n  * Got some Android chops too? That&#x27;s a plus!\n</code></pre>\nOur team of in house chefs trained under Michael Mina -- Let us know what you bring to the table. Send your resume, link to your GitHub, code&#x2F;design samples, and links to any deployed software you&#x27;ve worked on to chops@gobble.com.","time":1420141282,"type":"comment"}