{"by":"madisonmay","id":8823725,"parent":8822808,"text":"indico -- <a href=\"http://indico.io\" rel=\"nofollow\">http:&#x2F;&#x2F;indico.io</a>\nBoston, MA<p>We are indico, a Boston startup making productivity tools for data scientists.  We&#x27;re looking to democratize data science and bring the next generation of machine learning to everyone.<p>Full Stack Developer:\nLife moves fast in the world of startups, so we&#x27;re looking for someone accustomed to filling technical gaps and rapidly moving between projects.  Flexibility is a must.  Our tech stack is primarily python&#x2F;javascript, so familiarity with those languages is recommended.<p>Backend Engineer:\nWe&#x27;re looking for a backend engineer with experience building reliable distributed systems to deal with large amounts of traffic.  An ideal candidate would have a love for software architecture, a knack for building high throughput, high availability APIs, and experience with python.  Dev-ops experience is also a huge plus.<p>Data Engineer:\nA high quality dataset is arguably even more important than a bleeding-edge machine learning model.  We&#x27;re looking for a scrappy developer who is comfortable with data preprocessing, data normalization, and data collection (web scraping, mechanical turk, etc.).<p>Front End Developer:\nWe&#x27;re looking for a developer with design sense to build a beautiful, functional web interface for indico. An ideal candidate would have a deep appreciation for user experience, dream in javascript&#x2F;coffeescript, and know the ins and outs of clean HTML&#x2F;CSS layout.<p>Technical Writer:\nMachine learning is a highly technical field, and we&#x27;re looking for someone to help us reach out to the broader community of developers and data scientists. Responsibilities include writing excellent tutorials, documentation, and blog articles that help tell our story to the world. Although prior data science experience is not required, passion to learn more about the field is a must.<p>Interested?  Send an email to contact@indico.io.","time":1420137318,"type":"comment"}