{"by":"doctorpangloss","id":8824239,"kids":[8837055],"parent":8822808,"text":"Location: Santa Monica, Venice, Los Angeles, San Francisco CA (Happy to help with VISA)<p>Founded in 2014 and headquartered in Santa Monica, Workpop is a private, Series A company backed by venture capitalists including SV Angel, Obvious Ventures, Trinity Ventures, and Slow Ventures. Other investors, include Joe Lonsdale (Palantir), Aaron Levie (Box), Evan Williams (Twitter, Medium), Biz Stone (Twitter, Jelly), David Tisch (Box Group), Dennis Phelps (IVP), Jim Pallotta (Raptor), Kevin Colleran (Facebook) and Dave Morin (Path) . The company has grown to 12 employees with plans to increase to 18 to 20 over the next two quarters.<p>We are an experienced team of Harvard, Duke, and Berkeley alumns from companies like Google, Zynga, LinkedIn and Salesforce - currently 12 strong with plans to grow the team to 18 over the next quarter. Our founders have both big company and startup experience. We have collectively launched over 10 #1 overall iOS&#x2F;Android and Facebook applications. We live and breathe what we do and love every second of it. Developers are the heart and soul of our team, culture and products. If your passion is to help people succeed, we want to listen to your opinions, try out your prototypes and work together to achieve amazing things.\nOur company mission is to help everyone find a job they love. That mission starts with supporting the health and happiness of our own team and their families. We offer great salaries, generous equity offers, great healthcare, healthy meals, family friendly outings and encourage our team members to take the time they need for parental and&#x2F;or personal needs.<p>We would love to hear from you if you enjoy helping others around you grow as developers, can be autonomous and self-driven, and love the following: momentum, chaos, vibrancy, spontaneity, debate and swinging for the fences. But, most of all you have to be passionate about two things: \n1. Helping people in the hourly space find jobs they love \n2. Cutting edge technology. We are passionate about new tech and are betting big on Meteor.js<p>Workpop is hiring for three positions:<p>Full Stack Generalist - Full Time\nRequirements:\nB.S. or higher in Computer Science (or equivalent work experience)\nVery strong in one of the following:\n - Ability to create an interface in HTML, CSS and JavaScript\n - Proficiency creating applications in one server side framework: NodeJS, Rails, J2EE, Scala, etc.\nSolid understanding of the full web technology stack (e.g. HTTP, cookies, headers, asset loading &#x2F; caching)\nDisciplined approach to testing and quality assurance\nUnderstanding of CS concepts such as: common data structures and algorithms, profiling&#x2F;optimization<p>Android Lead - Full Time\nRequirements: \nB.S. or M.S. Computer Science or 4+ years in relevant work experience \n3+ years of object-oriented software development experience \n2+ years building Android applications in Java \n2+ years mobile application development experience (Android, J2ME or Blackberry) \nStrong coding abilities and experience with Java and Android SDK  Familiarity with Meteor, javascript, and node.js are strongly preferred.<p>UI&#x2F;UX Designer - Full Time\nRequirements:\nBS or MS in graphic or interaction design, or relevant experience in a related field\n4 + years of relevant experience\nAbility to work solo and recruit a powerful team\nHighest level of proficiency with current design tools and software application\nPassionate about creating, communicating, and defending the needs of the user\nExperience with a broad range of UX design problems\nA strong portfolio demonstrating creativity and mastery of great user-centered design on web and mobile<p>Please reach us at careers@workpop.com if you are interested.<p>Learn more at <a href=\"http://www.workpop.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.workpop.com</a>","time":1420145186,"type":"comment"}