{"by":"heyyobarb","id":8825278,"parent":8822808,"text":"Myrtle Beach, SC - Ruby on Rails Developer - <a href=\"http://KidsCanGiveToo.com\" rel=\"nofollow\">http:&#x2F;&#x2F;KidsCanGiveToo.com</a><p>Do you want to make a big impact in the lives of children and charities?<p>Company Description:\nKidsCanGiveToo.com is a seed-stage company that provides an online birthday party service making it easy for kids to share half of their gifts with a charity.  Guests receive invitations, RSVP online, make donations, and the money gets split between the child and a charity of their choosing. \nFor charities, we offer an innovative way to raise significant funds with very little strain on their resources. \nOur big vision is to fund charities while changing the mindset of a generation by streamlining how we give gifts to celebrate kids&#x27; birthday parties.<p>Job Location:\nWe’re located near Myrtle Beach, SC (Low cost of living, great weather - Learn more at WhyNotTheBeach.com).\nCome visit, and work remotely while you relocate here at your pace.<p>What we are looking for:\nWe are looking for a skilled full-stack Ruby on Rails developer who has a “get stuff done” attitude and wants to make a real difference in the lives of children and charities. \nYou’ll be one of our first full-time hires, and in addition to a career filled with purpose and opportunity you’ll get a combination of salary, equity &amp; benefits.\nWe respect work-life balance and offer vacation and work at home time. \nAt KidsCanGiveToo, we welcome visionaries and dreamers - individuals who don’t wait for change, but make it happen!<p>You should have experience working on a team building consumer-focused small to medium-sized ruby on rails applications. You should be self motivated, and able to prioritize between feature development, bugs, and new issues that arise. We want you to be more than just a code monkey - You’ll be an integral part of the team… strategizing, building the dev team, and helping define our culture!<p>Contact: barb+jobs@kidscangivetoo.com<p>We’re being incubated by Startup.SC and have the support of their staff.","time":1420166185,"type":"comment"}