{"by":"tianyicui","id":8828720,"parent":8822808,"text":"Jane Street - New York City, London, Hong Kong - Software Developer (Functinoal Programming) INTERN &#x2F; VISA<p>Jane Street is a technology-focused proprietary trading firm. We are looking to hire great software developers with an interest in functional programming. OCaml, a statically typed functional programming with similarities to Haskell, Erlang, F# and SML, is our language of choice. We’ve got the largest team of OCaml developers in any industrial setting, and probably the world’s largest OCaml codebase. We use OCaml for running our entire business, supporting everything from research to systems administration to trading systems. If you’re interested in seeing how functional programming plays out in the real world, there’s no better place.\nThe atmosphere is informal and intellectual. There is a focus on education, and people learn about software and trading, both through formal classes and on the job. The work is challenging, and you get to see the practical impact of your efforts in quick and dramatic terms. Jane Street is also small enough that people have the freedom to get involved in many different areas of the business. Compensation is highly competitive, and there’s a lot of room for growth.<p>You can learn more about Jane Street and our technology from our main site, janestreet.com. You can also look at a a talk given at CMU about why Jane Street uses functional programming (<a href=\"http://ocaml.janestreet.com/?q=node/61\" rel=\"nofollow\">http:&#x2F;&#x2F;ocaml.janestreet.com&#x2F;?q=node&#x2F;61</a>) and our programming blog (<a href=\"http://ocaml.janestreet.com\" rel=\"nofollow\">http:&#x2F;&#x2F;ocaml.janestreet.com</a>)<p>More in <a href=\"http://careers.stackoverflow.com/jobs?searchTerm=jane+street\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs?searchTerm=jane+street</a> and <a href=\"https://www.janestreet.com/join-jane-street/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.janestreet.com&#x2F;join-jane-street&#x2F;</a><p>(I personally work at the Hong Kong office. Feel free to get in touch via tcui@janestreet.com if you have any questions.)","time":1420234973,"type":"comment"}