{"by":"spang","id":8829817,"parent":8822808,"text":"Inbox | <a href=\"https://www.inboxapp.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.inboxapp.com&#x2F;</a> | San Francisco, CA (Mission) | Frontend (JS), Design, Backend (Systems+Ops)<p>Hi! We&#x27;re &quot;The Company Formerly Known As Inbox,&quot;[0] and we&#x27;re looking for help building the next generation email platform. We&#x27;re building a missing piece of Internet infrastructure and are looking for frontend engineers and designers and backend systems and infrastructure&#x2F;operations engineers to join us.<p>Companies are building their core businesses around our email API right now, and that means we have to be reliable, up all the time, and fast. We have more data for a single user than in most startups&#x27; entire database. That means big technical challenges to solve as we scale out our fledgling distributed backend. If you have experience with automated deployments, debugging running systems, release engineering, and on-call schedules, but are still comfortable writing code, this job[1] might be for you. :)<p>Many people spend their entire days buried in mail clients which haven&#x27;t significantly changed in years. That means many opportunities to tackle UX challenges as we build out our client scaffolds and create a new framework for the next generation of mail apps. (Ever meet anyone who really loves their email experience? We want to change that.) Sound exciting to you? Apply here[2].<p>== We&#x27;re particularly looking for folks who ==<p>* Take personal pride in their work and value autonomy and ownership.<p>* Want the chance to step up and lead a team.<p>* Put the work before ego. We&#x27;ve got each others&#x27; backs, and we want you to be with us on that.<p>== A bit more about us ==<p>* Our backend is built on tools like Python, Flask, gevent, nginx, MySQL, AWS, and Debian. We&#x27;ve been careful to keep our architecture componentized.<p>* Our frontend projects use Coffeescript, React, (Re)Flux, WebSQL for offline caching, Atom Shell (NodeJS + Chromium), with a strong focus on extensibility.<p>* Tons of our code is open source. Check it out: <a href=\"https://github.com/inboxapp\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;inboxapp</a><p>* We&#x27;re 40% women on our team of 13 (12 engineers), including 1 of 2 cofounders. We want to make that number 50%.<p>* Our sunny Mission office is more lived-in than tidy. Think art studio, not corporate.<p>* We&#x27;re more likely to end up at the climbing gym or on a bike ride together than out drinking at the latest startup event.<p>* We have an open vacation policy and value personal responsibility and ownership. Benefits include full health, dental, vision, commuter, and lunch at the office every day. Some remote work &#x2F; work-from-home is OK too.<p>Apply via Lever at <a href=\"https://www.inboxapp.com/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.inboxapp.com&#x2F;jobs</a>. Include a cover letter letting us know what draws you to the job. We welcome and encourage applications from women, LQBTQ folks, and people of colour. (We even have some already on the team!)<p>[0] A certain large company recently launched a product of the same name, so we&#x27;re going to change ours soon. Roll with the punches, eh?<p>[1] <a href=\"https://jobs.lever.co/inbox/6c7e7186-953d-4083-8bde-37443a239a91/apply\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;inbox&#x2F;6c7e7186-953d-4083-8bde-37443a23...</a><p>[2] <a href=\"https://jobs.lever.co/inbox/54f73eb2-9094-40ab-b59e-f9df48681065/apply\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;inbox&#x2F;54f73eb2-9094-40ab-b59e-f9df4868...</a>","time":1420255602,"type":"comment"}