{"by":"theseanz","id":8836157,"parent":8822808,"text":"New Matter - Pasadena (Los Angeles), CA - <a href=\"http://newmatter.com\" rel=\"nofollow\">http:&#x2F;&#x2F;newmatter.com</a><p>Our Indiegogo campaign from 2014 (raised just over $680k): <a href=\"http://indiegogo.com/projects/new-matter-149-mod-t-wifi-3d-printer-online-store-customization-sharing\" rel=\"nofollow\">http:&#x2F;&#x2F;indiegogo.com&#x2F;projects&#x2F;new-matter-149-mod-t-wifi-3d-p...</a><p>Software Engineer, Back End and Infrastructure\nWeb Software &#x2F; Mid-Senior<p>New Matter was founded in 2014 with a mission to bring 3D printing to every home, school, and office. An Idealab company backed by strong venture capital firms, New Matter is poised to revolutionize the consumer 3D printing market with its flagship product, the MOD-t. Slated for release in the first half of 2015, the MOD-t will be the most affordable 3D printer on the market and will be integrated with New Matter’s online store of 3D printable designs, allowing users of all skill levels to find, customize, and print great objects.<p>Job Description\nNew Matter is looking for an engineer to lead the development of the back end of an exciting new 3D printing marketplace that’s tightly integrated with our 3D printer. We’re very early so you really get to own this piece of the product.<p>You’ll lead the development and maintenance of our system architecture. You’ll also work closely with the lead back end engineer to develop an API that talks to both our marketplace as well as our printers. Being self-driven is important since the team is small and we want to build an ambitious product quickly.<p>Skills &amp; Requirements<p>• Strong experience developing large-scale web applications and Linux infrastructure, as well as understanding and familiarity of Linux fundamentals.<p>• Strong experience in developing and maintaining system reporting and infrastructure health monitoring.<p>• Solid understanding of TCP&#x2F;IP networking fundamentals.<p>• Experience with system architecture for web applications, and AWS in particular (EC2, EBS, CloudFront).<p>• Experience with developing RESTful APIs.<p>• Experience with and passionate about Ruby&#x2F;Rails, Python, Django, Sinatra, Flask, Go, Node, Angular, and other various web technologies.<p>• Experience with various relational&#x2F;non-relational database technologies (Oracle&#x2F;MySQL&#x2F;PostgreSQL&#x2F;NoSQLs).","time":1420410924,"type":"comment"}