{"by":"HeroHealth","id":8844697,"parent":8822808,"text":"Firmware Engineer - HERO (herohealth.com) :: NY, NY<p>JOB DESCRIPTION:<p>HERO is seeking a Firmware Engineer to join in the development of a revolutionary electro-mechanical health device. This Firmware Engineer will have ownership of key areas of firmware application design and implementation through production for HERO One and other products.<p>RESPONSIBILITIES:<p>• Serve as a key leader on a team of various engineering disciplines, working closely with electrical, industrial design, mechanical, and manufacturing engineering<p>• Develop system firmware for motor control, networking, LCD&#x2F;user interface and sensor sub-systems, using the FreeRTOS operating system<p>• Develop and execute rigorous test plans necessary for a healthcare application<p>JOB QUALIFICATIONS:<p>• BS or MS in Electrical or Computer Engineering, Computer Science or equivalent<p>• 3+ years firmware design experience, specifically durable real-time electro-mechanical systems<p>• Experience coding in C&#x2F;C++ for FreeRTOS on ARM chips (preferrably Cortex-M4), with expertise in UI frameworks, networking frameworks, and embedded file systems&#x2F;data structures<p>• Focus on with Test Driven Development (TDD) and software test automation<p>• Outstanding communication skills, self-starter with infectious enthusiasm, energy and problem-solving abilities<p>• Driven and motivated to grow with a top-tier team<p>ABOUT US:<p>HERO is redefining consumer health through smart design and proprietary technology with our first product, a revolutionary tabletop appliance. This is a unique opportunity to join a young, talented team that’s already filed a dozen electro-mechanical patents, and is making a substantial positive impact on healthcare in society.\nWe operate in both a technical and creative environment in the heart of New York City and are selectively adding to our team to accelerate product development.<p>Please submit your resume, cover letter to (careers@herohealth.com) and include “Firmware Engineer” in the subject line. HERO is not accepting candidates via recruiters for this position.<p>Join us, and make stuff that matters.","time":1420557738,"type":"comment"}