{"by":"maxneust","id":8862588,"parent":8822808,"text":"Upcoming (www.upcoming.nl) - Amsterdam, The Netherlands (No remote, but we&#x27;ll relocate you) - Full Stack Software Engineer<p>===== About us =====<p>Upcoming is a Dutch &#x27;listicle&#x27; website (a listicle is an article consisting of a list of funny&#x2F;informational&#x2F;sentimental&#x2F;whatever stuff). We&#x27;ve been growing continuously since we launched in 2013, already reaching 15% of the Dutch population with zero € spent on marketing. We&#x27;re (an independent) part of Telegraaf Media Groep, one of the biggest publishers of The Netherlands.<p>===== Abour our tech stack =====<p>We use python in the backend (Flask, Celery+RabbitMQ), and manage the frontend with Jinja2, jQuery, LESS and Grunt; persistence is done with MySQL and Redis. The deployments are automated, in a Continuous Integration environment.\nOur backend is developed in-house, with state-of-the-art publishing related features such as:<p>- Monitoring of 1000&#x27;s of rss feeds from news websites, in order to detect trending articles all around the globe.<p>- Advanced analysis of our own articles&#x27; metrics, for automatically promoting them among our publication channels (this is aimed at maximizing virality).<p>- (Bayesian) Headline and thumbnail A&#x2F;B testing<p>- Highly scalable click-through-rate optimizer, presented in a workshop of the ACM Recommender Systems conference in Hong Kong in 2013.<p>Since we&#x27;re part of a big media group, some of these tools are now being used by other teams, reaching tens of millions of users every day.<p>===== What we&#x27;re looking for =====<p>We&#x27;d love to bring on board a <i>pragmatic</i> developer. A CS degree helps, but relevant web experience is more important for us. We&#x27;d love it if you have spent some time across the whole stack, but if you consider yourself &quot;just&quot; a frontend or backend developer, we&#x27;re willing to hear you out as well.<p>===== What we offer =====<p>- A perfect balance between working on innovation projects and “regular” web development, both with short and iterative development cycles.<p>- The flexibility and dynamism of working in a startup, with the strong stability of being part of a big company.<p>- An international environment, with people from all over the world (UK, Italy, Romania, Argentina, Brazil, Iran, and more)<p>- Thorough relocation assistance, regardless of where you’re coming from<p>- A competitive salary<p>- 25 vacation days<p>- Amsterdam! You’ll be living in one of the most beautiful and cosmopolitan cities in the world.<p>If you’re interested, drop me a line: m.neustadt(at)tmg.nl","time":1420817430,"type":"comment"}