{"by":"stefanocutello","id":8873701,"parent":8822808,"text":"Technical Leader &#x2F; Full Stack Product Developer<p>PastBook.com &#x2F; Amsterdam (NL)<p>Full-time, Great Salary + Equity<p>Full Job Description: <a href=\"http://www.pastbook.com/txt/job-offers/#cto\" rel=\"nofollow\">http:&#x2F;&#x2F;www.pastbook.com&#x2F;txt&#x2F;job-offers&#x2F;#cto</a><p>PastBook is the easiest way to relive your memories, online and offline.<p>We’re looking for a smart person to join the team full-time that can take the lead on the technology&#x2F;product side of the business and build a top-notch tech team around him&#x2F;her.\nWe’re based in Amsterdam, with a beautiful cozy office on the Herengracht canal - in the middle of the city.  \nWe were part of RockStart Accelerator in Amsterdam and we’ve built an extensive network of connections that you can use. We are making money and we are VC backed, this year we&#x27;ll have to scale and grow globally. \nOur main market is the USA, where we’ll setup another office soon (HQ will stay in Amsterdam).<p>The role requires great 360° technical and communicational skills, leadership, autonomy and dedication.\nBeing able to understand and play – by case – with the balance between startup&#x2F;business needs (i.e. have something good enough out ASAP) and technical debt (i.e. re-work, re-factor) is key.<p>You’ll have to deal with:<p>- Apache + MySQL + Redis. Dedicated servers + AWS (EC2, S3 and more)<p>- PHP5, HTML5 (responsive design), CSS&#x2F;JavaScript (Bootstrap, Less, Coffeescript, jQuery)<p>- Template systems: Twig, Handlebars, Smarty<p>- Silex, Slim, Grunt&#x2F;Gulp, RESTful API, Vagrant, Puppet<p>- Git + svn<p>- MVC &#x2F; OOP (frontend&#x2F;backend)<p>- Interface design and UXP<p>- Site performance and trackings<p>Knowledge on (native) mobile application development (iOS and Android) is a plus.<p>Apply if you are:<p>- Native&#x2F;Fluent English speaker (it is a must).<p>- Good in written and spoken communication, both technical and not.<p>- Focused to details. Data driven.<p>- Creative, confident, determined, self motivated and proactive.<p>- Able to manage time effectively and work under strict deadlines<p>- A lateral thinker and problem solver<p>- Passionated about technology and development<p>Apply at work@pastbook.com (open to worldwide applications)\nRead more: <a href=\"http://www.pastbook.com/txt/job-offers/#cto\" rel=\"nofollow\">http:&#x2F;&#x2F;www.pastbook.com&#x2F;txt&#x2F;job-offers&#x2F;#cto</a>","time":1421068546,"type":"comment"}