{"by":"kmhofmann","id":8873224,"parent":8822808,"text":"R&amp;D Engineer Computer Vision &#x2F; Blippar &#x2F; Amsterdam, NL\n(<a href=\"https://layar.workable.com/j/0A73FE978C\" rel=\"nofollow\">https:&#x2F;&#x2F;layar.workable.com&#x2F;j&#x2F;0A73FE978C</a>)<p>We are now seeking a computer vision engineer to join our R&amp;D team who can help bringing our technology to the next level. You will be part of a strong R&amp;D team that builds some of the core technologies that integrate in the app and our backends, using modern C++ to achieve the best performance.<p>Blippar is continuously improving its Augmented Reality and image recognition technologies. You will be researching as well as implementing the latest technologies in the fields of image retrieval and recognition, natural feature tracking, SLAM, and feature-based 3D reconstruction. You will be reporting to the Computer Vision Team Lead, joining a small team of enthusiastic developers that are stretching mobile and server-side technologies to the limits of the available device capabilities. You will:<p>- research and implement the latest real-time computer vision algorithms in the areas of natural feature tracking, SLAM, object detection, image retrieval and image recognition\n- improve performance and extend the capabilities of our products\n- work closely with the other R&amp;D engineers\n- architect, extend and maintain a shared codebase used in our mobile clients or server-side in our backends<p>As computer vision R&amp;D engineer, we expect you to have MSc or preferably PhD level academic experience in computer vision and machine learning, as well as a proven track record of practical experience in areas such as natural feature tracking, multi-view geometry, 3D reconstruction, object detection and image retrieval and recognition.<p>In addition to a great academic track record, we also require you to have outstanding programming capabilities. You will be working on and extending our well architected and cleanly implemented computer vision codebase, which serves as a technical foundation for our products. You will be responsible for maintaining the high level of quality of our codebase.","time":1421059910,"type":"comment"}