{"by":"Onlineshoes","id":8888440,"parent":8822808,"text":"<i>Onlineshoes.com &amp; Shoes.com</i> Seattle, WA <i>Web Developers</i><p>Full Time, no sponsorship available<p>About Onlineshoes.com\nBased in Seattle, Washington, Onlineshoes.com is one of the top premier online shoe retailers in the country.  We continue to grow our presence in the ecommerce industry, and we are looking for the best, and the brightest talent to join our team as we continue on our path of stellar company performance.  If you like a challenge, are intrigued by customer behavior and want to be part of something big, then we’d like to talk with you.<p>The short of it:<p>What we want from you:\n-       Really love web development – and be good at it. \n-       Do the right things right.\n-       Be a consistent team mate. \n-       Be collaborative. \n-       Be professional. \n-       Have a solid grasp of web development best practices.\n-       Be able to run the table in technologies and skills. \n-       Know who said “I bent my Wookiee.”<p>What you’ll get from us:\n-       Team members that have your back. \n-       A commitment of quality.\n-       No dull moments. \n-       Time to innovate. \n-       A chance to use and grow all of your coding skills. \n-       Celebration of wins.\n-       Ermahgerd...free pizza! (Sometimes.) BUT free coffee ALL THE TIME!\n-       Code branches named after 80’s TV shows.<p>The long of it:<p>The ideal candidate must be a self-starter, possess sound judgment, and strong analytical and problem solving skills. The candidate must be able to communicate effectively with a broad range of diverse internal and external audiences.  The candidate must be able to work independently in a fast-paced, agile team environment, be able to manage multiple and competing priorities, and adapt to the changes that occurs with a fast-paced Internet retailer.  Finally, a strong sense of customer service and teamwork is critical to success in OnlineShoes.com’s Technology team.<p>If you&#x27;re interested in joining us please review our complete JD at the link below!\n<a href=\"http://www.onlineshoes.com/info/position?jvi=oJB6Zfw9,job\" rel=\"nofollow\">http:&#x2F;&#x2F;www.onlineshoes.com&#x2F;info&#x2F;position?jvi=oJB6Zfw9,job</a>","time":1421263771,"type":"comment"}