{"by":"jackfoxy","id":9639441,"parent":9639001,"text":"Tachyus - San Mateo, CA - 10 open positions<p>We are revolutionizing the oil and gas industry, well funded, and (most importantly) producing significant revenue. This is the opportunity for the right people to align with us and share in ownership. We are a focused science and engineering driven team working with real physical devices and processes in technology and the natural world. You will work closely with 3 PhDs, 2 Masters of Science, and 4 Microsoft MVPs. We take our Values statement seriously, so read it first and decide. <a href=\"http:&#x2F;&#x2F;tachyus.com&#x2F;joinus&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;tachyus.com&#x2F;joinus&#x2F;</a><p>Data Physicist<p>Our data physics team develops algorithms to provide intelligence critical to field operations. You bring your experience doing quantitative analysis (data science) and physical modelling. You must love digging for wisdom in complex data sets and possess fluency in a language commonly used for scientific technical computing (Mathematica, MatLAB, Python, etc). You will solve problems involving reservoir depletion, equipment failure, drilling and completion strategies, and production optimization.<p>Software Engineers - F#, Python, and Web<p>We believe that expressive, declarative code is more frequently correct code. The core of our software platform is built with F#, a functional-first, strongly-typed compiled language. We seek engineers who are excited to do full-stack, product-driven thinking.<p>Our core physics and data science algorithms are written in Python and bridge the gap between pure research code and production-quality algorithms, often scaling up code to run faster on more computers. We seek engineers who are excited to do product-driven thinking, grounded in hard core physics and statistics.<p>Web Engineers (you know who you are) we use Typescript and an MVVM design on the front-end, and F# for our API layer. Regardless of language experience, the ideal candidate has strong experience implementing web applications which are correct, attractive, performant, and maintainable.<p>Correctness Engineer<p>The Tachyus Correctness Engineer is a Software Engineer who specializes in building the infrastructure to prove our software and algorithms produce accurate results. The CE works closely with the entire Engineering organization to prevent, catch, prioritize and eliminate errors in both software and data. He or she is an engineer at heart, preferably with experience writing production code.<p>Product Manager<p>We need a Product Manager to work at the intersection of our customers, scientists, engineers, and designers gathering feedback from customers, synthesizing iterations into precise documentation, and communicating clear product requirements to the team as we execute on our ambitious product roadmap.<p>Just as important, we also have open positions for:<p>Data Engineer, Senior UI Engineer, Petroleum Engineer, Recruiter","time":1433173116,"type":"comment"}