{"by":"joshuakarjala","id":9639583,"parent":9639001,"text":"Founders | Copenhagen, Berlin, London | Technical co-founder<p>Founders is a startup studio based in Copenhagen, Denmark. We partner with exceptional people and provide capital, expertise and talent flow to turn ideas into great businesses. We are in it with you 100 percent and we get our hands dirty, just like we expect you to do.<p><i>About the opportunity</i><p>As a co-founder in residence your objective is to turn an idea into a company, working with us through the steps of the Founders Creation Process. You will work on one of our early stage ideas together with us. We expect you to act as a founder from day one and show that you have what it takes to build and lead a team in order to create a successful company. As part of Founders you will have access to a team of people who do nothing else than building companies and products.<p><i>Your profile</i><p>The typical technical co-founder is an accomplished developer who is already a passionate entrepreneur or has an extraordinary track record leading projects during her &#x2F; his career. We value your experience and previous accomplishments, but most of all we value your attitude.\nAs a co-founder you are expected to be able run and grow a company. You will have access to Founders’ resources, but you are responsible for building a great team, a great product and doing what it takes to win in the market. <p><i>Requirements</i><p><pre><code>  - Drive, passion and curiosity\n  - You feel at your best contributing production quality code every week\n  - Track record of delivering polished features based on operational and customer feedback\n  - The ability to fight for your opinions while remaining open to feedback\n  - A track record of getting shit done\n  - You know how to build a team and create a good product development culture\n  - The stamina to work hard and go through tough times\n  - An analytical and data driven approach to decisions\n  - You love getting your hands dirty\n</code></pre>\n<i>Bonus points</i><p><pre><code>  - Previous entrepreneurial experience\n  - You already know your first hire\n</code></pre>\nPlease apply @ <a href=\"https:&#x2F;&#x2F;founders.workable.com&#x2F;jobs&#x2F;23077\" rel=\"nofollow\">https:&#x2F;&#x2F;founders.workable.com&#x2F;jobs&#x2F;23077</a>","time":1433173950,"type":"comment"}