{"by":"moxie","id":9639543,"parent":9639001,"text":"Open Whisper Systems ➡ San Francisco ➡ Full Time<p>Open Whisper Systems is making private communication simple. Our technology is used by hundreds of millions of people, and everything we produce is open source.<p>What it&#x27;s like to work with us:\n<a href=\"https:&#x2F;&#x2F;whispersystems.org&#x2F;workworkwork&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;whispersystems.org&#x2F;workworkwork&#x2F;</a><p>★ iOS Lead -- Someone intimately familiar with iOS development and internals, who has an appreciation for the craft of software development and experience with making decisions that result in great products. No experience with cryptography necessary, just solid experience developing for iOS and an eye for good design.<p>★ Mobile UI &#x2F; Product Designer -- We’re seeking an original thinker with strong visual design skills ready to help make private communication simple. You&#x27;ll take on developing the look and feel of Signal on iOS, Android, and the desktop.  You’ll be responsible for updating the visual design for the app and helping shape consistent guidelines to communicate a compelling user story across our products and other touchpoints. You’ll work closely with a team of engineers with a passion for making usable software. No experience with cryptography necessary, just intuition for what makes a great product and solid experience designing products that are a joy to use.<p>★ Product Support &#x2F; Project Manager -- We&#x27;re seeking someone with strong writing skills and a passion for collaboration. This is an integrated position that incorporates both supporting our users and project management of software development. You will be responsible for providing support for our users both directly and by distilling knowledge into appropriate documentation, surfacing user feedback to help make product decisions and define development priorities, and using those focus points to help drive sprint planning and coordinated development. No experience with cryptography necessary, just a solid technical background, strong writing skills, a large capacity for empathetic listening, time spent organizing and coordinating development, and the ability to juggle wheels within wheels.<p>See more at the link above, or send us a note at workwithus@whispersystems.org","time":1433173693,"type":"comment"}