{"by":"colindean","id":9639434,"kids":[9654444,9639450,9646492,9654808],"parent":9639001,"text":"IBM Watson | Multiple positions | Pittsburgh | Onsite | Full-time | Citizen; Visa for well-qualified candidates | Scala; Java; Angular.js; Bootstrap; Python; Watson Explorer<p>IBM Watson in Pittsburgh has several open positions as of this posting. Unfortunately, our listing page is acting up at the moment so I cannot tell exactly which ones. Try back another time or search around a bit!<p><a href=\"http:&#x2F;&#x2F;ibm.biz&#x2F;watson-pgh-jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;ibm.biz&#x2F;watson-pgh-jobs</a><p>All or some of these may still be open:<p>* Watson Technical Product Manager<p>* Watson User Interface (UI) Junior Developer<p>* Watson Software Engineer<p>* Watson User Interface (UI) Developer<p>* Watson Quality Engineer<p>* Watson Support Explorer Engineer<p>I’m the software engineer tech lead on the Watson Explorer connectivity team and former consultant with the product&#x27;s Professional Services team.<p>We’re looking for folks versed in Java, Scala, and the Ruby on Rails stack. The UI positions are heavily focused on Angular.js and Bootstrap. We&#x27;re in new development mode right now, so if you like to start from nothing, you&#x27;ll like what we&#x27;re doing.<p>We do things like TDD, real actual pair programming†, kanban, agile-ish planning (IBM Design Thinking, not some convoluted buzzword bullshit), automated builds, “use the right tool for the job even if it’s not an IBM product”, and daily stand ups that, for the most part, never run past 15 minutes.<p>We like to have fun, too, having regular board game lunches and evenings, hosting meetup events, weekly communal lunch cooked by one or more of our fantastic cooks, and managers that are incredibly full-of-clue and treat us like the adults we all are.<p>We try to keep our interview process as bullshit-free as possible. If we think you look good on paper, we’ll reach out for a phone chat and give you the details on a pretty open-ended code test, where you’ll implement a simple library. If we like your solution, then we’ll invite you for a live culture fit and technical interview, in-person if you’re near or remote if not. This process has given us a ridiculously low turnover.<p>† no, really. We shoot for 50%-75% pairing, otherwise known as “pair when it makes sense”.","time":1433173077,"type":"comment"}