{"by":"nlh","id":9640651,"parent":9639001,"text":"Full-Stack Web Developer (Rails + JS + HTML&#x2F;CSS + Light Design) | Gotham Dream Cars | Remote | Part-Time+<p>So this is a bit of a different kind of gig&#x2F;company. Not Silicon Valley. Not even really tech. But cool :)<p>GDC (<a href=\"http:&#x2F;&#x2F;www.gothamdreamcars.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.gothamdreamcars.com</a>) is an ultra-exotic car rental company.  I started it about 11 years ago and have built it organically to a multi-city company renting out some of the coolest cars on earth.<p>A few years ago I dove headfirst into the tech side of things, taught myself to code, brushed off the &#x27;ol design skills, and built our entire tech stack myself - and it now runs the whole company. But I&#x27;m focused on other things these days and don&#x27;t have the time to maintain &#x2F; continue to develop the site, so it&#x27;s time to bring someone on board to handle it.<p>It&#x27;s not the most world-changing stuff -- essentially a CRUD app with a consumer-facing frontend and admin-facing backend for managing the fleet, booking reservations, doing light CRM, billing, logistics, etc. But it&#x27;s incredibly satisfying to work on -- every feature directly helps the employees in the office work more efficiently, helps the cars get booked more often, and helps our customers stay happy. It&#x27;s step-by-step replacing manual processes and has a huge impact on the company, employees and customers.<p>If you&#x27;re looking for some satisfying part-time, remote Rails + Frontend work and are interested in directly improving an interesting business that deals with Ferraris and Lamborghinis, this might be ideal for you. There&#x27;s zero overhead here -- if you have an idea for a feature, you can go ahead code it up and push it live that day.<p>You don&#x27;t have to be a senior Rails or JavaScript expert - you just have to be better than I am ;) (I&#x27;m a solid intermediate.)  But please do have experience with Rails - I&#x27;d prefer to work with someone who can hit the ground running.<p>There&#x27;s a long list of fun features on my to-do list, so the first few weeks&#x2F;months would be more involved as you bang out updates and get things caught up, then it would transition to maintenance, new features, new ideas, etc. over time.  I expect needing ~30 hrs&#x2F;week for the first few months and then scaling down to 10-20 hrs&#x2F;week.<p>Note I&#x27;m pretty serious about &quot;full stack&quot; here -- I&#x27;ve been a one-man band the past few years and you&#x27;re effectively going to replace me in day-to-day stuff, so while you don&#x27;t need to be a pro graphic designer too, you should have some basic design skills since it&#x27;s all you.  I&#x27;ll still be here and can certainly help in this area, but I&#x27;m going to lean on you for a majority of the heavy lifting.<p>A bit about our stack and some of the tasks at hand:<p>* Rails (currently on 3.2, moving to 4.x)\n* MongoDB (but that&#x27;s gotta go, so we&#x27;re moving to Postgres)\n* Stylus for CSS (not wedded to it - open to SASS&#x2F;LESS if it makes sense)\n* Haml &#x2F; Slim for HTML templates\n* JavaScript (currently mess of jQuery - TBD which framework we&#x27;ll move to)\n* Git-based workflow<p>If this sounds interesting&#x2F;fun and you like the idea of taking ownership over a live web app from top to bottom, take a look at the site, shoot me an email (contact info in HN profile) and we&#x27;ll discuss.","time":1433180739,"type":"comment"}