{"by":"blakecake","id":9641091,"parent":9639001,"text":"HelloFresh San Francisco Bay Area<p>We are the leading global company in the expanding online recipe kit delivery market. We are growing VERY rapidly and are in need of three new members on our team: Production Supervisor, Production Manager, &amp; Assistant Director. These positions are at our distribution center&#x2F;warehouse in San Francisco, but we are moving to the East Bay in the coming months. We offer complete transparency, benefits, weekly team lunches, and of course, recipes to take home and experience yourself!<p>Please apply if you are:\n• A natural leader who can motivate people and get the most out of your team\n• Proactive, ambitious, and assertive: you take ownership of your work and think beyond the scope of a given assignment\n• Entrepreneurial and can make things happen\n• Excited to work in a fast-paced environment with constant change and limited direction, comfortable making split-second decisions with far reaching consequences\n• Passionate about our business: a foodie or an operations and problem-solving zealot<p>Production Supervisor:\nYou will be on the floor leading and supervising a team of hourly leads and crew, ensure quality, health and safety standards are maintained, keep thorough counts of inventory, follow instructions and communicate with managers when appropriate and perform day to day administrative duties such as printing &amp; creation of spreadsheets.<p>Production Manager:\nWe are looking for someone who has strong project management skills and experience with building or improving inventory management, order management, and warehouse management systems and processes. You will develop operational procedures for executing handling and disposition of products and outgoing shipments. You will be responsible for achieving all operational goals, and tracking and improving accuracy and productivity levels, driving strategic planning and forecasting, and motivating, developing, and managing 40+ employees.<p>Associate Director:\nWe need a highly analytical general manager to help lead our expansion! You will help us oversee the start to finish process of delivering hundreds of thousands of meals across the country, ensure accurate receiving, inventory, and fulfillment, build and manage a team of managers, supervisors and hourly crew.<p>Preferred Experience:\n • 4+ years of management experience in fulfillment center&#x2F;warehouse operations; prefer food service&#x2F;e-commerce experience\n• At least 3 years of management experience in Receiving, Inventory Control, and&#x2F;or Order Fulfillment\n• Have a MBA and&#x2F;or a background in management consulting, operations, e-commerce, or investment banking from a top-tier firm<p>If interested, please send a short note &amp; resume to Blake @ HelloFresh.com\nThank you!","time":1433184056,"type":"comment"}