{"by":"ChrisCinelli","id":9641670,"parent":9639001,"text":"Palo Alto, California - Bloomboard - <a href=\"http:&#x2F;&#x2F;schools.bloomboard.com\" rel=\"nofollow\">http:&#x2F;&#x2F;schools.bloomboard.com</a> - Full stack engineers<p>Job post: <a href=\"https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j&#x2F;?cj=o6kSYfw0\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j&#x2F;?cj=o6kSYfw0</a><p>Make a difference in the quality of education in US. Supporting teachers to be champions for the students.<p>* Our products are used by million of teachers already.<p>* We just started working on a new exciting product and you will be able to have a major impact on the direction of the product.<p>Walking distance from Palo Alto Caltrain station with many nearby restaurants, cafes, bars, and shops.<p>More info:<p>- <a href=\"https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j&#x2F;?cj=o6kSYfw0\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j&#x2F;?cj=o6kSYfw0</a><p>- <a href=\"http:&#x2F;&#x2F;schools.bloomboard.com&#x2F;hiring\" rel=\"nofollow\">http:&#x2F;&#x2F;schools.bloomboard.com&#x2F;hiring</a><p>- <a href=\"https:&#x2F;&#x2F;www.facebook.com&#x2F;bloomboard\" rel=\"nofollow\">https:&#x2F;&#x2F;www.facebook.com&#x2F;bloomboard</a><p>What sets us apart<p>* Big impact: Shape the future of education and directly impact products used daily by educators.\n* Data driven: We look at performance and we optimize. \n* You will have the autonomy to adopt the best technology for the job.\n* Unique culture: We live our values: Candor, Impact, Team Work, Joy!<p>Requirement<p>* Bachelor&#x27;s degree in Computer Science, or equivalent work experience.<p>* Being able to write awesome code in art least one language<p>* Good critical thinking<p>* Passion for making education better<p>What you will do:<p>* Write awesome software in the language that you love. We have pieces of our product written in Ruby, PHP, Javascript and other modern languages. We use Node.js, nginx, AngularJS, Redis, Amazon Web Services, MySQL, MongoDB, etc.<p>* Provide technical leadership across engineering and help guide the overall engineering vision\nImprove developer productivity through better tools, processes and frameworks<p>* Evangelize software development best practices and develop&#x2F;conduct training on core architecture and libraries<p>* Develop API and integration points within the product to provide customer exports and connectivity to third-party applications.<p>* Participate in system requirements sessions, platform architecture, database design, and scrum standup and planning meetings to gain thorough understanding of the product, to incorporate into daily work.<p>* Analyze data to determine, recommend, and plan installation of Bloomboard platform for clients.\nBenefits<p>The team<p>* Work with a diverse community of talented engineers, former educators, and business professionals<p>* Competitive salary and equity for Silicon Valley<p>* Comprehensive medical, dental, and vision plans<p>* Free lunches, snacks, beverages, and weekly FroYo trip<p>* Team outings: like shotgun shooting, go carting, cooking lessons, etc.<p>* Ping pong table and nerf apparatuses<p>* Subsidize gym membership and office parking<p>* WFHF (Work From Home Fridays)!<p>Job post: <a href=\"https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j&#x2F;?cj=o6kSYfw0\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j&#x2F;?cj=o6kSYfw0</a>","time":1433188589,"type":"comment"}