{"by":"jetcom","id":9641136,"parent":9639001,"text":"Iterable (<a href=\"https:&#x2F;&#x2F;iterable.com\" rel=\"nofollow\">https:&#x2F;&#x2F;iterable.com</a>) - San Francisco, CA - ONSITE<p>Engineering @ Iterable<p>We&#x27;re a nimble startup of 8 people (5 engineers) building the growth engine for consumer Internet businesses. Our mission is to build a must-have messaging platform for modern marketers or growth hackers to engage with their users. Customers that rely us for messaging include Yelp, BetterDoctor and MemeBox.<p>We previously worked at Twitter&#x2F;Google, and we noticed that every one of these high growth companies would rebuild the same tools and abstractions internally to drive growth. They&#x27;d organize some people into a growth team, build software to orchestrate email, push, and prompt messaging, and run experiments.<p>We&#x27;ve built that ourselves to make those abstractions available to everyone.<p>There are a lot of interesting challenges in engineering the software - here are a few!<p><pre><code>  - Scale our messaging API \n  - Design and write performant, beautiful, asynchronous interfaces \n  - Build integrations with leading messaging platforms: Facebook Messenger, WhatsApp, Line\n  - Built our content recommendation service\n  - Make data visualizations for our email and user data \n  - Design an immutable deployment infrastructure for our platform\n</code></pre>\nI&#x27;d also really pinpoint our culture. We&#x27;re all friends and have fun at work. (I know everyone says that, but that social culture is something we missed at larger companies&#x2F;startups, so it&#x27;s something we focus on having at Iterable)\nSome aspects of our culture that make us different:<p><pre><code>  - Our company has egalitarian and transparent values (work when you want, on what you want) \n  - We are chill and empathetic people \n  - The company is completely transparent\n</code></pre>\nTechnologies you&#x27;ll work with:<p><pre><code>  - Scala\n  - ElasticSearch\n  - Postgres\n  - Redis\n  - AngularJS\n  - Play Framework\n  - RabbitMQ\n</code></pre>\nYou&#x27;ll get to work with us at our office at 5th &amp; Market in San Francisco. If this sounds like an interesting and fun opportunity for you, please email me: andrew at iterable.com","time":1433184302,"type":"comment"}