{"by":"cmonaghan","id":9641865,"parent":9639001,"text":"Washington DC - Nava - Reimagining technology in government - Onsite preferred<p>I&#x27;m part of a small team of engineers from Silicon Valley that came out to DC last year to help fix Healthcare.gov. In the process, we learned a ton about the world of government software. Many people know about the disastrous Healthcare.gov launch, but there&#x27;s a long list of huge technical problems that impact everyone in the US. A few examples: people are dying because the Veteran&#x27;s Administration is six months behind in processing claims, the IRS system goes down for regular maintenance every night, and the Social Security Administration is still paying benefits to millions of deceased Americans because their data is so poorly managed.<p>Over the past year, our team has seen an opportunity to create software that radically improves how our government serves its people, and we&#x27;ve started our company, Nava, to chase that vision.<p>You probably remember the initial launch of Healthcare.gov, but you might not have seen our relaunch in the news. That’s a good thing. Here are a few facts we can share: our new insurance application is processing 70% of all apps coming through the marketplace, converts 35% more people than the old app, gets them through in half the time, and is mobile-friendly (20% of applications were started on mobile). App 2.0 was the first system that CMS (Centers for Medicare and Medicaid Services) ever hosted on Amazon AWS, and the login system we just launched saves taxpayers $70 million a year. (Here&#x27;s a Wired article from last summer about us: <a href=\"http:&#x2F;&#x2F;www.wired.com&#x2F;2014&#x2F;06&#x2F;healthcare-gov-revamp&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.wired.com&#x2F;2014&#x2F;06&#x2F;healthcare-gov-revamp&#x2F;</a>)<p>We’re continuing to rebuild and improve Healthcare.gov while expanding in bold new directions, bringing talented engineers (we&#x27;re mainly Stanford, Google, and Y Combinator alums) to DC, the place where we&#x27;re needed most. If you&#x27;d like to build software that reimagines how millions of Americans interact with their government, we’d love to hear from you at jobs@navahq.com.<p>Specifically, we’re looking for:\n- a product manager with a technical background\n- senior devops engineers\n- senior full-stack engineers","time":1433190234,"type":"comment"}