{"by":"mburnett","id":9641514,"parent":9639001,"text":"untapt - <a href=\"http:&#x2F;&#x2F;untapt.com\" rel=\"nofollow\">http:&#x2F;&#x2F;untapt.com</a> - New York (NYC) - Full Time<p>untapt is a breakthrough solution for hiring technologists in financial services and we recently closed our $3MM Series A round. Our goal is to transform the job market for technologists with an end-to-end solution that thinks about hiring differently. We&#x27;re big believers in being happy at work and offer competitive salary, equity in the company, a great benefits package including healthcare and a health club allowance. We are looking to add team members who are passionate about disrupting this space and excited to be part of the journey.<p>Technologies we use: ● Python ● Flask ● AngularJS ● JavaScript ● HTML ● CSS (SASS) ● React ● MongoDB ● Git<p>Hiring for the following roles:<p>★ Full-stack Developer (Python&#x2F;Javascript) -- You&#x27;re a senior software developer who&#x27;s comfortable working across the tech stack, but particularly strong with Python and Javascript. Ideally you have some experience with AngularJS, Flask and MongoDB. Above all you value software engineering expertise, and don&#x27;t compromise on elegant code design.<p>★ Front-end Developer -- You&#x27;re a gifted front-end developer with a sharp eye for clean, modern design. You should have experience building single-page applications using AngularJS, Ember or Backbone. You&#x27;ve done terrifying things with media queries and animated a feature film using CSS keyframes ;-). You&#x27;re excited to work alongside a small team of passionate developers who are working to flip technology hiring on its head.<p>★ Quality and Usability Hacker -- You are technically savvy and ready to use your existing technical expertise as a springboard in playing an integral role within a thriving technology focused startup. You&#x27;re excited for the opportunity to learn some of the more cutting edge technologies and work closely with a dynamic and passionate software engineering team.<p>How to apply:\nYou can apply directly through out app (<a href=\"http:&#x2F;&#x2F;untapt.com\" rel=\"nofollow\">http:&#x2F;&#x2F;untapt.com</a>) and get a sense of the product you would actually be working on. You can see and apply for the roles right on our platform. Email us at info@untapt.com with any questions.","time":1433187336,"type":"comment"}