{"by":"0xa","id":9643146,"kids":[9660810,9673866,9678693,9646100,9678694],"parent":9639001,"text":"Kensho, Boston, MA (Cambridge), Stamford, CT, New York, NY (NYC): FULL TIME Software Engineers, SRE, UX or UI Designers ONSITE<p>Kensho&#x27;s growing engineering team[0] is headquartered in Harvard Sq. We are making financial analysis faster, accessible, intuitive and beautiful through our partnerships with Goldman Sachs[1] and CNBC[2]<p>Software Engineers &amp; SRE<p>We&#x27;re hiring fun-loving, hands-on nerds at every experience level, layer of the stack and facet of our technology.  We look for people who a hungry to learn, figure things out quickly, and are massively productive using technology and math.  To really catch our eye, show off your:<p><pre><code>  * Mindful coding combined with ambitious productivity\n  * Architectural sense applied using practical, iterative steps\n  * Experience at scale with machine learning, NLP, or unstructured data\n  * Charting, visualization or optimization skills in javascript\n  * Ability to design and build scalable infrastructure\n  * Style, workflow and responsive designs\n</code></pre>\nWhile we primarily use Python (especially pandas and NumPy) and AngularJS, that is just implementation detail and you can interview in the language of your choice.<p>UX or UI Designers<p>Design is critical to every aspect of our work.  We look for a crisp design aesthetic applied to complicated workflows or experienced UX methodology that produces intuitive designs.  We hope you will<p><pre><code>  * Share your portfolio and walk us through your design process\n  * Work through a design with us\n</code></pre>\nExperience with finance is not required.  A willingness to play bughouse, play ticket to ride, and shoot zombies is a plus.<p>Matt<p>[0] <a href=\"http:&#x2F;&#x2F;kensho.com&#x2F;#team\" rel=\"nofollow\">http:&#x2F;&#x2F;kensho.com&#x2F;#team</a>\n[1] <a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;GoldmanSachs&#x2F;status&#x2F;554680474392870913\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;GoldmanSachs&#x2F;status&#x2F;554680474392870913</a>\n[2] <a href=\"https:&#x2F;&#x2F;www.cnbc.com&#x2F;kensho\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cnbc.com&#x2F;kensho</a>","time":1433205814,"type":"comment"}