{"by":"koji","id":9643849,"kids":[9655059],"parent":9639001,"text":"Shift Labs (YCW15) is looking for our first embedded systems hire in Seattle.<p>We’re a Y Combinator backed company creating innovative and simple devices for fast-growing healthcare sectors. Our customers range from home health care patients in the US to expectant mothers in emerging markets. That means we build devices that use creative design and  engineering to develop technologies that help provide better care around the world. We’ve got ambitious goals and global plans. If you want to build technologies that make a difference in people&#x27;s lives, we want to talk to you.<p>Job Description:<p>We’re a growing startup looking for a team member to take a leadership role on the embedded systems side of our product development. If you have a strong knowledge of product development, embedded electronics systems and programming (with an emphasis on power management), and the ability to anticipate product, engineering, and consumer needs, read on!<p>If you enjoy building tangible things, can think at a systems level, and want to do meaningful work that helps improve the world, email us at jobs@shiftlabs.com.<p>Location:\nSeattle, WA<p>Qualities:<p>·        You enjoy talking to customers and are able to explain technical concepts to non-technical users.\n·        You have worked in a startup-like environment (unstructured, ambiguous, resource constrained).\n·        You have experience with manufacturing products and scaling production.\n·        You work well with engineers, marketing, sales and other stakeholders at the company.\n·        You have exceptional organizational, collaborative and communication skills.\n·        You are curious and have the ability to learn quickly and become an expert in new technologies, markets, etc.\n·        You can engage in both tactical and strategic thinking.\n·        You’re open to participation in broad tasks related to the business, including recruitment, resource planning, marketing strategy, etc.<p>Required Skills:\n·        Expert at embedded software development\n·        Expert at electronics circuit design, testing, and PCB layout (digital and analog)\n·        Experience with electronics design for manufacture, dealing with suppliers, including putting together electronics manufacturing packages to get production quotes. \n·        Capable in ultra-low power design\n·        C and C++ experience","time":1433219063,"type":"comment"}