{"by":"redler","id":9649126,"parent":9639001,"text":"cSubs | New Jersey, USA | REMOTE OK | Full-time<p><a href=\"http:&#x2F;&#x2F;www.csubs.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.csubs.com</a><p>o Web Application Developer<p>o Senior Web Application Developer<p>cSubs is a small, fast-growing, award-winning SaaS company focused on the knowledge resource management space. Our service is delivered primarily through a B2B web application targeting enterprise clients.<p>At cSubs you&#x27;ll work on large web applications for business, but help us bring a distinctly non-corporate user-focused sensibility to app design. We hold the occasionally contrary opinion that business people at work are still actual people, and we strive to make our web applications delight those people -- not just check the boxes on a corporate feature grid.<p>We care less about which specific languages you know than the fact that you have strong experience with more than one, and deep multi-year expertise with at least one. We&#x27;d love it if you have Python and CFML experience specifically, since we have a large CFML application running on the JVM using Railo&#x2F;Lucee -- but we also use Python, and are planning to transition much of our architecture to Python and PostgreSQL. As an expert, you would help spearhead this effort, alongside day-to-day development.<p>Because more and more of our application logic is moving to the front end, it&#x27;s critical that you have strong JavaScript knowledge and experience. You understand the architectural case for distributing application logic among the client and server, and you&#x27;re comfortable using at least one JS framework. While we don&#x27;t need you to be an expert with SQL, our applications run primarily atop relational databases, so it&#x27;s important that you have at least intermediate knowledge of SQL. While it&#x27;s not required, it would be great if you have enterprise integration experience in areas like single sign-on and punchout.<p>You will have contact with clients and client stakeholders, so you&#x27;re comfortable joining and occasionally leading calls and meetings. You&#x27;re able to express yourself in clear and professional English, so writing effective email messages and reading, analyzing, and developing project requirements is second nature to you.<p>Interested? Contact me at developerjob@csubs.com, and please let me know in the subject line that you&#x27;re coming from the HN thread.","time":1433280261,"type":"comment"}