{"by":"arshneet","dead":true,"id":13083167,"parent":13080280,"text":"Senior Software Engineer in Machine Learning (Amazon Web Services RDS) | Vancouver, Canada | Full-time | ONSITE, VISA |<p>Do you like to use the word &#x27;billions&#x27; a lot? Do you work in terabyte units? Are you interested in using machine learning to solve problems on some of the world&#x27;s largest data sets? Amazon RDS is looking for a passionate, talented, and inventive Senior Software Engineer in ML to help tackle some of the most complex, multi-dimensional performance optimization problems in the database industry.<p>We&#x27;re looking for Senior software engineers with a background in industrialized ML, with strong systems design experience to lead a newly formed project that will make extensive use of probabilistic and statistical approaches to deliver a first-for-cloud capability for RDS customers. Leveraging a number of AWS services including Kinesis and EMR&#x2F;Spark, our mandate is to provide actionable insights into underlying database performance and push the boundaries of product and technology innovation in this area. As the only big-data, analytics and ML focused team in RDS, our greenfield project is worked on by a tight knit DevOps team, owned, and operated entirely from the new Amazon office here in Vancouver, Canada. If you’re a snowbird in the winter, love long summers and beaches, and want to work on a very engaging, highly impactful product with extremely high customer demand, endless learning and collaboration in a world-class group then get in touch!<p>- Lead the design, build and operations of our ML application stacks – Deliver industry disruptive advancements driven from a customer focused technical product development approach in your work – Deliver aspects of critical path code - Ability to influence adoption of capabilities built by the team to AWS teams outside of RDS - Continuously discover, evaluate, and implement new technologies to maximize development and operational efficiencies – Have a scope of influence in development practices, methods and approaches across the team and RDS organization.<p>Requirements: -  Post-graduate level Computer Science, Machine Learning, Mathematics, Operational Research, Statistics or a related quantitative field with up to 5 years of related work experience - 10+ years professional experience in software development - Excellent written and spoken communication - Deep and broad technical experience - Experienced technical leader - Ability to independently define and execute against a technical vision and roadmap – Recruitment, coaching and mentoring of other engineers – Strong will to adhere to best practices in OO development and a need to leave well–structured code in your tracks – Strong analytical and problem–solving skills – Experience developing for multiple platforms a plus.<p>To apply: <a href=\"https:&#x2F;&#x2F;www.amazon.jobs&#x2F;en&#x2F;jobs&#x2F;425454\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.jobs&#x2F;en&#x2F;jobs&#x2F;425454</a><p>Please feel free to directly contact me (I&#x27;m an engineer on the team) [MyHNUsername][AT]amazon.com, or my manager pimmel[AT]amazon.com for any questions that you might have.","time":1480623867,"type":"comment"}