{"by":"sandGorgon","id":13088115,"parent":13080280,"text":"RedCarpetUp.com | Delhi, India| Data Science and UI&#x2F;UX |consulting<p><a href=\"http:&#x2F;&#x2F;www.redcarpetup.com&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.redcarpetup.com&#x2F;jobs</a><p>RedCarpetUp is on a mission to build the next generation of credit and lending for the unbanked in India.<p>We are building something around disrupting an entire chunk of banking and credit in India.\nWe are NOT a payments company. We combine data science and a whatsapp like experience on the mobile to build a credit experience that is easy to use.. and yet manage a very sophisticated lending and recon pipeline.<p>India is a trillion dollar economy - probably, the second fastest growing economy in the world. We have the fastest growing smartphone userbase.. yet 95% of retail (including e-commerce!) is cash based . The single biggest reason is lack of credit infrastructure - systems like social security number, credit bureaus, etc either do not exist... or are just beginning to take shape.<p>The need for credit is massive - however the mechanism to originate and manage risk is missing. And that&#x27;s what RedCarpetUp seeks to solve.<p>&gt; Data Science\nWe are looking for our chief data scientist who can set the culture and goalposts around our data science. We are looking for someone who has experience around financial data science (hedge fund, banks, trading systems... Palantir?) and has appetite for graph based analytics.<p>We are looking for you to build the data science from a validation point-of-view. We will invest a lot of effort into building domain specific backtester... we just dont want to throw algorithms at the wall. We want to have a thoughtful and reasoned out approach towards this.<p>We do not expect you to be a production quality coder - we already have a team of data engineers who will translate your concepts into production code. But you will need to be able to express your thoughts as R or Python Notebooks.<p>&gt; UX<p>We are looking for a UX designer who is focused on the Android platform (oh yeah... those design guidelines). You must not just craft designs, but also be able to look at Mixpanel&#x2F;Amplitude&#x2F;Play Store reviews and figure out what&#x27;s going wrong with UX.\nThis is not a one shot contract... so you must be able and willing to work with us for a couple of months and be able to respin design.<p>my email is my profile. or apply directly at <a href=\"http:&#x2F;&#x2F;www.redcarpetup.com&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.redcarpetup.com&#x2F;jobs</a>","time":1480682723,"type":"comment"}