{"by":"meredydd","id":13082613,"parent":13080280,"text":"MQA | Software Engineers | Huntingdon, Cambridgeshire, UK | Onsite, VISA, <a href=\"http:&#x2F;&#x2F;mqa.co.uk\" rel=\"nofollow\">http:&#x2F;&#x2F;mqa.co.uk</a><p>We are looking for software engineers to help us roll out the next generation of music distribution.\nWe&#x27;re still small (5 full-time engineers and a few contractors, ~20 total), and the music recording and hi-fi industries are already beating a path to our door, so we need all-rounders to keep up. If you like the idea of hacking on our (C++) encoder&#x2F;decoder, learning assembly for a new instruction set to optimise porting to a new hardware platform, then spending the next week helping us analyse, process and revitalise the back catalogs of the world&#x27;s top record labels...we want to hear from you. DSP wizardry not required (although obviously it&#x27;s nice!).<p>MQA has developed a music encoding and delivery system whose quality blows basically anything commercially available out of the water. (Think it&#x27;s impossible to do better than CD? So did a lot of people. If you want to help out with the peer-reviewed double-blind studies that proved them wrong - published in the field&#x27;s top journals - here&#x27;s the place to do it.) MQA is an end-to-end system, that ensures precise transmission of the analog signal (digital fidelity is only half the story) from the mastering desk to the listener&#x27;s ears. We&#x27;ve signed with household-name record labels, artists and hi-fi manufacturers, we&#x27;ve got music-industry luminaries working here (they&#x27;re remarkably nice to work with), and it&#x27;s only getting bigger from here.\nWe&#x27;re a friendly, international team that values initiative and getting things done, and we&#x27;re looking forward to meeting you. Interviews are a phone screen then on-site with the team.<p>Email: jobs [at] mqa.co.uk<p>Official job spec: <a href=\"http:&#x2F;&#x2F;www.mqa.co.uk&#x2F;customer&#x2F;news&#x2F;post&#x2F;careers-at-mqa-oct-2016\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mqa.co.uk&#x2F;customer&#x2F;news&#x2F;post&#x2F;careers-at-mqa-oct-2...</a>","time":1480620621,"type":"comment"}