{"by":"danielsht","id":13082024,"parent":13080280,"text":"Viv Labs | Sr. Frontend DevTools Engineer | San Jose, CA | Full-time | <a href=\"http:&#x2F;&#x2F;viv.ai\" rel=\"nofollow\">http:&#x2F;&#x2F;viv.ai</a><p>DESCRIPTION<p>Viv is the next-generation virtual personal assistant, brought to you by the team that created Siri. In addition to being far more capable and intelligent, Viv will provide a truly open platform and marketplace that lets any developer extend Viv&#x27;s capabilities for new domains and services. VentureBeat (<a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1NSHobJ\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1NSHobJ</a>) named Viv one of the top 15 interesting startups to watch in 2016. Check out this demo (<a href=\"http:&#x2F;&#x2F;www.theverge.com&#x2F;2016&#x2F;5&#x2F;9&#x2F;11639992&#x2F;viv-digital-assistant-ai-artificial-intelligence-siri\" rel=\"nofollow\">http:&#x2F;&#x2F;www.theverge.com&#x2F;2016&#x2F;5&#x2F;9&#x2F;11639992&#x2F;viv-digital-assist...</a>) from TechCrunch Disrupt NY, and watch the power of Viv in action.<p>Viv&#x27;s Developer Center provides a set of tools that make it easy for a third-party developer to create AI capabilities on top of their web services, and then publish the new functionality to a marketplace accessible by many users across a variety of devices and experiences. As a Sr. Frontend DevTools Engineer, you will be building a new kind of web-based IDE for a new kind of platform. In this new paradigm, developers write programs to teach Viv how to write its own programs. Come help us pioneer a new way of writing software, one that is a collaboration between the developer and the AI.<p>REQUIREMENTS<p>You are excited about our vision and want to collaborate with our team to build an amazing product\nIntimate knowledge of JavaScript, DOM&#x2F;browser, and Node.js APIs\nExperience with React or similar view-binding&#x2F;reactive or functional UI frameworks\nExperience collaborating closely with designers in an iterative environment\nAble to quickly build out web UI from specs&#x2F;sketches<p>DESIRED<p>Experience optimizing and writing performant client-side code\nPreviously built web-based developer&#x2F;expert tools\nFamiliarity with ACE, CodeMirror, and&#x2F;or lexers is a plus\nExperience building Electron apps or browser extensions is a plus<p>Apply here: <a href=\"https:&#x2F;&#x2F;viv-labs.workable.com&#x2F;jobs&#x2F;98839\" rel=\"nofollow\">https:&#x2F;&#x2F;viv-labs.workable.com&#x2F;jobs&#x2F;98839</a>","time":1480617194,"type":"comment"}