{"by":"rogik","id":13082752,"parent":13080280,"text":"People.ai, Inc. | Sr. Software Engineer | SF |  ONSITE |  <a href=\"https:&#x2F;&#x2F;people.ai\" rel=\"nofollow\">https:&#x2F;&#x2F;people.ai</a><p>Y Combinator-Backed People.ai is Hiring Engineers to Help Us Build AI for Better Team Management<p>People don’t quit their jobs, they quit their managers. Everyone has had a manager that makes them not want to come to work. Everyone has had a manager who regularly forces their team to chase their own tail doing meaningless work.<p>Why? Because most managers manage their teams blindly. They don&#x27;t hire, coach and promote based on data. Instead, they make decisions based on their gut, either because they don’t have the data to make better decisions or because they don’t know how to make sense out of it.<p>Not anymore. At People.ai we’re helping managers make decisions about their team based on data, not intuition.<p>We’re starting with sales teams because they’re a particularly notorious black box. No manager today can definitively say what makes a “top performer” do better than a “low performer.” People.ai is solving that by making sales transparent and building the world’s first AI for managing sales teams.<p>We have a 10+ person team and are actively looking for a Senior Software Engineer to join us. Our team needs someone with full-stack&#x2F;backend development experience as well as a deep background in Python, Linux, AWS, REST APIs and machine learning. Salesforce API experience is a plus!<p>This isn’t just another job. Your input will be incredibly important as we’re currently shifting from to a microservices architecture. You’ll have an opportunity to make a major impact on a number of our microservices and ML&#x2F;big data infrastructure as we are turning our MVP into a massively scalable product.<p>We offer a competitive salary with equity, a cool company culture, lunches and free snacks and drinks. At this time we are unable to provide visa sponsorship.<p>People.ai is located within walking distance of Caltrain in San Francisco.<p>Join us as we work towards quantifying people management!<p>Apply here:  <a href=\"https:&#x2F;&#x2F;peopleai.workable.com&#x2F;jobs&#x2F;377022\" rel=\"nofollow\">https:&#x2F;&#x2F;peopleai.workable.com&#x2F;jobs&#x2F;377022</a>","time":1480621438,"type":"comment"}