{"by":"aagr","id":13084091,"parent":13080280,"text":"Theorem | Multiple positions |  San Francisco, CA | INTERN, VISA, ONSITE www.theoremlp.com<p>Theorem is a company at the intersection of technology and finance.<p>We are a small team of fewer than 10 with a diversity of ideas and backgrounds applying machine learning, software engineering and rigorous scientific investigation to revamp the lending and securitization space. Every member of the team has a major impact on the company&#x27;s success, and gets to see their contributions working in the real world . Building good financial forecasting models is extremely challenging from both a technology and research point of view.<p>We’re using ideas across multiple disciplines: computer science, machine learning, statistics and biostatistics including survival analysis, supervised learning, natural language processing, imbalanced data, feature extraction and selection, and many, many other areas.<p>We were founded by a Google software engineer and a Morgan Stanley quant trader.  We are a Y Combinator graduate and our backers include Max Levchin, Two Sigma and major VCs. We are profitable and manage over $150mm dollars.  A large number of our clients are non-profits and university endowments, whom we are proud to support.<p>We are based in San Francisco, close to Caltrain and BART. We deeply value intellectual curiosity, creative idea generation, and close collaboration. We offer above market equity and cash compensation, and have a generous maternity leave policy.<p>Interested? Email us at jobs@theoremlp.com<p>RESEARCHER<p>* A high level of mathematical and statistical literacy, and an intense interest in applying quantitative analysis to do first class research.<p>* You should be a good scientist.  You need to know when you have something and when you don’t, you cannot be fooled by randomness.<p>* You must be comfortable and enjoy working with data.  This is the lifeblood of our business, your hypotheses start there and your testing ends there.<p>* You must be comfortable writing code.  Nobody will be doing it for you.  The better you are at it, the more efficiently you can explore the model space and find winning ideas.<p>* Research background devising novel approaches to solving problems and applying them to real world data to achieve robust, repeatable results.<p>* You’ll investigate data, construct a hypothesis, and think deeply about the results.  After several iterations, you will discover something new.  Instead of writing a paper, you will actually apply your ideas in the real world and see them working.<p>* You’ll need to care more about analysis being correct then achieving a p-value below 0.05.<p>SOFTWARE ENGINEER<p>* Professional experience in designing systems, and with numerical or scientific computing.<p>* We value correctness, maintainability, elegance, and testability of code. We want to do things the right way over just getting things “done.”  We’re strict about our code style and quality so that you don’t have to spend your time tracking down other peoples’ bugs.<p>* Coding skill in Python, C++ or similar. We currently use Python, but welcome developers of any background, as long as you can pick up Python.  Experience with numpy&#x2F;scipy&#x2F;pandas is a big plus.<p>* Experience with writing fast code (especially numerical code) , databases and dev ops preferred. Machine Learning experience is a big plus, but not required.","time":1480630723,"type":"comment"}