{"by":"tedd4u","id":13081952,"parent":13080280,"text":"Quizlet | Android Engineer | San Francisco, CA | ONSITE, <a href=\"https:&#x2F;&#x2F;quizlet.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;quizlet.com&#x2F;</a><p>Android Engineer<p>Want to build useful and intuitive Android apps for one of the top education brands in the world?<p>Quizlet is a pioneer in education technology with tens of millions of active users and HUGE growth ahead. We’re seeking talented and experienced developers who want to build learning tools that empower students and teachers globally. We’re backed by Union Square Ventures, Costanoa Venture Capital, Altos Ventures and Owl Ventures. Our business model is strong and got us to profitability before raising venture capital money. Come join a small team of engineers building and deploying new products to over a million users per day.<p>The Role<p>Quizlet’s Android app is already in the top ten education apps in the Google Play store and we’re just getting started. You’ll drive the Quizlet experience on Android devices, building out cutting-edge features accessible to millions of users around the world.\nYou must care passionately about product design and user experience, and develop a deep understanding of how users interact with Quizlet. The intuitive UI features you build will drive user engagement and thus directly affect the magnitude of Quizlet’s impact on education.<p>Qualifications and Experience<p>The ideal Android team member for Quizlet should:<p><pre><code>  - Have proven experience building his or her own high quality apps, ideally in the Google Play Store\n  - Have solid foundation in Java and with strong working knowledge of the web stack\n  - Be well-versed in performant, extensible network API design\n  - Have a dedication to code quality and software reliability\n  - Have a strong understanding of networking, memory management, and concurrency\n  - Be deeply excited about the impact his or her work could have in the lives of students and teachers every day\n</code></pre>\nQuizlet’s Team Culture<p>We’re extremely proud of the powerful impact our study tools are having on people’s lives across the U.S. and the world. Our focus on quality, usability, and performance across all platforms has helped Quizlet grow organically to a top U.S. web brand with top-ten education apps on iOS and Android. We regularly visit classrooms across the Bay Area to see Quizlet’s users in action. We believe in teamwork and communication, and we believe in each other — every member has the confidence and flexibility to take a stab at new problems across functions. We love technology and we love helping people. Come join us!<p>How to apply: email tim@quizlet.com with your resume and link to your Github profile.","time":1480616838,"type":"comment"}