{"by":"jkuria","id":13082004,"parent":13080280,"text":"Mouseflow | Redmond, Washington<p>If you respond please let us know you found out about the job from HN and your application will get an expedited review!<p>Social Media Coordinator\n------------------------------<p>We are currently looking for a fun, talented, and experienced Social Media &amp; Blog Coordinator in our Redmond, WA, USA office.<p>We seek a creative professional that is an expert in Social Media. You will create and grow engagement across all of our social media platforms. Your role will include planning, writing, and publishing relevant, thoughtful, and effective content on a daily basis.<p>Please see details here: <a href=\"http:&#x2F;&#x2F;blog.capitalandgrowth.org&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.capitalandgrowth.org&#x2F;jobs&#x2F;</a><p>Sales Associate\n-------------------<p>We are currently looking for a talented Sales Associate to join the team in our Redmond, WA, USA office. We’re a software company that produces one of the best analytics tools in the world – it’s been deployed on nearly 100,000 websites and is used by some of the largest brands in the world.<p>We seek an ambitious person with excellent communications skills – someone who isn’t afraid of competition and functions well under pressure. You should be a go-getter who likes the thrill of “winning”.<p>Please see details here: <a href=\"http:&#x2F;&#x2F;blog.capitalandgrowth.org&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.capitalandgrowth.org&#x2F;jobs&#x2F;</a><p>About Mouseflow\n------------------\nMouseflow is an analytics tool that tracks website visitor behavior and generates recordings, heatmaps, funnels, and form reports. This allows customers to analyze conversion behavior, debug problems, and target their marketing efforts in an easy-to-use platform.<p>Our company was founded in 2009 in Copenhagen, Denmark and quickly rose to become a powerful player in analytics with offices in Denmark, Germany, and the United States. Today, Mouseflow tracks over 90,000 websites and is aggressively looking to grow its international team!","time":1480617101,"type":"comment"}