{"by":"_iago","id":13081429,"kids":[13088008,13085758],"parent":13080280,"text":"FundApps | Infrastructure Engineer + Software Engineer | London | Full-time, Onsite | <a href=\"https:&#x2F;&#x2F;www.fundapps.co\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fundapps.co</a><p>=== Who we are<p>FundApps is an award-winning Fintech startup helping investment managers comply with worldwide regulation. We&#x27;re a small team of smart, friendly people {<a href=\"https:&#x2F;&#x2F;www.fundapps.co&#x2F;about-us&#x2F;meet-the-team\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fundapps.co&#x2F;about-us&#x2F;meet-the-team</a>} who collaborate closely and take pride in delivering amazing software and providing outstanding customer support.<p>We know that diverse teams are strong teams and we welcome applications from everyone regardless of age, gender, ethnicity, sexual identity, faith or disability to join our team of superstars.<p>=== Roles<p>Infrastructure Engineer | We are looking for someone who knows how to build out, deploy and maintain multiple applications in different languages on AWS. Someone who can write code both for production apps and for tooling. You should have a mindset of automating all the things all the time. | Apply here: <a href=\"https:&#x2F;&#x2F;fundapps.workable.com&#x2F;jobs&#x2F;22278\" rel=\"nofollow\">https:&#x2F;&#x2F;fundapps.workable.com&#x2F;jobs&#x2F;22278</a><p>Software Engineer | We are looking for motivated, intelligent coders to join our close-knit engineering team (see stack below) to work on anything from new features to greenfield products. We pride ourselves in getting our engineers up and running fast – expect to build and deploy your first feature in week one! Hiring process: coffee or call, followed by on-site interview with pair programming exercise | Apply here: <a href=\"https:&#x2F;&#x2F;fundapps.workable.com&#x2F;jobs&#x2F;64778\" rel=\"nofollow\">https:&#x2F;&#x2F;fundapps.workable.com&#x2F;jobs&#x2F;64778</a><p>=== Stack + Tooling<p>C#, F#, ASP.NET MVC, ES6, SCSS, Handlebars, Golang, AWS, Lambda, Terraform, Packer, Atlas, Consul, HAProxy, Sumologic, Sentry, TeamCity, Visual Studio, Resharper, GitHub.","time":1480613875,"type":"comment"}