{"by":"jpallen","id":13081539,"parent":13080280,"text":"ShareLaTeX (www.sharelatex.com) | DevOps | UK | REMOTE | www.sharelatex.com<p>We&#x27;re looking for someone for a DevOps role at ShareLaTeX, which is an online LaTeX editor with over 1 million registered users. We help academics collaborate more effectively, and make LaTeX easier to work with.<p>The technologies we use are Ubuntu, Redis, MongoDB, Haproxy, Nginx, Node.js, Jenkins and Docker. The job will involve responsibilities like:<p>* Modifying our Node.js services to work with different architectures as they evolve.<p>* Improving our auto-scaling solutions for our LaTeX compiling backend<p>* Management &amp; maintenance of our infrastructure, including designing redundant architecture, and upgrades &amp; security patches of services.<p>* Improving our CI and deployment process<p>* Testing and improving our backup &amp; backup verification process, and emergency procedures.<p>* Keeping our emergency monitoring services tested and up to date<p>* Improving and automating the Docker build process of our open source and onsite package<p>We automate everything via Chef, have a lot of small Node.js services, and use automated testing as much as possible, so you should be comfortable with these types of technologies and approaches.<p>Some reasons you&#x27;d enjoy working for us:<p>* Most of our codebase is open-source and we’re big fans of free software.<p>* We’re agile (with a lower case a). We test everything (unit and acceptance), we have a CI build process, a full staging environment to play with, and we automate as much as possible.<p>* Working hours can be flexible to your needs.<p>* Remote is a first class citizen, all founders and employees work remotely.<p>* We’re a bootstrapped &amp; profitable company with no outside investors which means no crazy business pressures. Code quality and user happiness comes first.<p>We&#x27;re looking from someone in a UK-compatible timezone. While we keep flexible hours, we&#x27;ve found that having reasonably overlapping core hours is important for communication.<p>Send us an email: founders@sharelatex.com","time":1480614451,"type":"comment"}