{"by":"Swizec","id":13081256,"parent":13080280,"text":"Yup | iOS, Android, Full-Stack Web Engineers | SF | ONSITE, VISA | <a href=\"https:&#x2F;&#x2F;www.yup.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.yup.com</a><p>Private on-demand tutoring for high school kids. You help us build the infrastructure, our tutors teach the kids, the kids get better grades[1], relieve anxiety, and become better humans.<p>Here&#x27;s how it works:<p>Imagine you&#x27;re a high school kid and you can&#x27;t do your homework. Take out your phone, snap a pic of the problem, and within 20 seconds a tutor will help you out via chat. You talk to the tutor for however long it takes[2], and by the end of the session you&#x27;ve <i>learned</i> how to solve those kinds of problems. Your life is now better.<p>Here&#x27;s where you come in:<p>We need engineers to help us build the product. It&#x27;s been just four of us so far and we need help. I&#x27;ve personally built large swathes of the infrastructure, primarily the tutor side, and <i>I</i> need your help. On the immediate, you can help me move the rest of our codebase from Backbone to React. We&#x27;re halfway there :)<p>Another imminent project is rebuilding the messaging infrastructure, making student&#x2F;tutor matching smarter, moving the backend to a microservice model. All the things you&#x27;d expect to do in a startup moving from small to bigger.<p>Why Yup:<p>We&#x27;re not just a Silicon Valley startup trying to get big fast and loose. Our goal is to build a product that helps people, has sound unit economics, and generates real revenue, not just users. Our BD branch is finding ways to bring Yup to underprivileged youths whose families couldn&#x27;t afford it on their own by selling it to schools.<p>I&#x27;ve worked with many startups before and, honestly, this is the only one that&#x27;s made me feel really good about what I&#x27;m building every day.<p>If you have questions, I&#x27;m on twitter and here as Swizec.\nIf you wanna join us, email the CEO -&gt; nag@yup.com<p>[1] we&#x27;ve had parents send us really nice emails saying their kid went from a D to a B+.<p>[2] some of our longest sessions so far have been north of 2 hours.","time":1480612988,"type":"comment"}