{"by":"deltaprojjobs","id":13081550,"parent":13080280,"text":"DeltaProjects (<a href=\"http:&#x2F;&#x2F;deltaprojects.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;deltaprojects.com&#x2F;</a>) | Poland&#x2F;Europe, REMOTE, Stockholm ON-SITE | Software Engineering, Frontend and Backend<p>DeltaProjects is looking for remote developers in Poland and a Team Leader in Stockholm Sweden.<p>We are looking for motivated developers for two roles and a team leader:<p>Frontend developers: We develop using Facebook Flow, React and usual front end tooling around JavaScript. Our legacy software is written in ObjectiveJ&#x2F;Cappucino so knowledge of these would be a plus, but is not mandatory. We have multiple web based applications coming soon.<p>Backend developers: We develop using Scala and Java, using usual tools available. We have build systems, bug tracking, deployment covered, everything that ensures smoot sailing.<p>Team leader: We are also looking for a team leader that would like to work on-size in Stockholm and take on responsibility as a main point of contact for a team of remote developers.<p>We are looking for a handful of people for each role throughout the coming year. Our aim is to have a long term relationship with mutual investment of time and energy for deep business and technology understanding on behalf of the candidate.<p>DeltaProjects works in advertising space in real-time bidding market. DeltaProjects is leading provider of RTB services in Sweden and other countries looking to expand operations. We have technically challenging size of traffic going through our servers and engineering has a reasonably free choice in technology selection. So far we use Kafka, Druid, Riak, CouchDB, mySql, MongoDB, Kibana, Elasticsearch, and multiple other technolgies that help us to deliver on our goals. As a company we value technical excellence so expect to work among a great team of skilled technicians.<p>Requirements: English and Polish language, Timezone plus&#x2F;minus 2h from Stockholm<p>Interview process: CV -&gt; two interview talks on Hangout -&gt; a programming task -&gt; salary negotiation -&gt; start!<p>Joins DeltaProjects by sending your CV to deltaprojjobs@gmail.com.","time":1480614539,"type":"comment"}