{"by":"obayesshelton","id":13081283,"parent":13080280,"text":"CoInvestor | London &#x2F; Canterbury, UK | Onsite&#x2F;Remote | Full-time | Lead PHP Developer | £55k-£70k<p>CoInvestor is an investment platform providing access to growth capital, tax efficient equity and income opportunities. We allow private investors to mix and match between investing in funds or building their own portfolios of direct investments by co-investing alongside these same funds.<p>We are looking for a lead php developer, ideally you would have a PHP background, failing that any object orientated language would do. We are looking for someone who can get hands on with a little DevOps where necessary.<p>Responsibilities:<p>* Deliver excellent production quality code and promote the use of test-driven development where applicable.<p>* Promote code reusability where appropriate with a view to reducing the development costs by applying principles of agile \ndelivery.<p>* Work as an effective member of a scrum team, understand and contribute to the agile delivery process, taking ownership for the team&#x27;s development quality from concept to production.<p>* Maintain, improve and hand over support documentation to the Operations team as part of production implementation.<p>* Ensure risks and issues are identified in a timely manner and effectively communicated with proposed resolution and mitigation strategies to the management team<p>A knowledge of AngularJs (1&#x2F;2), REST API&#x27;s &amp; Laravel is desirable. Having experience with financial markets would be a bonus.<p>We have offices in Canterbury and London, and you would be expected to work at both locations from time to time as required. Potential for partially remote working depending on performance.<p>Please send your resume and cover letter to oliver(aaattt)coinvestor(dot co dot uk), and read more at <a href=\"http:&#x2F;&#x2F;www.coinvestor.co.uk\" rel=\"nofollow\">http:&#x2F;&#x2F;www.coinvestor.co.uk</a>","time":1480613127,"type":"comment"}