{"by":"jbeda","id":13081074,"parent":13080280,"text":"Heptio Inc | Systems Software Engineer, Open Source | Seattle | REMOTE <a href=\"https:&#x2F;&#x2F;www.heptio.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.heptio.com</a><p>Heptio is a new (funded, 8.5M from Accel and Madrona) Seattle based startup in the systems infrastructure space. Our mission is to make mainstream enterprise more efficient in how they build teams and use physical resources. Our approach is based on experiences at Google and other first tier software companies.<p>While at Google, the Heptio founders (Craig McLuckie and Joe Beda) started Kubernetes.  Kubernetes enables IT organizations to offer API driven services to their organization and drive up resource utilization.  It is also a fast-growing open source community and the &quot;seed crystal&quot; for a groundbreaking set of technologies.<p>We are looking for extraordinary engineering talent to continue the mission to bring Kubernetes to enterprise developers and beyond.<p>What you&#x27;ll be doing...<p>* Working with and growing your stature in the Kubernetes open source community.<p>* Building distributed server side systems and developer tooling in Go.<p>* Listening to users in order to make complex technologies usable.<p>* Concentrating on user experience, especially for other engineers.<p>It would be nice if you&#x27;ve worked on or with technologies that make up the new &quot;cloud native&quot; stack.  This would include Kubernetes, Docker, Mesosphere, Go.<p><i></i>Important:<i></i> we are an equal opportunity employer and value diversity at our company. We’re strongly committed to providing equal employment opportunity for all employees and all applicants for employment. We want to embody the change we need in our industry.<p>We are open to hiring remote but want to make sure we do it right so are being careful. Having someone that has successful experience working remote and can help get us on the right path would be highly valued.<p>Email me at joe@heptio.com if you are interested.","time":1480612200,"type":"comment"}