{"by":"deepakalur","id":13093567,"parent":13080280,"text":"Anaplan | <a href=\"http:&#x2F;&#x2F;www.anaplan.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.anaplan.com</a> | San Francisco, CA<p>Open positions in Anaplan Engineering:<p>Anaplan | UI Engineer – Javascript&#x2F;React | San Francisco, CA<p>Anaplan | Principal Software Engineer - Data Platform | San Francisco, CA<p>Anaplan | Software Engineer - Data Platform | San Francisco, CA<p>Anaplan | Test Engineer - Data Platform | San Francisco, CA<p>Anaplan | Site Reliability Engineer | San Francisco, CA<p>Anaplan | Senior Software Engineer, Security | San\nFrancisco, CA<p>Anaplan | Software Engineer, Security | San Francisco, CA<p>Link to These Jobs:  <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3TZ1liw1\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3TZ1liw1</a><p>About Anaplan:\nWe are expanding our engineering team in San Francisco to build more cool stuff. Our team is building cloud and data platforms to enable Anaplan for the next stage of growth. Along with that comes lots of opportunities for innovative, creative and iterative development of next generation systems to cater to new demand. Join our awesome team of people with incredible knowledge and experience in building real-world scalable systems for well-known tech companies in the bay area like eBay, Google, Okta, Tidemark, Oracle, and other stellar companies. We are an engineering-led and innovation-focused company.<p>Anaplan is a well-funded and profitable startup headquartered in SOMA. In fact, we may be the most successful company you’ve never heard of! We are on a mission to revolutionize how companies analyze and plan their businesses. And it’s working - we are already trusted by hundreds of Fortune 2000 companies and we’ve only just begun.<p>Our engineers are foodies, music nerds, Pokéwalkers, and ex-Googlers from around the world building great things together. We strive for cross-team collaboration and innovation.  Our offices are super cool and relaxing with all the yummy foods, free beer, and healthy snacks galore, happy hours, karaoke nights and Settlers of Catan. We have phenomenal benefits, medical, dental, flexible work hours and unlimited vacation.","time":1480726405,"type":"comment"}