{"by":"SCM","id":13105699,"parent":13080280,"text":"Stevens Capital Management LP | Technical Recruiter | Radnor, PA | ONSITE | www.scm-lp.com<p>Stevens Capital Management LP (“SCM”) is a registered investment adviser that manages a multi-billion dollar hedge fund that has been in business for 25+ years.\nSCM specializes in the rigorous development and disciplined implementation of empirically based quantitative trading strategies. Our highly productive team works in a fast-paced collegial environment, utilizing extensive data sets, technology and the scientific method to devise and employ trading strategies throughout the world’s most liquid financial markets.<p>We&#x27;re seeking a technical recruiter with extensive experience recruiting software developers to work in a fast paced, high performance computational environment.  Candidates should be familiar with the requirements of highly selective, data intensive, quantitative research-driven organizations, and possess an established recruiting network.<p>Primary Responsibilities:<p>•\tDesign and implement tailored recruiting strategies.\n•\tIdentify and prioritize recruiting sources and networks.  \n•\tWork with colleagues to develop job descriptions and specifications.\n•\tSource and attract highly qualified candidates.\n•\tConduct interviews and employ tools and methods to assess applicants&#x27; skills, experience and aptitudes.\n•\tRepresent SCM at recruiting events and functions.<p>Requirements:<p>•\tProven experience recruiting software developers for highly selective, data intensive, technology reliant organizations.\n•\tSolid familiarity with the personnel and technology requirements of a high performance computational environment.\n•\tEstablished recruiting contacts in software development and the related academic communities.\t\n•\tExperience recruiting for low latency securities trading organizations is a strong plus.\n•\tCreative thinker who can generate innovative recruiting strategies.\n•\tExcellent communication and interpersonal skills.<p>Please submit your resume to: recruiting@scm-lp.com","time":1480949977,"type":"comment"}