{"by":"wc-","id":13115784,"parent":13080280,"text":"Digital H2O | Experienced Front-End Engineer | Chicago, IL | FULL TIME, ONSITE, <a href=\"http:&#x2F;&#x2F;www.digitalh2o.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.digitalh2o.com&#x2F;</a><p>Digital H2O, a water-focused SaaS company, is looking for talented software engineers to join us in building products to solve the challenge of sustainably managing, monitoring, and forecasting water supply and demand in cost-effective ways.<p>Digital H2O offers an agile work environment where you can have a large impact on the direction and success of the company.  As a Senior Software Engineer you are given the opportunity to own products and features from start to finish, design to delivery, using the best tools for the job at hand.  In return we offer a competitive salary, full health benefits, 401K matching, annual bonuses, relocation assistance, a generous paid vacation policy, and more.<p>There are many products a Front-End Software Engineer has the opportunity to help us build, including:<p><pre><code>  - Our water market intelligence platform using Ember.js, Vue.js, Node.js, Javascript, SASS, and more, which enables a comprehensive view into the world of water supply and demand\n  - Data visualization and mapping products using Mapbox, Leaflet, Highcharts, and D3\n  - iPad and Android tablet applications developed with Ember.js and Cordova\n  - Helping shape new and innovative products (and features) that our customers will utilize to optimize their water use\n\n</code></pre>\nA strong fit for this position will have most of the following:<p><pre><code>  - Software development experience building rich, full-featured applications in a modern framework - such as Ember.js, Vue.js, React.js, AngularJS, and Backbone.js\n  - Strong background with Javascript and awareness of upcoming ECMAScript standards\n  - Solid coding skills and Computer Science fundamentals\n\n</code></pre>\nOther things we would love to see:<p><pre><code>  - An appreciation for well tested code\n  - Expertise with data visualization libraries (D3, Highcharts, etc.)\n  - Previous experience with mapping libraries (Google Maps, Mapbox, Leaflet, etc.)\n  - Tablet development experience with Cordova, Phonegap, or other libraries\n</code></pre>\nEmail jobs ( a t ) digitalh2o.com to apply!","time":1481041363,"type":"comment"}