{"by":"4lc1d3","id":17903550,"parent":17902901,"text":"Doctor Today | Mobile app developer | Rome, Italy | REMOTE | Visa | 30-40k USD&#x2F;year + shares 0-1% | <a href=\"https:&#x2F;&#x2F;www.doctorsinitaly.org&#x2F;en&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.doctorsinitaly.org&#x2F;en&#x2F;</a><p>We are breaking the doctor-centric paradigm of healthcare, by building a patient-centric experience. Booking a doctor online when you need it, should be as easy as getting a taxi. No hassle, simple and free. See what we do here <a href=\"https:&#x2F;&#x2F;docita.ly&#x2F;youtu18\" rel=\"nofollow\">https:&#x2F;&#x2F;docita.ly&#x2F;youtu18</a><p>We are looking for someone who will help us create, develop and maintain a beautiful app, engaging and easy to use. The app will communicate with the back-end booking system, allowing for a smooth management of all requests.<p>We are a growing a promising startup engaged in an ethical business, solving a very real need in the simplest possible way. We are looking for someone who loves the idea and has the technical capabilities to effectively contribute to the mission.<p>The team is small and diverse, you would be leading the tech development, and there are plenty of growth opportunities for professionals joining at this stage.<p>The person we hire will be in charge of developing a cross-platform mobile app. Additionally, the same person will manage changes and updates of the front-end websites.<p>We are looking for someone who:\n- Knows how to write good code, clean and scalable\n- Loves innovating, experimenting, learning by doing\n- Loves working, is enthusiastic and genuinely wishes to share knowledge\n- Is willing and open to discuss, debate and work with the rest of the team (mostly non tech!), looking for the best possible solution to any challenge.<p>Required Skills\nExperience in developing crossplatform mobile apps in React Native; experience in integrating client-server communication with RESTful API; experience in web design, UI&#x2F;UX, PHP, Javascript, Graphic Design, HTML, CSS, MySQL, Wordpress, Cross Platform Mobile Development, Linux, Responsive Design, Bootstrap, React Native<p>Candidate must be willing to stay in Rome for the first 2 months, then can continue working remotely.<p>Apply via email to contact [at] doctorsinitaly (dot) org","time":1535993290,"type":"comment"}