{"by":"boling11","id":17909774,"parent":17902901,"text":"Privacy.com | Senior Software Engineer | FULL-TIME | New York, NY (NYC &#x2F; Brooklyn) | ONSITE | $120k - $160k (USD), 0.1 - 1% equity<p>Come help us build and scale Privacy.com. We&#x27;re building the world&#x27;s safest and easiest way to pay online. In less than two years since launch, we&#x27;ve saved users over $100,000,000 in unauthorized and unwanted transactions.<p>About Us<p>Privacy is a new way to transact without sharing your personally identifiable information or credit card number. Generate a new card number for every purchase with just 1 click. You don’t use the same password everywhere, why use the same card number?<p>We&#x27;re a rapidly growing, fintech company backed by tier 1 investors expanding our engineering team to keep pace with our growth. We believe that there is an enormous opportunity to improve the lives of millions of people by building financial tools that are both safe and delightful to use.<p>As an early team member, you will make a significant impact on both the product and culture. You&#x27;ll have the chance to work directly with everyone in the company on a multitude of interesting technical challenges across payment processing, banking APIs, fraud detection, scale, and predictive analytics.<p>Why apply?<p><pre><code>  -  Competitive compensation and equity \n  -  Medical &#x2F; dental &#x2F; vision coverage\n  -  Snacks, stocked fridge, and pantry\n  -  Choose your own Apple equipment\n  -  Pet friendly office\n  -  Commuter Benefits\n  -  Flexible vacation policy; take time when you need it\n  -  Our office is located in a beautiful loft in downtown NYC near most trains\n</code></pre>\nApply via Angel List or drop us a note jobs@privacy.com<p>Senior Frontend Engineer: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;privacy-com&#x2F;jobs&#x2F;361133-senior-frontend-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;privacy-com&#x2F;jobs&#x2F;361133-senior-frontend-eng...</a><p>Senior Backend Engineer: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;privacy-com&#x2F;jobs&#x2F;172194-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;privacy-com&#x2F;jobs&#x2F;172194-software-engineer</a>","time":1536075548,"type":"comment"}