{"by":"tbabej","id":17905343,"kids":[17905398],"parent":17902901,"text":"ProteinQure | Computational drug design | Full-stack dev | Toronto (onsite)<p>ProteinQure is building the next generation of computational tools to aid in early-stage drug discovery. We&#x27;re using a combination of physical simulations, quantum computing and reinforcement learning to reimagine how pharma companies create new therapeutics. The tools and molecules we are making hope to transform the world.<p>We are seeking a Full Stack Developer to become an integral part of our drug design team! You will be responsible for spearheading the development of our distributed internal simulation platform.<p>Responsibilities:\nWe&#x27;re an early-stage startup and thus you will be working closely with our CTO and CSO on extending and developing our internal simulation platform, both on the frontend and backend. The simulation platform analyzes and visualizes data that is collected from the compute nodes. To address our scaling needs, and to leverage our resources efficiently, the platform runs on a heterogenous mix of cloud and internal nodes. To handle the complexity, you will rely on tools like containerization to cope with the different environments. While emphasis is made on data collection, preservation and internal system maintenance, your role will also involve the use of public databases and APIs, visualization, scraping, development of JS tools and UX design.<p>Nice to haves:\n    Familiarity with Python data science stack\n    Interest in quantum computing and machine learning\n    Basic understanding of protein structures and modelling<p>Required Qualifications:\n    Previous experience in software development, computer engineering, or other related fields\n    Familiarity with OOP-based Python 3, testing frameworks, REST, software architecture\n    Experience with web backend development, databases, networking and containerization\n    User level experience with work in cloud-based VM environment (i.e. AWS, Azure, OpenNebula, etc..)\n    Linux system administration skills\n    Passing knowledge of HTML5, CSS3 and JavaScript\n    Deadline and detail-oriented\n    Strong analytical and critical thinking skills","time":1536014425,"type":"comment"}