{"by":"guthriej","id":17903505,"parent":17902901,"text":"True Wealth | Zurich, Switzerland | UX Designer &#x2F; Frontend Engineer | Full-time | Onsite<p>True Wealth (<a href=\"https:&#x2F;&#x2F;www.truewealth.ch\" rel=\"nofollow\">https:&#x2F;&#x2F;www.truewealth.ch</a>) is the leading online wealth management platform in Switzerland. We have both direct (B2C) customers as well as B2B relationships as a service provider for other financial institutions.<p>We are looking for someone at the intersection of Design and Engineering to take ownership of our front end. Ideally you have a great sense for how our customers tick, can turn ideas into visions, and those visions into code. We have a small team of full-stack engineers who look forward to having someone to take the lead when it comes to design.<p>Your role in bullet-points:<p>- Lead front-end projects (design, prototyping, iteration with business &#x2F; engineering &#x2F; external designers, implementation)<p>- UX and styling expert within the engineering team<p>- Front-end programming in Typescript &amp; React<p>- Ownership of CSS architecture, visual styling and consistency<p>- Ownership of web site, blog platform and digital marketing assets<p>We offer:<p>- Responsibility, ownership and influence on the further development of our best-in-class roboadvisory solution<p>- Exciting development projects, both B2B and B2C<p>- Competitive salary package, solidly financed company and real-world FinTech exposure<p>- Modern and lean open source stack based on Typescript, React, Java 10, PostgreSQL, Linux, Docker<p>- Cloud-based hosting, continuous integration and deployments, code review<p>- Flexibility, exposure and opportunities to work across the entire stack, depending on preferences and skills<p>- Office in Zürich (near station Zürich Binz SZU, 2 stops from HB)<p>If you&#x27;re interested, send us a mail with your CV, references, and some public samples of previous work to hr@truewealth.ch. Please note that you must be eligible to work in Switzerland.","time":1535992779,"type":"comment"}