{"by":"benfs","id":17903207,"parent":17902901,"text":"Elliptic | Software Engineer | ONSITE | London | Full-time<p>We reveal the truth behind Bitcoin activity.\nElliptic’s team of computer scientists and former law-enforcement agents has developed software to make Bitcoin activity more transparent and accountable. Today the world’s largest banks and Bitcoin exchanges use Elliptic software to monitor billions of dollars in Bitcoin transactions every month, and the top law enforcement agencies use Elliptic software to investigate Bitcoin’s role in cases of terrorist financing, arms trafficking, child pornography, and blackmail. Elliptic’s software is recognized in the Bitcoin industry as the standard for regulatory compliance and forensic investigations.<p>Open positions:\nPlatform Engineer<p>* Proven experience with Java&#x2F;C++ or Scala<p>* Strong CS fundamentals, including good working knowledge of algorithms, data structures, and concurrency.<p>* A passion for developing and mentoring team members<p>* Highly developed technical and people troubleshooting skills<p>* Expertise with data pipelines and modelling for analytic scenarios (SQL, NoSQL, Graph databases)<p>Javascript Engineer<p>* Proven industry experience with modern web development and frameworks<p>* Production experience with Javascript ES6, HTML5, CSS (and preprocessors), Node.js, Express and a front-end framework (React, Redux and Webpack preferred)<p>* Familiarity with testing frameworks (Mocha, Chai, Jasmine, Karma etc.)<p>* Comfort with asynchronous programming, be it callbacks, promises, streams...<p>* Good practical knowledge of data modelling, RDBMS (PostgreSQL preferred), and NoSQL solutions<p>* Familiarity with git source control<p>We are also hiring data scientists, dev-ops and sales, see all our jobs at <a href=\"https:&#x2F;&#x2F;www.elliptic.co&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.elliptic.co&#x2F;careers</a> or drop me a message at ryan &lt;at&gt; elliptic dot co for more details (be sure to include hacker news in the subject!).","time":1535989833,"type":"comment"}