{"by":"moffe42","id":17907819,"kids":[17911703],"parent":17902901,"text":"Colourbox | Senior Backend Developer | Full-time On-Site | Odense, Denmark<p>Colourbox is looking for an experienced backend software developer with an extensive theoretical background, who is interested in working with data mining, data analysis and high-performing web applications including search engines, image processing and cloud infrastructure.<p>You will be a part of a strong development team working out of our headquarters in Odense, Denmark. You will work on Scandinavia&#x27;s leading stock image website Colourbox and the associated media handling platform Skyfish that helps users organise, share and edit images.<p>Our customers include major public and private clients such as the Danish Ministry of Justice, a large part of the municipalities in Denmark, Ørsted and DSB. We are experiencing high growth and need you to help create optimal conditions for continued future growth. The platform you help develop will create a fantastic user experience for our users and also convert new visitors into paying customers.<p>You will be involved in data mining and data analysis and create new and innovative solutions. You will help implement these new solutions and make sure they work fast, are robust and scalable. You will also work on our existing solutions, improving and extending them to adapt to the ever-changing needs of our customers. You will be involved in the whole process from analysis through design to implementation. Our services run on our AWS infrastructure, consisting of Linux servers that run open source software such as NGINX, MySQL and Elasticsearch, and custom built services written in PHP, Python, Go and C.<p>Your Qualifications<p>Developers come in all shapes and sizes, but we expect you to match the following requirements to apply:<p><pre><code>  * A degree in Computer Science, Mathematics, Software Engineering, or similar\n  * Good communication skills (written and verbal) in English\n  * 5+ years working as a software developer\n  * Experience working with Linux\n  * Experience working with MySQL\n  * Proven development skills in PHP or similar languages\n  * Experience with one or more of the following technologies and terminologies is a big plus; Machine learning, Python, Go, Elasticsearch, TDD, AWS, refactoring techniques\n</code></pre>\nWe Offer; A full-time position, working in our office in Odense. You will be offered a competitive wage with the ability to be influential while enjoying professional freedom with responsibility. We offer flexible working hours, a pleasant office environment, a pension plan, awesome lunch, and a supportive work climate with ambitious and energetic international colleagues. You will become part of an expanding, successful international business.<p>Interested?\nIf this is you, we want to hear from you! Send your application to jobs@colourbox.com. If you have any questions, also email jobs@colourbox.com.<p><a href=\"https:&#x2F;&#x2F;www.colourbox.com&#x2F;jobs&#x2F;backend-software-developer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.colourbox.com&#x2F;jobs&#x2F;backend-software-developer</a>","time":1536054641,"type":"comment"}