{"by":"kevinwuhoo","id":17904526,"parent":17902901,"text":"10x Genomics | Software Engineers, QA, Designers | San Francisco &amp; Pleasanton, CA | Onsite or Remote (US Only)<p>We&#x27;re a biotech company developing novel software, hardware, and biochemical systems to give scientists new methods of discovering the mechanisms behind cancer and immunology. We&#x27;re growing our software team of currently nine engineers (including myself) and four QA engineers to help develop and release three novel products this year.<p>We started out in 2012, but scientists are already really excited about our technology as evidenced by the company seeing $71 million in revenue in 2017 (double our revenue in 2016). We&#x27;re working hard to continue this trend this year. This month we announced our first acquisition which will allow us to accelerate development of technology to determine which segments of DNA are currently being read.<p>You can find out more about our massively parallel pipelines as well as our visualization software at <a href=\"https:&#x2F;&#x2F;support.10xgenomics.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;support.10xgenomics.com&#x2F;</a>. We manage our pipelines with Go, develop analysis code using Rust and the NumPy&#x2F;SciPy stack, and drive our front-end applications with React&#x2F;Redux. No previous biological experience is required, but if you&#x27;re interested there are an abundance of opportunities to learn! You&#x27;ll work with a team who are alums of YC, Google, Facebook, 23andMe, MIT, Harvard, Caltech, and more.<p>We&#x27;re currently hiring for all types of software roles including full stack, front end, back end, infrastructure, UI, QA engineers as well as a product designer. You can see the full listing at our careers page: <a href=\"https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;</a>. Feel free to email me if you think you&#x27;re a good fit for these or really any role at our company or if you just want to chat. You can reach me at kevin.wu@10xgenomics.com or @kevinwuhoo.<p>[1]: <a href=\"https:&#x2F;&#x2F;www.cnbc.com&#x2F;2018&#x2F;08&#x2F;28&#x2F;sofbtank-backed-10x-genomics-buys-epinomics.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cnbc.com&#x2F;2018&#x2F;08&#x2F;28&#x2F;sofbtank-backed-10x-genomics...</a>","time":1536004308,"type":"comment"}