{"by":"aminima-ctt","id":17905811,"parent":17902901,"text":"Cryptact Ltd. | Engineer | Tokyo, Japan | ONSITE | FULL TIME<p>We are looking for mid-level engineers with experience in React, Node, React Native and mobile app development.<p>We are also looking for mid-level engineering generalists who enjoy working with data and have an interest in financial services and&#x2F;or blockchain&#x2F;cryptocurrencies.<p>Cryptact is a FinTech startup company aiming to provide services centering on virtual assets.  Our first service was an online web-based service called tax@cryptact aiming to help Japanese investors in cryptocurrencies manage their comprehensive ledger of transactions for reporting and tax purposes.  In the short amount of time since the service was launched (end-December 2017), it has grown to Japan&#x27;s largest with over 30,000 users.  Several joint projects related to the platform are also underway with some of Japan&#x27;s largest financial services and FinTech companies.  The immediate goal for this service is to rapidly grow the user base and build a one-stop investment support platform for individuals, professionals and investment institutions.<p>The co-founders have over 40 years of experience in financial services and technology.  The management team is a mix of Japanese and US professionals and we aim to be one of the few global-reaching startup companies based in Japan.  Distributed ledger technology and smart contracts are going to change the financial industry dramatically in the next 10 years.   At Cryptact we aim to be one of the key players of this change.<p>We can provide assistance with visa renewal if you are already working in Japan.<p>The stack for our services is fully Typescript-based Node and React.  Our market data services utilize Python and Java&#x2F;Kotlin&#x2F;Haskell.  Our entire infrastructure is Linux based on AWS.<p>Depending on the skill-set and area of expertise of the individual, Japanese language ability may be required.  The entire code base, comments and documentation are in English.<p>Please email hcm@cryptact.com for more information.","time":1536022033,"type":"comment"}