{"by":"betocmn","id":17905187,"kids":[17906057],"parent":17902901,"text":"Wine Gallery | Fullstack Engineers | Sydney, Australia | Full-time | Onsite | Visa | Salary + Equity<p>We get it. You’re in high demand. You’re a talented coder with options galore. Atlassian, Uber and the others are practically throwing free beer and poker nights at you to keep you happy. The money’s good and the work&#x27;s pretty good. So life’s good. We understand.<p>But we also know there&#x27;s a few of you with itchy fingers.\nA rare few of you who want the challenge to build something unique. To work on a challenge where the outcome is uncertain and your skills will play a direct role in determining which way it goes. A select few of you who are yearning for the thrill of pressing that button and launching your latest work into production without the layers of bureaucracy. Those of you who want to test their metal, and if proven, will be rewarded for getting on the ground floor.<p>It&#x27;s our mission at the Wine Gallery to disrupt a powerful and entrenched industry and liberate the world of wine from the aloof, the exclusive, the confusing, and the pretentious. To open up the joy of wine discovery for the novices through to the aficionados, by reimagining what the wine retail experience can be for one of the oldest consumer products on earth.<p>To give you an idea, one of our first products is something we like to call &quot;Spotify for Wine&quot;. We like to think of it as providing monthly wine adventures, customised to each member&#x27;s unique tastes, delivered to their door. Where they can learn as much (or as little) about their wines each month as they like. We&#x27;re a little over two years old, and we&#x27;ve just started to hit our stride.<p>And if the above strikes a chord with you, you can read more and apply at <a href=\"https:&#x2F;&#x2F;blog.thewinegallery.com.au&#x2F;full-stack-developer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.thewinegallery.com.au&#x2F;full-stack-developer&#x2F;</a>","time":1536012400,"type":"comment"}