{"by":"papercruncher","id":17904183,"parent":17902901,"text":"Tubi TV | iOS, DevOps, Elixir | San Francisco | ONSITE VISA | <a href=\"https:&#x2F;&#x2F;tubitv.com\" rel=\"nofollow\">https:&#x2F;&#x2F;tubitv.com</a><p>We are making studio produced TV shows and movies available for streaming everywhere and to everyone, 100% free. Join Tubi TV and reinvent the way consumers discover and consume premium, studio content. Some of our studio partners include MGM, Lionsgate and Paramount. We offer very competitive base salary, stock options, full medical, dental &amp; vision, catered lunch, gym subsidies and your choice of hardware. Learning is a huge part of our culture and we frequently help non-engineers learn basic programming skills.<p>We are hiring for:<p>* Lead &amp; Sr IC Elixir Platform Engineers: We are heavy Elixir users, using Elixir to power both our gRPC services as well as critical infrastructure like our video transcoding &amp; packaging pipeline <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;db7e29e41\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;db7e29e41</a><p>* Lead &amp; Sr IC Infrastructure Engineers: This is our equivalent of a DevOps&#x2F;SRE role. We have been able to grow so far using infrastructure-as-code and configuration-as-code practices, but now we need a build a team to own all infrastructure <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;dec2c3b31\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;dec2c3b31</a><p>* Sr iOS Engineer: We are particularly proud of our iOS app. After spending some time focusing on performance and stability, we are ready to roll out a lot of features that our users have been asking for <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;7be0fb951\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;7be0fb951</a><p>* Roku OTT Engineer: Roku has been making waves recently and their market penetration is growing. If you are excited about the platform and looking to work on one of the largest apps available on Roku, this might be a role for you. No previous BrightScript experience required, we will teach you all that you need to know <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;8f72c2ec1\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;8f72c2ec1</a><p>Positions are available ONSITE in San Francisco &amp; Beijing. If you would like to chat more, email me directly and mention HN in the subject.","time":1535999789,"type":"comment"}