{"by":"chillydawg","id":17909532,"parent":17902901,"text":"Longshot Systems | Multiple Roles | Marylebone, London, UK | ONSITE | Full time<p>At Longshot Systems Ltd we&#x27;re a small startup building advanced platforms for sports betting analytics and trading. Having developed a lot of our core platform infrastructure we are looking to begin expanding our trading strategy development activity.<p>1) Senior Machine Learning Engineer | £70k-£85k (<a href=\"https:&#x2F;&#x2F;longshot-systems-ltd.workable.com&#x2F;j&#x2F;529141E6D2\" rel=\"nofollow\">https:&#x2F;&#x2F;longshot-systems-ltd.workable.com&#x2F;j&#x2F;529141E6D2</a>). You&#x27;d be turning prototype trading models into production-ready systems, designing and building the tooling &amp; frameworks to support strategy research and development as well as architecting the high-level design of the strategy software to minimise trading latency and scale effectively. Our ML stack is Numpy&#x2F;Scipy based and communicates with our core infrastructure, written in Golang, by RPC. The ideal candidate will have a strong software engineering background, with broad experience across a range of topics related to general high performance computing such as multi-threading, networking, profiling and optimisation.<p>2) Senior Machine Learning Researcher | £70k-£85k (<a href=\"https:&#x2F;&#x2F;longshot-systems-ltd.workable.com&#x2F;j&#x2F;23F31D6A82\" rel=\"nofollow\">https:&#x2F;&#x2F;longshot-systems-ltd.workable.com&#x2F;j&#x2F;23F31D6A82</a>) You&#x27;d be designing, testing and implementing new high frequency sports betting strategies based on machine learning models. If you&#x27;re the kind of person who enjoys knocking up a prototype model based on something you read the other day in a research paper you&#x27;ll enjoy our working environment; you&#x27;ll have a high level of autonomy to research whichever methods you felt would be best suited to the problem at hand. A strong mathematical understanding of the fundamentals of Machine Learning is very important for this role and ideally you&#x27;ll have experience in doing research on cutting-edge models either in industry or academia.<p>Website: <a href=\"https:&#x2F;&#x2F;www.longshotsystems.co.uk\" rel=\"nofollow\">https:&#x2F;&#x2F;www.longshotsystems.co.uk</a>","time":1536073598,"type":"comment"}