{"by":"esilverberg2","id":17904472,"parent":17902901,"text":"SCRUFF | Tech Lead | New York City (NYC) | Onsite | Full Time<p>SCRUFF, one of the largest global gay social networks worldwide, has an opening for a Tech Lead in our New York office.<p>SCRUFF is a software company at its core, led by a team with educational and professional experience at Stanford, MIT, Google, Microsoft, and more. We run a major AWS infrastructure using the latest Gen-5 AWS VMs, Ruby (Sinatra, not Rails) 2.5, Docker, Aurora, Redshift, Kinesis, and many other cutting-edge pieces of cloud services. Our client was one of the first apps in the iOS and Google Play app stores, and today is built with the latest mobile development languages like Swift, Kotlin, and React Native (in addition to Objc and Java of course).<p>We are a dedicated group building a digital community for GBTQ men that is unique, welcoming, and (per our app store ratings and user interviews) widely liked. We are growing quickly both in the USA and internationally, and have major feature work that continue to push the boundaries of what many in years past dismissed as being a &quot;hookup app.&quot;<p>Ideal candidates have a minimum of 7 years of professional software development experience, 2+ years managing development teams, and have shipped major software projects. You will be responsible for managing projects distributed across a team of 10 engineers, some based in NYC and others based in remote home offices.<p>There are myriad skills a Tech Lead must possess and cultivate, but the most important are sincere empathy, crystal clear communication, and technical excellence. These skills are equally weighted. The Tech Lead is a “hybrid” role with one foot in management and the other in engineering, and acts as a liaison between project expectations and development tasks.<p>We have additional roles for Mobile Software Engineers and Ruby Engineers. Check out <a href=\"https:&#x2F;&#x2F;www.scruff.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.scruff.com&#x2F;careers</a> for more details.","time":1536003569,"type":"comment"}