{"by":"karim","id":17903307,"parent":17902901,"text":"Nylas – San Francisco, NYC or remote | Site Reliability Engineer | AWS, Ansible, Terraform | Full-time<p>The Nylas Cloud APIs makes it an order of magnitude easier for companies to add email, calendar, and contacts integrations to their applications. By being at the core of business communication, scheduling, and contacts, we believe we can shape the future of how people work.<p>We’re looking for Site Reliability Engineers to join our team to help build and scale the infrastructure our platform runs on and the tools our developers need to get work done. Our SRE team is responsible for the infrastructure layer of our API platform—the base operating system (including security), CI&#x2F;CD &amp; deployment tools, monitoring and observability tools, and our horizontally sharded data storage layer which stores tens of terabytes of data. Right now, our open-source Python sync engine regularly archives terabytes of data across a massive SQL cluster, and our Flask APIs handle tens of millions of requests a day. We aim to scale that several times over in the next year.<p>At Nylas, “DevOps” is a part of our engineering culture, not a role we’re looking to fill. Our development team shares the pager with operations and makes their own deploys. We’re always looking for ways in which we can have specialists who delight in really knowing different parts of systems but still avoid being silo’d away.<p>We keep our code and infrastructure automation in the same repo, and you’ll be empowered to make application changes necessary for scaling and reliability in collaboration with our development team.<p>Our stack: Python, MySQL, Redis, AWS, Debian\nAbout you:\n- You have 2 - 5 years of production engineering experience<p>- You are located anywhere in US timezones - we have offices\n in San Francisco and NYC and this team contains remote members<p>- You value communication and empathy as much as technical prowess<p>- You can navigate a Linux command line<p>- You have experience automating systems using any modern configuration management system (Chef, Ansible, Puppet)<p>- You have experience running services on a cloud platform (AWS, GCP, Azure)<p>- You can write reliable code in at least one scripting language (Python, Ruby, Perl, JavaScript etc.), though this won’t be a focus of our interview process<p>- You’re excited to create a modern, scalable infrastructure and automate away drudgery<p>Nice to have:<p>- Experience with monitoring systems, databases, or service orchestration using terraform (but don’t worry, it’s OK to learn this stuff on the job if you don&#x27;t know it already)<p>Our team collaboratively wrote about our values, benefits, perks, and published them in our open-source handbook. Read it to learn more about Nylas. You can also find more details at: <a href=\"https:&#x2F;&#x2F;www.keyvalues.com&#x2F;nylas\" rel=\"nofollow\">https:&#x2F;&#x2F;www.keyvalues.com&#x2F;nylas</a><p>If you&#x27;re interested in applying, please send me an email at karim@nylas.com!","time":1535990786,"type":"comment"}