{"by":"phantomas1234","id":17911571,"parent":17902901,"text":"Novo Nordisk Foundation Center for Biosustainability (DTU Biosustain) | Full Stack Engineer | Copenhagen Denmark | ONSITE | VISA<p>The Center for Biosustainability at the Technical University of Denmark is an international research center developing next generation cell factories and bioprocesses for sustainable production of high-value chemical compounds as well as protein-based products. The center uses advanced metabolic engineering techniques and computational biology ensuring efficient and cost-effective design and construction processes.<p>Engineering a living cell is an incredibly hard task. Mathematical and computational models are being developed in order to make computer-aided design of biology possible. The project we are hiring you for is about building a web platform to provide easy access to metabolic models so the development of new strains becomes faster and cheaper. The platform already has the capabilities of modifying cells right in your browser window and constraining the models with real experimental data in order to gain insights about cellular metabolism. You can get more information about the project at <a href=\"http:&#x2F;&#x2F;dd-decaf.eu&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;dd-decaf.eu&#x2F;</a> and take a look at the platform itself at <a href=\"https:&#x2F;&#x2F;app.dd-decaf.eu\" rel=\"nofollow\">https:&#x2F;&#x2F;app.dd-decaf.eu</a>.<p>The Job:<p>We are looking for a full-stack developer with a strong focus on the front-end. You will be dealing with biological concepts every day, discovering the best ways to operate with genes and biochemical reactions. Deep understanding of biology is not a requirement though, most of the developers in the institute were able to gain the necessary knowledge after joining our team. Our technology stack at the moment is<p>* Angular, Angular Material, Typescript\n* Python3.6 for the backend services (Flask) and core scientific libraries\n* Postgres, MongoDB, Redis, Neo4j\n* Docker<p>More information available here:\n<a href=\"http:&#x2F;&#x2F;www.dtu.dk&#x2F;english&#x2F;about&#x2F;job-and-career&#x2F;vacant-positions&#x2F;job?id=2675cc6e-040d-4ae6-b01a-01a1ab58be7c\" rel=\"nofollow\">http:&#x2F;&#x2F;www.dtu.dk&#x2F;english&#x2F;about&#x2F;job-and-career&#x2F;vacant-positi...</a>","time":1536085945,"type":"comment"}