{"by":"motordel-ltd","id":17918666,"kids":[17956507],"parent":17902901,"text":"Motor Delivery Ltd | Lincoln, United Kingdom\nFront End Developer | Full Time | Remote or Onsite | Immediate Start<p>We hate buzz words. You’ve heard innovative, you’ve heard disruptive and all the hype elsewhere… so lets get straight to the point. We are building a platform that will change the face of vehicle distribution in the UK, in Europe and eventually Globally. Our platform connects motorists and dealers and gives car buyers the easiest way to get their new cars home on their drive. This isn’t fluff; we’ve already signed up all of the major UK dealers who are eager to get started. What’s the blocker? Our platform front-end, and this is where you come in.<p>We are looking for a skilled and experienced front-end web developer to join our team, to build the front end from designs and supporting the launch of our new and cutting edge Proof of Collection &#x2F; Proof of Delivery system. There will be involvement in end to end testing including unit, integration, system and performance testing. Knowledge&#x2F;experienced of automated testing procedures is a plus.<p>The site will allow our clients to book and arrange the movements of their vehicles either online, before checking the transit status within their My Account area. The Administration area will allow us to manage the deliveries, and understand some key metrics.<p>Beyond this, we’ll be looking to continually improve the front end and functionality of the system as the load increases and feedback is received. The mission is to make the system the best in field and stay ahead of the market, maximising technologies to achieve the best possible performance that will help support our business growth.<p>Must have ..<p>- Knowledge and experience implementing web-based applications or interactive experiences\n- Experience interfacing with RESTFul APIs using JSON\n- Knowledge of JavaScript frameworks such as React, Angular or Node\n- Familiarity with JavaScript concurrency, browser tooling, and debugging\n- Experience with common font-end development tools such as Webpack, NPM, etc\n- Ability to understand business requirements and translate them into technical requirements\n- Proficiency with HTML and CSS (responsive)\n- Use of source code version control using tools such as Git, Subversion or Mercurial\n- User experience design, testing and QA\n- Knowledge and experience of object orientation and design patterns\n- Help build an automated testing approach to deliver clean, consistent code\n- Experience working in an Agile environment\n- Ability to use the Adobe creative suite\n- Strong organizational and communication skills\n- Experience of architecting front end on greenfield systems","time":1536160207,"type":"comment"}