{"by":"cbanek","id":17911755,"parent":17902901,"text":"The Large Synoptic Survey Telescope | Front End Engineer | Tucson, Arizona | ONSITE<p>LSST invites applications for a Front-End Developer to join the Education and Public Outreach (EPO) Team. The goal of LSST EPO is to provide worldwide access to, and context for, a subset of LSST data through engaging and exciting online experiences so anyone can explore the universe and be part of the discovery process.<p>LSST is a large aperture, wide-field, ground-based telescope that will survey half the sky every few nights in six optical bands. LSST will explore a wide range of astrophysical questions, ranging from discovering near earth asteroids, to examining the nature of dark energy.  The project includes an 8-meter class telescope, the largest digital camera ever built (3.2 gigapixel), a state-of-the-art peta-scale data management system, and a fully-developed online EPO program to bring the excitement of astronomy directly to the public.<p>The LSST EPO program is currently being designed and built by a diverse team residing in Tucson and in Chile.  We are looking for a great Front End Developer to help round out our team and make this dream into reality.  You will contribute by developing interactive visualizations and online tools that are intuitive, satisfying, inspiring, and beautiful for our users. We&#x27;re a small team, so the most important thing is to be able to be flexible and solve problems - even if they aren&#x27;t your problem.  If you know astronomy, great, if you don&#x27;t, great, you&#x27;re our target demographic!<p>The Front-End Developer works on the design and development of browser-based educational activities. As a technical member of a diverse team that includes astronomers, educators, and developers, you will be responsible for collaborating to refine user interface requirements and then iteratively developing and testing prototype mockups in HTML&#x2F;CSS&#x2F;JavaScript. Duties include whiteboarding&#x2F;wireframing ideas, troubleshooting errors&#x2F;performance, documenting code and deliverables, and providing periodic status updates to leadership.<p>For questions about this opportunity, feel free to reach out and contact bemmons@lsst.org!<p>Apply online: <a href=\"https:&#x2F;&#x2F;recruiting2.ultipro.com&#x2F;SPA1004AURA&#x2F;JobBoard&#x2F;3a88e9d0-e68e-418e-9433-d36443ba8c5b&#x2F;Opportunity&#x2F;OpportunityDetail?opportunityId=82ec7171-6f4d-4023-bf1c-20a3ffc3cfd7\" rel=\"nofollow\">https:&#x2F;&#x2F;recruiting2.ultipro.com&#x2F;SPA1004AURA&#x2F;JobBoard&#x2F;3a88e9d...</a>","time":1536087238,"type":"comment"}