{"by":"Runtastic","id":17916269,"parent":17902901,"text":"== Runtastic | Data Software Engineer | Linz, Austria | ONSITE | VISA == \n<a href=\"https:&#x2F;&#x2F;runtastic.jobbase.io&#x2F;job&#x2F;2vip9u1i\" rel=\"nofollow\">https:&#x2F;&#x2F;runtastic.jobbase.io&#x2F;job&#x2F;2vip9u1i</a><p>We believe in supporting people to improve their fitness and overall health. With more than 220 million downloads of our apps and 115 million registered users on Runtastic.com, we face unusual and fascinating challenges everyday.<p>YOUR MISSION<p>As our new Data Software Engineer, you will join our data team in building our central data platform and making use of the treasury of data. Your tasks will include:<p>--Integrating data from various sources into our analytics platform (based on Hadoop, MS SQL Server, and Qlik)<p>--Developing data models and schemas together with our squads<p>--Creating and implementing data science models in collaboration with data scientists, developing data products based on machine learning and running them in production infrastructure<p>--Managing and curating the available data to assure its quality and availability<p>--Operating and continuously improving the data architecture and toolset to fit the evolving requirements of an agile business<p>YOUR PROFILE<p>--Degree in Business Informatics, Computer Science, or a related field (university or higher technical institute)<p>--Advanced programming skills in at least one language (i.e. Python, Java, R, C#, MDX&#x2F;DAX)<p>--Ability to convert complex business systems and requirements into technical concepts and solutions<p>--Preferably, professional experience in using Hive, Spark, Flume, T-SQL, SSIS, SSAS, and SSRS<p>--Passion for new technologies and for creating value from data in a fast-changing environment<p>--Very good English skills<p>Interested? Apply now: <a href=\"https:&#x2F;&#x2F;runtastic.jobbase.io&#x2F;job&#x2F;2vip9u1i\" rel=\"nofollow\">https:&#x2F;&#x2F;runtastic.jobbase.io&#x2F;job&#x2F;2vip9u1i</a><p>And here’s the fine print: The minimum salary is EUR 33,510 gross per year. But that is certainly the very least we can do for you. Your actual offer depends on your skill set and experience.","time":1536138345,"type":"comment"}