{"by":"qth10","id":17922092,"kids":[17922923],"parent":17902901,"text":"Thanx (<a href=\"https:&#x2F;&#x2F;www.thanx.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thanx.com</a>) | SF, DEN, Remote | Fullstack Engineer | ONSITE&#x2F;REMOTE, Full-time | $100K-$170K, top-notch equity | <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;thanx&#x2F;jobs&#x2F;903207\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;thanx&#x2F;jobs&#x2F;903207</a><p>Americans spend more than $5 trillion on restaurants, retail, and services each year. Nearly 90% of those transactions happen in a real-world store. Data is king and online, it powers personalized customer experiences and product recommendations. Offline, however, it’s still 1999. Brands are blind to their customers, causing them to spend more and more money on “megaphone” marketing with the same message to everyone. The result is an ever-increasing wave of generic spam that makes it hard for consumers to build deeper, data-driven relationships with their favorite brands. No wonder brick-and-mortar stores are being left behind.\nThanx is fundamentally changing that. As the CRM for offline merchants, Thanx personalizes every interaction between a merchant and their best customers, resulting in measurable increases in revenue for merchants and far greater personalization for consumers.<p>Think of us as Salesforce meets Google Adwords for offline retail.<p>Thanx is backed by some of the best investors in the world — Sequoia Capital, Icon Ventures, and Andy Rachleff (CEO Wealthfront, cofounder Benchmark Capital), to name a few.<p>Engineering\n\t•\tTeam: early engineers at AWS, Cloudera, Climate, Zenefits, Okta. Experience from successful product companies like Disney, Google, and Facebook. This is an elite engineering team, period.<p>•\tGrowth: 10x YOY data growth; $100M+ delivered to merchants; 200% team growth; modern, rapidly-evolving platform -- adopted Golang, Elasticsearch, NLP, React, React Native, GraphQL, and added 5+ new microservices; all in the last 12 months. And we are just getting started.<p>•\tCulture: data-driven decision-making, risk-taking, no hierarchy, collaboration &amp; shared responsibility, testing and continuous improvement. As a remote-friendly team, we have flexible work hours. We take time off as needed. We work and play hard -- be warned, when it comes to Mario Kart, we are super competitive!","time":1536183115,"type":"comment"}