{"by":"makowskid","id":17949370,"parent":17902901,"text":"Senior PHP back-end programmer &#x2F; ONSITE &#x2F; FULLTIME &#x2F; Tech – Singapore<p>Apply here:\n<a href=\"https:&#x2F;&#x2F;bemyguest.bamboohr.com&#x2F;jobs&#x2F;view.php?id=21\" rel=\"nofollow\">https:&#x2F;&#x2F;bemyguest.bamboohr.com&#x2F;jobs&#x2F;view.php?id=21</a><p>Established in 2012, BeMyGuest is the leading provider of tours, activities, and attractions in Asia. The multi-award winner has been named as the Best Tours &amp; Activities Website at the 2015 and 2016 TravelMole Asia Pacific Web Awards, the Best Business Innovation at the 2016 Singapore Tourism Awards, and the fourth travel company on Fast Company’s list of the World&#x27;s Top 50 Most Innovative Companies in 2016. \nJoining our talented development team you will get to improve your skills whilst working on a fast-growing platform that is helping to power Asia&#x27;s travel industry. We also take training and professional growth seriously, we focus on promoting good software practice and work on a varied technology stack which means you will learn and grow as a developer whilst working here.<p>Responsibilities:\n- Helping to build and maintain complex, fast, and scalable applications\n- Being involved in estimating and delivering development projects to a high standard.\n- Working collaboratively with the rest of the team to plan, coordinate and deliver work throughout a project&#x27;s life-cycle\n- Contributing to the overall design and development of the products we build and support, with a focus on scalability, usability, maintainability, and performance<p>Skills and requirements:\n- Ability to write fast and scalable applications\n- Ability to write quality and well-documented code\n- Expert in PHP7 and relational databases with at least five (5) years of experience\n- Good knowledge of Unit Testing and Test Driven Development\n- Experienced user of source control with Git (Github)\n- Good knowledge of best-practice for web application security.\n- Experience in integrating with third party platforms using different APIs\n- Experience in PHP frameworks (Symfony, Laravel, etc.)\n- Prepared to move to Singapore\n- You need to work Independently and have excellent communication skills\n- Be prepared to show us some code from your recent projects.<p>687474703A2F2F6269742E6C792F326F456A4F764F","time":1536553493,"type":"comment"}