{"by":"ASchubert","id":17954520,"parent":17902901,"text":"Invia Group Germany - fluege.de | (Senior) Android Developer (m&#x2F;f) | Berlin, Germany | ONSITE | RELOCATION and VISA Support<p>The Invia Group is a pan-European market leader in online travel sales and brings together leading travel portals in Europe under one roof. From package holidays to tailored tours, from business trips to family breaks.<p>We are looking for a talented Android Developer (m&#x2F;f) with a curiosity in technological innovations for our mobile development team in Berlin. Our fluege.de Android App has been downloaded more than half a million times. Currently, we are working on a relaunch of the app with the goal to create a more intuitive and exciting experience for our customers with state of the art technologies. This is your chance to develop and build applications for millions of users and impact the future of the online travel industry.<p>Our tech stack: Kotlin, Coroutines, Dagger 2, Retrofit, MVVM with unidirectional data flow, Github&#x2F;Travis Ci.<p>Your tasks:<p><pre><code>   - Develop the fluege.de Android App using cutting-edge technologies\n   - Write clean, SOLID, maintainable code\n   - Push forward our test-driven development process including unit, integration- and functional testing\n   - Collaborate with your coworkers (m&#x2F;f), our Designer-Team and Product-management to develop and ship new features\n   - Share new ideas and make decisions about app architecture and technologies\n</code></pre>\nTo find out more and to apply just follow the link: <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;AndroidinBerlin\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;AndroidinBerlin</a>\nIf you have any questions or just want to say hello you can comment below or contact me directly via Alexander.Schubert@invia.de<p>We are also looking for Front End Developer (m&#x2F;f) and Back End Developer (m&#x2F;f) just have a look at our career-page =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;InviaCareer\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;InviaCareer</a>","time":1536608494,"type":"comment"}