{"by":"aturley","id":7829066,"parent":7829042,"text":"Company: TheLadders (<a href=\"http://www.theladders.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.theladders.com</a>)<p>Location: New York, NY<p>Postion: Full-time on-site software engineer<p>TheLadders&#x27; mission is to match people with the jobs that are right for them. In order to do that we need a strong engineering team.<p>Currently we are looking for a software engineer to join our Platform Engineering Team. This team is responsible for developing and maintaining the software and systems that power our websites, mobile applications, and marketing.<p>A few things about us:<p>* We try to use the right tool for the right job; maybe a shell script, maybe multiple Storm topologies communicating via RabbitMQ and reading data from internal web services. And while we have found some tools that work, we&#x27;re always willing to incorporate new ones if they give us a new way of tackling a problem.<p>* We know that engineering is all about understanding tradeoffs, not applying the same solution over and over again to every problem.<p>* Sometimes we get to work with fun new tools (Scala, Clojure, Storm, Elastic Search), sometimes we work with old standards (Java, Python, Bash). Sometimes we write cool new code, sometimes we are on call dealing with a production issue.<p>* We think pushing code into production is only the beginning of our job. We are responsible for what we put out in the world, including monitoring and maintainence.<p>A few things about you:<p>* You&#x27;re an engineer, but you know how to think like an operations person.<p>* You cut your teeth in open source software, and know how to find documents, read the source, ask for help, and report a bug.<p>* You&#x27;re excited about glamorous work, but you&#x27;re willing to sometimes do shit work, because in the end somebody has do it.<p>If this sounds interesting and you think you&#x27;d be a good match, or if you&#x27;re interested in learning the skills to become a good match, please get in touch with Andrew Turley (aturley@theladders.com).","time":1401629060,"type":"comment"}