{"by":"snowpalmer","id":7829207,"parent":7829042,"text":"SpruceMail - <a href=\"https://sprucemail.com\" rel=\"nofollow\">https:&#x2F;&#x2F;sprucemail.com</a> - Full Time, Washington, DC or REMOTE<p>Looking for someone that not only creates working software but well-crafted software. Someone who will respond to change but also steadily add value to it.<p>Looking to seamlessly integrate with our partner&#x27;s API in order for customers of both platforms to have a dead simple and streamlined experience. This will cover the entire stack from backend api integration and ongoing sync up through the front-end integration&#x27;s.<p>When you aren&#x27;t actively working on one of these integration&#x27;s you&#x27;ll be helping to build the next generation features for our application.<p>&gt;&gt; Technologies &lt;&lt;<p><pre><code>  * Ruby\n  * Rails\n  * CoffeeScript\n  * EmberJS\n  * Redis\n  * Postgres\n  * SCSS\n  * (very possibly soon) RabbitMq\n</code></pre>\n&gt;&gt; Core Values &lt;&lt;<p><pre><code>  * Continuously deliver success\n  * Be extremely happy with your work\n  * Not be bogged down with meetings and other non-tech stuff\n  * Have hardware, software, and freedom necessary to do the above\n  * Refactor frequently\n  * Release often\n  * Explore their own ideas\n  * Choose a work environment and schedule which suits you\n  * First and last: Continuously deliver success!\n</code></pre>\n&gt;&gt; What is SpruceMail? &lt;&lt;<p>We&#x27;re building out the next generation marketing platform that connects together traditional email marketing into the social world. While we get to do the complicated stuff on the backend we try to keep it as simple as possible for the user to use.<p>We&#x27;ve been around for 5 years in the social advertising space and managed more than $250 million in Facebook ad spend. Have managed many of the world&#x27;s leading brands including Samsung, McDonalds, PepsiCo, Target, University of Phoenix, Walmart and Zynga.<p>&gt;&gt; How to apply &lt;&lt;<p>Send me an email: software-engineer AT sprucemail.com. Preferably mention hacker news.","time":1401632432,"type":"comment"}