{"by":"Fergi","id":7829866,"kids":[7829940],"parent":7829042,"text":"PipelineDB (YC W14) is hiring employees #1 - #4<p>We are on a mission to build a new type of database for a modern world in which information is constantly moving, and moving fast. PipelineDB runs SQL queries continuously on large volumes of streaming data, giving companies the capability to easily develop scalable, realtime applications and services using only a familiar SQL interface. No application code is required.<p>This inherently involves solving many big problems, many of which are novel. We’re looking for creative engineers who appreciate the value and freedom of choosing their own projects, approaches, and working with other top talent in a low distraction, streamlined work environment in our new SOMA office.<p>We are well funded by top investors including SV Angel, Susa Ventures, Data Collective, Paul Buchheit, and more.<p>If you’ve been waiting for an opportunity like this, please send your resume and a quick blurb about yourself to jobs@pipelinedb.com. We&#x27;re hiring for two positions:<p>1) Software Engineer<p>Requirements:<p>* Bachelor&#x27;s degree or higher in CS or related field\n* You&#x27;ve worked with large C&#x2F;C++ systems in a Linux environment\n* Strong system-level debugging skills\n* Strong understanding of how performant storage systems work<p>Bonus points:<p>* Experience with&#x2F;contributions to PostgreSQL, Storm, Kafka, Samza, Kinesis, or Esper\n* Experience with database internals\n* Experience building distributed systems\n* Experience building realtime systems<p>Compensation:<p>$90k - $120k + 1% - 4% equity<p>2) Frontend Engineer<p>Requirements:<p>* Strong design sense (please send us a link to your portfolio&#x2F;work if possible)\n* Strong HTML, CSS, and JavaScript skills\n* Ability to implement your vision effectively\n* Experience with a framework such as Django or Rails<p>Bonus points:<p>* Bachelor&#x27;s degree or higher in CS or related field\n* Experience with databases \n* Experience with monitoring&#x2F;operations&#x2F;admin software<p>Compensation:<p>$80k - $110k + 1% - 3% equity","time":1401642628,"type":"comment"}