{"by":"jetsnoc","id":7829269,"kids":[7829363],"parent":7829042,"text":"Idaho (remote or on-site)<p><pre><code>  KickBack Rewards Systems\n  http:&#x2F;&#x2F;www.kickbacksystems.com\n  http:&#x2F;&#x2F;careers.kickbacksystems.com\n</code></pre>\nI&#x27;m a senior manager at KickBack. KickBack Rewards Systems is a privately held company founded in 1999 that specializes in customer specific marketing and payments for over 1000 US clients. We&#x27;re a bootstrapped and profitable start-up. We&#x27;re building a nation-wide coalition loyalty program and already have thousands of clients and thousands of locations on the program. Our clients include a half-dozen Fortune 50 companies - one that is an anchor partner in our coalition loyalty program. As the Director of Software Development I need some help! You will be joining a medium sized team of 13 developers. If you are interested in any of these positions my contact information is under my profile.<p>-<p>Data Scientist\nI am looking for a world-class data scientist to get in to the minds of our customers. Your job will be to analyze our &quot;large&quot; data-sets, identify patterns, determine consumer sentiment and provide them with incredible offer. Looking for someone with extensive programming and modeling experience using the Hadoop ecosystem. At KickBack you will research and implement new scalable learning algorithms and data mining techniques including sequential data models, variable discretization, feature extraction, selection, and construction. Machine learning a plus. We&#x27;re looking for an expert someone we would consider a &quot;game changer&quot; and are paying accordingly.<p>-<p>UX Designer\nI am looking for someone who can create beautiful user interfaces that are simple, elegant and flow well. You will be designing web and mobile interfaces and assisting developers in understanding whether the customer should swipe left, right or possibly not at all.<p>-<p>Project Manager\nI need a strong PM&#x2F;Business Analyst to assist us in managing all of this. We&#x27;re a loose agile shop and have a few projects kicking off that I need you to scope out..<p>-<p>Back-end Developer\nI am looking for a pro that can create scalable back-ends. Message queues, concurrency and fault tolerance should be second-nature to you.<p>-<p>Front-end Developer\nI am looking for an expert in AngularJS whom can pair with our aforementioned world-class back-end developer. Heck, if you aren&#x27;t an angular pro, anyone with amazing front-end skills will do, you can pick-up our framework or suggest a better one as you work in to the role. UX skills a plus. Like any start-up, we&#x27;re big on usability.<p>-<p>Mobile Developer\nI am looking for two mobile developers. We have a specific vision for our mobile platform and have already moved past html5 interfaces to native applications to improve performance.<p>-<p>SecOps\nDo you breathe ciphers, best practices and feel strongly about data privacy? We need a good security operations engineer to help us maintain industry compliances. Your job will be to ensure overall server, network and systems security.<p>-<p>DevOps\n(Multiple positions) We&#x27;re looking for a Hadoop cluster administrator and an overall DevOps engineer proficient in Chef, Celery, Message Queues, Networking, BGP AnyCast, etc. We&#x27;ll always train the right candidate so junior developers and candidates fresh out of a university are welcome to apply. Thanks!","time":1401633403,"type":"comment"}