{"by":"dmgrow","id":7829370,"parent":7829042,"text":"Salt Lake City, UT -- Lucid Software (<a href=\"http://www.golucid.co\" rel=\"nofollow\">http:&#x2F;&#x2F;www.golucid.co</a>)<p>Lucid Software is building world class graphical applications in the browser and on mobile devices. Our first product, Lucidchart (<a href=\"http://www.lucidchart.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.lucidchart.com</a>), is an online diagramming application with 1M+ users. We recently launched our second product, Lucidpress (<a href=\"http://www.lucidpress.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.lucidpress.com</a>), which is an online layout and design application. Lucid is a startup founded by Karl Sun, a former Google exec, and Ben Dilts, our CTO. We&#x27;ve been profitable for 2+ years and recently closed our Series A.  We are growing rapidly in every dimension of the business and need people to join our team. For fun we raft river rapids on company retreats, have Friday BBQs, and eat lots of pizza. Talent and ability to learn are more important than specific skills.<p>BACKEND SOFTWARE ENGINEER (all experience levels) - Lucidchart and Lucidpress run with various decoupled services in a Linux environment using Scala, MongoDB, AWS, and MySQL. At Lucid your responsibilities would include enhancing existing services, building new services, integrating with 3rd party applications and ensuring services are highly available, secure, and scalable.\n   Requirements: - Talent - BS degree<p><pre><code>   Recommended experience: - Building large products &#x2F; applications - Scala or Java - MySQL or other relational database - NoSQL   \n   databases - Cloud computing (AWS)\n</code></pre>\nFRONTEND SOFTWARE ENGINEER (all experience levels) - Lucidchart and Lucidpress are powered by one of the largest Javascript codebases on the Internet (about 250k lines of JS), optimized so that the user experience is indistinguishable from an installed native application. Come help us show the tech world what can be done on the web.\n   Requirements: - Talent - BS degree<p><pre><code>   Recommended experience: - Building large products &#x2F; applications - Javascript - Google Closure compiler&#x2F;library - CSS&#x2F;HTML&#x2F;DOM \n   manipulation - jQuery \n</code></pre>\nIOS ENGINEER (all experience levels) - We are looking for a talented iOS developer to play a key role in the design and development of Lucid Software&#x27;s iOS applications. This is an opportunity to make a big impact and see your work used by millions of customers. The ideal candidate will have a passion for building best-in-class iOS applications.\n   Requirements: - Talent - BS degree<p><pre><code>   Recommended experience: - Experience designing, architecting, and releasing iOS applications - Deep understanding of Objective-C and the internals of iOS frameworks - Extensive knowledge of iOS common software design patterns, including the ones needed to develop high-performing UI\n</code></pre>\nAll applicants email resumes (and links to recent projects) to jobs@lucidchart.com.","time":1401634950,"type":"comment"}