{"by":"phillytom","id":7830564,"kids":[7830976],"parent":7829042,"text":"Monetate - Conshohocken PA, London UK, Palo Alto CA, or Remote<p>Monetate sells a software product that helps digital marketers make their content more relevant. We help our clients to put the right experience in front of their users.<p>What we&#x27;re looking for:<p>* Problem solvers who like to code - we take things apart, figure out how they work, then build software to solve our users&#x27; problems<p>* People who like hard challenges - we have great problems across our products - data, UX, 3rd party Javascript, high volume &#x2F; low latency APIs - we have no shortage of fun problems to work on<p>* People who like to ship - we&#x27;re focused on building and shipping great products - if you like to see your work in production quickly you&#x27;ll see it here<p>We&#x27;ve hired a number of great people from HN in the past. We&#x27;re looking for people not positions.  We work primarily in Python &amp; JS, but have people who have joined the team with no background in our primary languages and people from non-traditional backgrounds.<p>Feel free to email me with any questions - tom at monetate com<p>We&#x27;re hiring engineers in general, but this month I&#x27;ll highlight a DevOps Engineer role.<p>Why we need you:<p>* to help us ship software more quickly and reliably<p>* to design and implement tools for reliable, zero-downtime, push-button releases<p>* to measure, control, and improve our build, test, deployment, and release processes<p>What we&#x27;re looking for:<p>* a highly collaborative technical leader<p>* the ability and willingness to work on many different parts of our systems (Infrastructure, Operating System, Database, Application, Network)<p>* a strong understanding of fundamental Internet technology<p>* a strong understanding of operating systems, networking, and software engineering basics<p>* two years or more writing Internet applications in languages such as python, ruby, node.js, or PHP<p>* five years running Linux&#x2F;Unix services in production<p>* experience using AWS or other virtualized infrastructure<p>* experience using automation tools such as Ansible, Chef, or Puppet in production<p>Bonus Points for:<p>* experience using AWS services at scale<p>* experience running high-volume Internet services<p>* contributions to Open-Source Software","time":1401655268,"type":"comment"}