{"by":"blucz","id":7830110,"parent":7829042,"text":"Meridian Audio - New York, NY - Full Time - <a href=\"https://www.meridian-audio.com/en/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.meridian-audio.com&#x2F;en&#x2F;</a><p>Job Description<p>We&#x27;re looking for a motivated and independent software developer who&#x27;s passionate about building software for music lovers. This is an opportunity to join us in developing an application that reaches over 20 million users annually.<p>In this role, you will eventually be responsible for the end-to-end development of a Windows Store Application built using the C#&#x2F;Xaml&#x2F;WinRT stack. You will be working closely with UI&#x2F;UX and graphic designers to bring a highly bespoke user experience to life.<p>At Meridian, we have a strong developer-driven project management culture and a track record of on-time delivery without trashing our weekends. We constantly iterate on the development process to keep things running smoothly.<p>While you will be working out of our New York office, our culture is extremely casual, and our office hours and work-from-home policies are flexible.<p>Skills &amp; Requirements<p>Requirements:\n- Experience with Windows 8&#x2F;8.1 App development using C#&#x2F;Xaml and Visual Studio\n- Strong fluency in C#, Xaml, and WPF\n- Experience communicating with services built using JSON, HTTP, REST, OAuth, etc\n- Experience working closely with graphic designers to build applications<p>Preferred Skills:\n- Experience with Android or iOS development\n- UI Design experience\n- Photoshop familiarity<p>About Meridian Audio<p>In 2000, unsatisfied with the music products that existed in the world, a few rabid music fans got together to create something better. We built Sooloos because we wanted its features for ourselves: the ability to browse huge music libraries and stream audio to multiple rooms. We built touchscreen kiosks and put them in our friends&#x27; houses and in our favorite bars. We kept our day jobs, but in our own time we relentlessly pursued the world&#x27;s coolest music listening experience.<p>After a few years, we were surprised that other products in the space were still unable to meet our needs, so we turned our hobby into a company and shipped our first product in 2006. We built our own hardware using studio-grade audio components and packaged Sooloos as a high-end music server for the audiophile market, which received us with open arms.<p>In late 2008 we were acquired by Meridian Audio, which had a culture of innovation in audio hardware and DSP that matched our own in UX and streaming. In addition to manufacturing the gold standard of high-performance multi-zone music solutions, we also develop software music products for Jaguar Land Rover, Hewlett Packard, and a variety of audio OEMs.<p>Five years post acquisition, everyone on our original development team is still with us. Our reference product serves a community of 10,000 specialty users, and we have 10 million activations and 1.5 million monthly actives for HP Connected Music, the product we bundle on nearly 20 million PCs annually. We work with the biggest services in the business including Last.fm, AllMusic Guide, Rhapsody, Deezer, TuneIn, iHeart Radio, Spotify, 7digital, Songkick, Musicbrainz, LyricFind, and Qobuz.<p>Our team is headquartered in Meridian&#x27;s New York office in Soho (home to the most amazing digital theater ever) but we routinely work remotely, sometimes on four continents at once. Our flat structure relies on the initiative and accountability of everyone on the team; we all own projects (and in some cases product) and our output speaks for itself.<p>Please contact hiring@sooloos.com if you&#x27;re interested","time":1401646980,"type":"comment"}