{"by":"thisduck","id":7830031,"kids":[7830093,7830417],"parent":7829042,"text":"Financeit - Toronto, Ontario, <a href=\"http://www.financeit.ca\" rel=\"nofollow\">http:&#x2F;&#x2F;www.financeit.ca</a> (soon to be financeit.io)<p>Financeit connects merchants with lenders allowing the merchants to offer financing options to their customers. Since 2011, we&#x27;ve processed over 700MM in loan applications. We recently raised a big series A to bring our product to the US. [1]<p>We&#x27;re looking for a Senior QA to:<p>* Work with developers and dedicated QA engineers to automate as much of the QA process as possible<p>* Work with a tech team where testing and QA are already deeply embedded in their DNA<p>* Roll up your sleeves and manually test the last mile when new features are rolled out<p>* Work with a team that already understands the importance of testing - all code must have rspec and cucumber tests written before getting shipped<p>* Help the developers understand what needs to be tested by involving yourself in the requirements gathering process early on<p>* Make an impact as we build a 21st century loan management system<p>Amongst your skills:<p>* Years of QA experience testing web, mobile and API products<p>* You love setting up frameworks and love giving input on how to re-organize roles and responsibilities to improve QA<p>* You&#x27;re motivated to automate as much of QA as possible - and love researching new ways to do so<p>* Nothing gets by you – you understand a complicated product deeply and think of all the edge cases<p>* Proactive – you love giving feedback and strive to build a better product<p>* Very good at what you do<p>* Not afraid to think<p>We have:<p>* Sane working hours<p>* Great compensation<p>* Opportunity to work at a startup seeing huge growth and lots of success<p>Email us, mention hackernews: devjobs@financeit.ca<p>[1] <a href=\"http://techcrunch.com/2013/11/19/financeit-raises-13-million-to-bring-simple-purchase-financing-options-to-small-and-medium-businesses/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2013&#x2F;11&#x2F;19&#x2F;financeit-raises-13-million...</a>","time":1401645481,"type":"comment"}