{"by":"nowarninglabel","id":7831844,"parent":7829042,"text":"Kiva: San Francisco, CA<p><a href=\"https://kiva-openhire.silkroad.com/epostings/index.cfm?fuseaction=app.jobInfo&amp;version=1&amp;jobid=140\" rel=\"nofollow\">https:&#x2F;&#x2F;kiva-openhire.silkroad.com&#x2F;epostings&#x2F;index.cfm?fusea...</a><p>Who We Are: Called the &quot;hottest non-profit on the planet&quot; by FORTUNE magazine and a Top 50 Website by TIME, Kiva (www.kiva.org) is the world&#x27;s first personal micro-lending marketplace with a mission to connect people through lending to alleviate poverty. In just 8 years, Kiva has raised over $500 million for more than 1 million borrowers in 73 countries. Kiva combines the culture and approach of an internet start-up with an intense focus on alleviating poverty and serving the borrower-to-lender connection. Kiva is poised to take its initial success to a whole new level - targeting $1 billion in loans by 2017 and continued expansion into new areas (e.g. student loans, water, mobile, etc.). Headquartered in San Francisco, Kiva&#x27;s team has 100+ employees and 500+ volunteers worldwide.<p>The job:<p>Kiva Technical Operations is part of Kiva&#x27;s Engineering team and is dedicated to ensuring that Kiva&#x27;s software and hardware infrastructure is kept up to date, up to speed, and up and running so that Kiva volunteers, partners, and lenders all enjoy the best possible experience using our sites, and so that Kiva staff is efficiently and effectively using the technology that keeps the organization functioning at the best possible level.<p>The Systems Engineer will help keep Kiva’s infrastructure secure, reliable, performant, compliant and elegant.  We are looking for a rockstar software and systems professional who’s well-versed in security best practices, attentive to detail, has great communication skills, and is passionate about Kiva’s mission.  This position will report directly to the Director of Technical Operations.  This is a high-impact role that requires a superstar.  Only highly talented, experienced and motivated applicants need apply!","time":1401682384,"type":"comment"}