{"by":"jttam","id":7831871,"parent":7829042,"text":"Senior Devtools Engineer - Boston\nEngineering | Boston, MA, United States<p>Fiksu is the leading provider of mobile app marketing products that help app and game marketers reach their user acquisition goals. The company’s patent-pending Programmatic Mobile Demand Platform applies intelligent technology to proprietary big data to master ALL the challenges of mobile advertising - including tracking, optimization, media buying and integration.  Additionally, Fiksu offers FreeMyApps®, the world’s largest app discovery platform where users are rewarded.<p>Fiksu is a 200+ person company headquartered in Boston with offices in Northampton, MA, San Francisco, London, Helsinki, Singapore, Seoul and Tokyo.  Voted Boston&#x27;s Best Places to Work in 2013, Fiksu offers competitive salary, equity and benefits.  By joining Fiksu you would not only directly impact the success of our business but also help to shape the mobile landscape of the future.<p>Are you a developer who doesn’t feel comfortable with their responsibility ending at the code? Are you a systems administrator who prefers coding their way out of a problem?<p>Job Specifications<p>Spend 30% of your time developing automation and tools to support 50+ developers and thousands of nodes processing billions of transactions a day.<p>Spend 30% of your time digging deeply into the infrastructure and remediating problems around availability, reliability, scalability, and efficiency.<p>Spend 30% of your time growing the platform through researching and implementing the best services and tools.<p>Job Qualifications<p>Either experience in Linux systems administration with a desire to increase your knowledge of development or experience as a developer with a desire to learn the best practices of systems automation.<p>Knowledge of the modern stack including the utilization of external caching, load balancers, internal caching, queuing, webservers, SQL and&#x2F;or NoSQL databases, and cloud services.<p>Familiar  with an automation framework such as Chef, Puppet, Ansible, or otherwise.<p>Worked with AWS and their APIs or equivalent (such as OpenStack or CloudStack.)<p>Experience with Ruby and&#x2F;or Java (but other languages work, too.)<p>A desire to teach developers about new tools, technologies, and methods for improving their throughput.<p>Job Benefits:<p>Fiksu engineering embodies the cultural movement known as devops. Developers release their own code, manage their own monitoring and alerting, and are the first line of support to triage their software.<p>Intelligence and dedication are valued at every level in Fiksu, and this fosters a community of curious learners willing to share their knowledge and collaborate on solutions.<p>Join the startup that BBJ voted #1 Best Place to Work!","time":1401682977,"type":"comment"}