{"by":"twentyjp","id":7833423,"kids":[7835794],"parent":7829042,"text":"Twenty Digital - New York, NY<p>We are a recruitment firm, focused solely in NYC&#x27;s startup, digital &amp; tech space. We strategically support businesses at various stages of development, from inception through late series funding, to pre &amp; post-IPO.<p>As many organizations in this space are competing for the best engineering talent, we help to accurately represent both company and opportunity to the potential candidate. We are flexible to our client&#x27;s needs, taking on as much of the process as requested, including pre-screening and meeting each candidate before presentation.<p>Some of our current positions include:<p>-CTO (LAMP Stack) – Fast Growing, Tech-Focused Fitness Company<p>-Director, Engineering (LAMP Stack) – Fast Growing, Tech-Focused Fitness Company<p>-Full Stack Engineer (LAMP Stack) – Fast Growing, Tech-Focused Fitness Company<p>-Senior Python Developer (Python Expert) - Post Series A Funded Startup with a Unique Networking Platform<p>-Front-End Engineer (Heavy Javascript) - Post Series A Funded Startup with a Unique Networking Platform<p>-Tech Lead&#x2F;Senior Engineer (Java &amp; PHP) - Disruptive E-Commerce Business, Post Series B Funded<p>-Lead Front End Engineer (Heavy Javascript) - Series A Funded B2C Startup<p>-Development Manager (Strong Python) - Series B Funded SaaS Startup<p>-Front End Tech Lead (Raw Javascript) - Series B Funded SaaS Startup<p>-Senior Software Engineer (Deep Python) – Series A Funded B2B Platform Startup<p>-Engineering Manager (Java, Struts &amp; Project Mgmt) - SaaS product in the Entertainment space<p>-Back End Engineer (Scala) - Mobile Web Platform, Seed Funded<p>-Senior Front End Engineer (Javascript) - Mobile Web Platform, Seed Funded<p>-DevOps Engineer (Chef or Puppet) – Startup Cloud Provider<p>-Systems Engineer (Perl, Python, Ruby) – Startup Cloud Provider<p>-Lead Ruby Engineer (Ruby) – Startup Crowdfunding Platform<p>-DevOps Engineer (Chef or Puppet) – Startup E-Commerce<p>-QA Lead (Manual &amp; Automation) – Startup E-Commerce<p>-Lead Front End Engineer (HTML5, CSS3, JS) – Startup E-Commerce<p>-Back End Lead Engineer (Python) – Startup E-Commerce<p>-Lead Engineer (Python) – Startup Digital Agency<p>Please get in touch to understand how we can be a resource to you, as well as to learn further details on these opportunities. We offer a seamless recruitment experience, unlike any other in the startup space. We will provide full company and role description, verbally. In addition, we have met all of our clients, so truly understand the environment and culture.<p>email: jonathan.peters@twentyrecruitment.com","time":1401717142,"type":"comment"}