{"by":"akarrer","id":7834955,"parent":7829042,"text":"El Segundo, CA - FULL-TIME, IN-HOUSE<p>Web&#x2F;Software Application Developer Needed for Great Startup in El Segundo<p>Aggregage is revolutionizing the world of B2B Media.  We will be launching 1,000 business vertical sites over the next five years.  We are well funded for the next several years, but our model works with a small team doing big things.<p>We are looking for a full-stack Java web developer.  We are a small company and are looking for a solid programmer who can grow with the company.  Someone who is a team player.  And even if you don’t have experience with everything listed in this job description, we offer excellent learning opportunities for those who are eager to expand their skill sets.<p>Job Responsibilities<p>Working in a small development team, you will take a central role in the technical design, and development of the front-end and back-end of the application that’s written in Java, MySQL, Lucene, JavaScript, HTML&#x2F;CSS.  This application deals with fairly large scale of content and users, so understanding of robust, high-performance sites is a plus.<p>Job Qualifications<p>In addition to programming capability, candidates must have experience working on collaborative development teams and good communication skills.<p>Ideal candidates will have experience building all facets of software systems including the data model, business logic, and front-end.<p>Knowledge of the following is required:<p>Java\nHTML&#x2F;JavaScript&#x2F;CSS\nJava Frameworks such as Spring, Dropwizard, or Wicket<p>Knowledge of the following is a plus:<p>Lucene or SOLR\njQuery\nORM (Hibernate, etc.)\nMySQL and SQL query tuning\nAnt&#x2F;Maven&#x2F;Git\nApache\nLinux<p>That said, we’re mostly looking for great developers who are great to work with. If you don’t have experience with everything listed above but are still a solid developer eager to learn new things, you might be a great fit here.<p>Visit: <a href=\"http://www.aggregage.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.aggregage.com&#x2F;jobs</a>","time":1401733475,"type":"comment"}