{"by":"maramartin","id":7835070,"parent":7829042,"text":"San Francisco - Full Time - International Candidates Welcome!<p>Scribd is now a top 10 app in the eBooks category, and we&#x27;ve grown our installs by a factor of 10 over the last 6 months. We also recently brought our app to the Kindle Fire, and we&#x27;re so far from done, it&#x27;s not even funny.<p>But we&#x27;ve done all this with an Android team of just 3 people. To take the app to the next level, we&#x27;re looking for an Android Developer to join our team and help us build the Netflix for eBooks!<p>Our goal is to invent the world&#x27;s best reading experience for mobile devices. To do that, we need to make an amazing reader for all kinds of written content, get offline &amp; syncing exactly right, and build a content discovery experience that always finds you something you actually want to read. We&#x27;re also working on analyzing data so we can enhance our recommendations to our readers.<p>As an Android Engineer at Scribd, you&#x27;ll have the opportunity to learn from our small but excellent (if we do say so ourselves!) team and solve real challenges for an app that is more than just the hottest game - we truly believe that we&#x27;re building a meaningful product, and that we can get people to read more by making reading easier and more beautiful on mobile devices.<p>Our Ideal Candidate Has:\n* A CS degree or an equivalent background in software engineering prior to moving to mobile.\n* At least one year of Android development experience.\n* Solid understanding of Android technologies and development.<p>Bonus Points For:\n* An impressive Android project - in the play store, open source, or something you can share with us. \n* Great design &amp; product sense.\n* Experience in areas besides Android - iOS, web development, etc.\n* Experience building book, magazine, PDF or news reading applications.<p>What We Offer:\n* Competitive base salary\n* Full benefits (medical, dental, vision)\n* Create your own workstation with any type of equipment\n* Free catered meals from local restaurants, three times a day\n* Frequent company activities ranging from weekly happy hours to group indoor skydiving\n* Generous equity to give you true skin in the game\n* Flat organizational structure that ensures your influence on products we build\n* Imagine mixing go-karts and quadricopters with free food and company ski trips!<p>Please Note:\n* International candidates willing to relocate are welcome to apply!<p>Apply via link: <a href=\"http://www.thesourcery.com/jobs/716/applications/new\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;716&#x2F;applications&#x2F;new</a>","time":1401734815,"type":"comment"}