{"by":"maramartin","id":7836603,"parent":7829042,"text":"REDWOOD CITY, CA - FULL TIME - ON SITE - PRODUCT MANAGER @ COURSE HERO<p>APPLY VIA LINK: <a href=\"http://www.thesourcery.com/jobs/743\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;743</a><p>We’re looking for a Product Manager who will help define and build the product roadmap and define the customer experience as we move to internationalize our core study guides, flashcards and tutoring platform.<p>You’ll own this product and work closely with a dedicated engineering and design team, you’ll collaborate with our other Product team members, and you’ll share product roadmap, expectation and results with our Executive team and board.<p>Here are some of the projects you’ll own: \n•\tYou’ll understand Course Hero’s strategic and competitive position and deliver products that are recognized as best in the industry \n•\tYou’ll own the product roadmap for one of Course Hero’s core growth initiatives. \n•\tYou’ll conduct market research, perform competitive analyses, and identify current trends in the e-commerce and education technology space. \n•\tYou’ll use data-driven approaches to help guide your decisions and continuously improve your product. \n•\tYou’ll work closely with engineering teams and user interface designers to deliver product experiences that delight our customers. \n•\tYou’ll define and regularly monitor KPIs, success metrics and other analytics to determine product health. \n•\tYou’ll support our customer facing and marketing teams to ensure product features are well communicated and promoted to our customers.<p>Here are a few things we’d love to see in a strong candidate: \n* 3+ years of professional experience in a Product Manager role in a consumer facing software company, with extra bonus points for educational technology or e-commerce experience. \n* A BA or BS degree, or relevant skills and equivalent work experience. MBA a plus! \n* You can demonstrate success in delivering products and services in a high growth environment, and you have a track record of successful international product expansion in both strategy and execution. \n* You can demonstrate effective, clear communication to lead a team and drive product as a major influencer across the company.<p>Nice-To-Have&#x27;s Include: \n* Some experience with Asana or other project management software. \n* You’re driven by data to make decisions, and you’re familiar with scripting in SQL and generating reports with Tableau or similar tools.<p>What we can offer you: \n* Industry competitive salary and stock options. \n* Full medical coverage (medical, dental, vision). \n* 401(k) program to help you save for the future \n* Regularly planned team events and outings. \n* Free Friday lunches and an endless snack and drink supply \n* On-site amenities including a day spa, full-service cafeteria, 3 miles of nature walks along the Bay and free membership to a 7500 sq. ft. fitness center.","time":1401744950,"type":"comment"}