{"by":"maramartin","id":7836819,"parent":7829042,"text":"SAN FRANCISCO - FULL TIME - ON SITE - ANDROID ENGINEER @ WEARABLE INTELLIGENCE<p>APPLY VIA LINK: <a href=\"http://www.thesourcery.com/jobs/756\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;756</a><p>We’re looking for a capable, curious and smart Android Engineer to join our team. You’re a tinkerer and an aesthete, and you like to write code that gives mobile and wearable devices magic abilities. You have a passion for building great products that are robust and enjoyable, and you’re interested in stretching the boundaries of what’s possible on wearable hardware.<p>As one of our early team members, you’ll work directly with our leadership team to develop software for wearable devices -- from our product suite to core framework components -- and help us ensure optimal performance for our clients. We’re growing, and we’d be thrilled for you to grow your career with us, be it into a senior engineer, team lead, or architect.<p>Here are some of the product challenges you’ll own: \n* You’ll build end-user applications and core platform services for various devices running the Android stack, and you’ll be one of the rare few developers to hack on Google Glass for the enterprise \n* You’ll work with designers, product managers, and other engineers to imagine, build, and launch successful products and features that will have immediate impact to some of the world’s leading companies \n* You’ll balance rapid prototyping with production-grade code, and as an early employee, you’ll refine best practices and lead by example<p>Here are some things we’d be thrilled to see in a strong candidate: \n* You have a BS or Masters Degree in Computer Science, Computer Engineering, or Electrical Engineering \n* You have at least 1 year of professional software engineering experience where you’ve built and shipped a product as part of a team \n* Experience with Java, C++, and developing and maintaining Android applications \n* You build with the end user in mind, and you’re comfortable with self-directed learning on the job<p>Bonus points for: \n* You have experience developing on, or building apps for, devices using Android, from smartphones to other mobile-enabled products, with major bonus points if you’ve worked in wearables \n* Experience working with the Android SDK and some familiarity with NDK \n* You have some experience, or a working knowledge of, developing for video calls and streaming, and want to work more with OpenGL ES. \n* You have a curiosity to work on core systems for mobile devices (networking, multi-threading, Bluetooth&#x2F;WiFi, periphery devices)<p>Here’s what we can offer you: \n* Competitive salary, benefits and early-stage equity \n* Sunny San Francisco office close to CalTrain, Muni and BART \n* A team with a strong track record of building successful companies and innovative products. We teach each other and learn new frontiers together \n* $5K to get the setup you deserve \n* Opportunities to get your product in front of category leaders \n* Time to attend industry conferences and grow in your field","time":1401747070,"type":"comment"}