{"by":"caulagi","id":7838657,"parent":7829042,"text":"<a href=\"https://wwstay.com/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;wwstay.com&#x2F;careers</a> - Bangalore, India. Fulltime, no remote, relocation within India<p>We are building a new travel platform ground up. Our primary programming languages are Python and JavaScript. We use Django and Nodejs extensively. We are beginning to dabble with Clojure. Some of the terms you will hear us use everyday and which are very close to us are TDD, continuous deployment, functional programming, peer review, etc. We are looking to add the first few team members to our team. They will be extremely passionate and highly motivated individuals who want to make a difference. The job will expose you to all aspects of web development, from setting up a server and looking at the logs to writing JavaScript and then some tests for that JavaScript as well. You will get a chance to work with highly skilled peers and influence the technology choices.  We also have a presentation for developers here - <a href=\"https://speakerdeck.com/pcaulagi/wwstay-for-developers\" rel=\"nofollow\">https:&#x2F;&#x2F;speakerdeck.com&#x2F;pcaulagi&#x2F;wwstay-for-developers</a>.<p>We are looking for developers with prior experience (3-7) years, but we will consider exceptional fresh graduates too.  In addition, you should have -<p>* An active github&#x2F;bitbucket account.  If you haven&#x27;t got one, consider creating a simple web app where people can submit recipes and view what others have posted.<p>* Experience working in an Unix environment for more than 2 years.<p>You get -<p>* Above industry standards salary! We are funded and profitable.<p>* A shiny new laptop with root access (you install whatever Unix you want).<p>* To work with technologies that were relegated to your hack sessions at home&#x2F;night.<p>To apply, please send your resumes to careers.hn@wwstay.com.  Be sure to include your github&#x2F;open source contributions.  We tend to ignore vanilla resumes without mentioning projects&#x2F;code contributions.","time":1401782931,"type":"comment"}