{"by":"bestan","id":7839180,"parent":7829042,"text":"Flash developer, London.<p>Want to work for a startup in London? A leading discovery platform are looking for someone to help in the development of a unique product discovery platform that will change the way kids engage in the space both on the web &amp; on mobile.<p>Benefits:<p>- Their team has a serious track record. They have built companies like DemonWare, Jolt Online, Swapit and played key roles in others.<p>- They work with every major kids’ brands in the world such as Disney, Hasbro, LEGO and hundreds of others.<p>- They are the number one in the UK and have just launched in the US. Each month they reach over 30M uniques across web, mobile, online video and physical discovery channels.<p>- They operate in a tough space which has lot of interesting problems to solve. They have got traction, revenue and a lot of clients. Oh and did they mention a community of over 30M kids and teens?<p>- Join now and you get a real opportunity to shape the company’s growth. For real.<p>Your profile:<p>- Extensive knowledge of Flash and ActionScript3<p>- Experience with building multiplayer games and virtual worlds is a plus<p>- Experience in HTML(5), CSS(3) and JavaScript is a plus<p>- Eye for detail<p>- Able to go from specification to final product, with minimal intervention<p>Your responsibilities:<p>- Take ownership of the Flash development of BinWeevils, one of the largest children’s virtual worlds in the UK<p>- Tweak and improve the existing in-game experience<p>- Deliver high quality solutions for major kids&#x27; brands<p>- Develop other SuperAwesome Flash properties<p>They are the leading discovery platform for 8-14 kids in the UK. Founded by a track-record team responsible for some of the top games and technology startups in Europe (DemonWare, Swapit, Jolt Online, Fight My Monster), the company’s clients include some of the biggest names in entertainment. The company is based in London and Dublin.<p>Feel free to drop me an email to stan@superawesome.tv","time":1401791390,"type":"comment"}