{"by":"nethergoat","id":2162047,"kids":[2162544],"parent":2161360,"text":"EA2D - Redwood Shores, CA (SF Bay Area)<p><a href=\"http://www.ea2d.com\" rel=\"nofollow\">http://www.ea2d.com</a><p>We're a small, autonomous studio within EA building social games for gamers.  Our first monetized title, Dragon Age Legends, is about to enter closed beta and has been generating a lot of buzz (<a href=\"http://pc.ign.com/articles/114/1146553p1.html\" rel=\"nofollow\">http://pc.ign.com/articles/114/1146553p1.html</a>).<p>Our Platform team is looking for mid to (very) senior engineers. You would be responsible for building the platform on which all EA2D games will run, from the pages that serve the HTML to the suite of game servers supporting them.  Analytics, social network integration, shared services (REST), scaling, real-time stateful and stateless game servers -- this would all be your domain.<p>Our stack is primarily Java with MongoDB on the backend, but we're becoming increasingly polyglot (Python, Ruby) in the middle tier.  We're hosted on EC2 (w/auto-scaling and on-demand environments) and practice continuous deployment.  A sampling of the tech we use: Chef, git (GitHub), Hudson (now Jenkins?), ant, ivy, SQS, S3, EMR, Loggly, PagerDuty, Mixpanel, Kontagent, NginX, Tomcat, Hive, and Google App Engine.  We contribute code back to the open source projects we use, and we've even started open sourcing our own (<a href=\"https://github.com/EA2D\" rel=\"nofollow\">https://github.com/EA2D</a>).<p>The Platform team is small and young -we're still building out the initial implementations of many services- so you would have a tremendous impact on our architecture and direction.<p>We're a tight-knit team with lots of whiteboards, so you'd need to be on-site.  On the plus side, EA's campus is fantastic - we have a stellar gym, cafeteria, theater, shuttle service to Caltrain, soccer field, volleyball and basketball courts, tournament-quality foosball tables, and much more.<p>Drop me a line if you're interested, mikeb@ea2d.com<p>We've already hired two people from previous HN \"Who's Hiring?\" threads, so you'd be in good company!","time":1296491483,"type":"comment"}