{"by":"jqhacker","id":2165400,"parent":2161360,"text":"WOTI (Washington, DC; on site)<p>Ours is a small team of 3 in a company of about 150, on a small but involved ground-up project that's just starting to take on beta users.  It's a web app that pulls together data from many sources and presents an easy-to-navigate graphical summary.  We use mostly Python (2.7) in a Unix environment.  On the back end, we munge a few TB of data using Python, Hadoop and Pig, and some in-house distributed Unix tools.  The processed data goes into Solr/Lucene, is served up by CherryPy and Genshi, and presented by jQuery in IE7, IE8, Firefox 3.5+ and some COTS viz software.  A lot of the job is extracting the juicy bits from various data sources -- e.g., personnel databases and news articles -- then normalizing, aggregating, and indexing it.  The challenge is that it's way too much data for a single system, so we need to parallelize the process on dozens of systems.  We also need to think about how the data is organized to keep search and retrieval fast.  And of course you want an intuitive, powerful front end for all that functionality.<p>A bit about the work environment: we heart open source.  We have nice dual-monitor workstations running RHEL 5 with root; you're free to set up your dev environment how you like (as long as it's secure).  You can be as back-end or front-end as you like, or mix it up.  We all try to do a bit of everything. We have proper sysadmins to help, but end up doing a lot of the server and network configuration ourselves; that way we get it right, plus we kinda like it.  We take security seriously.  Mercurial for version control; Jira for project management; just starting with Scrum for process.  You get a real office with a real window, shared with one person.  The job is a government contract, but in a fairly agile R&#38;D environment (though a startup it ain't).<p>Eight-hour days with a half hour for lunch, whatever hours work for you as long as you're in between 10-3.  Overtime is very rare; no comp time.  There's a basic but serviceable gym and a good walking loop.  It's South of the beltway on the Maryland side, a short commute with no traffic from Alexandria, Arlington, Suitland, or Southeast D.C.  Unfortunately there is no public transportation that comes this way.  Occasional local travel.  Pay is about average for the area.  Benefits and vacation are pretty good.  There are opportunities to move to other projects within the company if you get bored with this one.  And if this particular job ain't your cuppa but you like what you hear generally, drop us a resume anyway; we have several locations in the metro area and are always looking for good people.<p><a href=\"http://woti.com/jobs.cfm\" rel=\"nofollow\">http://woti.com/jobs.cfm</a> (The \"Scripting Genius\" posting)","time":1296566944,"type":"comment"}