{"by":"bloopernova","id":18807580,"parent":18807017,"text":"Ann Arbor, MI and Columbus, OH | ONSITE<p>To apply, please use either my email address, aclark@nexient.com OR <a href=\"https:&#x2F;&#x2F;www.nexient.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nexient.com&#x2F;careers</a><p>----- My take -----<p>Nexient are good people: My experience at Nexient has been overwhelmingly positive, they are flexible, caring and fun to work at. They actually care about the life&#x2F;work balance too. Multiple tabletop, D&amp;D, console gaming nights are organized all the time. Charity drives and other ways to give are also promoted within the company. The work environment is really nice too, with motorized standing&#x2F;sitting desks and laptops that actually have enough memory!! Nexient do outsourcing but with US-based staff, we work closely with clients so we&#x27;re just part of the team.<p>----- Recruiting Dept&#x27;s Description -----<p>Nexient is hiring! In 2009, we launched Nexient to give American businesses a more responsive, domestic alternative to sending software development offshore. We knew we could deliver better software faster by collaborating with clients in real time. Today, we’re the only 100% US tech company among the World’s Top 100 Outsourcers. Every day, we help dozens of businesses — mostly Fortune 500 companies and fast-growing tech product companies — accelerate their products and services to market and increase their agility.<p>We are hiring software programmers across all levels – for backend and frontend development using Java, C++, JavaScript, Angular, React and associated technology stacks.  The list of current openings is available at  <a href=\"https:&#x2F;&#x2F;www.nexient.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nexient.com&#x2F;careers</a>.  These are full time positions working from Nexient’s delivery center at Ann Arbor, MI. Visa sponsorship and telecommute &#x2F; remote work options are not available for these roles.","time":1546447979,"type":"comment"}