{"by":"jonathan_mace","id":18809987,"parent":18807017,"text":"The Max Planck Institute for Software Systems (MPI-SWS) | <a href=\"https:&#x2F;&#x2F;www.mpi-sws.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mpi-sws.org&#x2F;</a> | PhD applicants and interns | Saarbrücken &#x2F; Kaiserslautern, Germany | ONSITE | VISA and INTERNS | English-language<p>I am Jonathan Mace, and I am a faculty member at MPI-SWS (my position is equivalent to a US assistant professor).  I lead the Cloud Software Systems research group, and I am actively looking for new PhD students to join my group in fall 2019.  I am also hiring interns year-round (interns are typically at the late-stage undergrad or graduate level).<p>A quick brief about the institute more generally: MPI-SWS is a world-class academic research institution located in the German cities of Saarbrücken and Kaiserslautern.  Our faculty are world leaders in many research areas including cloud &amp; distributed systems, computer networks, operating systems, security, privacy, programming languages, verification, and more.  All students admitted to our PhD program receive full funding for the duration of their PhD.  Structurally, our PhD program is similar to those found at US research universities, with longer-duration PhDs, flexibility to move between research groups, and a multicultural, English-language working environment.<p>More specifically about my research group: My group&#x27;s goal is to make it easier to operate large software systems and to understand their behavior at runtime.  Our research entails designing new abstractions for building distributed systems, new techniques for measuring and understanding their performance, and new tools for analyzing their behavior both online and offline.  The kind of questions we ask include things like:<p>* When you put together a complex distributed system, how do you know what it&#x27;s doing when you run it?<p>* Is my distributed system performing well? Did I configure it correctly?<p>* When things go wrong -- like a crash, or if things are really slow -- how do I figure out why?<p>* If I&#x27;m building a new system, what choices can I make so that it&#x27;s easier to understand and analyze its behavior later?<p>* How can multiple users effectively and efficiently share a distributed system without impacting each other?<p>The type of systems we work with include those offered by public cloud providers (Google Cloud, AWS), open-source systems like those in the Hadoop ecosystem, and emerging paradigms like microservice architectures and function-as-a-service platforms.  My group&#x27;s research has a significant practical element, and applicants will need to be comfortable diving into unfamiliar code bases and rapidly prototyping new ideas.<p>If this sounds interesting to you, please feel free to get in touch with me directly (mention seeing this ad for bonus points).  My contact details and more information about my group&#x27;s research can be found here: <a href=\"https:&#x2F;&#x2F;people.mpi-sws.org&#x2F;~jcmace\" rel=\"nofollow\">https:&#x2F;&#x2F;people.mpi-sws.org&#x2F;~jcmace</a><p>General information about PhDs at MPI-SWS can be found at <a href=\"https:&#x2F;&#x2F;www.mpi-sws.org&#x2F;graduate-studies\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mpi-sws.org&#x2F;graduate-studies</a><p>Lastly, applications should be submitted at <a href=\"https:&#x2F;&#x2F;apply.mpi-sws.org\" rel=\"nofollow\">https:&#x2F;&#x2F;apply.mpi-sws.org</a>","time":1546461753,"type":"comment"}