{"by":"james_at_plaid","id":18809108,"parent":18807017,"text":"Plaid | Software Engineer | SF, SLC, or REMOTE | equity + benefits | REMOTE, Full-time, <a href=\"https:&#x2F;&#x2F;plaid.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;plaid.com&#x2F;</a><p>Hi HN! I&#x27;m James Nichols, an engineering manager at Plaid. We&#x27;re hiring, and I believe that for the right people, a position at Plaid could be truly transformational. I was a member of Microsoft&#x27;s Bing team back when it was MSN Search (2006!) and was at Airbnb before it was a household name, but I&#x27;ve never been more excited than I am now in my new role at Plaid. I joined Plaid because of the Plaids I met and because of the feeling I had that I had discovered a secret: a really amazing company, well-positioned in an exciting space, that wasn&#x27;t well known among my friends.<p>Interestingly, only my friends in fintech had familiarity. &quot;Plaid? Oh they&#x27;re great!&quot; was a common refrain. As I learned more, I realized that Plaid was actually a major part of some of my favorite apps (<a href=\"https:&#x2F;&#x2F;www.cnbc.com&#x2F;2018&#x2F;10&#x2F;04&#x2F;meet-the-startup-that-powers-venmo-robinhood-and-other-big-apps.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cnbc.com&#x2F;2018&#x2F;10&#x2F;04&#x2F;meet-the-startup-that-powers...</a>). Venmo, Robinhood, Lending Club, Coinbase, Acorns, and Plastic all use Plaid&#x27;s APIs to improve the user experience of connecting to the banking system. 2018 has been a big year for Plaid (and the fintech space in general), and the company has huge plans in 2019 to deliver even more consumer value, to expand dramatically, and to do it all while cultivating a company culture (and hiring bar) to be proud of.<p>The vast majority of the company is based in San Francisco, but the newly opened Salt Lake City office has a small, tight team that’s growing fast, led by Kira Booth (<a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;kira-booth-11aab289&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;kira-booth-11aab289&#x2F;</a>). The SLC office (in the growing tech scene of “Silicon Slopes”) is a short drive from world-class skiing and national parks.  Plaid also has a team of distributed, location-independent, highly successful engineers. The company is doubling down on this, as evidenced by hiring me as their first remote engineering manager. I&#x27;ll be remote myself, and focused on building a world-class work environment for remote engineers who want to be part of a hypergrowth Silicon Valley company but also want to have flexibility in where they work.<p>Does any of this sound good? Learn more at <a href=\"https:&#x2F;&#x2F;plaid.com&#x2F;company&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;plaid.com&#x2F;company&#x2F;</a> and reach out to me by email (my first name at plaid.com) with a little bit about yourself. Let me know which one of these statements resonates the most:<p>You&#x27;re excited about the fintech space but would prefer to empower hundreds of consumer applications rather than just a single one.<p>You want to join a hypergrowth company, especially before everyone else finds out about it.<p>You care a lot about company culture and the people you work with, but impact is your primary motivation to do great work.<p>You’re based in Salt Lake City and excited at the prospect of a growing SLC office of a Silicon Valley company.<p>You&#x27;ve considered becoming a remote engineer, but are worried that you&#x27;ll have to sacrifice career growth, technical challenge, culture, or other important parts of your work environment.<p>You&#x27;re already a very effective remote engineer and interested in collaborating with a team invested in remote work.","time":1546456707,"type":"comment"}