{"by":"jashmenn","id":18807034,"kids":[18811624,18807510,18811826,18821837,18807163],"parent":18807017,"text":"Fullstack.io | Book author | Remote | Part Time | <a href=\"https:&#x2F;&#x2F;www.fullstack.io&#x2F;write-a-book&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fullstack.io&#x2F;write-a-book&#x2F;</a>\nEarn on order of $50k&#x2F;year by writing a programming book. We’re the authors of Fullstack React, ng-book, Fullstack Vue and we’re looking to work with authors like you to write a few new books this year.<p>Our books sell very well because:<p>- We go way beyond API docs and teach everything you need to know to build real apps.<p>- We guarantee the books and code are up to date.<p>- We invest in marketing the books (and have an active email list of over 100k)<p>- We love the topics we write about and aim to create something remarkable every time.<p>If you decided to self-publish, you may find the marketing is more than writing the book. We have an audience, and we know what they want to read - so when your book is done, we already have people who want to buy it.<p>If you decide to go with a “traditional” publisher, you may be given a mediocre editor, write your book in MS Word (ha), and earn 5-15% in royalties. With us, our editors (me) are programmers first, our tooling is dev-friendly, and our royalties are split 50&#x2F;50. (For scale, the author of Fullstack Vue earned $20k on the opening weekend.)<p>I’d specifically like to work with someone on Fullstack Go and Fullstack Rust - which is less about the respective languages and more like guides to building full-stack web applications with each, including third-party libraries, etc. But we’re also looking to write content about Python, Kubernetes, JavaScript, Elixir, etc. Anything up and coming.<p>If this sounds like something you’d be interested in, fill out the form linked below. Looking forward to hearing from you!<p><a href=\"https:&#x2F;&#x2F;www.fullstack.io&#x2F;write-a-book&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fullstack.io&#x2F;write-a-book&#x2F;</a><p>(I&#x27;ve talked more about our economics of writing books here: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=17015117\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=17015117</a>)","time":1546444994,"type":"comment"}