{"by":"extensible","id":18808490,"parent":18807017,"text":"Extensible Energy | Data Scientist | Berkeley, CA | Full-time | ONSITE<p>We are a cleantech innovator developing amazing software to integrate more solar into the grid while saving commercial electricity customers money. Led by serial entrepreneurs with a track record of success in this field, we&#x27;re growing -- and growth provides great opportunities for the right new team members. We are in need of a Data Scientist to build and evaluate models of energy production and usage in commercial buildings. This is a unique opportunity to become a core part of team of energy entrepreneurs. The Data Scientist&#x27;s work will be integrated into a shipping commercial product.<p>Responsibilities<p><pre><code>    - Research and develop statistical learning models, with an emphasis on timeseries forecasting\n    - Collaborate with product manager, software engineers, and building engineer\n    - Develop contacts with customers, partners, and public entities required to obtain rich data sources for model development\n    - Maintain careful documentation of data sources, data validation, and modeling processes\n</code></pre>\nQualifications<p><pre><code>    - Advanced degree in computer science, statistics, applied math, economics, engineering, or related field\n    - Rigorous understanding of statistical modeling and timeseries forecasting\n    - Several years practical experience with statistical languages, database programming, and data analysis (particularly machine learning, neural networks, and time-series analysis)\n    - Extensive background in real-world statistical analysis\n    - Excellent pattern recognition and predictive modeling skills (including thoughtful evaluation of how applicable and &quot;good&quot; a model is to a specific problem)\n    - Enough machine learning experience to be dangerous\n    - Real-world Python experience required\n    - Knowledge and interest in energy and building modeling desirable</code></pre>","time":1546452939,"type":"comment"}