{"by":"johnkeates","id":18808580,"parent":18807017,"text":"wehkamp | Cloud Engineer, DevOps Engineer, Software Developer and more! | Zwolle, Netherlands | ONSITE | Full-time<p>Wehkamp is one of the biggest and oldest players in the online retail market in The Netherlands and with a large and varied catalog we serve millions of customers.<p>Our microservices and microsites are hosted using a variety of technology including Mesos, Lambda functions and systems like Kafka and Spark. We have been running containers in production for over 3 years, with orchestration systems like Terraform and Ansible to programmatically create our infrastructure. Most of our stack is built using Linux as a base OS with runtimes like nodejs, jvm and .NETCore CLR to run our workloads. You can find a lot of additional variations in operating systems and languages where and when it makes sense, like some cases where Windows, IIS and .NET was the best fit. We often automate ops workloads and event reactors in a number of our favourite utility languages like python and shell scripts, and Prometheus metrics are everywhere - something the SRE team is extremely happy with. Note: We have a lot of English-speaking colleagues at Wehkamp, so don&#x27;t worry if you&#x27;re not a proficient in Dutch.<p>We&#x27;re looking for passionate engineers who feel at home around microservices, deployment pipelines, immutability and infrastructure-as-code and who feel comfortable talking Python and Bash. Or ones that simply want to join us on our adventures :)<p>Job posting in Dutch: <a href=\"https:&#x2F;&#x2F;werkenbij.wehkamp.nl&#x2F;vacatures&#x2F;technology&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;werkenbij.wehkamp.nl&#x2F;vacatures&#x2F;technology&#x2F;</a><p>Interested? Our Dutch posting has online application forms and our LinkedIn pages contain easy apply buttons at <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;1018869307&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;1018869307&#x2F;</a> (Dutch) and <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;cloud-engineer-at-wehkamp-936453962&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;cloud-engineer-at-wehkamp...</a> (English)<p>Or reach out directly at: cGxhdGZvcm1vcGVyYXRpb25zQHdlaGthbXAubmwK==","time":1546453456,"type":"comment"}