{"by":"ztorkelson","id":18809098,"parent":18807017,"text":"Clover | Sunnyvale, CA | ONSITE | Full-Time | Senior Software Engineer (Backend) | USD $180k+<p><i>Our Team</i><p>We are a small team of experienced software engineers tasked with ensuring that Clover’s rapid growth is sustainable over the long term. Our team solves for cross-cutting non-functional requirements like the security, scalability, and fault tolerance of Clover’s backend services. Together we design and develop the core architectural components, libraries, frameworks, tooling, and distributed systems at the heart of our global payment platform.<p><i>Our Work</i><p>We recently completed a project to horizontally shard our OLTP cluster, which had grown to 10+ TB in size. Next up is building a fully autonomous service for rebalancing merchant data across the shards to distribute load and eliminate hot spots.<p>We just finished moving our production infrastructure from private data centers to the public cloud in an effort to streamline our global expansion. Now we’re revisiting our architecture, processes, and tooling in order to better take advantage of the cloud environment.<p>We are actively working on the design, development, and deployment of data pipeline infrastructure to support richer analytics and reporting for our merchants and internal business needs. Our focus is on its security, scalability, reliability, and performance.<p>We already have a comprehensive suite of functional unit and integration tests, and are now focused on improving our automated stress tests and supporting infrastructure. That involves building the tools to spin up full production-scale environments, synthesize load, perform fault injection, and to collect, analyze, and surface test results to help drive continual improvement of performance and availability.<p><i>Our Stack</i><p><pre><code>  - Java for backend services.\n  - Python for integration and stress tests.\n  - MySQL for OLTP. Snowflake for OLAP.\n  - Kafka for stream processing.\n  - Memcached for caching (duh).\n  - Redis for ephemeral shared data structures.\n  - Wavefront and ELK for operational visibility.\n  - Google (GCP) as our cloud service provider.\n  - Docker for building containers. Kubernetes for running them.\n  - Netty for speaking HTTP, behind HAProxy for load balancing.\n</code></pre>\nThis is the Clover of today. You can help shape the Clover of tomorrow.<p>Contact: zac at clover dot com (and mention you saw this in HN!)<p>More info: <a href=\"https:&#x2F;&#x2F;www.clover.com&#x2F;job-post?gh_jid=1461732\" rel=\"nofollow\">https:&#x2F;&#x2F;www.clover.com&#x2F;job-post?gh_jid=1461732</a>","time":1546456654,"type":"comment"}