{"by":"nwienert","id":18809705,"parent":18807017,"text":"Orbit | Frontend with some full stack | Onsite | Full time | React, Typescript, Electron<p>Post-funding, pre-market startup, you are the first to join so this is ideally a first-developer or even co-founder type role with appropriate responsibility&#x2F;equity depending.<p>Let&#x27;s build a better app platform. To start, by focusing on companies&#x27; knowledge based apps. Think: unified search, profiles, and company vocabulary.<p>But let&#x27;s make it fun. Using a novel OCR engine we&#x27;re realizing a leap in computing: the augmented OS; Orbit understands every word on screen in realtime (with &lt;1% battery hit), uses new NLP to sort it into your history by topics&#x2F;interests. You can organize knowledge using the various apps, or just see context to whatever you&#x27;re looking at currently using a slick dropdown with quick actions.<p>And thats just the start. It can eventually power some impressive things down the road from relevancy based on activity to company news based on disambiguated &quot;attention ranking&quot;.<p>Don&#x27;t you wish desktop apps:<p>- Stored data in a standardized format using SQLite<p>- Could share and access data separately from the apps themselves<p>- Could be easily built with hot reloading and using a shared component kit your team can maintain<p>- Could be deployed without infrastructure using p2p -- one click deploy<p>- Instantly launched just like spotlight<p>- Had reactive queries, a beautiful&#x2F;large&#x2F;themeable UI kit, virtual lists and tables, natural language APIs, all typed<p>- Could go cross platform&#x2F;device easily<p>- (insert your ideas here!)<p>If you love programming in general, are passionate about product, think Bret Victor is great, and generally want to try and make a big difference in the world, please get in touch with me. I need one or two really great developers as it&#x27;s more fun to do things like this with a passionate team than alone.<p>natewienert gmail","time":1546459966,"type":"comment"}