{"by":"marksamman","id":18809152,"parent":18807017,"text":"Doctype | Software engineer with reverse engineering skills &#x2F; Anti-cheat engineer | Stockholm, Sweden | ONSITE, VISA or REMOTE (worldwide) | Full-time &#x2F; part-time | <a href=\"https:&#x2F;&#x2F;www.doctype.se&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.doctype.se&#x2F;</a><p>We&#x27;re a small digital agency based in Stockholm, Sweden. Currently around 15 people. We have an office in the heart of Stockholm, but our employees are free to work from wherever they feel most productive. We&#x27;ve built <a href=\"https:&#x2F;&#x2F;lemondogs.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;lemondogs.com&#x2F;</a>, <a href=\"https:&#x2F;&#x2F;www.gothiaecup.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gothiaecup.com&#x2F;</a>, <a href=\"https:&#x2F;&#x2F;beta.esportal.se&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;beta.esportal.se&#x2F;</a>, amongst other websites. Our largest clients are within the eSports segment.<p>We’re currently looking for a software engineer with reverse engineering skills to work with us on client-sided anti-cheat technology. Our current tech stack is mainly Go, MariaDB and React, but the project you would be working on is a standalone client built in C&#x2F;C++ and Assembly.<p>Requirements:<p>* Good understanding of C and x86-64 assembly<p>* Good understanding of the x86 architecture<p>* Basic understanding of the Windows NT kernel<p>* Eager to learn<p>Nice to have:<p>* Experience with reverse engineering malware&#x2F;cheats<p>* Experience with reverse engineering the Windows NT kernel<p>* Experience with binary instrumentation<p>* Experience with hardware-assisted virtualization (such as VT-x and AMD-V)<p>* Experience with SLAT (Second Level Address Translation)<p>* Understanding cryptography primitives<p>The role we’re looking to fill is initially part-time, but may eventually grow into a full-time role. You’ll be working together with another anti-cheat engineer to combat cheaters in video games. If you’re looking for a full-time role, we may be able to offer that depending on your breadth of knowledge. We can offer relocation to Sweden and assist with housing. I’m one of the co-founders and currently hold the role as CTO. Feel free to mail me at mark@doctype.se if this sounds interesting to you!","time":1546456884,"type":"comment"}