{"by":"datahipster","id":18808504,"parent":18807017,"text":"a.i. solutions | Washington, D.C. | C++ Software Engineer | U.S. Citizenship<p>Would you love to be a part of the new space industry?\nDo you like solving challenging problems with algorithms and data structures?\nDo you enjoy designing and developing sophisticated software architectures?<p>Read on!<p>We’re a team of software engineers, aerospace engineers, physicists, mathematicians, and data scientists building FreeFlyer, one of the top platforms for satellite orbital modeling and trajectory design. Our software is used by NASA and other space agencies and private companies for satellite mission planning and mission control. FreeFlyer has been used for spacecraft missions of all types, including the International Space Station, communications satellites, science missions, and several planned missions to the Moon and beyond.<p>Take a look at how FreeFlyer was used to analyze and visualize high-fidelity gravitational field measurement data from the GRACE mission: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=eET-PlSB6yQ\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=eET-PlSB6yQ</a>. You can learn more about FreeFlyer via our website: <a href=\"https:&#x2F;&#x2F;ai-solutions.com&#x2F;freeflyer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;ai-solutions.com&#x2F;freeflyer&#x2F;</a>.<p>We are looking for someone to join our team who is excited to dive in and make an impact. By joining the team, you will have the opportunity to:<p>+ Solve interesting problems that are centered around high fidelity computational modeling, data structures, algorithms, data visualization, and performance.<p>+ Contribute to improving our software architecture and help us build a better product.<p>+ Learn from subject matter experts about everything that goes into sending a satellite into orbit.<p>To learn more about the position, please visit: <a href=\"https:&#x2F;&#x2F;rew12.ultipro.com&#x2F;AIS1000&#x2F;JobBoard&#x2F;JobDetails.aspx?__ID=*5EA76D5DB6A664BB\" rel=\"nofollow\">https:&#x2F;&#x2F;rew12.ultipro.com&#x2F;AIS1000&#x2F;JobBoard&#x2F;JobDetails.aspx?_...</a>.<p>If this sounds interesting to you, we would love to hear from you! You can reach out to us over email or connect with us via the DC Tech Slack community with any questions.<p>We look forward to hearing from you!<p>The FreeFlyer Team<p>stefan.novak@ai-solutions.com<p>@stefan on DC Tech’s Slack community(<a href=\"http:&#x2F;&#x2F;www.dctechslack.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.dctechslack.com&#x2F;</a>)","time":1546453028,"type":"comment"}