{"by":"eriktrautman","id":18812222,"parent":18807017,"text":"NEAR Protocol | Developer Evangelist | San Francisco | Full-time | ONSITE<p>## About the Role<p>As a developer evangelist, your mission is to educate and engage early adopters and the broader developer community about the NEAR platform by telling a compelling story and backing it up with practical examples.  That means doing whatever it takes to bring them into our developer community and keep them actively and happily building within it while learning from their experiences.<p>Practically speaking, this means that you will wear a lot of hats.  As the core protocol is developed, you will be a key interface with the early adopter community to make sure they will have a great experience on the platform when it is released.  You’ll need to build developer tools, write demos&#x2F;tutorials and otherwise do pretty much whatever it takes to ensure developers have a great experience onboarding to and using the platform.<p>Going forward, you will be a visible presence representing NEAR in communities around the world by working directly with our events and community teams.  This means everything from speaking to hosting workshops to supporting developers at events. You are the voice of the community to our internal team as well, helping to inform the development and education roadmaps.<p>This is a role that will allow you to build real software and also take a public-facing role representing the platform to developer communities.  It is one part engineering, one part community and one part education with a sprinkle of marketing and PR. You will be based in San Francisco but travel is a necessary component to support events around the world.<p>Apply at <a href=\"https:&#x2F;&#x2F;nearprotocol.com&#x2F;careers?gh_jid=4106601002\" rel=\"nofollow\">https:&#x2F;&#x2F;nearprotocol.com&#x2F;careers?gh_jid=4106601002</a><p>## About NEAR<p>NEAR is a scalable blockchain and smart contract platform designed to provide the performance and user experience necessary to bridge the gap to mainstream adoption.  Unlike other next generation blockchains, this network’s performance both scales with the total number of nodes and allows those nodes to be run on low-end devices like mobile phones, bringing potentially billions of them into the network and providing a direct path to end users.<p>Apply at <a href=\"https:&#x2F;&#x2F;nearprotocol.com&#x2F;careers?gh_jid=4106601002\" rel=\"nofollow\">https:&#x2F;&#x2F;nearprotocol.com&#x2F;careers?gh_jid=4106601002</a>","time":1546481209,"type":"comment"}