{"by":"equilian","id":18817972,"kids":[18849122],"parent":18807017,"text":"OnDeck (<a href=\"https:&#x2F;&#x2F;www.ondeck.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ondeck.com&#x2F;</a>) | Multiple Positions | New York, NY and Arlington, VA | Onsite Only<p>At OnDeck, we make small business a big deal. We’re improving the world’s economic landscape by changing the way small businesses access capital. We care intensely about each other, our company and the customers we serve, and are committed to making every day count.<p>Technology at OnDeck is a mix of building world-class user experiences for our partners and direct customers, data processing to enable underwriting model development and real-time lending decisions, automating operational and compliance workflows, and generating precise money movements and calculations to service our customers. We have an emphasis on scalability, security, reliability and accuracy.<p>My teams are focused on building the experience and automation that underpin our abilities to quickly and easily enable merchants to apply for and receive capital.<p>Qualifications:<p>- Strong Java developer with experience building complex system<p>- Experience with Java frameworks like Jersey, Spring, and&#x2F;or Dropwizard<p>- Experience with AngularJS, Ruby on Rails, SQL and&#x2F;or NOSQL<p>- Experience creating and consuming REST web services<p>- Good understanding of event-driven, functional, and object oriented paradigm<p>- Passionate about technology and willing to learn something new<p>We are looking for:<p>- Technical Lead Engineer: Link to Come<p>- Senior Software Engineer: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;ondeck&#x2F;jobs&#x2F;1425758\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;ondeck&#x2F;jobs&#x2F;1425758</a><p>- Senior Software Engineer (More front-end focused): <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;ondeck&#x2F;jobs&#x2F;1146728\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;ondeck&#x2F;jobs&#x2F;1146728</a><p>- Software Engineer: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;ondeck&#x2F;jobs&#x2F;1454072\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;ondeck&#x2F;jobs&#x2F;1454072</a><p>Feel free to reach out with any questions&#x2F;send resumes to aevansel at ondeck.com.","time":1546541672,"type":"comment"}