{"by":"daveungerer","id":18812427,"kids":[18822041,18824967],"parent":18807017,"text":"SimplePay | Ruby on Rails Developers | Cape Town, South Africa | REMOTE<p>The story (skip this paragraph if you don&#x27;t like stories in your job posts): I founded and continue to run this startup. Most of the team works from our office in South Africa. However, 8 months ago I moved to Singapore for work &#x2F; personal reasons. I used to be quite averse to the idea of remote workers, but seeing as just about everyone will now be remote from my perspective, I decided it&#x27;s a good time to start focusing on hiring for remote work. We’ve hired 3 remote developers so far and it’s been a great experience!<p>SimplePay is online payroll software for South Africa, Ireland, Singapore and Hong Kong. Our software lets thousands of small business owners (and their accountants) run their payrolls without headaches, so they can focus on the challenge of building their businesses.<p>Do you believe most SPAs are a pile of steaming crap, but wouldn&#x27;t mind digging into Vue.js for pages that will benefit from the increased interactivity? Do you laugh when people give up the power of PostgreSQL in favour of data stores that don&#x27;t offer any benefits for their use case? If so, you may fit in well with our mindset. The work will include: Doing direct integrations with banks that offer good APIs; Expanding our API for other systems to integrate with us; Adding new features; Optimising for performance; Integrating with government systems; Squashing bugs; Eventually, the opportunity to do some mobile development (maybe using Flutter).<p>Experience: Due to our full pipeline, we can only hire developers who have a few years of Rails experience at this time, or polyglots who at least know Ruby. Previous experience with remote work would be a bonus - we need people who understand the challenges and can share what they&#x27;ve learnt.<p>Location: Most of the team is in GMT+2, and I&#x27;ll be in GMT+8 going forward. So anything from GMT+2 to GMT+8 should be OK.<p>Please mail careers@simplepay.co.za and put &quot;Hacker News&quot; somewhere in the subject. I look forward to transforming the company to being more remote-friendly.","time":1546483894,"type":"comment"}