{"by":"deepakkarki","id":18813834,"parent":18807017,"text":"Clarisights | Frontend, Backend, Data engineers | Bangalore, India | Full-Time | ONSITE | <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;clarisights&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;clarisights&#x2F;jobs</a> | 8L - 30L<p>Clarisights is an data ingestion and analytics platform that enables marketers to make sense of and gain unique insights from data coming in from all the sources (analytics, ads data, CRM, Payroll, etc). Our platform is a seamless in browser experience - the users just add the data sources they want to track, our backend then pulls in data from those resources and stores it into our own database. The user then proceeds to the visualisation page to create the required data visualisations.<p>Clarisights was founded to empower performance marketing and growth teams by creating a platform that gives them insights and superhero powers they have always wanted. Rather than wrestling with outdated spreadsheets and BI platforms that can&#x27;t keep pace with their growing volume of marketing channels and data, marketers can use Clarisights to independently explore and analyse all their data in a single and intuitive interface. Marketing teams around the world use Clarisights for every aspect of their performance marketing workflow - from integrating with data channels, creating and optimising dashboards, and collaborating with teammates - all in real time!<p>We have found product market fit and have recently closed a $2M round from top European VC&#x27;s. Currently a team of 20 people looking to scale.<p>We&#x27;re looking for frontend, backend and data engineers at all levels (Architects, senior, mid-level and interns). <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;clarisights&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;clarisights&#x2F;jobs</a><p>We deal with a lot of data and need real-time responses - you will have an opportunity to work on some really hard engineering problems. We often run into performance issues in popular open source tools and libraries - we don&#x27;t hesitate to find the bottlenecks and fix them. Team is lead by Ex-Google and Ex-Facebook folks who&#x27;ve got lots of experience building scalable production software.<p>Tech stack :<p>Backend : PostGres, MongoDB, Docker, Kubernetes, Ruby on Rails (we&#x27;re considering a migration to Elixir or GoLang). Hosted on Google cloud platform.<p>Frontend : React, Redux, Styled components, Jest, FlowType, WebPack, etc.","time":1546506923,"type":"comment"}