{"by":"jaredsilver","id":18810085,"parent":18807017,"text":"DataCamp | Full-Stack Engineer (Growth), Front-End Engineer (Growth &#x2F; Marketing) | New York City | Full-time | Onsite<p>About DataCamp:<p>Fresh off a $25 million fundraise (<a href=\"https:&#x2F;&#x2F;venturebeat.com&#x2F;2018&#x2F;12&#x2F;17&#x2F;datacamp-raises-25-million-for-customizable-online-data-science-courses&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;venturebeat.com&#x2F;2018&#x2F;12&#x2F;17&#x2F;datacamp-raises-25-millio...</a>), DataCamp is the leading platform for learning and teaching data science skills. Over 3 million students and professionals from companies like Uber, Airbnb, and Deloitte use DataCamp to become better versed in data analytics and programming languages like R, Python, and SQL. Come join us in our office on the 77th floor of the Empire State Building, and help build the future of education for millions of learners around the world.<p>--<p>Full-Stack Engineer (Growth): <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;datacamp&#x2F;jobs&#x2F;1482036\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;datacamp&#x2F;jobs&#x2F;1482036</a><p>Rapidly implement high-impact experiments across DataCamp&#x27;s learning products to help the company reach more learners. Work closely with a data scientist, a growth marketer, and another growth engineer to prototype in production and achieve results that will make your resume shine. In the past year, this team has accomplished things like increasing user engagement with two content types by over 33% and improving conversion rates on course pages by over 10%.<p>--<p>Front-End Engineer (Growth &#x2F; Marketing): <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;datacamp&#x2F;jobs&#x2F;1435244\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;datacamp&#x2F;jobs&#x2F;1435244</a><p>Own DataCamp&#x27;s entire logged out experience, working with cool tech like Gatsby.js to make DataCamp as accessible on an Android phone in India as it is on a MacBook Pro from your office on the 77th floor of the Empire State Building. Work alongside the growth &amp; marketing teams to implement portfolio-worthy pixel-perfect webpages.<p>--<p>Unbelievable Perks:<p>* Work out of the world&#x27;s most famous office building<p>* International company retreats multiple times a year (I&#x27;ve been to Spain, Ireland, England, and Belgium so far)<p>* Daily catered lunches<p>* Massive learning &amp; development budget for conferences<p>* Full medical&#x2F;dental<p>* Super generous compensation (including stock options and 401k contributions)<p>--<p>This is a chance to play a foundational role on a super entrepreneurial team within a rocketship company. Please feel free to reach out if you have any questions!<p>We&#x27;re also hiring for a ton of other roles, which you can check out here: <a href=\"https:&#x2F;&#x2F;www.datacamp.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.datacamp.com&#x2F;jobs</a>.","time":1546462442,"type":"comment"}