{"by":"CrayHiring","id":18810907,"kids":[18811698],"parent":18807017,"text":"Software Engineer – Chapel Language Development\nThe Chapel Team at Cray is looking for a forward-thinking Software Engineer to build the next generation features for the Chapel Language. This is an opportunity to work with a dynamic team on a high-productivity language. \nPrimary Duties and Responsibilities:\n·\tAdvance Language, Libraries, and Runtime.  \n·\tDesigns, develops, troubleshoots, and debugs the Chapel compiler.  \n·\tDevelops appropriate unit tests for automated build system. \n·\tHas appreciable latitude for decision making within the scope of the project.\n·\tWorks closely with other team members to review design directions<p>Key Qualifications include:\n·\tRequires a Bachelor’s degree or equivalent experience.\n·\t2+ years of related experience.  \n·\tExperience with C&#x2F;C++.  \n·\tProven analytical skills and strong oral and written communication skills.  \n·\tExperience with Linux operating systems is required.  \n·\tExperience with LLVM is considered a plus.  \n·\tPractical compiler or interpreter implementation experience also a plus.\n·\tExperience with Agile development methodologies is desired.  \n·\tAbility to manage multiple projects and tasks, prioritize work and deliver software projects on time and within budget.\n·\tHas mastered engineering skills in field and easily applies knowledge to determine and develop an approach to meet objectives.  Resolves a wide range of issues in creative ways.\n·\tDemonstrates good judgment in selecting methods and techniques for obtaining solutions.  Work requires imaginative, thorough and practical solutions to a wide range of problems.\n·\tAbility to communicate effectively across the function and often across organizational boundaries, or with customers\nWe are proud to be an Equal Opportunity Employer including protected veterans and individuals with disabilities. CRAY Inc. is an Affirmative Action, Equal Opportunity Employer. As part of our standard hiring process for new employees, employment with CRAY will be contingent upon successful completion of a comprehensive background check.\n<i></i>ONSITE - SEATTLE\nmy email: gmastel@cray.com","time":1546467837,"type":"comment"}