{"by":"amandalui","id":18811291,"parent":18807017,"text":"Albert | Product Manager | Full-Time | Los Angeles | ONSITE | <a href=\"https:&#x2F;&#x2F;albert.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;albert.com&#x2F;</a><p>Albert is a new type of financial service that uses powerful technology to automate your finances, with a team of human experts to guide you. Our geniuses find savings you’re missing, identify bills you&#x27;re overpaying, help you pay down debt faster, save automatically for you, and much more. Text Albert a financial question, and we’ll not only offer guidance but help you make it happen.<p>We’re an LA-based startup with a proven business model, backed by top tier institutional investors, and over 500,000 users who have trusted Albert to help them achieve their financial goals. We’re on a mission to improve the financial lives of millions of people with a beautifully designed, simple product, and we’re looking for thoughtful, talented people to join us on our journey.<p>Currently on the lookout to hire product managers who aren&#x27;t afraid to get their hands dirty. On an average day, you might pitch a concept to senior leadership, create a launch plan with marketing, work with designers, prototype a new feature, analyze customer data directly with our geniuses, and work with engineering on implementation. You have responsibility for understanding the customer&#x27;s needs, influencing business strategy, feature specification, and working with engineering to develop software.<p>Benefits include a competitive salary and meaningful equity; health, vision, and dental insurance; free lunch; and your own hardware budget.<p>Read more and apply here:\n<a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;meetalbert&#x2F;fe6dfca7-2d67-41eb-b780-ed6a60f4a1d3\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;meetalbert&#x2F;fe6dfca7-2d67-41eb-b780-ed6...</a><p>Feel free to reach out if you have any questions: amanda@albert.com","time":1546470992,"type":"comment"}