{"by":"urlwolf","id":18813998,"parent":18807017,"text":"Data Science Retreat | Director | Berlin or Montreal | Onsite | Fulltime | Visa | Remote possible for exceptional candidate<p>Data Science Retreat (DSR) is the market leader in EU for machine learning training. We are expanding to North America, we started in SF but are moving to Montreal. DSR helps coders or people with significant quantitative training (e.g. science, engineering, or math graduates) ramp-up rapidly for a data science career - arguably the fastest-growing, highest-demand profession. Our participants have an average of 5 years of industry experience.<p>We are launching a new product that is a big departure from our 3-month in-person training:<p>- For a monthly fee (3 different price points), our customers receive a topic that our teachers prepare in depth. For example, an exciting new technique that just came out in a paper and that is really applicable in the industry today<p>- There&#x27;s code that implements the technique, but the most important part is that we provide a detailed explanation and references to every bit of knowledge you need to understand the topic. With exercises that are self-correcting (you write code, press a button, get red&#x2F;green)<p>- This business model works well B2C, but it&#x27;s something easy to consume for big corporates that want to train their people on-the-job (the current 3-month retreat doesn&#x27;t address this need well). It&#x27;s all very &#x27;hands on&#x27; and more advanced than the usual MOOCs. We suspect MOOCs are not creating data scientists, at least not when done on-the-job. If we can demonstrate results, this should be an easy sell.<p>As Director of this product, these could be your day to day activities:<p>- Think up methods to increase our pipeline, together with marketing\n- Pay attention to KPIs for recurrent business, for example, churn\n- Decide which proportion of revenue goes to service the base, and which to invest in R&amp;D\n- Look at customer lifetime value (you don&#x27;t need to calculate it, we have a resident expert on the team)\n- Experiment with variations of product and pricing\n- Do outbound sales to convince companies to try our service","time":1546509278,"type":"comment"}