{"by":"Runtastic","id":18843918,"kids":[18862927],"parent":18807017,"text":"Open BACKEND DEVELOPER Jobs at Runtastic<p>We believe in supporting people to improve their fitness and overall health. With more than 220 million downloads of our apps and 115 million registered users on Runtastic.com, we face unusual and fascinating challenges everyday. == ONSITE | VISA ==<p>YOUR MISSION<p>Ready to change the world with code? With hundreds of millions of users we face the challenge of building a top-class backend infrastructure and applications every day. Our main tools of choice to scale our applications are jRuby, Sinatra, Sidekiq, MySQL and MongoDB. In your agile team, your tasks will include:<p>- Designing efficient and scalable backend services and APIs for our health and fitness applications<p>- Working together with your team to envision the next great features and applications of Runtastic<p>- Writing tests and releasing &amp; monitoring your code<p>- Improving our growing codebase<p>- With a proactive mindset there will be plenty of opportunities to bring in your own ideas to shape the future of Runtastic<p>YOUR PROFILE<p>- Experience writing robust, maintainable HTTP and REST APIs<p>- First contact with Ruby<p>- At least 2 years of experience in backend development<p>- Knowledge of SQL and familiarity with NoSQLdatabases such as MongoDB or Cassandra<p>- Ability to speak JSON (preferably JSON API) and REST to clients<p>- Preferably, a degree in Information Technology, Software Engineering or a related field (higher technical institute or university)<p>- Very good English skills<p>- Curious mindset, a team player and desire to work and live in Austria<p>Sounds interesting? Find out more: <a href=\"https:&#x2F;&#x2F;www.runtastic.com&#x2F;en&#x2F;career?jh=bl58u34xb4m97cu20g3eik2ijlx59jj\" rel=\"nofollow\">https:&#x2F;&#x2F;www.runtastic.com&#x2F;en&#x2F;career?jh=bl58u34xb4m97cu20g3ei...</a><p>We offer jobs in various fields, check out our career page <a href=\"https:&#x2F;&#x2F;www.runtastic.com&#x2F;en&#x2F;career\" rel=\"nofollow\">https:&#x2F;&#x2F;www.runtastic.com&#x2F;en&#x2F;career</a> and see if any of our open positions match with your interests and background (i.e. open positions for Mobile Developers, Data Engineers, Scrum Masters, ...).","time":1546853415,"type":"comment"}