{"by":"3Shape","id":18845555,"parent":18807017,"text":"3Shape Denmark | C# developer | Cloud | 3D algorithms |<p>3Shape creates 3D scanning and CAD&#x2F;CAM software solutions. Award-winning technology that enables dental and hearing professionals to treat more people, more effectively and with improved care. Based on the strength of its unwavering commitment to technology and innovation, 3Shape continues to thrive and grow year after year.<p>We are hiring:<p>A skilled C# developer to help strengthen our cloud-based solutions, which enable digital workflows for dental professionals working within the field of Orthodontics. You will work on a solution consisting of distributed systems written in C#, on the Windows stack, targeting orthodontic specialists around the world: <a href=\"https:&#x2F;&#x2F;3shape.easycruit.com&#x2F;vacancy&#x2F;2205649&#x2F;111446\" rel=\"nofollow\">https:&#x2F;&#x2F;3shape.easycruit.com&#x2F;vacancy&#x2F;2205649&#x2F;111446</a><p>A creative C# Developer for Audio who will be implementing user stories and tasks, participate in software design and problem-solving discussions, perform code reviews, do pair programming etc. You are typically involved in a task from its beginning to end while still having wide possibilities to apply special efforts in areas in which you excel, e.g. UI and UX, architecture, APIs, 3D algorithms etc: <a href=\"https:&#x2F;&#x2F;3shape.easycruit.com&#x2F;vacancy&#x2F;2197071&#x2F;111085\" rel=\"nofollow\">https:&#x2F;&#x2F;3shape.easycruit.com&#x2F;vacancy&#x2F;2197071&#x2F;111085</a><p>Get to know more about our Engineering team: <a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;Y0Pd1YNtcgw\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;Y0Pd1YNtcgw</a><p>And meet Jesper Lomborg Manigoff, Vice President for R&amp;D Software Development, who explains how curiosity drives our development: <a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;R6d_s9NrLG4\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;R6d_s9NrLG4</a>","time":1546872800,"type":"comment"}