{"by":"mattbee","id":18884719,"parent":18807017,"text":"BlueSky Education | Senior Software Engineer | Guildford, UK | Onsite | Full-time<p>BlueSky is looking for its first in-house, full-time software engineer in Guildford, UK.<p>Over 17 years, our pioneering team has made BlueSky the UK&#x27;s leading performance management tool in the field of education. BlueSky is a web-based software product that drives professional development for tens of thousands of teachers.<p>You will be our first in-house engineer. You will gradually take charge of engineering practice that we&#x27;ve successfully contracted out for 17 years. In the long term we will look to you to set standards for future engineers and help recruit a larger team. There is the opportunity for this to become an executive level role within 12-24 months.<p>Educators are our lifeblood here at BlueSky – we need you to care about their careers as much as we do.\nResponsibilities<p>Responsibilities:<p>You&#x27;ll be reporting to the Managing Director, Denise Inwood, who also designed and specified the BlueSky software.<p>In the short term, you will need to take ownership of our 50,000 line Rails 3 code base and deliver improvements alongside our outsourcing partner.<p>You&#x27;ll be stepping into a multi-disciplinary team of server, front-end &amp; database experts who are part of our outsourcing company, and will be a major part of BlueSky for years to come. You&#x27;ll build a working relationship with their team, plan engineering work with them and manage a slow transition of ownership.<p>More details and application instructions -&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2M3FSe4\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2M3FSe4</a><p>(If you recognise my handle, you&#x27;ll know this isn&#x27;t my company - I founded bytemark.co.uk and did lots of hiring of engineers over the years. Since leaving Bytemark I&#x27;m helping BlueSky create their own engineering department, and I&#x27;ll be assisting with the recruitment process - this will the first move of many!).","time":1547225103,"type":"comment"}