{"by":"jsolvesit","id":18898417,"kids":[18984405],"parent":18807017,"text":"HiringSolved | REMOTE | Python Integrations Engineer | Machine Learning | BUILD AIAWESOMENESS<p>Rare opportunity for a <i>Passionate-Pythonian-Polyglot-Polymath</i> to join a tight-knit team of distributed engineers building machine learning AI software that is pioneering the future of hiring.<p>And so our story begins… In a dimly lit hacker space in 2012 called Gangplank in Chandler, Arizona, where two friends met and decided to build the competitive advantage. Today, HiringSolved is one of the top AI-based talent discovery and automation solutions on the global HR Tech market with users in 130 countries around the world. Read the full story at <a href=\"https:&#x2F;&#x2F;hiringsolved.com&#x2F;about\" rel=\"nofollow\">https:&#x2F;&#x2F;hiringsolved.com&#x2F;about</a><p>Our mission is to organize the world&#x27;s data about people and to increase the efficiency and humanity of the hiring process through intelligent automation. Join us! The team that&#x27;s unstoppable.<p>We are looking for an API Integration Engineer to lead implementation projects start-to-finish; coding up custom solutions on the backend that integrate our robust web app - written in Python and Javascript - with our customers’ enterprise systems.<p>HARD SKILLS:\nFamiliarity with our tech stack: Python, Flask, ElasticSearch, JavaScript, React, Rest, MongoDB, HTML, Linux +++\nExperience consuming APIs and integrating 3rd party systems (ATS, CRM, HRIS etc.);\nConsiderable time with Soap&#x2F;REST API Paradigms. character encodings, building ETL pipelines;\nData extraction, crawling, parsing and munging from structured and unstructured sources.<p>Our ideal candidate is…\n… A math minded die-hard engineer who can hit the ground running with our stack, break down complex problems into solutions to code, and put them into production. \n… A coder to the core. Loves to code! Can actually write the framework, not just use it. \n… Is a fan of using Python to solve unique or peculiar problems. \n… An entrepreneur at heart who wants to play a key role in building AI awesomeness using a petabyte of robust data on servers our company owns. Hard code to cold metal.\n… A true collaborator who enjoys working with a small team of distributed engineers in a fast-paced live code production environment.\n… A contributor to the Python open source community (a plus!)<p>Sometimes, starting as an underdog gives you something to prove and a challenge that only serves to make you stronger. We still have a lot to prove and still thrive on challenge. Demand is growing and so is our team. On target to double in size in 2019, we invite those who love a good challenge to join us on our mission to solve hiring.<p>TO APPLY: Take the HS Challenge at <a href=\"https:&#x2F;&#x2F;challenge.hiringsolved.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;challenge.hiringsolved.com&#x2F;</a>","time":1547410390,"type":"comment"}