{"by":"lylo","id":9303594,"parent":9303396,"text":"FreeAgent - Edinburgh or REMOTE (within UK) - Full Time<p>We&#x27;re looking for software engineers of all levels to come and work on our flagship product FreeAgent (<a href=\"http:&#x2F;&#x2F;www.freeagent.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.freeagent.com</a>). We&#x27;re a growing team of 75, based in Edinburgh but with remote staff around the UK (5 engineers are fully remote).<p>We have a lot of happy customers (40,000+, NPS=75!), a lot of traffic (13 million+ page views&#x2F;mo), and some lovely staff to work alongside, learn from and have fun with (<a href=\"http:&#x2F;&#x2F;www.freeagent.com&#x2F;company&#x2F;about-us\" rel=\"nofollow\">http:&#x2F;&#x2F;www.freeagent.com&#x2F;company&#x2F;about-us</a>). We invest a lot of time in our platform (code health, scalability, security) as well as working on new features, which is nice.<p>Our engineers tend to be full stack, but we’re seeing people move towards more specialist work these days, such as front-end programming (we&#x27;re doing a lot of React.js, primarily on our iOS app), our real-time accounting engine, data science. People play to their strengths really. Our stack is intentionally straightforward. It&#x27;s sensible and sustainable. Javascript aside, we mainly write Ruby alongside MySQL, RabbitMQ, Elasticsearch, Puppet.<p>We are looking for <i></i>UK-based<i></i> full-time staff right now, but I&#x27;d also be interested to chat to <i></i>UK-based<i></i> freelancers interested in a longer-term contract (e.g. 12 months+).<p>jobs@freeagent.com<p><a href=\"http:&#x2F;&#x2F;www.freeagent.com&#x2F;company&#x2F;jobs&#x2F;senior-software-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;www.freeagent.com&#x2F;company&#x2F;jobs&#x2F;senior-software-engine...</a><p><a href=\"http:&#x2F;&#x2F;www.freeagent.com&#x2F;company&#x2F;jobs&#x2F;software-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;www.freeagent.com&#x2F;company&#x2F;jobs&#x2F;software-engineer</a>","time":1427897038,"type":"comment"}