{"by":"latitude","id":9303484,"kids":[9303503],"parent":9303396,"text":"Pipemetrics - Lausanne, Switzerland - Local only<p>Senior developer, C &#x2F; C++ &#x2F; Windows<p>Looking for experienced developers to help expanding our existing product into a suite of complimentary products and services (<a href=\"https:&#x2F;&#x2F;bvckup2.com\" rel=\"nofollow\">https:&#x2F;&#x2F;bvckup2.com</a>).<p><pre><code>  --\n</code></pre>\nBasic requirements - Solid C&#x2F;C++ with a focus on producing lean and efficient code; considertable experience developing and shipping software for the Windows platform.<p>Good to have - Knowing one&#x27;s way around Linux, both the development toolchain and the shell; PHP, JS, SQL; people skills for communicating with users.<p>Nice to have - Embedded and kernel development experience.<p>Ideally, you should be reasonably comfortable with all elements of a system that allows controlling a Windows app through an externally hosted web interface - from Windows, through the network to the PHP&#x2F;SQL backend to the HTML&#x2F;JS web frontend.<p><pre><code>  --\n</code></pre>\nThe company is built around the notion of &quot;doing one simple thing, but doing it really well.&quot; This doesn&#x27;t mean creating simplistic software, but rather having a single primary function that captures one specific user need and then providing a host of supporting features to make things simple and convenient. This is a fairly alien approach on Windows where the software still tends to compete on the length of the feature list first and foremost. However, the good news is that there is a substantial demand for simpler, but better-made software. This is what we do.<p>Prior to founding Pipemetrics, I was the principal person behind Hamachi VPN service (<a href=\"http:&#x2F;&#x2F;swapped.cc&#x2F;hamachi\" rel=\"nofollow\">http:&#x2F;&#x2F;swapped.cc&#x2F;hamachi</a>).<p><pre><code>  --\n</code></pre>\nGet in touch - hello-at-pipemetrics.com &#x2F; alex-at-pipemetrics.com","time":1427896211,"type":"comment"}