{"by":"jackfoxy","id":9303447,"parent":9303396,"text":"Tachyus - San Mateo, CA - 4 open positions<p>We are revolutionizing the oil and gas industry, very well funded, have begun selling our product, and are looking for the right people to share in ownership. Tachyus is the most fun and rewarding environment you will ever work in. We work with real physical devices and processes in technology and the natural world. You will work closely with 3 PhDs, 2 Masters of Science, and 4 Microsoft MVPs. We take our Values statement seriously, so read it first and decide. <a href=\"http:&#x2F;&#x2F;tachyus.com&#x2F;whoweare&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;tachyus.com&#x2F;whoweare&#x2F;</a><p>Data Physicist, <a href=\"http:&#x2F;&#x2F;tachyus.com&#x2F;joinus&#x2F;data-physicist.html\" rel=\"nofollow\">http:&#x2F;&#x2F;tachyus.com&#x2F;joinus&#x2F;data-physicist.html</a><p>Our data physics team develops algorithms to handle disparate data sets and provide intelligence critical to field operations. You command a detailed scientific understanding of the way the world works to constrain a problem space and arrive at real-world insight quickly. You bring your experience doing quantitative analysis (data science) and physical modelling as well as intense intellectual curiosity demonstrated by past projects and experiences. You must love digging for wisdom in large, complex data sets and possess fluency in a language commonly used for scientific technical computing (Mathematica, MatLAB, Python, etc).<p>Data Engineer, <a href=\"http:&#x2F;&#x2F;tachyus.com&#x2F;joinus&#x2F;data-engineer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;tachyus.com&#x2F;joinus&#x2F;data-engineer.html</a><p>The successful candidate is an engineer with strong computer software skills, including database and SQL skills, programming experience in at least one modern language (Java, C#, F#, C++, etc.), and strong math and statistics skills, preferably including experience using R, SAS, Mathematica, Matlab, or scientific computing in Python. The Data Engineer draws on data science and statistics skills to analyze inbound data, assess its quality, and decide whether it’s fit for consumption by Tachyus algorithms. Along the way, he&#x2F;she uses those same skills to build tools for automating data acquisition, cleaning, quality analysis, and ongoing reporting of those metrics, exceptions, and other statistical information.<p>Senior Front End Engineer, <a href=\"http:&#x2F;&#x2F;tachyus.com&#x2F;joinus&#x2F;senior-front-end-engineer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;tachyus.com&#x2F;joinus&#x2F;senior-front-end-engineer.html</a><p>The Tachyus platform provides rich data visualization and analysis capabilities in the browser using D3 and Kendo UI. We build our front-end applications in JavaScript and are in the process of transitioning parts to TypeScript. We believe in functional programming and strong typing. The ideal candidate has deep experience building web applications using the single-page application (SPA) paradigm and feel comfortable reading our back-end F# code to understand the mechanics of the APIs consumed by the front-end. Lots of opportunities to work on interesting visualizations including geographic applications.<p>Correctness Engineer, <a href=\"http:&#x2F;&#x2F;tachyus.com&#x2F;joinus&#x2F;correctness-engineer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;tachyus.com&#x2F;joinus&#x2F;correctness-engineer.html</a><p>The Correctness Engineer is an amalgam of Software Engineer and Quality Engineer who (with help from subject matter experts and the Science team) develops and manages the artifacts and processes that ensure the correctness of all Tachyus products and services. These include (but are not limited to) the Test Infrastructure, Test Data Sets, Test Plans, Test Scenarios&#x2F;Cases, Automated Tests and Gap Analyses. The successful Correctness Engineer recognizes the importance of conducting the role as an engineering discipline and not a “quality control” process. You must have have an understanding of functional programming and modern tools like QuickCheck&#x2F;FsCheck. Experience with F# is a plus.","time":1427895952,"type":"comment"}