{"by":"kod","id":9303552,"parent":9303396,"text":"Kixer (<a href=\"http:&#x2F;&#x2F;kixer.com&#x2F;jobs&#x2F;devops&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;kixer.com&#x2F;jobs&#x2F;devops&#x2F;</a>) Austin, TX area, full-time, DevOps<p>We believe DevOps is about automation to improve productivity, reduce risk, and achieve scale. DevOps engineers should always be striving to deprecate themselves. However, DevOps is not limited to one team. It is something that is cultural and the responsibility of all engineering.<p>About You\nYou love building things.  You are one of those individuals who love making things go faster, graphs go up and being clever about how you do it. Most of what you do on a daily basis is work w&#x2F; a diverse set of technologies to brainstorm, automate and refine the Kixer platform.  The stack is built on Spark, Scala, C, C++, Node.js, PHP, MySQL, Redis, Kafka and AWS.<p>You have worked with teams on large-scale projects, on multiple different languages and like experimenting with new technologies.  You also understand the realities of CAP theorem and how to design systems in distributed manner across hundreds of servers.<p>You get things done. You know how to walk the line of having sound practices while still knowing when something is good enough.  At Kixer, the work you do will have a disproportionate impact on the business.\nYou love setting your own course.  At Kixer, most of the week is “blacked out” for engineering.  Which means no meetings are allowed to be scheduled.  You get to make things happen without someone saying so.<p>Things You Might Do\nKixer is a startup, so you’ll get to play in a little bit of everything.  That being said, here are some things you’ll get to lead:\nWork on technologies of all flavors\nScaling the production systems to deal w&#x2F; multiple billion impressions\nArchitecture direction, build out, and maintenance of the Kixer platform\nExperimentation with new technologies and techniques to in infrastructure automation\nDevelop tools that make life easier for all of engineering<p>About Kixer\nKixer helps app developers get installs through making app recommendations on mobile websites (like TMZ, IGN, and Slashdot).  These recommendations are done through user insights garnered through analysis of massive amounts of data.","time":1427896717,"type":"comment"}