{"by":"trumbitta2","id":9304165,"parent":9303396,"text":"Inpeco - Science and Technology Park of Sardinia, Building 8, Pula (CA), Italy<p>Hello, I&#x27;m a frontend developer ad Inpeco ( <a href=\"http:&#x2F;&#x2F;www.inpeco.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.inpeco.com&#x2F;</a> ). We currently have a couple openings.<p>If interested, you can send your CV and &#x2F; or LinkedIn profile to my boss at riccardo.triunfo@inpeco.com<p>== Backend Software Engineer ==<p>You will be responsible of software implementation and code maintenance for healthcare devices built by Inpeco. You should have high attention to detail, strong teamwork, and be willing to learn new technologies.<p>Requirements: <p><pre><code>  - You are fluent in multiple programming languages (object oriented and&#x2F;or functional)\n  - You have gained at least three years of relevant and demonstrable work experience\n  - You have good understanding of system design, data structures and algorithms\n  - You are passionate and eager to learn new programming languages and technologies\n  - You have a good experience with Linux&#x2F;Unix systems\n  - You have experience with SQL&#x2F;noSQL databases \n  - You have good experience with distributed VCS and bug tracking tools\n  - You have experience with software testing\n  - You have good knowledge of English language\n  - You are capable of writing good technical documentation\n</code></pre>\nDesiderata:<p>Experience with Python, the Django framework, RESTful APIs, event-driven programming, experience with the main clinical standards (HL7, IHE) and the regulations related to software development in healthcare<p>Responsibilities:<p>Design, develop and deploy applications across a variety of devices and OS environments. Code primarily using Python. Work with technologies like Django, oAuth, Elasticsearch. Work in an agile environment collaborating with the team using scrum&#x2F;kanban methodologies. Be proactive in collaborating with the other colleagues.","time":1427900544,"type":"comment"}