{"by":"theflyingkiwi42","id":9304631,"parent":9303396,"text":"17hats - Pasadena, CA - Senior Dev&#x2F;Ops Engineer with humor\nFull time - remote ok\n<a href=\"https:&#x2F;&#x2F;17hats.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;17hats.com&#x2F;</a><p>We are looking for someone to join our team to help develop, build, and maintain our product, with just enough Ops work to keep everything running smoothly. If you’re passionate about performance and reliability, we&#x27;d love to chat!<p>17hats is an online service designed to help tame the chaos of running a small business by combining invoicing, customer quotes, contracts, to-do lists, client contacts, bookkeeping and more into one easy-to-use app. Rather than repeat all the stuff that makes 17hats so nifty, head on over to our website and check it out: <a href=\"http:&#x2F;&#x2F;www.17hats.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.17hats.com</a><p><pre><code>  Dev Skills:\n  - As much JS as possible (Knockout, Sammy, jQuery, etc)\n  - As much Perl as possible (Moose, DBIC, Plack, etc)\n  - HTML, REST, JSON, etc\n  - Excellent debugging skills\n\n  Ops Skills:\n  - EC2, OpsWorks\n  - Enough Chef to keep things running\n  - A bit of Ruby helps\n  - All the usual Linuxy things: bash, postfix, apache, proftpd, mysql, memcached, beanstalkd, perl, git\n\n  Other Skills:\n  - Jedi Mind Trick (naturally), Invisibility (just for fun), Vulcan Nerve Pinch (in case things get dicey), Cooking a perfect Beef Wellington (a man&#x27;s gotta eat!), knows the airspeed velocity of an unladen swallow \n\n  Personality:\n  - Simplicity enthusiast &#x2F; problem solver (find the simplest solution to a problem)\n  - Greater good &#x2F; no ego (what&#x27;s best for the team, not for personal gain)\n  - Sense of humor (the glue that keeps us working together harmoniously)\n  - Humble &amp; open minded (always open to new ideas and approaches)\n</code></pre>\nE-mail us at jobs@17hats.com if you are interested!","time":1427904311,"type":"comment"}