{"by":"flyhighplato","id":9304724,"parent":9303396,"text":"Chicago, IL or REMOTE - Full Stack Engineer @ Spantree - <a href=\"http:&#x2F;&#x2F;www.spantree.net\" rel=\"nofollow\">http:&#x2F;&#x2F;www.spantree.net</a><p><pre><code>    Web Front End: Angular, Backbone, React \n    Web Back End: Spring Boot, Grails\n    Data Stores: Elasticsearch, Postgres, MongoDB, Redis, Couchbase, Neo4J\n    Clustered Systems: Mesos, Marathon \n    Systems Management: AWS, Docker, Docker Compose (Fig), Vagrant, Puppet \n    Build Automation&#x2F;CI: Gradle, Grunt, CircleCI, Jenkins, Sonar\n    Test Automation: Spock, Selenium, Mocha, Jasmine\n</code></pre>\n<i>Who we are</i><p>============<p>Spantree is a boutique software engineering firm based in Chicago, with some members scattered around the western hemisphere. We&#x27;re looking for an engineer who&#x27;s not afraid to tinker and break things.  You should enjoy solving tough problems, coming up with novel solutions and delivering a polished product.<p>We&#x27;re a small team with a fairly flat organizational structure.  Everyone has specialties, but everyone is encourage to work on every aspect of a project.<p>We love sharing and open source.  We constantly hunt for better and smarter ways to do things. And, since we&#x27;re often pushing our software and our systems, you should feel comfortable communicating with developers in the open source community.  Pull requests to open source projects are highly encouraged.<p><i>What we work on</i><p>==============<p>Our clients range from small and scrappy startups to large enterprise companies. We have 3-7 projects going at any point in time. We tend to focus on greenfield development, building web applications from the ground up. We also work on integrating the old with the new, bringing technologies like Mesos, Elasticsearch and Drools to large companies. Helping people make better decisions is the central theme of most of our projects. This can take the form of a search engine to help people find interesting stuff to do on a Saturday night, a complex rules-oriented workflow management system for evaluating health insurance claims, helping people find the right doctor, or a matchmaking and scheduling system to help people book face-to-face meetings at conferences. In the next year or two, we also plan to get into product development, taking our experiences solving the same sort of problems for multiple clients and rolling them into a generic framework which we plan to open source and support directly for our clients and the rest of the world.<p><i>Contact us</i><p>==========<p>Drop us a line at jobs@spantree.net and tell us a bit about yourself. If you have a resume or CV, feel free to pass that along as well. Github and LinkedIn profiles are also helpful. We&#x27;re looking forward to hearing from you!","time":1427905103,"type":"comment"}