{"by":"nshiftan","id":9304873,"parent":9303396,"text":"New York City &#x2F; Seattle &#x2F; Philadelphia -- Curalate<p>Curalate is looking for talented full-time software developers to join our team.  Our team today is deep in the trenches -- tackling some of the gnarliest problems out there at the intersection of computer vision and big data -- and we&#x27;re looking for a few great engineers to join us.<p>Responsibilities:<p>You&#x27;ll be expected to dive into our stack and toolkit, and start shipping code on day one. We&#x27;re not hiring code monkeys; you&#x27;ll be given substantial feature ownership, and we&#x27;ll expect you to contribute product ideas as well as code.<p>We&#x27;re not language zealots; we believe in using the right tool for the job, and are comfortable with a polyglot codebase. That said, today we lean on:<p>* Languages: Scala, Javascript<p>* Frameworks: Storm, Lift, Scalatra<p>* Infrastructure: AWS<p>* Databases: Cassandra, MySQL (RDS), DynamoDB, Redis, Memcached<p>* Front End: Angular, jQuery, Bootstrap<p>(Production experience with any of these technologies is not required. However, candidates will, at a minimum, want to have experience with an object-oriented language like Java, C++, or C#).<p>About Us:<p>Curalate is the leading marketing and analytics suite for the visual web and a partner to more than 500 of the world’s most-loved brands. We’re a passionate team of visual thinkers, makers, and storytellers dedicated to helping brands create authentic connections with consumers through images. And we’re building something really powerful.<p>Much like the brands we work with, our people are nothing short of inspiring – and we’re looking to grow our team. If you’re scrappy, creative, curious, and FUN, then we think Curalate could be the place for you.<p>Full details can be found at <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;curalate&#x2F;jobs&#x2F;48681\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;curalate&#x2F;jobs&#x2F;48681</a>. No recruiters, please.","time":1427906363,"type":"comment"}