{"by":"atto","id":9304029,"parent":9303396,"text":"Kifi (<a href=\"http:&#x2F;&#x2F;www.kifi.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.kifi.com&#x2F;</a>) - Mountain View, CA (H1B okay, prefer already in the area) - Front-end, backend, ML, etc. Full list: <a href=\"https:&#x2F;&#x2F;www.kifi.com&#x2F;about&#x2F;join_us\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kifi.com&#x2F;about&#x2F;join_us</a><p>We&#x27;re a social network for knowledge, bringing you the things you should know, based on who you are. VentureBeat wrote about our vision recently: <a href=\"http:&#x2F;&#x2F;venturebeat.com&#x2F;2015&#x2F;03&#x2F;10&#x2F;a-new-company-fighting-the-meaningless-cycle-of-clicks-and-likes&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;venturebeat.com&#x2F;2015&#x2F;03&#x2F;10&#x2F;a-new-company-fighting-the...</a><p>We use Scala, Lucene, Akka, Play Framework, browser extensions, AngularJS, Gulp, etc.<p>• Front-end Engineer<p>Build the desktop product, creating an excellent user experience &amp; easy-to-use product.<p>You: Highly proficient in JS and HTML&#x2F;CSS; Well versed in HTTP semantics and web API design principles; Comfortable learning&#x2F;using new web technologies to build rich applications (think MutationObservers, CSS Transforms, SVG …)<p>• Mobile engineer<p>Design and build high quality, modern consumer mobile user experiences. It&#x27;s our fastest growing market.<p>You: Prior iOS or Android experience; Passionate about user experience<p>• Machine Learning &#x2F; Information Retrieval Engineer<p>Using a massive amount of user events, analytics data, social graphs and web documents, you will build a new breed of ML and IR systems with tight throughput and latency requirements.<p>You: Proficient in at least one JVM language and can easily pick up Scala; Passion for elegant and efficient algorithms and data structures; Experience with implementing high quality ML&#x2F;IR systems<p>If you&#x27;re interested, the best contact address is careers@kifi.com, or direct: andrew@kifi.com","time":1427899808,"type":"comment"}