{"by":"jessmartin","dead":true,"id":9304043,"parent":9303396,"text":"Head of Data Infrastructure | First Leads | Durham, NC or Remote<p>== Who we are ==<p>We&#x27;re reshaping the way realtors find their next client. We find people who are interested in buying or selling their home _before_ they start looking for a realtor and we connect them with the best realtor.<p>We&#x27;re building a new kind of data engine, one that combines data from dozens of sources and is capable of highly accurate correlation. We achieve this by leveraging the best of algorithms and humans together through unique workflows.<p>We&#x27;ve got a healthy seed round, and are already booking revenue.<p>I&#x27;m the CTO and co-founder - give me a shout if you&#x27;re interested in solving some really interesting data problems: jess@firstleads.net<p>== What you will do ==<p>You&#x27;ll be a core leader on our rapidly growing team.<p>You&#x27;ll work closely with managed workforce providers to engineer new ways of integrating human intelligence via API. Basically, you&#x27;ll innovate and improve on ideas present in Amazon&#x27;s Mechanical Turk and apply it to particular problem domains.<p>Architect and implement a highly-scalable data aggregation and correlation platform. You’ll solve genuinely new challenges by rewriting First Lead&#x27;s data infrastructure workflows from scratch, blending algorithmic approaches and a managed workforce.<p>You&#x27;ll also own the majority of our operational infrastructure on which we&#x27;re constructing unique product offerings. You&#x27;ll drive key strategic decisions about our system architecture and deployment. Together with the CTO, you&#x27;ll discuss tradeoffs around technical debt, incoporate new technologies when significant leverage is demonstrated, and craft a consistent, comprehensible, maintainable system.<p>You&#x27;ll hire a team that codes, scales, and supports our rapidly growing data engine. You&#x27;ll be on the lookout for areas of our system that can be cleanly separated out and contributed to the open source community. You&#x27;ll be a thought leader in our industry, with deep, applied knowledge in the area of integrating humans and algorithms.<p>Within 3 Months, You&#x27;ll: (a) Deeply understand the existing capabilities of our data engine, (b) Fully own the development roadmap for the data engine, and (c) Implement and extend the core functionality to support multiple new data sources.<p>Within 6 Months, You&#x27;ll: (a) Integrate with a managed workforce provider to scale up our human-powered intelligence stations, (b) Participate in product design discussions mapping out novel ways to utilize our data to improve realtor lead generation processes, and (c) Hire and train 1-2 software developers to scale up the buildout of the data engine.<p>Within 12 Months, You&#x27;ll: (a) Facilitate the creation of statistical models around our data engine to better predict when intent data will connect with a purchasing decision, (b) Manage and grow a team of data scientists to build out our statistical models, and (c) Oversee continued development of the systems and train the team on best practices.","time":1427899904,"type":"comment"}