{"by":"wonjun","id":9304752,"parent":9303396,"text":"Sprout - <a href=\"http:&#x2F;&#x2F;sproutatwork.com\" rel=\"nofollow\">http:&#x2F;&#x2F;sproutatwork.com</a> - Toronto, Canada<p>Role: Full-stack JavaScript Developer (Angular, PhoneGap)<p>Sprout is seeking for a super smart, talented and energetic full-stack JavaScript developer to join our growing product team! You will play a key role in supporting Sprout’s mobile development using latest web and mobile development technologies and frameworks. You will do this by working closely with other product team members bringing new services and capabilities to life. If you’re passionate about changing today’s workplace culture, love to code, enjoy helping a team create great work – you will love working with us at Sprout!<p>You will be involved in the full life cycle development from start to finish and responsible for:<p>- Designing and implementing features for Sprout&#x27;s hybrid mobile applications for Android, iOS and other mobile platforms<p>- Owning end-to-end features (including design, development, testing, etc)<p>- Managing scope, providing solid estimates, and delivering exceptional results<p>- Developing and maintaining clear documentation (e.g., design and feature specs, test cases)<p>- Collaborating with QA and other developers to fix issues and maintain the applications<p>- Going beyond the predefined technologies and suggesting new tools, frameworks and systems<p>- Finding creative ways to enhance product features while writing less code<p>- Identify process inefficiencies and find ways to save time on tasks through automation<p>As an ideal candidate, you have:<p>- Developed or substantially contributed to the development of mobile apps using Phonegap<p>- 3+ years of experience developing in Javascript (not jQuery), HTML5 and CSS<p>- Experience with AngularJS and Ionic (preferably) or another similar framework<p>- Familiarity with agile, iterative design processes<p>- Keen attention to detail<p>- Experience operating in a fast paced, startup environment (ie. working autonomously, needing little direction, comfortable with ambiguity, etc.)<p>- Can do, positive attitude\n- Bachelor’s degree in computer science, computer, software engineering or relevant proven experience and knowledge\nPassion about wellness, fitness and transforming current workplace culture<p>You can apply by email to: wj.bae@sproutatwork.com<p>We are also looking for QA&#x2F;Release Engineers, more details at <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs2&#x2F;view&#x2F;35911026?trk=vsrp_jobs_cluster_name&amp;trkInfo=VSRPsearchId%3A64004371427905626054%2CVSRPtargetId%3A35911026%2CVSRPcmpt%3Ajobs_cluster\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs2&#x2F;view&#x2F;35911026?trk=vsrp_jobs_c...</a>","time":1427905351,"type":"comment"}