{"by":"waltish","id":9304565,"parent":9303396,"text":"Baltimore, Maryland, USA | We&#x27;re hiring for an interactive designer position in an established daily newsroom. You almost certainly must have at least two years of LAMP stack development experience AND a journalism degree to be considered for this role. We are only likely to consider exceptions if you have at least 3 years of experience coding news-focused LAMP applications in a newsroom setting -- all others will almost certainly be discarded.<p>Our development projects regularly take on topics like police brutality, government corruption and corporate mismanagement, meaning that the candidate we hire will care as much about security of our apps and the integrity of our journalism as the visual niceties of the code.<p>That means pushing back robustly if someone wanders in from outside the newsroom with a request to &quot;make some advertorial content look better.&quot; This is a newsroom job, and we will expect you to help enforce the distinction between editorial and advertising content.<p>It also might mean coaching reporters on topics like PGP or databases occasionally when they ask, or sending them along to someone who knows the answer if there&#x27;s not a ready solution at hand. Don&#x27;t worry -- our team has at least three other coders (or more, depending on your criteria) who will support you on a lot of this stuff. These questions can be a lot of fun, though, since they usually mean there&#x27;s a great investigative story of some sort in the works.<p>Repeating: You almost certainly must have at least two years of LAMP stack development experience AND a journalism degree to be considered for this role. We are only likely to consider exceptions if you have at least 3 years of experience coding news-focused LAMP applications in a newsroom setting -- all others will almost certainly be discarded.<p>Still reading after all that? Good. Here&#x27;s the description.<p><a href=\"http:&#x2F;&#x2F;www.journalismjobs.com&#x2F;job-listings&#x2F;1616820\" rel=\"nofollow\">http:&#x2F;&#x2F;www.journalismjobs.com&#x2F;job-listings&#x2F;1616820</a>","time":1427903855,"type":"comment"}