{"by":"academiaedu","id":9305752,"parent":9303396,"text":"Academia.edu | <a href=\"https:&#x2F;&#x2F;www.academia.edu&#x2F;hiring\" rel=\"nofollow\">https:&#x2F;&#x2F;www.academia.edu&#x2F;hiring</a><p>Full Time Generalists and Front End Engineers | Downtown San Francisco (near the Montgomery BART Station)<p>We have a very agile group of 12 engineers at Academia.edu in Downtown SF. I joined them because I really respect the problems that they are working on. Are you aware of how inefficient, inaccurate, slow and costly, scientific publishing is?  In fact, the vast majority of peer-reviewed scientific research that gets published is actually not reproducible.  Imagine a world where scientists can share their research more quickly, obtain greater peer-review coverage, and innovate faster. I joined because I wanted to contribute to building this disruptive Open Science platform.<p>Below you can find some more info about the company and the general mission of Open Science below if you&#x27;re interested in the subject.<p>The tech stack here consists of Rails, Coffeescript, Backbone, PostgreSQL, hosted on AWS. I&#x27;d like to tell you more about our team so ping me at hiring[at]academia.edu so we can set up a quick call.<p>More about the company:<p>According to EdTech Magazine we are tech underdogs who are “key disruptors among open-access publishers.”<p><a href=\"http:&#x2F;&#x2F;www.edtechmagazine.com&#x2F;higher&#x2F;article&#x2F;2014&#x2F;06&#x2F;open-access-journal-underdogs-take-aging-academic-publications\" rel=\"nofollow\">http:&#x2F;&#x2F;www.edtechmagazine.com&#x2F;higher&#x2F;article&#x2F;2014&#x2F;06&#x2F;open-ac...</a><p>And we are viewed by Wired as “a key player in the movement toward open access scientific publishing.”<p><a href=\"http:&#x2F;&#x2F;www.wired.com&#x2F;2014&#x2F;07&#x2F;incentivizing-peer-review-the-last-obstacle-for-open-access-science&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.wired.com&#x2F;2014&#x2F;07&#x2F;incentivizing-peer-review-the-l...</a><p>We have 18MM users who support our mission and we are growing 10% per month.  We are financially backed with $17MM by top VCs including Khosla Ventures, True Ventures and Spark Capital.","time":1427913081,"type":"comment"}