{"by":"eli","id":9305236,"parent":9303396,"text":"Interns - Chinatown, Washington, DC - Industry Dive<p>====================================================<p>Industry Dive is a mobile-focused B2B media company that provides business leaders with news and intelligence that makes them smarter at their jobs. Corporate site: <a href=\"http:&#x2F;&#x2F;www.industrydive.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.industrydive.com&#x2F;</a> Example news site: <a href=\"http:&#x2F;&#x2F;www.utilitydive.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.utilitydive.com&#x2F;</a><p>We are hiring interns in a variety of areas. Our internships are more like apprenticeships; you work on real projects with minimal busywork. Some of the people managing teams at Industry Dive today, started as interns two years ago.<p>DEVELOPER INTERN: Our primary codebase is Python&#x2F;Django, but prior Python experience is not a requirement. Interest or experience in mobile development a plus. HTML&#x2F;CSS design skills a plus.<p>EDITORIAL INTERN: Original writing and reporting -- opportunities to get by-lined work published. Work with a talented team of writers and editors to develop story ideas and pitches.<p>DESIGN INTERN: We&#x27;re always looking for smart, talented designers to intern. Work with HTML&#x2F;CSS&#x2F;JS on a daily basis. Impress our readers by taking the UI of our news sites to the next level.<p>DIGITAL MARKETING INTERN: Help us build our audience by developing and implementing marketing strategies that involve email, social, SEO, and PPC.<p>More info and other jobs here <a href=\"http:&#x2F;&#x2F;www.industrydive.com&#x2F;company&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.industrydive.com&#x2F;company&#x2F;jobs&#x2F;</a> email me with any questions eli.at.industrydive.com  (Apologies if you applied previously and haven&#x27;t heard back from me, I&#x27;ve been backlogged. I will get to your email this week, but feel free to apply again.)","time":1427909070,"type":"comment"}