{"by":"danwirestorm","id":9305568,"parent":9303396,"text":"SR. SOFTWARE PROJECT MANAGER (Engineering) WIRESTORM<p>Portland Oregon or Santa Monica CA<p>$100k- 140k plus plus<p>Wirestorm’s solutions team has doubled in size in the last six months and plans to double again. We develop web tools and apps for huge audiences with a goal to craft beautiful interactions between people and technology.  If you are looking for a fun and challenging opportunity to grow and work with some of the best and brightest, then shoot us an email and let&#x27;s talk.<p>This is a highly visible role that requires you to coordinate across teams, mitigate risks and balance business needs with technical constraints.<p>RESPONSIBILITIES\n•\tManage software design and development by applying consistent standards and practices to produce and maintain high quality software products applications. \n•\tContributes to the strategic direction for product development through effective interactions with staff and management.  \n•\tWorking with customers to understand extremely diverse end-user needs and operational contexts.  Translate those needs into functional system and engineering requirements, building an implementation strategy. \n•\tWorking with customers, stakeholders, and management to formalize software development requirements, prioritize team tasks, and align personnel and resources to projects accordingly\n•\tAdapting to changing priorities which result in the delivery of proven solutions.\n•\tApplying program management and life cycle management principles and methods to plan and execute complex assignments; develop new methods, approaches, and procedures; estimate resource requirements; plan and implement project schedules; define milestones and deliverables; \n•\tMonitor and report weekly status of activities; brief customers and leadership on project activities; formulate effective alternatives as needed; and evaluate and report accomplishments.<p>If interested in checking us out send your resume to Dan@wirestorm.us  and let us know when is the best time to talk.","time":1427911606,"type":"comment"}