{"by":"kapnobatairza","id":9306099,"parent":9303396,"text":"Max2 Inc - New York, NY<p>Hi! We are Max2 Inc. - the makers of the Scene app: <a href=\"http:&#x2F;&#x2F;www.sceneapp.io\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sceneapp.io</a><p>We are building a way to generate and surface real-time information about places around you - Think of it as &quot;Waze&quot; for places. This is our entry point as part of a larger grand plan to become a bigger player in the mobile local commerce space.<p>We are small, close knit team of 7 developers (1 devops, 3 backend, 2 frontend, 1 floater) and 3 bizdev people. We are still in the very early phases of developing our product, and have spent most of our focus on our back-end and infrastructure.<p>We are looking for some really talented UI&#x2F;UX designers to get us to the next level and round us out. We especially need designers that are adept as visualizing data streams, but are also generally looking for interface designers who are familiar with the latest trends but are not afraid to think outside the box.<p>We are also looking for an iOS front-end developer who can work with both Objective-C and Swift.<p>We are a startup in the true sense of the word - We don&#x27;t have project managers or set working hours. We are looking for people who can be self-motivated and take ownership of tasks assigned to them. You won&#x27;t just be handed down requirements or directives, but will be asked to be a part of the decision making process behind them. Basically, we want people that want to be a part of building a startup, not just work for one.<p>We are well capitalized&#x2F;backed, so we can offer competitive wages on top of an equity stake. We offer full medical&#x2F;dental&#x2F;vision and an awesome informal working environment in a small brownstone we fully occupy in Manhattan.<p>If this sounds like the sort of thing you might be interested in, reach out to me at michael@max2.com.<p>Michael Salmasi\nCo-founder and CEO","time":1427915857,"type":"comment"}