{"by":"zacwitte","id":9306142,"parent":9303396,"text":"HandUp - <a href=\"https:&#x2F;&#x2F;handup.org\" rel=\"nofollow\">https:&#x2F;&#x2F;handup.org</a> - San Francisco<p>=== Senior Product Designer ===<p>HandUp is looking for a senior product designer who is excited about leading the future of direct charitable giving in the US.  The product design lead is responsible for executing on all stages of the design process: from concepts, to user testing, to wireframes, to visual design. This role sits at the center of the team and requires close collaboration with marketing, business, engineering, and HandUp users. You should enjoy initiating small, quick experiments to validate ideas and assumptions. At the same time, you must be able to take charge of large projects, and incorporate feedback from multiple stakeholders.\nWe’re a fast growing company that’s passionate about social change and are looking for candidates who share those values. As a senior teammate, we’re looking for someone with three or more years of product leadership experience and comfort in the startup environment. Our long-term mission is big - to leverage technology and the power of human relationships to fight urban poverty. We come to work every day excited to build tools that directly affect those most in need.<p>As senior product designer you will<p>* lead concept design to test and validate product ideas<p>* seek and incorporate feedback from multiple stakeholders<p>* carry design ideas through to prototypes<p>* work with engineers on a daily basis to ensure we ship \nthe right solutions<p>* conduct user research and closely monitor site metrics<p>* manage product and copy feedback process and style consistency<p>Job criteria<p>* 3+ years experience on a product design team covering multiple roles (PM, User Research, UI&#x2F;UX, Visual)<p>* comfortable and flexible in a fast changing environment<p>* passion for social change<p>* comfortable in html&#x2F;css&#x2F;js<p>Bonus<p>* experience in crowdfunding and&#x2F;or social good technology<p>=== About HandUp ===<p>At HandUp, we believe that we’re all better off in a society where everyone can meet their basic needs. That’s why we created our company - to leverage technology and the power of human relationships to fight urban poverty. We come to work every day excited to build tools that directly affect those most in need. We’re a fast growing company that’s passionate about social change and are looking for candidates who share those values.<p>=== Compensation ===<p>$80k - $120k and 0.25% - 0.75%<p><a href=\"https:&#x2F;&#x2F;angel.co&#x2F;handup&#x2F;jobs&#x2F;48003-senior-product-designer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;handup&#x2F;jobs&#x2F;48003-senior-product-designer</a>","time":1427916224,"type":"comment"}