{"by":"andreasklinger","id":9306238,"parent":9303396,"text":"Product Hunt - www.producthunt.com - San Francisco&#x2F;Remote - Lead iOS Engineer<p>--------------------------------------------------------------------------------------------<p>Imagine if reddit and the appstore would have a baby - that&#x27;s Product Hunt<p>Mobile will soon be our most important platform and in 5 years from now we wont &quot;install&quot; apps. We wont &quot;open&quot; apps. How will our app look then? We are looking for someone who wants to have a say in this future.<p>The role is essentially an hybrid between Product Owner of the mobile app and the Lead Engineer that brings in structure to the team.<p>Given that the role has a big part in product design, it&#x27;s easier if this person is in SF. That being said the majority of our team is remote (no further than Eastern Europe). Consider also applying if you are &quot;close enough to SF&quot; that you could come by regularly.<p>There are more details on the role here: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;product-hunt&#x2F;jobs&#x2F;47947-lead-ios-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;product-hunt&#x2F;jobs&#x2F;47947-lead-ios-engineer</a><p>But in a nutshell:<p>* Strong opinion on codestyle, structure, automated processes, product building<p>* Being able to learn from and enable others<p>Everyone in the team works quite autonomous and we value maker craftman ship highly.<p><a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;rrhoover&#x2F;status&#x2F;540950035827916800\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;rrhoover&#x2F;status&#x2F;540950035827916800</a> (we also do livestreamings to brainstorm with the community on upcoming or about-to-release features)<p><a href=\"https:&#x2F;&#x2F;medium.com&#x2F;on-startups&#x2F;the-artifacts-of-product-hunt-11682e9e01dd\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;on-startups&#x2F;the-artifacts-of-product-hunt...</a><p><a href=\"https:&#x2F;&#x2F;medium.com&#x2F;@rrhoover&#x2F;we-fucked-up-9163151c9166\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;@rrhoover&#x2F;we-fucked-up-9163151c9166</a><p>To apply simply email me andreas()producthunt.com - or use angellist if that&#x27;s easier for you :)<p>Will be around this thread - ask me anything.","time":1427917064,"type":"comment"}