{"by":"zacwitte","id":9306184,"parent":9303396,"text":"HandUp - <a href=\"http:&#x2F;&#x2F;handup.org\" rel=\"nofollow\">http:&#x2F;&#x2F;handup.org</a> - San Francisco<p>=== Senior Full Stack Engineer ===<p>We’re looking to hire a second engineer to join our team of five working to fight homelessness and urban poverty. As an experienced generalist you will be responsible for working with our designer to bring product features to reality. You should be comfortable working from the linux platform, through back-end architecture, all the way to implementing designs with responsive html&#x2F;css&#x2F;js.\nAt HandUp, you’ll have the satisfaction of seeing your work directly impact thousands of lives. We’re using technology as a tool for human empathy. Passion for solving big, complex social problems is a must-have. You don’t need any specific qualifications, but we do look for people who exhibit these qualities:<p>* Self-starter - you’ve worked on your own projects before and are a self-motivated do’er.<p>* Startups - you have experience working in environments where priorities and tasks can change frequently.<p>* Scrappiness - you know when to cut corners and when to spend the time to do it right. You&#x27;re good at prioritizing and managing limited time and resources.<p>* Experience - this isn&#x27;t your first rodeo. You&#x27;ve been doing this for a while and can tell us some good stories.<p>Our stack is Bootstrap &#x2F; jQuery, Python &#x2F; flask, MySQL. You don’t need to be an expert in those technologies but you should have a proven ability to pick up new skills quickly. You ideally have some experience in automated testing methods and deployment tools. Metrics are important to us so deep knowledge of funnels and Google Analytics and&#x2F;or mixpanel are a plus.<p>=== About HandUp ===<p>At HandUp, we believe that we’re all better off in a society where everyone can meet their basic needs. That’s why we created our company - to leverage technology and the power of human relationships to fight urban poverty. We come to work every day excited to build tools that directly affect those most in need. We’re a fast growing company that’s passionate about social change and are looking for candidates who share those values.<p>=== Compensation ===<p>$80k - $120k and 0.25% - 0.75%<p><a href=\"https:&#x2F;&#x2F;angel.co&#x2F;handup&#x2F;jobs&#x2F;49163-senior-full-stack-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;handup&#x2F;jobs&#x2F;49163-senior-full-stack-enginee...</a>","time":1427916578,"type":"comment"}