{"by":"helloshow","id":9307508,"parent":9303396,"text":"Hello Show - Ft. Lauderdale, FL (Relocation Offered)<p>Lead UI&#x2F;UX Designer for Web and Mobile Application<p>Hello Show is a design-driven real estate application that is transforming the way real estate agents communicate and schedule. The application has created an easy to use scheduling and showing process for all parties through a secure mobile messaging platform, route planner, and an agent-to-agent scheduling system. The result is an exceptional tool kit designed for the way real estate agents work.<p>You will be joining an amazing team: one of the top Realtors in South Florida, 2 of the top 100 Ruby on Rails contributors, a market research expert, a seasoned startup operations veteran, and 3 additional senior engineers. Our design foundation comes from the world-class designer behind Desk.com, Bitl.ly, Heroku, Grooveshark and more, so you will be building upon an incredibly well organized and high quality product. Our development team is entirely remote, but you should be local.<p>As our UI&#x2F;UX Designer, you will be at the forefront of our product team, moving ahead of the rest to determine what we need to work on. You must be excited to challenge your assumptions and prove ideas with data; everything we do is an experiment, but decisions are made pragmatically.<p>Responsibilities:<p>- Design clean and unique User Interfaces to mirror UX requirements<p>- Develop deep empathy and understanding of our users and their experiences<p>- Translate user testing and research results into wireframes and user-flow diagrams<p>- Design for the responsive web<p>- Explore and incorporate new and emerging design trends<p>- Communicate and collaborate with developers on design<p>- Develop project optimized assets and deliverables<p>- Make our users incredibly productive and make a product they love<p>Apply at: <a href=\"https:&#x2F;&#x2F;helloshow.workable.com&#x2F;j&#x2F;B620BDDF57\" rel=\"nofollow\">https:&#x2F;&#x2F;helloshow.workable.com&#x2F;j&#x2F;B620BDDF57</a>","time":1427928399,"type":"comment"}