{"by":"jn","id":9307559,"parent":9303396,"text":"ServiceFrame - Dublin, Ireland - Full Stack Software Engineer<p>ServiceFrame improves the quality of outsourcing relationships. Outsourcing brings together two organisations in an unusual alliance to deliver a set of services. Objectives are misaligned, cultures and sometimes languages differ. Until now, this has resulted in fractured communication between the two organisations, and eventually in failure. ServiceFrame establishes clear and consistent communication between the two organisations, better control for the customer, better margins for the supplier and a higher success rate for both.<p>We&#x27;re looking for full stack product developers; people who are as happy designing and implementing new UI features as they are building out distributed data integration systems in AWS. Self-starters who can own the development of features from day one. People who are passionate about quality and can deliver. People who are brave enough to fight their corner and big enough to know when they are wrong. People who like to put themselves in our customers shoes and who are able to think big. People who are innovative and also able to simplify.<p>We currently use technologies like C#, CoffeeScript, io.js, Docker, AWS, MongoDB, PostgreSQL, Handlebars, Stylus. We believe in functional programming, SOLID principles, DRY, testing, continuous deployment, REST. We don&#x27;t care if you know our specific stack already: the right kind of developer will pick it up quickly, and show us how we can improve it (Haskell, React and etcd would be easy sells, for example). Our development process relies heavily on GitHub, Slack and emoji.<p>More information at <a href=\"https:&#x2F;&#x2F;jobs.github.com&#x2F;positions&#x2F;d891f6da-ce4b-11e4-9534-f8ce52ee04c3\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.github.com&#x2F;positions&#x2F;d891f6da-ce4b-11e4-9534-f8...</a><p>If you&#x27;re interested, contact us with your CV and cover letter at info@serviceframe.com","time":1427928928,"type":"comment"}