{"by":"noahbrier","id":9308296,"parent":9303396,"text":"New York, NY &amp; SF. Full time. We&#x27;re looking for jr &amp; sr python engineers, jr &amp; sr frontend (js&#x2F;backbone) engineers + jr. &amp; sr. android &amp; iOS engineers.<p>As you can tell from the job openings, Percolate is a very quickly growing SaaS company in NYC. We are building The System of Record for marketing: A platform that helps companies manage all their marketing workflows from planning and strategy through creative development, production, and distribution. We&#x27;ve raised $35 million from Sequoia, GGV, and First Round Capital amongst others. We&#x27;re looking for backend (all levels), frontend engineers (we run backbone.js alongside our RESTful API), mobile (iOS + android) and infrastructure&#x2F;devsops (cfengine + AWS).<p>Here&#x27;s thirteen reasons why you should come work here: (1) Our goal is to build the best engineering team in NYC (2) Every employee gets salary + equity (3) As we get bigger, you will be able to focus on what you are good at (4) We are all different and we love it (5) GPL compliant company (6) You choose your workstation (7) You choose your tools (8) No worries, free your mind: NY salary + medical + dental (9) No vacation policy (we don&#x27;t count the # of days you take in a year) (10) Company invests in you: Fly to PyCon and other conferences (11) We prefer quality over quantity: Focus on clean code and test coverage (12) Your voice will be heard (13) We have a cold-brew coffee keg year round<p>Lots more info about us at our new about pages: <a href=\"http:&#x2F;&#x2F;percolate.com&#x2F;about\" rel=\"nofollow\">http:&#x2F;&#x2F;percolate.com&#x2F;about</a> If you&#x27;re interested email us at jobs@percolate.com or apply at <a href=\"http:&#x2F;&#x2F;percolate.com&#x2F;about&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;percolate.com&#x2F;about&#x2F;jobs&#x2F;</a><p>If you have any questions you can email me (I&#x27;m co-founder and CEO) directly at noah@percolate.com. Thanks.","time":1427941241,"type":"comment"}