{"by":"denglish","id":9308972,"parent":9303396,"text":"Culture Amp - Melbourne, Australia - <a href=\"http:&#x2F;&#x2F;CultureAmp.com\" rel=\"nofollow\">http:&#x2F;&#x2F;CultureAmp.com</a> - VISA - Full-time Front End Lead Developer (Not considering remote workers for this role)<p>We&#x27;re looking for a front end specialist to join our development team in Melbourne, and lead the evolution of the JavaScript and SASS&#x2F;CSS within our codebase. Our application is built primarily in Ruby on Rails, with a MongoDB back end, and hosted on AWS. We also have a Java component (but we won&#x27;t subject you to that).<p>You love crafting beautifully designed and intuitive user experiences, and you believe that creating well tested, clean code is just as important for the front end as the back end. You enjoy being surrounded by talented engineers, learning from others, as well as contributing to their development. To top it all off you&#x27;ve got a passion for culture and changing the world of work for the better.<p>There are plenty of challenges in the front end code to keep you interested. Our user-friendly survey capture form needs to work across a wide range of browsers and devices, and provide a simple, enjoyable user experience. On the reporting side, we use JavaScript and CSS to visualise and make sense of big data. We use JQuery and some JQuery UI and Bootstrap components, and we know there&#x27;s a need for other libraries to help streamline the code - that&#x27;s where you come in.<p>We&#x27;re a small development team, using lightweight agile processes and working closely together on the codebase. We use git and an automated CI for builds, and review each others&#x27; pull requests. We believe in automation over repetition, and aim to make our code and infrastructure modular and reusable.<p>We work with some of the worlds most innovative tech companies (Airbnb, Pinterest, Etsy, Uber, Slack, Squarespace, yelp, are just some of our well known clients) to help them better understand and improve their culture. We&#x27;re located in one of Melbourne&#x27;s most vibrant co-working spaces, Inspire 9&#x27;s Foundry9 - a stone&#x27;s throw from Richmond Station, and the monthly venue of the Melbourne Ruby user group.<p>We care about who you are and what you&#x27;ve achieved, not what pieces of paper you hold. For this role, we&#x27;re looking for a front end focused developer with strong technical skills in JavaScript and CSS, leadership experience, a keen interest in learning and an awareness of existing libraries and frameworks.<p>If you&#x27;re excited by the opportunity to work in a fast growing start-up, where there&#x27;s plenty of opportunities to pitch in on anything from shaping the next product feature to influencing our technology stack, and building a global software company from Melbourne, reach out to us.<p><a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;cultureamp&#x2F;d620e798-5774-42c4-8a41-2b97e10e8054\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;cultureamp&#x2F;d620e798-5774-42c4-8a41-2b9...</a>","time":1427956303,"type":"comment"}