{"by":"mikeomoto","id":9308141,"parent":9303396,"text":"E la Carte - elacarte.com - Palo Alto, CA<p>E la Carte puts tablets on restaurant tables.<p>Before you apply, do some reading about us-- here&#x27;s some press:\n<a href=\"http:&#x2F;&#x2F;tcrn.ch&#x2F;1bgAQyV\" rel=\"nofollow\">http:&#x2F;&#x2F;tcrn.ch&#x2F;1bgAQyV</a> - TechCrunch - E la Carte + Applebees\n<a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1bQ5TtU\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1bQ5TtU</a> - FastCompany - 50 Most Innovative Companies\n<a href=\"http:&#x2F;&#x2F;cnnmon.ie&#x2F;1Hkqhxb\" rel=\"nofollow\">http:&#x2F;&#x2F;cnnmon.ie&#x2F;1Hkqhxb</a> - CNN Money - Innovation Nation<p>We&#x27;re currently hiring a Sr&#x2F;Lead Android developer\n<a href=\"http:&#x2F;&#x2F;elacarte.com&#x2F;about&#x2F;#job-senior-lead-android-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;elacarte.com&#x2F;about&#x2F;#job-senior-lead-android-developer</a><p>The ultimate responsibility is to build something that fits frictionlessly into the very demanding and chaotic restaurant environment.  We have the unusual requirement of facing two sets of customers, the restaurant themselves, and the customer sitting at the dining table.  Can you help solve this problem in an elegant way?<p>We&#x27;re also hiring a Sr Software Engineer\n<a href=\"http:&#x2F;&#x2F;elacarte.com&#x2F;about&#x2F;#job-sr-jr-software-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;elacarte.com&#x2F;about&#x2F;#job-sr-jr-software-engineer</a><p>This engineer is responsible for building and maintaining the interface server between our internal tablet and the various legacy systems that are already present in the restaurant.  Make sure that fifty extra pieces of hardware fit in neatly with a legacy software stack.  Create future-proof APIs and then have the freedom to play with any part of the server you want.  Help bring restaurant technology into the 21st century.<p>If you think you might be a fit for either role, feel free to reach out and say hi, mike[at]elacarte[dot]com, I&#x27;m the lead infrastructure developer here, and am the filter for the hiring pipeline.<p>No remote, H1Bs will be considered, but those with unrestricted work status will be given a strong priority.","time":1427938152,"type":"comment"}