{"by":"sanguinerane","id":9308131,"parent":9303396,"text":"Thanx | San Francisco, CA | Series A, Sequoia Capital | <a href=\"https:&#x2F;&#x2F;www.thanx.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thanx.com&#x2F;jobs</a><p>What is Thanx?\nThanx helps merchants identify, reward, and retain their best customers. Launched in 2012, Thanx evolves the traditional customer loyalty program which is plagued with high integration costs for business owners and massive customer fatigue (think punchcards and plastic loyalty cards). Thanx makes the experience effortless for merchants and consumers alike. For consumers, earning rewards at their favorite merchants is as easy as paying as usual – gone are the hassles of check-ins, loyalty cards, or any added steps at checkout. Through Thanx, merchants can easily build personal relationships with their best customers – no point-of-sale integration or additional hardware required – taking advantage of automated retention marketing campaigns powered by Thanx. On average, Thanx merchants generate 30% increases in revenue from existing customers and experience drastically improved customer satisfaction. Backed by A-list venture firms Sequoia Capital and SoftTech VC, Thanx powers retention marketing for multi-location merchants across the United States. Over $15B in loyalty rewards were given out last year. Thanx brings a new, measurable and data-driven approach to a massive market that is waiting to be revolutionized.<p>Roles?\nEntry-level sales candidates! We&#x27;re looking to expand the sales team at Thanx, as we&#x27;ve been growing a ton and recently raised our Series A with Sequoia Capital. We also just hired an excellent head of sales (he was one of the first hires at Groupon), who will be a great mentor to somebody looking to establish a career in sales.<p>How to apply?\n<a href=\"http:&#x2F;&#x2F;thanx.theresumator.com&#x2F;apply&#x2F;tSwBTN&#x2F;Sales-Development.html\" rel=\"nofollow\">http:&#x2F;&#x2F;thanx.theresumator.com&#x2F;apply&#x2F;tSwBTN&#x2F;Sales-Development...</a>","time":1427937962,"type":"comment"}