{"by":"standmi","id":9312548,"parent":9303396,"text":"Yousician - <a href=\"http:&#x2F;&#x2F;company.yousician.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;company.yousician.com&#x2F;careers&#x2F;</a> - Helsinki - UI&#x2F;UX Engineer - Full time, visa<p>If you prefer video, check this out first: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=de_qk-Hr25I\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=de_qk-Hr25I</a><p>We’re the fastest growing music education company in the world with over 13 million users. The company develops high-tech guitar learning software that gives users real time feedback on how they play. Yousician’s cutting edge audio technology can listen to any real acoustic or electric guitar without the use of additional equipment. The service combines the addictive features of computer games with guitar exercises to make the learning process easy, fun and motivating.<p>Yousician also created the worlds #1 guitar tuner app Guitar Tuna and has won numerous international business awards including WIRED’s hottest Finnish startup, SXSW, Midem, Launch.edu, and educational awards such as Sunday Times &#x27;World&#x27;s best apps&#x27; or Best European Learning Game. Yousician believes that musicality can and should be as commonplace as literacy today, and it is the company’s declared mission to achieve this.<p>As a UI&#x2F;UX Developer you’ll be taking the lead in implementing, testing and evaluating the front end design of our products, the user interface and user experience. You’ll work in close collaboration with the UX design team, back-end team &amp; visual artists and play an important role in product design meetings.<p>This is a chance to do something new and unique and to impact the lives of millions of future Jimi Hendrixs around the world. We have the most talented, creative people who thrive in a dynamic environment &amp; do not shy away from crazy ideas and hope you can be one of them.<p>We’re looking for someone driven and passionate about working on the visual aspects of a product - someone who takes pride in making it look and feel great. We expect you to have experience implementing the visual design and UI in a published app using Unity3D, web or native mobile technologies. You have excellent user interface development skills and have experience with responsive design &amp; UI animations. We want you to be self-driven and keen to work in a team using the “Lean Startup” methodology. But importantly, we want you to be reliable and trustworthy, with a keen eye for detail and aesthetics.<p>To apply, drop a one line email with a link to your LinkedIn or GitHub profile and subject &quot;Hello from Hacker News&quot; to careers@yousician.com","time":1428002118,"type":"comment"}