{"by":"ashrob","id":9316719,"kids":[9318226],"parent":9303396,"text":"Seeking full-time Clinical Research Programmer to work at MGH in Boston<p>The Center for Experimental Drugs and Diagnostics in the Center for Human Genomics Research at Massachusetts General Hospital is seeking a Clinical Research Programmer for research using electronic health records for studying clinical outcomes and genetic risk in psychiatric and neuro-developmental disorders. The position offers significant involvement in an exciting area of research and a collaborative research environment, and is optimal for programmers looking to increase their experience in health care informatics prior to pursuing a career in medicine, medical research, or medical informatics.<p>The scope of this position will include working with large, heterogeneous health care data sets in a research environment and working with a multidisciplinary team developing scalable computational frameworks and methodologies for biomedical informatics. Responsibilities include creating, analyzing and documenting complex data warehouses; collaborating with clinical investigators and software developers to devise tools and strategies for working with the data; analyzing the data and preparing it to be analyzed statistically; writing database code (stored procedures and queries); working securely with sensitive health care data; administering data bases; and working with medical and genetic ontologies and natural language processing results.<p>The position requires a two year commitment. The start date will be negotiated upon hire, but will be sometime in the Summer or early Fall of 2015.<p>Salary varies depending on experience. Generous benefits package.<p>Competitive candidates should have:\n•\tBachelor’s&#x2F;Master’s degree in computer science, bioinformatics or equivalent experience.\n•\tHealthcare experience beneficial but not required.                                                                       \n•\tAbility to handle a variety of tasks amid shifting priorities.\n•\tStrong analytical skills with a high degree of initiative.\n•\tCreative and highly motivated individual with strong organizational and management skills.\n•\tExcellent written and verbal communication skills.\n•\tAbility to multi-task in a dynamic multi-disciplinary research environment.\n•\tComputer skills and familiarity with statistical methods\n•\tInterest in clinical&#x2F;biomedical research and&#x2F;or human genetics<p>Interested applicants should email a resume and cover letter to Ashlee Roberson at aroberson2@partners.org. Candidates should be prepared to provide a transcript and two letters of recommendation if they are invited to interview for the position.","time":1428078020,"type":"comment"}