{"by":"ngg971","id":9325688,"parent":9303396,"text":"MedNexus - New York, NY<p>MedNexus (<a href=\"http:&#x2F;&#x2F;www.mednexus.io\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mednexus.io</a>) is a semantic search engine for Healthcare professionals (and expert consumers) - think &quot;Google for Medicine&quot;. Our search and discovery tool is powered by cutting-edge web analytics and crowdsources users’ preferences to deliver the most relevant medical content on any topic or clinical question.<p>We are looking for a VP of Business Development to work closely with the founders to execute on the go to market strategy. The ideal candidate will have a passion for Healthcare, an interest in Information Systems and have experience in marketing and sales. They will help us grow our user base, expand our sales and distribution pipeline, and hone our business model.<p>They will work with the founders on the following processes:\nUser acquisition and customer development\nEngage with thought leaders and medical organizations for branding and distribution\nMonitor market trends and market participants\nExplore sales leads (identify decision makers amongst the targeted leads in order to start sales process)\nInbound marketing -  build an online presence and enhance credibility through creation of content and social media engagement<p>The ideal candidate should be detail-oriented, highly articulate and comfortable communicating our value proposition to users, potential partners &amp; clients. Furthermore, they should have an ability to understand larger strategic issues, and be motivated to work independently and assume responsibility during key phases in product and business development.<p>What we look for: \n- Experience in marketing and sales\n- Business development experience at a startup\n- Knowledge of healthcare and&#x2F;or life sciences industry \n- Ability to work independently and learn on the fly<p>Compensation will be in equity (1%-4%) and cash (&gt;$60k).<p>You will be given a large equity stake and have the opportunity to play a pivotal role in the company.<p>If you are interested, please feel free to reach out to founders@mednexusinc.com or visit our website.","time":1428276505,"type":"comment"}