{"by":"MitraCapital","id":9327606,"parent":9303396,"text":"Software Engineer (Machine Learning) for Hedge Fund (Boston, MA)<p>Mitra Capital LLC is a Boston-based long-short hedge fund seeking a versatile and talented programmer to join our small, entrepreneurial team.  As a member of the Mitra Capital team, you will work with intellectually curious and driven colleagues who utilize our proprietary and proven methodology to analyze the public remarks of company management teams to find opportunities where our analysis reveals that management’s expectations regarding upcoming quarterly results are sharply at odds with market consensus.  The firm’s analysis framework has its roots in the Central Intelligence Agency.<p>In the Software Engineer (Machine Learning) role, you will be challenged to create innovative technology solutions at the intersection of language analysis, data-driven insights and logic-based workflow.  The Software Engineer’s core responsibilities will involve building tools that drive the systems underlying the firm’s research process, including advancing the firm’s text mining and machine learning platform.  The position reports to our experienced Chief Data Scientist and offers a high rate of learning on a diverse range of projects and the opportunity to quickly have direct impact upon the organization.<p>The ideal candidate is a clever and versatile coder with a hacker mentality who is eager to tackle complex problems.  The Software Engineer must be comfortable working in an agile development environment with high expectations for rapid delivery of prototypes, changing requirements, and direct feedback from the internal business customer.<p>* Candidates should be able to learn fast and learn on the fly in order to work with a variety of languages and projects, and be capable of taking responsibility for delivering code that accomplishes defined objectives.<p>* Hands-on experience coding in Python or other advanced programming languages is required for this role, as is experience working with large datasets using SQL.  Experience with Java, R, PHP, Perl and&#x2F;or Unix is an advantage.<p>* We are looking for candidates with 3+ years’ experience and a quantitative background with degree(s) in majors such as Computer Science, Engineering, Science, Mathematics, Economics or similar.<p>---- To Apply ----<p>Interested and qualified candidates are encouraged to send a resume and cover letter to recruitment@mitracapital.com.  Please include, in CV&#x2F;resume or separately, detailed descriptions of past relevant projects. Mitra Capital can only consider candidates who are legally authorized to work in the U.S. without sponsorship.  Mitra Capital is an equal opportunity employer.","time":1428321536,"type":"comment"}