{"by":"mwenger234","id":9335829,"parent":9303396,"text":"Epion Health - Hoboken, New Jersey, Senior Rails Developer<p>Epion Health is transforming the doctor’s appointment into ­a personalized digital experience where patients can share information with their doctor and take ownership of their own health management. Our solution spans the appointment life cycle, from the waiting room, to the exam room, to checkout, using technology that is deployed on kiosks, tablets, and personal devices. As a developer on the Product Team, you will be working within a modern technology stack that includes Ruby-on-Rails (version 4.2), SCSS, Redis, Git, outside-in testing, continuous integration with Travis, and a pristine code base architected in partnership with the folks at thoughtbot. On a daily basis, you will have a chance to: - Shape the product roadmap - Build new features that delight patients and doctors - Program alongside a team that is committed to BDD&#x2F;TDD and industry best practices<p>Desired Skills and Experience\n- 4+ years experience working as a software developer\n- 2+ years experience developing with Ruby on Rails - Strong track record working in a team environment that regularly ships features\n- Experience writing feature and unit tests (Capybara and RSpec a plus)\n- Experience with Git and web application deployment - Able to showcase recent web application you worked on and&#x2F;or Github account\n- Able to move in a fast paced startup environment with a lot of autonomy<p>Perks\n- Highly competitive salary - Hoboken office in a Class A office building on the Hudson River with a beautiful view of NYC\n- 200 yards from the Hoboken Transportations Center with a 10 minute Path ride to Manhattan, multiple NJ Transit trains, buses and Light Rail. Commute costs covered.\n- Comprehensive health benefits including medical, dental and vision\n- Stock Options\n- 401K\n- Latest Mac tools\n- Reimbursement for continuous education classes and conferences\n- Regularly scheduled team building events with the Epion Team including hiking, skiing, day at the beach, etc.\n- Intimate exposure and contribution to the business side of a venture-backed startup<p>Apply at <a href=\"http:&#x2F;&#x2F;epionhealth.theresumator.com&#x2F;apply&#x2F;EFsflK&#x2F;Web-Developer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;epionhealth.theresumator.com&#x2F;apply&#x2F;EFsflK&#x2F;Web-Develop...</a> or email mwenger(at)epionhealth.com","time":1428429614,"type":"comment"}