{"by":"kelner","id":9337527,"parent":9303396,"text":"The Weather Channel - Atlanta, GA or Andover, MA - Contract to Perm - Willing to consider remote possibilities - Sr. Sys Engineer<p>Want to build scalable, highly available, and distributed systems? Our team is helping do it.  We are a small team in a large corporation that is moving fast, working with cloud technology, and building new products and services for the enterprise.<p>You&#x27;ll be helping build, implement, and maintain centralized services such as metric storage, logging, and auth as a service while helping other teams use these services.<p>Education, Experience, &amp; Skills:<p>- BS in Computer Science or related field or appropriate experience.<p>- Experience with Amazon Web Services is required. Experience with other cloud platforms is a plus - public and private.<p>- Experience with multiple programming languages - Java, Ruby, Python, Go, JavaScript, etc.<p>- Experience with Puppet, Chef, Ansible, SaltStack or other configuration management software.<p>- Experience with automation and continuous integration.<p>- Experience with APIs such as AWS APIs and higher level abstractions (Boto, Fog).<p>- In-depth exposure to best practices in monitoring, logging, operations, etc.<p>- Proficient with scripting languages such as Python or Perl.<p>- Proficient with Linux&#x2F;Unix.<p>- Proficiency designing and developing highly available distributed systems.<p>- Understanding of infrastructure and application design, building and integrating APIs and systems, networking, and database concepts.<p>- Understanding of layer 4 - 7 load balancing technology.<p>- Familiarity with networking, storage, and database concepts.<p>If you are interested I am a developer on the team, feel free to ask me questions.  Shoot me your resume (no attachments please) at twc.sr.sys.engineer.2015@gmail.com.  Feel free to include any side projects or code examples (if you have them available and at the ready), your GitHub profile (if you have done some open source contributions), LinkedIn, etc.","time":1428444684,"type":"comment"}