{"by":"jonrkarr","id":9360010,"parent":9303396,"text":"Postdoctoral Fellow&#x2F;Scientist&#x2F;Software Engineer in whole-cell modeling - Mt Sinai School of Medicine, New York NY<p>The Karr lab in the Institute for Genomics &amp; Multiscale Biology at the Mount Sinai School of Medicine is seeking talented, ambitious individuals to develop cutting-edge dynamical models of human and bacterial cells. Despite the explosion of experimental data, we do not comprehensively understand how phenotype arises from genotype. Our approach is to develop computational models which predict how behavior emerges from the molecular level by integrating diverse data into a single model. Our goal is to use models to make medicine more precise and personalized by predicting disease progression and drug responses. We are also using our models to engineer bacteria. Our research is highly interdisciplinary involving computational modeling, software engineering, data visualization and curation. We have close collaborations with several experimental groups to build and test our models.<p>Responsibilities: The candidate will be responsible for developing human and bacterial whole-cell models for precision cancer medicine and synthetic biology. This will include expanding the scope of whole-cell models, incorporating new sources of high-throughput genomic data, and improving the accuracy of whole-cell models. The candidate will work closely with experimental cancer collaborators at Mount Sinai, as well as with Luis Serrano&#x27;s laboratory at the Center for Regulatory Genomics in Barcelona, Spain.<p>Desired skills&#x2F;experience: The ideal candidate has the following skills. Applicants with deep experience in related fields are also encouraged to apply.\n- Deep experience in dynamical and genome-scale modeling, software engineering, data visualization, and databases;\n- Strong knowledge of biology, physics, mathematics, and computation;\n- Several years experience in computational systems biology is a plus;\n- Excellent object-oriented programming skills in Python, MATLAB, and JavaScript;\n- Ability to learn new skills and concepts;\n- Excellent oral and written communication skills; and\n- Abilities to work independently and within a team effort.<p>More information: Please visit our website (<a href=\"http:&#x2F;&#x2F;research.mssm.edu&#x2F;karr&#x2F;join.html\" rel=\"nofollow\">http:&#x2F;&#x2F;research.mssm.edu&#x2F;karr&#x2F;join.html</a>) or contact Jonathan Karr (karr@mssm.edu).<p>How to apply: Please send a cover letter indicating your research and career goals, a CV, and 2-3 letters of reference to Jonathan Karr (karr@mssm.edu).","time":1428774678,"type":"comment"}