{"by":"akashkotadia","id":9367954,"parent":9303396,"text":"encircle.io(Ahmedabad, India). <a href=\"http:&#x2F;&#x2F;encircle.io&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;encircle.io&#x2F;</a> - Full Time - Social Media &#x2F; PR<p>encircle.io is an technology start-up building platform for connected things (IoT). We are based in Ahmedabad, Gujarat. Our Circlep platform consists of hardware, software and services which enables one to build next generation physical-digital hybrid applications which will be installed on real world.<p>Our journey has begun with the thrilling Beacon technology that fits very well with our vision of a multifunctional Sense-Connect-Cloud platform. We are building Software Platform and Mobile App to enables Retailer Brands, Museum and event organizers to deliver most contextual and relevant information on the phone of audience present in precisely defined location.<p>We’re agile, with an aggressive roadmap. As we moving fast in product development, We want an expert to spread word about our product, industry and engage with target audience via social channels and other digital technology means.\nIf you join us, the work will not be work anymore, It’ll be all fun and have a pride to be part of something big.<p>If you join us, the work will not be work anymore, It’ll be all fun and have a pride to be part of something big.<p>You Do :<p>-  Research our industry trends, news. Define content strategy and run creative campaigns.<p>-  Develop creative content for social media and Write blog posts.<p>- Manage our social media channels; Share Relevant content, audience engagement and analyze its performance to improve  scale and engagement of audience of our brand.<p>-  Build presence and engage with the online startup community and influencers.<p>-  Imagine. Implement. Iterate. Improve; Get things done.<p>-  Learn new things and have lots of Fun everyday.<p>You Have :<p>-  Passion and desire to understand our domain , technology and its innovative applications.<p>-  Effective Communication and writing skills.<p>-  Competency in conducting Internet based research.<p>-  Social media marketing experience and skills to strategize content and marketing campaigns.\n-  Basic Knowledge of Content Creation tools (i.e. Photoshop etc.)<p>Apply at <a href=\"http:&#x2F;&#x2F;encircleio.recruiterbox.com\" rel=\"nofollow\">http:&#x2F;&#x2F;encircleio.recruiterbox.com</a>","time":1428936730,"type":"comment"}