{"by":"niallsmart","id":6995835,"parent":6995020,"text":"Hightower, New York NY (REMOTE, H1B)<p><a href=\"http://www.gethightower.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.gethightower.com</a><p>Ground floor opportunity at a commercial real estate software startup :)<p>Commercial real estate (CRE) is one of the largest parts of our economy ($7T in U.S. asset value) but incredibly underserved by technology. We&#x27;ve actually met teams using different color sheets of paper to manage and track their sales pipeline. One of our investors described the opportunity as &quot;finding the proverbial lost tribe in the amazon&quot; [1]. If reimagining this world sounds interesting, come talk to us – we&#x27;ve got a product in market, just closed a 2.1M seed round, and are hiring engineer #1.<p>Our stack is Rails + AngularJS. We&#x27;ve been using AngularJS since day 1 and love it (and have paid it forward in some pull requests). Our development workflow is simple and robust – Trello for task management, CircleCI for continuous integration, and deployment to Heroku.<p>The product is a collaboration and workflow platform for CRE leasing teams. Our goals are to dramatically increase their operational efficiency with a purpose built web + mobile experience, and to leverage the underlying data to deliver performance insights to insititutional owners.<p>Hightower is being actively piloted by some of the biggest names in CRE, and we&#x27;ve raised a 2.1M seed round led by BVP and Thrive Capital with participation from a host of amazing angels and VC including Aaron Levie, Lee Linden, David Tisch and Gary Vaynerhuck. Our founding team is Brandon Weber (CEO – CMU graduate and former VP @ CBRE), Niall Smart (CTO, formerly founder of YC W09 company Echodio, which sold to RealNetworks) and Donald DeSantis (CDO, formerly founder of LIFFFT, early Redfin employee).<p>We&#x27;re hiring engineer #1. Knowledge of CRE is not a pre-requisite. In fact, possibly the less you know on that front, the better :) You should have deep experience with any or all of: Rails, Backbone, Angular, Ember, Django, Node -- and a strong history of building product at startups. Meaningful equity + cash compensation is on offer for the right person.<p>Drop me a line to learn more – niall.smart (at) gethightower.com.<p>Happy new year!<p>[1] <a href=\"http://www.bvp.com/blog/hightower-poised-modernize-commercial-real-estate-business\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bvp.com&#x2F;blog&#x2F;hightower-poised-modernize-commercia...</a>\n[2] <a href=\"http://www.pehub.com/2013/12/hightower-secures-2-12-mln-in-seed-financing/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.pehub.com&#x2F;2013&#x2F;12&#x2F;hightower-secures-2-12-mln-in-s...</a>","time":1388600933,"type":"comment"}