{"by":"sontek","id":6995736,"parent":6995020,"text":"SurveyMonkey ( <a href=\"http://www.surveymonkey.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.surveymonkey.com</a> )<p>Offices in:\nPalo Alto, CA, USA\nSeattle, WA, USA\nPortland, OR, USA<p><i></i>Job Description<i></i>:<p>Survey Monkey is looking for software engineers who have a passion for\nsolving complex and interesting problems. In addition to scaling site,\nwe are looking for people who can help with advanced analysis and data\nvisualization, natural language processing, and new storage\narchitectures.<p><i></i>Requirements<i></i><p>* Experience writing top quality software for high-volume&#x2F;high\navailability websites, including being involved in building critical\nuser-facing components.<p>* Comfortable working in a Unix environment<p>* Experienced in working with multiple databases and datastores\n(Postgres, ElasticSearch, Redis, Cassandra, etc.)<p>* Love Python<p><i></i>About the company<i></i><p>SurveyMonkey is the world&#x27;s largest survey company, but there&#x27;s really\nmuch more to us than that. We&#x27;re a smart, passionate group of people who\nwork hard to deliver the best survey experience on the planet, period.\nWe do this because we believe everyone deserves easy access to the\ninsights and information they need to make better, more informed\ndecisions.<p>We help customers collect over 2+ million online survey responses daily.\nSurveyMonkey is trusted by millions of customers, including 99% of the\nFortune 500, as well as other businesses, academic institutions and\norganizations of all shapes and sizes.<p>* What Python is used for:<p>Our primary services&#x2F;applications are all built on top of the Pyramid\nWebframework. We use pylibmc, ansible, jinja2, sqlalchemy, and many\nother open source python libraries to power our infrastructure.<p>We are planning to do our first Python3 and PyPy deployments in 2014.\nAlong with moving from weekly releases to continuous deployment.<p>* Contact Info:<p>Contact: John Anderson<p>E-mail contact: johna [at] surveymonkey.com<p><i></i>No telecommuting<i></i>","time":1388599771,"type":"comment"}