{"by":"mwilliamson","id":6995088,"kids":[6995111],"parent":6995020,"text":"Software developer, Stat.io - Cambridge UK, or REMOTE<p>We aim to allow users to understand the socio-economics of any location, from the population of a country to the crime rate of a postcode. Organisations can then use this data to improve their decision-making, whether it&#x27;s businesses making strategic sales and marketing decisions, NGOs trying to understand a country, or somebody else entirely.<p>The two main technical challenges we face are:<p>* Importing data from many different sources, from APIs to Excel files, and understanding their structure. For instance, given an Excel file, we need to determine the structure of any tables, such as which columns represent a location. We also want to pick up as much metadata as possible, such as a description of the dataset.<p>* Designing a UI that allows users to find what they&#x27;re looking for, and then making that UI fast (we&#x27;re currently up to about 10,000,000 datasets and 200,000,000 data points)<p>Our technology stack:<p>* Postgres + PostGIS to store the data we&#x27;ve imported<p>* Elasticsearch for... search<p>* Python code to import data from the original source to our database (with a tiny bit of Redis for some basic queueing)<p>* A thin PHP web application to display the data (probably soon to be replaced by node.js)<p>Things we like:<p>* Test-driven development and good test coverage (when it makes sense -- sometimes, it&#x27;s better to manually test a very thin UI than to keep worrying about brittle UI tests)<p>* Releasing early and often. We deploy features as they&#x27;re ready, and try to break work down to small pieces.<p>* Doing the simplest thing that could possibly work. Rather than planning for every possibility up front, we implement something small but useful to start with, and then iterate and refactor as necessary.<p>What we&#x27;re looking for:<p>We were founded in Cambridge last year, and we&#x27;re now working towards a product covering public data for the UK.<p>We&#x27;re looking for a software developer to join us, initially part-time for £1,000 a month + stock option plan. We&#x27;re joining Microsoft Ventures in London from February 2013, so you can join us in Cambridge or London, or work remotely.<p>If you have any questions, feel free to get in touch: contact@stat.io. If you&#x27;d like to apply, please send us a CV and a paragraph describing why you&#x27;re interested.<p>You can find out more about us on our website: <a href=\"http://www.stat.io/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.stat.io&#x2F;</a>","time":1388587621,"type":"comment"}