{"by":"magic_at_enimai","id":6995794,"parent":6995020,"text":"ënimai - www.enimai.com - Mountain View CA - Full Time, no remote work.<p>Seeking a passionate LTR<p>Us: \nA very passionate group of individuals who strongly believe our hardware and software will change how we have approach computing. We went to Caltech, CMU, IIT, RPI, Stanford, UIUC, USC to earn our PhDs and other degrees in Aeronautics, Computer Science, Cryptography, Materials Science, Applied Math, Particle Physics etc.<p>Our exs include Apple, Facebook, Google, Jawbone, Lab126, NASA, NSA, Samsung. We have worked on a variety of projects including Android devices, Chromebooks, Cryptanalysis, Distributed systems at Facebook, Jawbone UP, Macbook Pro, OLPC, Personal Aircraft, RISC processors, Speech recognition, Sun workstations, Video compression algorithms etc.<p>We love what we do. As a team we believe we will make an impact in this world.<p>You:\nBe awesome in coding. Know you are awesome in coding.<p>Be a generalist at heart. You could be a specialist in something but you should be open to working on our RTOS one day and twiddling with machine learning algorithms the next. Be cognizant we are a product company trying to pack in as much research as possible i.e end of the day we have to ship a product that makes an impact and amazes people.<p>_Understand_ CS fundamentals.<p>You shouldn’t just know who is Knuth. You should be ok to program in MMIX if required. You get the point - use whatever tools at your disposal to solve the next available problem&#x2F;task. You will need to hold a lot of complexity in your head.<p>If all this sounds like a relationship you are looking for please apply at <a href=\"http://enimai.theresumator.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;enimai.theresumator.com&#x2F;</a> or email stdin@enimai.com.  This is a matter of mind and heart so no need to send a picture but a resume of what you have done, what you can do and a statement of what moves you would be a great start.<p>Happy New Year.","time":1388600462,"type":"comment"}