{"by":"ilz","id":6996221,"parent":6995020,"text":"Blue Apron (New York, NY): Software Engineer<p>Blue Apron (<a href=\"http://www.blueapron.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.blueapron.com</a>) is an NYC-based startup delivering original recipes and premium, seasonal ingredients needed to prepare them, in exactly the right proportions. We&#x27;ve raised $8M from First Round Capital, Bessemer Venture Partners, and Dave Tisch and have been featured in the New York Times [1]. Forbes recently named us one of the hottest startups of 2013 [2].<p>After just one year of operation, we&#x27;re delivering over 300,000 meals each month nationwide (up from 100k just a few months ago). Our product is growing quickly, and we want to work with talented, passionate individuals that will help us enhance the experience of cooking at home.<p>Our engineers solve problems for both customers and members of the Blue Apron team. We evaluate, design, and implement new features to provide more enjoyable experiences for our users. We collaborate to understand and overcome unique scheduling and logistics challenges. We listen to the needs of our interal teams and build tools that bring harmony to complex operational workflows.<p>Our stack: Ruby on Rails, RSpec, PostgreSQL, HAML, Bootstrap, SASS, JQuery, AJAX, Git, Heroku<p>About you:<p>- You communicate your ideas clearly.<p>- You&#x27;re excited to learn and evaluate new technologies and techniques.<p>- You&#x27;ve taken features or products from concept to completion and have experience working with at least one large-scale web application.<p>- You&#x27;re confident with JavaScript and CSS and understand the challenges involved with supporting older browsers.<p>- You&#x27;re mindful of your impact. You write tests to improve the quality and reliability of your code.<p>- You help teammates improve when reviewing their work and appreciate feedback when they reciprocate.<p>This role comes with health insurance, a flexible vacation policy, and competitive salary and equity. To apply, please submit a short email outlining your experience and why you are interested along with your resume to jobs@blueapron.com.<p>[1] <a href=\"http://www.nytimes.com/2013/02/13/dining/the-dinner-kit-is-served.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nytimes.com&#x2F;2013&#x2F;02&#x2F;13&#x2F;dining&#x2F;the-dinner-kit-is-s...</a><p>[2] <a href=\"http://www.forbes.com/pictures/emjl45himd/blue-apron-4/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.forbes.com&#x2F;pictures&#x2F;emjl45himd&#x2F;blue-apron-4&#x2F;</a>","time":1388605236,"type":"comment"}