{"by":"AdageTech","id":7000830,"kids":[7001491,7000852],"parent":6995020,"text":"Chicago, IL\nAdage Technologies\nFull-time Developer\nInternational candidates are welcome to apply!<p>Adage is a web and software development firm located in downtown Chicago.  We build websites, web apps and mobile apps for a pretty broad range of clients, but are best known for our work in the performing arts space and currently work for the LA Opera, Boston Symphony Orchestra, Chicago Symphony Orchestra and many others.<p>The vast majority of our builds utilize the ASP.NET and Backbone.js frameworks.  Often they are used in combination, sometimes they are used independently.  You don&#x27;t necessarily need ASP.NET or Backbone.js experience to apply for our developer positions.  We are simply looking for passionate programmers who have experience with C-based languages and OOP.<p>Our teams are small so it is easy for your influence to be felt through the code you write and the ideas you bring to the table.  You will be coding and architecting applications.  The work is exciting, but challenging.  You will make mistakes, but as long as you’re learning, improving, and committed to your teammates, that is alright by us.<p>The ideal candidate for this job is a person who loves to program, is interested in helping and interacting with clients, and is continually interested in improving in all facets of application development.<p>Check out our description for our JavaScript and ASP.NET developer positions.<p>ASP.NET Developer: <a href=\"http://www.adagetechnologies.com/careers/Experienced-Net-Developer/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.adagetechnologies.com&#x2F;careers&#x2F;Experienced-Net-Dev...</a>\nJavaScript Developer: <a href=\"http://www.adagetechnologies.com/careers/JavaScript-Developer/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.adagetechnologies.com&#x2F;careers&#x2F;JavaScript-Develope...</a><p>We&#x27;re also looking for Front-End Developers to help engineer UI&#x27;s: <a href=\"http://www.adagetechnologies.com/careers/front-end-developer/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.adagetechnologies.com&#x2F;careers&#x2F;front-end-developer...</a>","time":1388684365,"type":"comment"}