{"by":"nsp","id":7001818,"parent":6995020,"text":"iCapital: Lead Designer\nNew York, NY\nWe believe in simple interfaces, clean design, and pixel perfection. Our design is driven by a strong desire to build an experience that people love and a product that they use with ease.<p>The ideal candidate has experience working as a web designer on fast moving small teams to deliver production web designs, a desire to “move fast and break things” (ship quickly, iterate quickly, emphasis on action over planning but still deliberate about design), and the ability to discern what is important in order to build the simplest solution and design to a problem.<p>We expect excellent wireframing and storyboarding skills, technical skills in Photoshop and Illustrator, and process and communication abilities. We expect strong self-motivation and an inner desire to perform at the top of your discipline.<p>Salary is $110k+ w&#x2F;options, negotiable. Strong company-provided benefits (health insurance, snacks, cellphone, computer equipment of your choice, etc.)<p>E-mail your portfolio (including examples of your web-based work) to jobs@icapitalnetwork.com\nAbout iCapital Network\nWe use modern technology to connect private equity fund managers with institutional investors. Today, and for the past 30yrs, our industry has operated in the same inefficient and fragmented manner and its time for some evolution.<p>$500 - 750 billion of capital flows into alternative investment funds every year. Almost 100% of these capital flows are facilitated via telephone or rudimentary use of email. Lets change it up a bit!<p>Our company was founded by a team of passionate individuals who have raised billions of dollars of private equity capital and built highly innovative financial software and data businesses. Over the past 15 months, we have formalized key strategic partnerships with some of the leading firms across the private equity industry. We&#x27;re 7 people at the moment, pre product,  recently completed our Series A round, and are in go mode!\nEmail me at - \nnoah@icapitalnetwork.com","time":1388692463,"type":"comment"}