{"by":"unclegene","id":7012492,"parent":6995020,"text":"Amazon Studios - Seattle, WA - FULLTIME<p>From &quot;official&quot; job description:<p>Amazon Studios develops original film and television properties for Amazon.com. Amazon Studios is a unique experiment in collaborative filmmaking that is open to great ideas from creators and audiences around the world. Anyone can upload a script and within 45 days will be notified if that script is optioned. After receiving more than 18,000 movie scripts and 4,000 series pilots, Amazon Studios now has 29 film projects and 30 television series in development.<p>At Amazon Studios we test stories in creative development with actual customers, and use the feedback to identify problems and confirm suitability to audience--it&#x27;s like iterative software development but for storytelling. Since movie and series customers consume visual stories on multiple platforms, we put visual&#x2F;multimedia content in front of test audiences on our site, on mobile and social platforms, in focus groups, or on other Amazon.com sites. These can include, for instance, storyboards, trailers or full-length animated test movies.<p>See the site at: <a href=\"http://studios.amazon.com\" rel=\"nofollow\">http:&#x2F;&#x2F;studios.amazon.com</a><p>As a Software Development Engineer, you will be working as part of a talented and nimble team of engineers to design, develop, test, and deploy world-class production software for collaborating on scripts, constructing movies, and getting actionable feedback from movie fans. The range of challenges includes scalable back-end media infrastructure, web applications with complex interactive customer experiences, and external social or mobile clients. We&#x27;re looking for engineers who are excited about innovative rich user interfaces backed by high performance services, and have the scope, inventiveness and drive to make it happen.<p>In addition to demonstrated excellence developing customer-facing software, a successful candidate will have strong technical proficiencies, great communication skills, and a motivation to achieve the right results in a fast-paced environment. You must insist on the highest standards for software quality, maintainability, performance and availability.<p>Send me your resume @ hn at softover dot com, or apply directly @ <a href=\"http://www.amazon.com/gp/jobs/236578\" rel=\"nofollow\">http:&#x2F;&#x2F;www.amazon.com&#x2F;gp&#x2F;jobs&#x2F;236578</a>","time":1388863789,"type":"comment"}