{"by":"jesseiqmi","id":7019692,"parent":6995020,"text":"IQMI, Vancouver, BC, Canada<p>IQMI is looking for experienced Ruby on Rails application developers in Vancouver, BC, to assist in bringing to market our next generation of SaaS based products. From desktop to mobile (web and native), you’ll be lending your knowledge to push out some truly great products.<p>We are an established Vancouver, BC based company that is providing data capture, management, authenticity, traceability and management reporting services to a variety of industries and value chains.<p>Employing desktop and mobile application channels for our clients and partners, we continually prove out year-over-year that our products, services and solutions provide game-changing transparency from producer to consumer, improve business efficiencies and allow our clients to have a smaller environmental impact.<p>As a Rails developer you should always be learning, you know and understand web frameworks (Rails primarily) and mobile technology quite well and are specialized in at least one area of the application stack (UI&#x2F;UX&#x2F;HTML&#x2F;CSS, API’s, core, mobile, db, devops, etc). Working with others in a group environment and solving problems with efficient code and the right tools is your thing. Like the rest of us you will end up wearing many hats, supporting each other in areas such as solution design, ops, and customer support. Over time you will have plenty of opportunity to grow into other areas of the organization if you choose.<p>We are centrally located in Vancouver and, of course, offer a competitive salary.<p>If working with IQMI interests you, drop Jesse a line at jobs@iqmi.ca with your resume and a brief blurb of what makes you, you and what you would be bringing to the team. Feel free to include any links to projects you’ve worked on in the past or Github code you’ve built or contributed to - we want to see what you’ve done!<p>Cheers,\nJesse\nVP Technology, IQMI","time":1389126669,"type":"comment"}