{"by":"gametimeunited","id":12848304,"parent":12846216,"text":"Gametime  |  Buy&#x2F;Sell Last Minute Tickets  |  SF downtown, Powell Bart<p>Android:   <a href=\"https:&#x2F;&#x2F;play.google.com&#x2F;store&#x2F;apps&#x2F;details?id=com.gametime.gametime\" rel=\"nofollow\">https:&#x2F;&#x2F;play.google.com&#x2F;store&#x2F;apps&#x2F;details?id=com.gametime.g...</a>\niOS:       <a href=\"https:&#x2F;&#x2F;itunes.apple.com&#x2F;us&#x2F;app&#x2F;gametime-making-your-mobile&#x2F;id630687854\" rel=\"nofollow\">https:&#x2F;&#x2F;itunes.apple.com&#x2F;us&#x2F;app&#x2F;gametime-making-your-mobile&#x2F;...</a><p>Careers:   <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;gametime\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;gametime</a><p>- Backened Engineers\n- Growth Analysts\n- Data Engineers\n- Product Designers\n- Full Stack Engineers\n- ML Engineer\n- Frontend Engineer (web)\n- Business Development, Music<p><i></i>*<p>Live It, Last Minute. Mobilize friends in seconds with textable tickets at last-minute prices.\nGametime makes finding the perfect live experience remarkably fast and easy (especially last minute). We curate an epic list of the most amazing possibilities your city has to offer. Once you select your event, we examine as many as 10,000 potential seats and present you with just the 50 best values - not an impossibly long list of choices.<p>Each curated seat option includes a high-resolution, full-stadium, panoramic view from that section. Navigate to the seat map to see price-vs-location comparisons within amazingly detailed, true-to-life, full-color stadium maps.<p>Once you’ve found the perfect seats, two-tap buying (even after the event starts!) gives you the speed you need to rule the last minute. After purchase, Gametime delivers tickets directly to your phone. Text your tickets to your crew so that everyone gets in instantly. Change of plans? No problem - sell your tickets with the push of a button. Have paper tickets your parents gave you? Snap a quick photo and sell them on Gametime in seconds.","time":1478022265,"type":"comment"}