{"by":"qntmfred","id":12846629,"parent":12846216,"text":"Kaplan Test Prep | Frontend Developer | New York City | Onsite | <a href=\"http:&#x2F;&#x2F;kaplan.com&#x2F;work-with-us&#x2F;our-culture&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;kaplan.com&#x2F;work-with-us&#x2F;our-culture&#x2F;</a><p>Kaplan Test Prep is a market leader in test preparation, we serve college students and young professionals studying for the MCAT (medical school), GMAT (business school), LSAT (law school), GRE (Master&#x27;s and PhD programs), SAT exams and many others. Our organization is entrepreneurial, growth-oriented, and energetic. Our people genuinely enjoy what they do and take pride in it. If you seek a challenging, exciting, and creative engineering role -- while working with talented and passionate people -- this might be the position for you. Email me at ken.warner at kaplan.com if you&#x27;re interested.<p>Responsibilities:<p>- Design and build web applications for our courseware platform<p>- Partner with our Design and UX team to prototype and validate new features<p>- Work with our Engineering team to turn successful prototypes into high-quality, production-ready products<p>- Keep quality high by writing and maintaining unit tests<p>- Be a strong problem-solver and ask questions<p>- Improve the documentation of our systems and team development practices<p>- Have fun! We&#x27;re a collaborative, fast-paced technology team.<p>Knowledge, Skills &amp; Abilities:<p>- Expertise with modern web stack technologies, including detailed knowledge of HTML, CSS Style Sheets and JavaScript<p>- Practical experience with MV* JavaScript frameworks like AngularJS, Backbone.js or ReactJS<p>- Can confidently write large-scale, maintainable stylesheets using front-end frameworks like Bootstrap, Foundation and stylesheet authoring languages like Less or Sass<p>- You understand the importance of responsive, semantic HTML and how to address accessibility standards<p>- Front end task runner and build tools like grunt or gulp<p>- You have an eye for what makes a delightful user experience and will speak up to defend it.<p>- Full-stack mindset. You know what a good API looks like and understand what&#x27;s happening on the backend. You can jump into Node.js, C# or SQL when needed.<p>- Experience with scalability considerations of large-scale production systems<p>- Experience with Agile or Lean software development methodologies and practices<p>- Organized, goal-oriented, excellent ability to multi-task, motivated self-starter who can work well in a team environment<p>- Possess excellent communications skills, with the ability to work with business users as well as other members of the technical staff<p>- Interest in education and having a positive effect on students<p>- Minimum 2 or more years of software development experience<p>- BS in Computer Science, or an equivalent degree.","time":1478014334,"type":"comment"}