{"by":"bkeroack","id":12848447,"kids":[12848550],"parent":12846216,"text":"Dollar Shave Club | Infrastructure SWE (DevOps) | Full Time | Los Angeles, CA<p>=============================================================<p>About DSC<p>We’re on a mission to build a better bathroom. We started with razors way back in 2011, and now millions and millions of Members later, we’ve expanded into shave products, skin care, hair styling, with more to come. We’re always growing and reinventing, and we rely on killer talent to help us achieve our goal of owning the bathroom. If you’re a team-playing innovator, you’ll fit right in. A sense of humor helps, too.<p>Role Summary<p>Interested in writing Go and contributing to OSS? Excited about Docker, Kubernetes, Mesos and the brave new world of containerized distributed applications? DSC is looking for a Software Development Engineer in Infrastructure (SDEI)! Help build a world class application platform for one of the hottest, most successful new brands in Los Angeles.<p>Responsibilities &#x2F; Qualifications<p>Experience in at least one programming language. Go (golang), Python or Ruby would be great. Shell languages do not count.\nA passion for building tools and automation.\nAbility to communicate and partner with the rest of the engineering team to deploy and maintain a stable suite of production microservices.\nKnowledge of networking concepts and security best practices\nExperience with Linux systems\nExperience or interest in technologies such as Docker, CoreOS, Kubernetes and Mesos.\nExperience with a public cloud provider like AWS would be a big plus.\nExperience with monitoring and alerting tools.\nExperience with continuous delivery pipelines would be a big plus.<p>DSC Culture<p>We work in an open- air, freshly renovated office in the heart of Silicon Beach. As we disrupt industries and unseat corporate giants, our plan is to think big, but stay small.  No egos. No jerks. No prima donnas. Just awesome folks who live and breathe collaboration and dig the perks like haircuts, weekly food trucks, and team happy hours. And yes, we have snacks.<p>Send CV&#x2F;resume to benjamen+hnjobs@dollarshaveclub.com","time":1478022947,"type":"comment"}