{"by":"lindsayaoneal","id":12848356,"parent":12846216,"text":"nCino - Wilmington, NC - Senior Developer - Onsite - Full-Time<p>As a Senior Developer you will be an essential part of a high-performing, collaborative Scrum development team that produces innovative software of exceptional quality. The ideal candidate has a background in Agile&#x2F;Scrum and will thrive in a hands-on, focused, and team-oriented environment.\nSenior developers are expected to have a deep understanding of object-oriented design, the ability to articulate technical understanding and a proven record of learning and doing. A senior developer is expected to provide significant value through the creation of high-quality code while also acting as a coach and mentor for more junior developers. Senior developers are expected to use their experience to make technical and design decisions and to lead a group in discussing and weighing alternatives.<p>Qualifications\nRequired: \n- Bachelor’s degree in Computer Science or a related field or equivalent professional experience\n- 6+ years hands-on development experience\n- Expertise in at least one OOP language (Java, C#, C++, Apex, PHP, Ruby, Scala, Python, etc.)\n- Substantial experience with client-side development (HTML, CSS, JavaScript, Angular, Knockout, React JS, etc.)\n- Proven ability to create enterprise-scale application designs using industry standard patterns and best practices\n- Demonstrated commitment to quality and continuous improvement\n- Motivated individual with the proven ability to contribute to multiple concurrent projects in a fast-paced, collaborative environment\n- Excellent problem solving, decision-making, and interpersonal skills\n- Excellent verbal and written communication skills for technical and non-technical audiences<p>Desired:\n- Proven ability to lead software development teams and mentor junior developers\n- Significant experience in Agile&#x2F;Scrum and TDD development methodologies\n- Salesforce Developer Certification(s) (e.g. DEV 401, App Builder, Platform Developer)\n- Experience producing Salesforce managed packages as part of the ISV Partner Program<p>Please send resume to Lindsay O&#x27;Neal at Lindsay.oneal@ncino.com","time":1478022539,"type":"comment"}