{"by":"efields","id":12847591,"parent":12846216,"text":"Vanda Pharmaceuticals - <a href=\"http:&#x2F;&#x2F;vandapharma.com\" rel=\"nofollow\">http:&#x2F;&#x2F;vandapharma.com</a> - ONSITE - Washington, DC | Full-Stack, Big Data, Senior Developers of all stripes | $100k++<p>We&#x27;re a young, small pharma in DC with a couple products on the market, including one for circadian rhythm management that has helped many in the blind community.<p>We&#x27;re looking for more Senior Software Developers to join our small engineering team, especially those with experience in data wrangling and high level DBA-type skills. The team is half onsite, half remote, but we are looking to hire more onsite at the moment.<p>For the last couple years, we&#x27;ve been building an in-house app that aggregates a lot of data from desperate sources, including user generated, into useful tools that have measurably improved performance throughout the company. We&#x27;ve got a modern stacks on the front- and back-end. React&#x2F;JS&#x2F;Ruby&#x2F;Postgres, looking to integrate GraphQL and more: whatever tools will get the job done best.<p>What we lack in start-up glow we make up for in giving you the opportunity to build tools for users that are across the office that measurably affect company performance; you can get realtime feedback on what works what doesn&#x27;t, iterate as quickly or as thoroughly as need be, with ample resources at your disposal.<p>Our compensation is excellent. Truly. Ask for what you think you&#x27;re worth. Stock and benefits is also top-notch, w&#x2F; 401k matching, etc.<p>If you&#x27;re interested, contact me at eric.fields@vandapharma.com. I&#x27;m happy to answer any other questions too.<p>Our email server is kinda strict so if your message bounces try ericdfields at gmail.<p><a href=\"http:&#x2F;&#x2F;www.vandapharma.com&#x2F;jobs&#x2F;I6006.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.vandapharma.com&#x2F;jobs&#x2F;I6006.html</a>","time":1478018802,"type":"comment"}