{"by":"jobs-at-OEM","id":12847188,"kids":[12861656],"parent":12846216,"text":"Open Energy Market - Junior UX&#x2F;UI Designer | Surbiton (UK) | Remote OK<p>About Open Energy Market<p>Open Energy Market is a growing, innovative, company building technology that is re-defining the commercial energy buying space.  Since our launch in 2013 we have built an impressive portfolio of clients and partners, providing a platform for large scale energy buyers to manage their energy portfolios and procurement process. Our clients are some of the largest household names in the United Kingdom including restaurant chains, supermarkets and national brands.\nFor more information about us and what we do, head to <a href=\"https:&#x2F;&#x2F;openenergymarket.com\" rel=\"nofollow\">https:&#x2F;&#x2F;openenergymarket.com</a>.\nDue to our rapid expansion we are seeking enthusiastic, intelligent and creative team members to join us.  In return we offer a fun but hard working environment where your contributions will be visible from day one.<p>The Role<p>We are seeking a designer whose responsibility it will be to design, and possibly build, best in class user interfaces and user journeys for our customers across our platform.  Working closely with the Product Owner, you will champion the user at all times to ensure that we deliver beautiful, cutting edge, usable and innovative designs that simplify the complex process and data involved in energy procurement and management.<p>You will be given a high level of autonomy in how to approach delivering requirements and will report directly to the Chief Technology Officer.  Our development team is currently fully remote however, we do have an office in Surbiton just outside of London.  You should be comfortable working in a mature and collaborative manner and have no issue in conversing with non-technical employees across multiple time zones.<p>Skills&#x2F;Experience<p>In order to be considered for the role we would like to see a varied portfolio of previous work which can include contributions to non-commercial projects and course work.<p>You should also:\n•\tHave a solid understanding of up-to-date UI&#x2F;UX design methodology, patterns, trends, techniques, and technologies.\n•\tBe able to effectively communicate with all stakeholders at all levels to evolve the approaches and implemented designs.\n•\tHave a good working knowledge of industry standard tools including Adobe Creative Suite, prototyping and wire-framing tools.<p>Candidates with good working knowledge of web presentation technologies (HTML, CSS and JavaScript) are sought as are designers who would like to cross train in these technologies (fully supported).  Any experience of styling frameworks would also be beneficial.<p>To find out more about the role please email jobs at openenergymarket dot com and we&#x27;ll get straight back to you.","time":1478016937,"type":"comment"}