{"by":"aantony","id":12849927,"parent":12846216,"text":"Scoutible | VP Engineering &#x2F; CTO | San Francisco, CA | Fulltime, ONSITE | <a href=\"http:&#x2F;&#x2F;www.scoutible.com&#x2F;hiring&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.scoutible.com&#x2F;hiring&#x2F;</a>\n(Also hiring for PMs, Frontend&#x2F;Full Stack Engineers, Interns)<p>Scoutible is on a mission to make every hire a top performer… using video games. (Here&#x27;s a short video that explains the concept: <a href=\"http:&#x2F;&#x2F;tinyurl.com&#x2F;scoutiblevideo\" rel=\"nofollow\">http:&#x2F;&#x2F;tinyurl.com&#x2F;scoutiblevideo</a>). Our team seeks an experienced engineering leader to join our fast-growing startup backed by Mark Cuban, NEA, Great Oaks and other top VCs and investors.<p>Some quick bullets about us:\n-Scoutible launched at Tech Crunch Disrupt in May\n-Scoutible won the GStartup Worldwide 2016 Competition in September\n-Scoutible was featured in Fast Company in October (<a href=\"http:&#x2F;&#x2F;tinyurl.com&#x2F;scoutiblefastco\" rel=\"nofollow\">http:&#x2F;&#x2F;tinyurl.com&#x2F;scoutiblefastco</a>)\n-Scoutible is an all-star team of engineers and PhDs from Harvard, Stanford and other top institutions<p>Role Description:<p>As Scoutible’s VP of Engineering, you will own and execute our company’s technical roadmap, alongside an ambitious, all-star team who has each other’s backs.<p>The ideal candidate has expert knowledge of modern web technologies and frameworks, has built backend infrastructure and&#x2F;or data pipelines, and has experience growing engineering teams shipping software products. Interest in data science, machine learning, and&#x2F;or big data is a plus. Your role will involve hands-on coding balanced with engineering team management. As the team grows, aligning the vision and milestones we set forth as a team will be a primary focus. There is the opportunity for a significant equity stake for the right candidate.<p>Our product-first organization solves the #1 challenge for every company: hiring the best talent.  You should be passionate about delivering first-rate solutions and eager to make a significant impact on the success of the entire company.<p>----\nWe are also hiring for a few other roles (check out the links for more info):<p>VP Engineering: <a href=\"http:&#x2F;&#x2F;www.scoutible.com&#x2F;vpeng\" rel=\"nofollow\">http:&#x2F;&#x2F;www.scoutible.com&#x2F;vpeng</a>\nProduct Manager: <a href=\"http:&#x2F;&#x2F;www.scoutible.com&#x2F;product-manager\" rel=\"nofollow\">http:&#x2F;&#x2F;www.scoutible.com&#x2F;product-manager</a>\nFrontend Engineer: <a href=\"http:&#x2F;&#x2F;www.scoutible.com&#x2F;frontend-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;www.scoutible.com&#x2F;frontend-engineer</a>\nInterns in engineering, data science, and marketing<p>Thanks! Our team is excited to hear from you. You can reach out in 2 seconds via any of our job links and we&#x27;ll follow up immediately.","time":1478033656,"type":"comment"}