{"by":"shaggyfrog","id":12849821,"parent":12846216,"text":"Copperleaf Technologies | Vancouver, BC, Canada | Full-Time | ONSITE<p>We build products to help companies managing millions of dollars of assets make better decisions. Our core product, C55, helps companies decide which projects to invest in, how to reduce their risk, increase safety, and reduce their environmental impact. We are one of the top 20 Fastest-Growing Software Companies in Canada and winner of the BC Tech 2016 Emerging Company of the Year Award.<p>We want to expand our development team significantly in the next year. We have a number of positions available, and especially looking to fill roles on a few different teams right now:<p>1. An existing Django&#x2F;Python stack “cloud” team (which I am on), working on a new product. We’re looking for all kinds of developers (frontend, backend, full-stack). Experience with JavaScript is a plus, and having experience across the whole stack (including Postgres) is a big plus. We’d love to have all of our headcount filled for January 1st!<p>2. A new Django&#x2F;Python stack &quot;cloud&quot; team, building a new product based on a successful feature in our core product. Similar setup to the existing team.<p>3. The third “cloud” team, using a Node.js&#x2F;JavaScript stack, also working on a new product. They are using Angular on the front end, and Postgres on the back. All the “cloud” teams use modern devops tech like AWS, Ansible, and Docker to manage deployments.<p>4. The analytics team, using the core product’s C#&#x2F;ASP.NET stack, is looking for a developer for the predictive-analytics module of C55, which creates forecasts based upon risks. This is a great position for someone who is mathematically-inclined, likes algorithms, probability, stochastic processes, graph theory, and linear programming.<p>There are also several other open non-development positions at <a href=\"http:&#x2F;&#x2F;www.copperleaf.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.copperleaf.com&#x2F;careers&#x2F;</a><p>I joined Copperleaf back in April. The people here are really nice, they care about what they do, and they have a lot of domain knowledge.<p>If any of that sounds interesting to you, please fire off an e-mail to me (Tom) at thauk@copperleaf.com and we can chat a bit more!","time":1478032730,"type":"comment"}