{"by":"ejcx","id":12847089,"parent":12846216,"text":"CloudFlare <a href=\"https:&#x2F;&#x2F;www.cloudflare.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cloudflare.com&#x2F;</a> | San Francisco, CA; London, UK; Singapore, SG; Urbana-Champaign, IL; Austin, TX | VISA, ONSITE<p>CloudFlare is building a better Internet -- performance and security optimization at the edge. Our long term goal is to give every site the same performance, security, and reliability that major sites like Google and Facebook accomplish, without any specialized network hardware or complicated administration. We enhance millions of sites, including this one. We&#x27;re hiring for a variety of roles -- started 2015 at 128, ended around 220, doubling again in 2016.<p>This is a perfect time to join -- product market fit is established, but there&#x27;s a lot of great engineering, product, sales, and support work to be done. We&#x27;ve publicly said we&#x27;re profitable and on track for long term independent success. You may wish to check out our blog to see the kinds of engineering work we do. (<a href=\"https:&#x2F;&#x2F;blog.cloudflare.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.cloudflare.com&#x2F;</a>).\n<a href=\"https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team</a> has a listing of positions. We&#x27;re always hiring for operations&#x2F;SRE, sales, general systems engineering (mostly in Go, nginx, and network, as well as DNS at scale), and web development. Specific roles we&#x27;re keen to hire include:<p>0) Front End Engineer(s): building new UI&#x2F;UX to expose controls and data to customers is an increasing portion of what we do. Our current front-end stack is Backbone + Marionette with Browserify and Sass. Our new projects are using React + Redux + Babel + css-modules, and generally adopting Higher Order Components. We&#x27;re also starting the process of re-imagining our main WWW Front-end stack with a migration to Redux.<p>1) Data Engineering(s) -- We have a ton of different technologies that our data engineers work with, and they are a really strong core team here. Kafka, PostgreSQL, Docker, Mesos, Marathon, Chronos, nginx, and so many more technologies.<p>2) Product Security Engineer -- We have a lot of applications and need more talented software engineers who love to break and fix. We need hands on engineers who are not afraid to dive in and drive fixes to completion, and evangelize security.<p>3) Systems Engineer (Austin) -- We are hiring systems engineers at all of our offices, but our Austin office is growing very quickly. Our Austin office is working on some really new and innovative projects. Web and distributed systems built with Go, Node, Docker, and much more.<p>If you&#x27;re interested, please apply through the <a href=\"https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team</a> link, our recruiting team looks at every single application from every applicant.","time":1478016398,"type":"comment"}