{"by":"johanmena","id":12848820,"parent":12846216,"text":"PulsePoint (<a href=\"https:&#x2F;&#x2F;pulsepoint.com\" rel=\"nofollow\">https:&#x2F;&#x2F;pulsepoint.com</a>) | Senior Backend Engineer, Scala | New York, NY | Full-time, remote or onsite\nWe&#x27;re looking for an Senior Backend Engineer to help us architect and scale our micro-service oriented platform. Some technologies we use on a daily basis: Scala, Akka (cluster, http, fsm, pubsub, many more), Play, Docker, Mongo, PostgreSQL and Jenkins. We also have some Clojure and Ruby sprinkled around, and we&#x27;re looking to introduce some more of both. We like functional programming and hopefully you do too! Other teams have an array of services that we can take advantage of like Mesos, Kafka, Spark, Cassandra, Zookeeper, ELK, Hadoop, etc. Ideally you&#x27;ll have plenty of hands-on Scala and Akka experience, but a strong Java background is ok too. You need to have experience working with distributed systems too.<p>PulsePoint (<a href=\"https:&#x2F;&#x2F;pulsepoint.com\" rel=\"nofollow\">https:&#x2F;&#x2F;pulsepoint.com</a>) | Senior Full-Stack Engineer (Scala, JavaScript) | New York, NY | Full-time, remote or onsite\nSimilar role to the above, but we&#x27;d expect you to have senior-level JavaScript experience. We&#x27;re currently running on Angular 1 (CoffeeScript, JavaScript), and are in the process of migrating to a React &#x2F; Flux stack. If you have shipped a few JS projects and are interested in working with some of these technologies, please reach out!<p>About PulsePoint: We are profitable company (so we&#x27;re not going away any time soon) in the advertising technology industry. We have nice benefits like medical, dental, vision, 401k match up to 6%, life insurance, stocked fridges, beers, generous vacation, etc. (everything you&#x27;d expect from a tech company these days and then some): Check it out: <a href=\"http:&#x2F;&#x2F;www.pulsepoint.com&#x2F;Benefits&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.pulsepoint.com&#x2F;Benefits&#x2F;</a> — We were also voted one 50 best places to work in 2016 by Inc, and by Crain just last week (<a href=\"http:&#x2F;&#x2F;www.crainsnewyork.com&#x2F;article&#x2F;20160928&#x2F;SMALLBIZ&#x2F;16092...\" rel=\"nofollow\">http:&#x2F;&#x2F;www.crainsnewyork.com&#x2F;article&#x2F;20160928&#x2F;SMALLBIZ&#x2F;16092...</a>)! Finally, to save you the trouble, here&#x27;s our Glassdoor page: <a href=\"https:&#x2F;&#x2F;www.glassdoor.com&#x2F;Overview&#x2F;Working-at-PulsePoint-EI_...\" rel=\"nofollow\">https:&#x2F;&#x2F;www.glassdoor.com&#x2F;Overview&#x2F;Working-at-PulsePoint-EI_...</a>. :-)<p>Johan (jmena@pulsepoint.com) from PulsePoint here! Both of these roles are for my team (I&#x27;m a engineer here), so if you have any questions (technical or otherwise) or are interested in applying feel free to reach out directly. Please include your resume, GitHub profile, and anything else of interest.","time":1478025053,"type":"comment"}