{"by":"maxaf","id":12847191,"kids":[12847389],"parent":12846216,"text":"Canary (<a href=\"https:&#x2F;&#x2F;canary.is\" rel=\"nofollow\">https:&#x2F;&#x2F;canary.is</a>) | New York, NY | Platform Engineer | Full-time | ONSITE<p>We&#x27;re the innovative home security company that grew out of a [crowdfunding\ncampaign][0] and brought to market our easy-to-use and user-friendly video\nmonitoring solution. Canary combines the latest advances in computer vision,\nlearning, and data science to help our users live more secure lives.<p>I lead the platform engineering team at Canary, and am looking to grow this\nteam in pursuit of making our home security devices faster and smarter.<p>Canary&#x27;s first security camera is unique in that it comes with multiple onboard\nsensors - temperature, air quality, and humidity - that produce a continuous\nsecond data stream in addition to the visuals captured by each device.<p>Our second product is a [battery-powered outdoor security\ncamera](<a href=\"https:&#x2F;&#x2F;canary.is&#x2F;flex&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;canary.is&#x2F;flex&#x2F;</a>) that is without doubt the coolest piece of\ntechnology I&#x27;ve ever worked on. My team is responsible for the command channel\nwhich allows us to keep in touch with sleeping, battery-powered devices that\nexist mostly in a low-power state. This presents many unique challenges in\nareas ranging from cryptography to asynchronous networking.<p>We&#x27;re all passionate about doing right by our users, and this passion shows in\nour designs, code, and planning.<p>Please have a look at the [job posting][1] if you&#x27;re interested in learning\nmore about the team and what we do. I&#x27;m also happy to answer any questions -\ne-mail is in my profile.<p>[0]: <a href=\"https:&#x2F;&#x2F;www.indiegogo.com&#x2F;projects&#x2F;canary-the-first-smart-home-security-device-for-everyone#&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.indiegogo.com&#x2F;projects&#x2F;canary-the-first-smart-ho...</a>\n[1]: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;s2a6b1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;s2a6b1</a>","time":1478016951,"type":"comment"}