{"by":"orf","id":12849682,"parent":12846216,"text":"Context Information Security | London, Germany, Australia. VISA INTERNS | Full-stack Senior Python dev + Infosec Security Consultants | ONSITE<p>Context is looking for a senior Python developer to join our London based development team. We are a Python and Django team and work on both internal and client-facing projects in the information security space. We&#x27;ve got some very interesting large-scale projects in the pipeline for some of the worlds largest companies and are looking for someone great to join us.<p>We work in a very relaxed environment, with beers at your desk on a Friday and a office-wide ping-pong tournament. You will get ample opportunities to attend conferences all over Europe with our training budget, including EuroPython and Djangocon. Our last hire was from Hacker News so if you&#x27;re interested and think you fit the bill then send an email to recruitment@contextis.co.uk with your CV for more info.<p>We are also always looking for experienced information security consultants as well as people who can transfer technical skills from other areas. If you are an excellent developer or sysadmin or working in another technical role, and have a keen and demonstrable interest in information security then we’d love to hear from you. We are looking for people who can transfer technical skills from other areas into penetration testing and can support you in doing so. At Context you’ll have the opportunity to work on a range of interesting projects (we&#x27;re the guys who got Doom playing on a hacked printer[1]), in a team with a structured training and development plan and a strong focus on technical excellence.<p>Apply: recruitment@contextis.co.uk<p>Careers Page: <a href=\"http:&#x2F;&#x2F;www.contextis.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.contextis.com&#x2F;careers&#x2F;</a><p>1. <a href=\"https:&#x2F;&#x2F;www.wired.com&#x2F;2014&#x2F;09&#x2F;doom-printer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.wired.com&#x2F;2014&#x2F;09&#x2F;doom-printer&#x2F;</a>","time":1478031406,"type":"comment"}