{"by":"thruflo","id":12847139,"kids":[12863271,12849146,12870579],"parent":12846216,"text":"Opendesk | London or REMOTE | Lead Developer, Front-end Developer, Full-stack &#x2F; Systems Developer<p><a href=\"https:&#x2F;&#x2F;www.opendesk.cc\" rel=\"nofollow\">https:&#x2F;&#x2F;www.opendesk.cc</a> is an open making platform based around workspace furniture. What&#x27;s different about our furniture is that it&#x27;s designed to be distributed as a digital file, downloaded and made locally anywhere in the world. We have a passionate early adopter community, a global network of professional makers and customers like Nike, Etsy, Arup and Digital Ocean.<p>We&#x27;re mainly a London-based team of ~20 people working across web design &amp; development, product design, CAD engineering and digital manufacturing. We&#x27;re looking for a:<p>* Lead Developer\n* Front-end Developer\n* Full-stack &#x2F; Systems Developer<p>## Lead Developer -- London, £40-65k<p>You&#x27;ll lead the development of our online systems. These include a marketing website, a fulfilment marketplace, a design publishing and distribution system and various online integrations.<p>You need to be full-stack unix, deep on web development with experience across multiple products &#x2F; projects &#x2F; stacks and languages. It&#x27;s a practical, hands-on role leading the team, coding, code reviewing, writing specs, collaborating with designers, making system design and architectural decisions and generally using technology to get things done.<p>## Front-end Developer -- London, £20-35k<p>You&#x27;ll develop front-end interfaces for our customer, maker and designer audiences. You need to be a strong Javascript, CSS and HTML developer able to work with Angular directives and Ruby-based CMS templates. You&#x27;re comfortable refactoring to improving performance and maintainability.<p>## Full-stack &#x2F; Systems Developer -- London or Remote, £20-40k<p>You&#x27;re a full-stack polyglot developer happy to design and develop back-end systems, integrations and automated workflows. You&#x27;ll inherit a medium sized Python web application (Pyramid, SQLAlchemy), Ruby content management system (Spontaneous.io) and a domain specific design publishing and distribution system (see <a href=\"https:&#x2F;&#x2F;opendesk.github.io&#x2F;winnow&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;opendesk.github.io&#x2F;winnow&#x2F;</a>). Your job is to maintain and extend these systems and generally develop and improve our web applications, online systems and infrastructure.<p><i></i>*<p>We&#x27;re looking for talent, drive and passion for our model of open making. All these roles have solution design and decision making responsibility and everything we do is an iterative collaboration between creative technologists.<p>If that sounds like you then please do get in touch. To be clear: the CTO and Front-end roles must be based in London (we&#x27;re in Hackney) whilst the back-end roles can be in London or remote. We&#x27;re ideally looking for you to start in December or January.<p>If you&#x27;re interested, email dev-recruitment@opendesk.cc with information about you (CV or profile links), the role you&#x27;re applying for and a short personalised cover note explaining exactly why you&#x27;re interested in it.","time":1478016654,"type":"comment"}