{"by":"JMCQ87","id":12847964,"kids":[12848522],"parent":12846216,"text":"MiNODES (<a href=\"http:&#x2F;&#x2F;www.minodes.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.minodes.com&#x2F;</a>) | Berlin, Germany (ONSITE) | full-time | Software Engineers &#x2F; Developers, Business Intelligence, Data Analytics, Tableau | VISA OK<p>Minodes is a startup in the retail analytics space. Based in the heart of Berlin near Checkpoint Charlie and backed by well-known investors, we provide (offline) retailers innovative solutions to understand their business better and enhance their customers’ in-store experience.<p>We are an international team of ~30 highly motivated people from various backgrounds. From a technology perspective, we have thousands of devices with our own firmware installed in our customers’ retail stores around the world and our own server infrastructure to manage these devices and to process the terabytes of data that they are producing via machine learning algorithms.<p>Our tech stack consists of Python for the data processing, Ruby on Rails for applications on top of that, and Cassandra and Postgres for data storage. We are also working on our first own mobile SDKs. We offer a great opportunity for personal and professional growth in a multicultural environment. We work, learn and develop while having lots of fun on the way. The usual perks (drinks, breakfast, awesome office, …) are included. We’re also happy to help with visa and relocation where necessary.<p>We are looking for a wide range of people to join our team, including:<p>Developers (Python, Rails, OpenWRT and others): <a href=\"https:&#x2F;&#x2F;minodes-jobs.personio.de&#x2F;job&#x2F;6481\" rel=\"nofollow\">https:&#x2F;&#x2F;minodes-jobs.personio.de&#x2F;job&#x2F;6481</a><p>Business Analysts: <a href=\"https:&#x2F;&#x2F;minodes-jobs.personio.de&#x2F;job&#x2F;6387\" rel=\"nofollow\">https:&#x2F;&#x2F;minodes-jobs.personio.de&#x2F;job&#x2F;6387</a><p>Tableau Jedis: <a href=\"https:&#x2F;&#x2F;minodes-jobs.personio.de&#x2F;job&#x2F;6389\" rel=\"nofollow\">https:&#x2F;&#x2F;minodes-jobs.personio.de&#x2F;job&#x2F;6389</a><p>You can find even more jobs, including internships here: <a href=\"https:&#x2F;&#x2F;minodes-jobs.personio.de&#x2F;?language=en\" rel=\"nofollow\">https:&#x2F;&#x2F;minodes-jobs.personio.de&#x2F;?language=en</a>","time":1478020672,"type":"comment"}