{"by":"lenan","id":12849888,"parent":12846216,"text":"AMAZON LAB126 HIRING SYSTEM DEVELOPMENT MANAGERS | SUNNYVALE, CA | FULL-TIME | ON-SITE<p>Amazon Lab126 is an inventive research and development company that designs and engineers high-profile consumer electronics. Lab126 began in 2004 as a subsidiary of Amazon.com, Inc., originally creating the best-selling Kindle family of products. Since then, we have produced groundbreaking devices like Fire tablets, Fire TV and Amazon Echo. What will you help us create? \nThe Role:\nAs the Design Technologies Systems Development Engineering Manager, you will provide exceptional leadership &amp; management for a staff of Systems Development Engineers within the Hardware Engineering DevOps environment for Amazon. Your team will be the point of contact for infrastructure systems management, fleet planning and liaison to Amazon&#x27;s infrastructure teams (AWS) to support Amazon&#x27;s Digital Devices Engineering teams. \nThe ideal candidate will have the following traits: Enjoy being a really great people manager. Building, motivating and mentoring a systems engineering team is an important part of this role. He&#x2F;She will have experience in recruiting and retaining talent and excel in day-to-day people and performance management tasks. The Systems Development Engineers within our team are instrumental in creating, automating, deploying, operating and scaling distributed systems. We are seeking passionate engineers with strong Linux systems engineering skills who proactively automate away problems and constantly look to improve quality of service for our customers. \nHave a strong understanding of cloud-based infrastructure technologies, Linux, Windows, networking and security technologies, and software development. He&#x2F;She will enjoy keeping technical skills reasonably current, to the point of still contributing to architecture discussions. Regularly take part in deep-dive troubleshooting exercises and drive technical post-mortem discussions to identify the root cause of complex issues. \nBe great fun to work with. Our company credo is “Work hard. Have fun. Make history.” The right candidate will love what they do and instinctively know how to make work fun. \nKnow how to run a tight, lean, efficient operation. The right candidate will want to measure everything and be very data driven. He&#x2F;she will excel at using metrics, monitoring and alarming to measure and improve the operational processes and performance of their team.\nBasic qualifications\n-Bachelor&#x27;s degree in Computer Science or other technical degree and&#x2F;or equivalent experience\n-7+ years of technical management experience, overseeing systems administrators, engineers, and or support personnel, including remote teams\n-Experience in Linux&#x2F;UNIX, Windows, networking fundamentals and systems integration<p>Preferred qualifications\n-Master&#x27;s degree in Computer Science\n-Motivates others by creating a climate in which people want to do their best\n-Engineering experience with tools used to manage the procurement, provisioning and instrumentation of shared services.\n-A firm understanding of cloud based solutions and virtualization\n-Demonstrable expertise around specifying, designing, and&#x2F;or implementing system health, performance monitoring tools, and software management tools for 24x7 environment\n-Flexibility, thinking on your feet, and strong problem solving skills\n-Demonstrable track record dealing well with ambiguity, prioritizing needs, and delivering measurable results in an agile environment\n-Excellent verbal and written communication skills\n-Strong leadership skills and a successful track record of driving projects to completion<p>IF INTERESTED, PLEASE SEND RESUMES TO LENAN@LAB126.COM","time":1478033381,"type":"comment"}