{"by":"itsdrewmiller","id":12846198,"kids":[12847394],"parent":12846216,"text":"NGP VAN - Washington, DC and Boston&#x2F;Somerville, MA<p>* Software Engineer (DC)<p>* IT Help Desk &#x2F; Systems Administrator I (Boston)<p>NGP VAN is the world’s leading political technology firm, providing campaign and organizing technology to Democrats, progressives, and non-partisan organizations. We built the voter contact and volunteer management tools used by Obama for America. Nearly every State Democratic Party in the United States distributes our VoteBuilder tools to Democrats up and down the ticket, and we provide industry-leading organizing tools that enable labor unions, environmental groups, pro-choice advocates, civil rights activists, and progressive political parties to win their campaigns around the world. Our fundraising and compliance software is used by the majority of Democrats from the Presidential level on down, and our engagement platform has become the most-used toolset for Democratic campaigns as well.<p>NGP VAN has been recognized by Inc. magazine as a fast-growing company and an awesome place to work. And they are right!<p>Company Site: <a href=\"http:&#x2F;&#x2F;ngpvan.com\" rel=\"nofollow\">http:&#x2F;&#x2F;ngpvan.com</a><p>NGP VAN believes a diverse, inclusive staff makes us a stronger company and better partner for our clients.  Two of our founders are a gay couple.  We’re committed to hiring people of all races, ethnicities, ages, sex, genders, sexual orientation or gender identities, marital status, religions, and disabilities.  Women, people of color, LGBTQ individuals, and members of other minority or marginalized groups are encouraged to apply.<p>We interview across a pretty wide range of experience levels. Hit me up at dmiller at ngpvan dot com for more info or to apply. I&#x27;m the VP of Engineering here.<p>All job descriptions are available at <a href=\"https:&#x2F;&#x2F;github.com&#x2F;NGPVAN&#x2F;job-descriptions\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;NGPVAN&#x2F;job-descriptions</a> - feel free to flag issues or submit PRs, although if you try to radically redefine the role your PR may be denied.  :-)<p>Keywords: ONSITE","time":1478012630,"type":"comment"}