{"by":"ChuckNovice","id":12853429,"kids":[12874120],"parent":12846216,"text":"Paris-Meudon Observatory | Meudon (Paris), France | ONSITE<p>The Paris-Meudon observatory &#x2F; LESIA (Laboratory of space studies and instrumentation for astrophysics) is looking for a developer to contribute to the on-board computer software of a nanosatellite.<p>The Picsat project:\nThe developer will integrate the Picsat team. Picsat is the name of a nanosatellite (3U cubesat), aiming to perform scientific observation of the star &quot;Beta Pictoris&quot;. The satellite is currently in the integration and test phase, the launch is planned for the summer 2017.<p>Candidate profil:\n- proficiency in C++ is required\n- having at least one of the following skills is highly preferred : embedded systems, real-time computing\n- a good scientific background is preferred (e.g. Scientific Baccalaureate)\n- availability: full time is preferred, part time down to 60% possible\n-  5th year student in computer school, or recent graduate\n- starting not later than early January 2017, December 2016 preferred\nMonthly salary for full time (depending on the type of contract, to be chosen by the candidate):\n- internship, 5th year student,  before graduation: 554€ (indemnity amount is fixed by law)\n- &quot;internship&quot;, but officially the contract is a CDD (also 5th year student,  before graduation): 1542€ net (to be confirmed)\n- CDD (after graduation&#x2F;with diploma): 1680 - 1932€ net<p>Note on the salary and professional perspectives:\nWe are aware that the salary ranges can differ significantly compared to what is expected for the type of profile sought after. Unfortunately it is constrained by CNRS salary grids.\nHowever the job has a strong potential to open the way towards a follow-up contract in prestigious institutions, with much higher wages,  such as the European Space Agency (ESA), the European Southern Observatory (ESO), or even NASA. The job is ideal for somebody interested by a career into the space industry (without being limited to public organizations) and&#x2F;or linked to scientific research in general, and astrophysics in particular.<p>Contact:\nTo apply send a CV and eventual questions to: antoine.crouzier@obspm.fr\nFrench nationality or a &quot;carte de séjour&quot; with validity over the whole employement period is required to apply\nTo learn more about Picsat: <a href=\"http:&#x2F;&#x2F;lesia.obspm.fr&#x2F;PICSAT.html\" rel=\"nofollow\">http:&#x2F;&#x2F;lesia.obspm.fr&#x2F;PICSAT.html</a>","time":1478082387,"type":"comment"}