{"by":"airpmb","id":12858590,"parent":12846216,"text":"Vahana Project - A³ by Airbus Group | Santa Clara, CA | ONSITE  | Full-Time<p><a href=\"https:&#x2F;&#x2F;vahana.aero\" rel=\"nofollow\">https:&#x2F;&#x2F;vahana.aero</a><p>At Vahana, we are passionate about personal flight. The aircraft we’re building doesn’t need a runway, is self-piloted, and can automatically detect and avoid obstacles and other aircraft. Designed to carry a single passenger or cargo, we’re aiming to make it the first certified passenger aircraft without a pilot. We aim to fly a full-size prototype before the end of 2017, and to have a productizable demonstrator by 2020.<p>We seek to help enable truly vertical cities by opening up urban airways in a predictable and controlled manner. We believe that full automation will allow us to achieve higher safety by minimizing human error. Our aircraft will follow predetermined flight paths, with only minor deviations if obstacle avoidance is needed. We believe this mode of operation will be compatible with future airspace management systems and will allow more aircraft to share the sky. Full automation also enables us to make our aircraft as small and light as possible, and will significantly reduce manufacturing costs.<p>We’re always looking for talent and for development partners. If you’d like to be part of the Vahana team, we want to hear from you. Please look at our current openings and reach out to us if you feel you can contribute!<p>More Info on Vahana -- <a href=\"https:&#x2F;&#x2F;vahana.aero\" rel=\"nofollow\">https:&#x2F;&#x2F;vahana.aero</a>\nMore Info on A³ -- <a href=\"http:&#x2F;&#x2F;airbus-sv.com\" rel=\"nofollow\">http:&#x2F;&#x2F;airbus-sv.com</a><p>Current Openings -- <a href=\"https:&#x2F;&#x2F;vahana.aero&#x2F;tagged&#x2F;work-with-us\" rel=\"nofollow\">https:&#x2F;&#x2F;vahana.aero&#x2F;tagged&#x2F;work-with-us</a><p>• Avionics Electrical Engineer\n\t• Avionics Embedded Software Engineer\n\t• HIL Software Engineer\n\t• Lead Test Engineer\n\t• Software Engineer\n\t• Sr. Engineer, Motion Planning, Autonomous Systems\n\t• Sr. Engineer, Perception, Autonomous Systems\n\t• Deputy Project Manager","time":1478115958,"type":"comment"}