{"by":"lagamn","id":12851683,"parent":12846216,"text":"Earthwave Technologies | <a href=\"http:&#x2F;&#x2F;www.earthwavetech.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.earthwavetech.com</a> | Indianapolis, IN | On-Site<p>Earthwave Technologies is looking for experienced Mobile Application and Software Developers.<p>You are a good candidate for this position if you like to work under minimal supervision and experience fulfillment by delivering what was only an imaginative idea into a polished fully functional feature that shocks and awes the customer. \nFurthermore, You have a team player mentality; you seek to mentor and be mentored. You understand that there is not a limited amount of ways to express code and that not one way of expressing logic is better than another. But, you do however believe in keeping things organized, modular, efficient, flexible, DRY and most importantly scalable.<p>Our software developers must be proficient in: \n&gt; Python, Django, Git, MySQL, Linux, jQuery, Restful APIs.<p>Our mobile developers must be proficient in: \n&gt; Kotlin, Java, Swift 3, Python, MySQL, Linux, jQuery, Restful APIs.<p>About our Team &#x2F; Why work with us?<p>At Earthwave Technologies, we are paving the future of managing construction initiatives. Our developers are a small group of tightknit, self-fueled individuals with an innate ability to create, who believe in the success of the team. We believe in trying new technologies, talking things through, and recognition for our accomplishments. We know each of us is human and therefore not perfect, but we mentor each other, hold each other accountable, and share in both good and bad. We push each other to be better, help each other achieve short and long term goals, and ultimately do anything we set our minds to.<p>How to apply<p>Very casual just send me your resume at luis.garza@earthwavetech.com and we&#x27;ll make sure to get back with you. Make sure to provide us your github&#x2F;bitbucket&#x2F;gitlab profile should you happen to have one. We want to make sure you will be a good fit!","time":1478051411,"type":"comment"}