{"by":"JanoschF","id":12856886,"parent":12846216,"text":"Data Scientist (f&#x2F;m)\nBerlin, Germany, ONSITE, Full time, We support VISA<p>Job description:\nAs a data scientist you&#x27;re positioned at a crucial intersection of the company - infusing human intelligence into machine-learning algorithms. Your day-to-day work will be about translating fuzzy human behavior into clear code, enhancing our algorithms&#x27; overall performance. You&#x27;ll be working alongside risk experts, developers and business stake-holders, reporting directly to the CTO.<p>Among others, your responsibilities would include:\n    -You will design, develop and implement algorithm improvements into our core engine, allowing it to reach new accuracy levels, combining statistical and behavioral machine learning methods\n    -You will tackle the most complex data-enrichment challenges requiring a deep understanding of the fraud domain as well as a well-rounded technical skill-set\n    -You will identify, acquire and implement new data sources to feed the core engine<p>Skills &amp; Requirements:\n    -You are an excellent communicator that can translate business needs to code and vice versa. You can clearly articulate statistical modeling and machine-learning techniques to non-experts.\n    -You have at least a Master&#x27;s degree in physics, computer science, applied mathematics, engineering or a related field\n    -You have at least 5 years of professional work experience, where you were required to solve analytical problems using quantitative approaches. Past experience in Cyber-Security, FinTech or eCommerce is a big plus.\n    -A strong passion for empirical research and for answering hard questions with data\n    -You have mastered at least one data analysis tool: R, Matlab, or SAS\n    -Very good familiarity with relational databases and SQL\n    -Experience working with distributed computing tools is a plus (Map&#x2F;Reduce, Hadoop, Hive, etc.)\n    -Experience with C++&#x2F;GoLang is a big plus\n    -Business fluent in English<p>What we offer:\n    -A dynamic, young, highly motivated and international team with flat hierarchies\n    -Fun, creative and focused teams committed to learning and problem-solving through collaboration\n    -Competitive remuneration package\n    -Office located in the heart of Berlin<p>We are looking forward to receiving your applicatio: jobs@fraugster.com.","time":1478105961,"type":"comment"}