{"by":"adam-p","id":12855877,"parent":12846216,"text":"Psiphon (psiphon.ca) | IT Admin | Toronto, Canada | Onsite<p>= What we do =<p>We develop and operate Psiphon, an Internet censorship circumvention network that helps millions of people in freedom-restricted countries access uncensored Internet every day.<p>We work at the leading edge of circumvention technology, where the latest network protocol and endpoint obfuscation research is rapidly deployed into production around the world. Our tasks include censorship technology research, server and client software development, and operation of a dynamic, global network of thousands of proxy servers.\nWe’re a small team (8 developers) looking for skilled and enthusiastic people to join us as a system administrator.<p>= What you do =<p>The successful candidate would be responsible for maintaining and improving the entire office infrastructure and would require a wide breadth of knowledge that encompasses all aspects of a small office including security and stability improvements to hardware, software, end-user systems, server and networking infrastructure.<p>== Roles and Responsibilities ==<p>* Administrate and provide technical support to all aspects of office infrastructure including networking&#x2F;server&#x2F;desktop and mobile devices.<p>* Understand, implement and enforce office security policies and best practices.<p>* Monitor office network and systems, respond to security and usability concerns in a timely manner.<p>== Qualifications and Skills ==<p>* Experience with multiple desktop&#x2F;server and mobile operating systems.<p>* Networking knowledge, including:<p><pre><code>  - Various proprietary and open source networking equipment.\n\n  - Routing&#x2F;Switching&#x2F;VLAN and VPN experience.\n</code></pre>\n* Experience implementing and maintaining wired and wireless network topology design and implementation.<p>* Experience in network security, including evaluating, implementing and auditing company security policies and procedures.<p>= Contact =<p>info+hn@psiphon.ca","time":1478101071,"type":"comment"}