{"by":"blocher","id":12850108,"parent":12846216,"text":"Engage | Paid Internship (Part or Full time) | Onsite (Alexandria, VA -- Washington, DC metro area) | Foreign Visas welcome | <a href=\"http:&#x2F;&#x2F;enga.ge\" rel=\"nofollow\">http:&#x2F;&#x2F;enga.ge</a> | Apply at <a href=\"http:&#x2F;&#x2F;engagedc.theresumator.com&#x2F;apply&#x2F;Zla9Rw&#x2F;Web-Development-Intern-Spring-2017\" rel=\"nofollow\">http:&#x2F;&#x2F;engagedc.theresumator.com&#x2F;apply&#x2F;Zla9Rw&#x2F;Web-Developmen...</a><p>About Engage:<p>We are a full-service digital agency that is dedicated to impacting the world around us through bold strategy and innovative technology. With clients that range from political campaigns to top level associations and advocacy groups, we use cutting-edge technology to tell the most compelling story for our clients.<p>About the Internship:<p>Engage is looking for a web development intern. The ideal candidate is a highly motivated student or recently graduated student interested in pursuing a career in web development and is excited to work with our in-house development team.<p>++++<p>Back-end focused internship: PHP, SQL (MySQL or similar), Wordpress theme or plugin development, or equivalent Drupal experience (Bonus: PHP framework—Laravel, Symphony, CakePHP, Zend, or CodeIgniter--REST APIs, mobile development, LAMP stack<p>++++<p>And&#x2F;or, front-end focused internship: Semantic HTML5 markup, CSS, web accessibility standards, cross browser compatibility, Javascript and jQuery, responsive layouts\n(Bonus: Vue.js, Angular, or ReactJS, Photoshop, Bootstrap, Wordpress themes)<p>++++<p>In order to be considered, you must submit work samples. Please link to your GitHub profile or portfolio&#x2F;website.<p>About Our Work Culture:<p>We love being able to provide interns hands-on experience that allows them to try new things, learn new skills, and grow. Our goal is to create an environment that will hone your skills based on your interests. Our interns are extremely important to our operations and quickly become integrated into our team. We take pride in producing high quality and award winning work, but we always find time for Nerf gun fights and team lunches. We love coming to work and think that you will too!","time":1478035103,"type":"comment"}