{"by":"vivekamn","id":12853646,"kids":[12853842],"parent":12846216,"text":"Software Engineer | Chennai, India | Pipecandy | pipecandy.com | Onsite<p>We, at PipeCandy, are trying to re-imagine the way B2B outbound prospecting is carried out, by unleashing the power of data and technology. We are building the tool that would make a sales person&#x27;s life a lot easier and prospecting, a breeze. As one of the early hires, you&#x27;d get the ground floor opportunity to move the needle right from day one and get to work with some of the brightest minds.<p>As a technical architect, you will be required to spearhead projects from its inception to the final leg. Hence, a strong sense of business and technical knowledge is required. It is essential to understand all the stages of the project as you will be in charge of the project running successfully.<p>If that excites you, read on -<p>Responsibilities:\nAbility to break down the project into smaller chunks\nFacilitating and coordinating between the tasks assigned to various teams\nEnsuring that the quality of the project stays top-notch\nUnderstanding the requirements and delivering on that\nResponsible for leading delivery teams and ensure successful end to every project\nAbility to convert business requirements into technical requirements by planning, developing and refining\nRequirements:\nExcellent communication (written and verbal) and ability to convey the message to the various members involved in the project\nAbility to constantly update and stay knowledgeable about the relevant industry practices\nExposure to designing data solutions\nExposure to data engineering, data science &amp; advanced analytics and data visualization\nLooks to solve problems with an optimistic approach and takes on challenges\nOur platform is built using Python, R, Apache Spark, Luigi and Kafka (on the data-side) and Node.js &#x2F; React (on the application side).\nWe are looking for an individual who enjoys taking initiative, adaptable and thrives in a high powered environment! A role with the best of both worlds - business + tech. If the adrenaline inside you has been thumping while reading this, then write to me – sakina@pipecandy.com","time":1478085731,"type":"comment"}