{"by":"imp","id":12868237,"parent":12846216,"text":"RVshare | Akron, OH | Onsite | QA Engineer<p>RVshare is a profitable, growing startup in Northeast Ohio. Founded in 2014, RVshare is the “Airbnb for RVs.” In a short amount of time, we have quickly become the largest peer-to-peer RV marketplace online, powering thousands of trips every year. Our mission is to empower RV owners to provide great RV rental experiences. We strive to make RV travel more seamless and accessible to renters everywhere. We are looking for self-driven people who want to help us make the most of the many opportunities ahead of us. Our friendly, flexible work environment and amazing benefits show our commitment toward our employees.<p>Job Description<p>Our small development team is looking for our first QA engineer to take charge of documenting requirements, writing acceptance criteria, and validating tests. We follow an agile test-driven development process, and we need a motivated QA engineer to help ensure that quality is built into our product along every step of the way.<p>As a QA engineer at RVshare, you will be given a large amount of responsibility. You will be entrusted to get out ahead of bugs before they happen and ask thoughtful questions to ensure the product is well built. You will work with the product designer and developers to create an appropriate test plan and then execute that test plan. You will also triage bugs as they are reported by the support team and write steps to reproduce each issue.<p>Our technology stack is a combination of PHP and Ruby on Rails, and we’re moving toward becoming 100% built on Ruby on Rails. We use Github for repository hosting, Circle CI for continuous integration testing, and AWS for infrastructure.<p>Full job description: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;rvshare&#x2F;jobs&#x2F;185834-quality-assurance-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;rvshare&#x2F;jobs&#x2F;185834-quality-assurance-engin...</a>","time":1478209194,"type":"comment"}