{"by":"ncbk12","id":12885927,"parent":12846216,"text":"NextChapter | Columbus, Ohio | Onsite | Full-time \nFull Stack Lead Software Engineer  (Ruby on Rails &#x2F; Angular.js)<p>NextChapter (<a href=\"http:&#x2F;&#x2F;www.nextchapterbk.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nextchapterbk.com&#x2F;</a>) is a web application for attorneys to prepare, manage and file bankruptcy cases online. “Turbotax for Bankruptcy Attorneys.”  We are seeking a Lead Software Engineer with focus on Ruby on Rails &#x2F; Angular.js to join the team in Columbus, Ohio. This is an opportunity to the lead engineer at a rising legal tech startup, take on a lot of responsibly and play a substantial role in the future of the company. We make sure that our early team members are well compensated in salary, equity, benefits and work-life balance. We also offer a free gym membership, generous and flexible vacation policy with paid holidays off, the technology to do your job successfully and an energetic work environment with our small team.<p>Current stack: Ruby, Rails, Postgresql, Javascript, Coffeescript, Angular.js<p>Our ideal candidate will have the following skills:<p><pre><code>  • Extensive experience in developing web applications\n  • Dedication to creating quality, maintainable code\n  • Compassion for the end user and an eye for design\n  • Experience developing REST APIs to serve web clients\n  • Firm grasp on object oriented analysis and design\n  • Passion for discovering new ways to solve problems\n</code></pre>\nWe try to keep our interview process straightforward: online code challenge (&lt;1 hr), 1-2 phone screens (&lt; 1 hr) and an on-site interview (&lt;2 hrs).<p>For more information: <a href=\"http:&#x2F;&#x2F;nextchapterbk.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;nextchapterbk.com&#x2F;jobs&#x2F;</a><p>TO APPLY: Please tell us your story and share with us why you want to be part of the NextChapter Team. Email jobs(at)nextchapterbk(dot)com. Thanks!","time":1478451379,"type":"comment"}