{"by":"tedd4u","id":12940517,"parent":12846216,"text":"Quizlet | San Francisco, CA | ONSITE | CONTRACT<p>Quizlet is looking for a frontend web engineer to work with our team to help complete our website redesign.  We&#x27;re about 50% finished and wish to accelerate completion.  This is a short-term contract position for 2 months, with no expectation of converting to full-time. We&#x27;d like at least the first three weeks onsite with option to work remote for the balance of the engagement.<p>This short-term role is great for engineers looking for a flexible gig. You&#x27;ll have the opportunity to work with a high-caliber, fast-moving team on a large-scale product — over 20M people use Quizlet learning activities every month.  You&#x27;ll be working with ES6&#x2F;React&#x2F;Stylus and contributing code on day one.<p>Some examples of what you will do:<p><pre><code>  - Bring mockups to life with ES6&#x2F;React&#x2F;Stylus\n  - Improve frontend performance\n  - Collaborate with the product manager to identify and fix issues\n  - Work with the team to ensure deadlines are understood and met\n</code></pre>\nQualifications<p><pre><code>  - Must be available to work in our San Francisco office full-time — preferably starting by mid-November\n  - At least 1 year experience working on frontend web applications — experience with git and React is preferred\n  - Self-starter — you can find out answers on your own and know when to ask questions\n  - Detail-oriented — you sweat over the details\n  - Team-oriented — you enjoy collaborating with other team members to create your best work\n  - Passion for education and&#x2F;or doing good in the world — you are excited about the impact your work will have in the lives of students and teachers every day\n</code></pre>\nQuizlet’s Team Culture<p>We’re extremely proud of the powerful impact our study tools are having on people’s lives across the U.S. and the world.  Quality, usability, and performance across all platforms is our main focus.  This has helped Quizlet grow organically to a top U.S. web brand with top-ten education apps on iOS and Android.  We regularly visit classrooms across the Bay Area to see Quizlet’s users in action.  We believe in teamwork and communication, and we believe in each other — every member has the confidence and flexibility to take a stab at new problems across functions.  We love technology and we love helping people, and we work in a warm, respectful and supportive environment.<p>How to apply: email tim@quizlet.com with your resume and link to your Github profile.","time":1478989102,"type":"comment"}