{"by":"drags","id":5304813,"parent":5304169,"text":"SF - Rails/JS - HALF-TIME with benefits (or FULL-TIME)<p>I mentioned a few days ago that we have a few engineers who work half-time-ish (and do their own things the rest of the time) and it got some positive feedback: <a href=\"http://news.ycombinator.com/item?id=5235860\" rel=\"nofollow\">http://news.ycombinator.com/item?id=5235860</a><p>We're looking to hire a couple more engineers who are interested in being part of a team but would prefer to work 24-40 hours per week instead of the usual 50+. If it sounds interesting let me know (ragalie@verbasoftware.com)<p>=========<p>About us:<p>The college textbook market is currently being disrupted. Verba helps college bookstores transform themselves so that they a) understand and embrace the power of the nets, b) become agents of change in the textbook industry instead of agents of reaction and c) continue to make a healthy profit.<p>About 300 colleges and universities use our applications to acquire low-cost inventory and price textbooks competitively. Then millions of students visit our white-labeled sites to transparently compare the bookstore's offers against online competitors, and around 80% of students choose to buy from their local bookstore.<p>We're looking for people familiar with Ruby, Rails, MySQL and JS who can help us grow faster. We (thankfully) don't have too many scaling problems on the technical side, but we have a ton of opportunities (product and partner-based) that we could move on much faster with a few more hands on deck, and we're always looking for ways to provide more control to our support team so they can provide top-notch customer service.<p>The ideal person has strong Rails knowledge, solid testing practices, a good head for architecture and knows enough JS to help out on front-end.<p>Be sure to check out our website (<a href=\"http://www.verbasoftware.com\" rel=\"nofollow\">http://www.verbasoftware.com</a>) so you can read all about our current products and hear people say nice things about us. :)","time":1362152619,"type":"comment"}