{"by":"salsf","id":5304856,"parent":5304169,"text":"SF, CA; ecommerce technology leader<p>OUR CHALLENGE:  ecommerce today is stuck as a metaphor of offline retail.  Online replications of the offline world may have extreme scale, but are highly disruptable since they are based on brick and mortar paradigms not actual customer/brand relationships.  iTunes was the best online record store imaginable, but Spotify is quickly disrupting it.  Amazon is a (very, very well run) giant Wal-Mart – ecommerce can be better than massive-scale superstores.<p>Our software changes the online retail from \"superstores\" to multi-year, high-value brand/consumer relationships.  We do this by facilitating long-term, multi-SKU relationships between brands and customers.   The first market we are targeting is household products – because it’s huge, underserved online, and going through rapid channel shift (and, the multi-SKU element works incredibly well in this niche).<p>MISSION STATEMENT ePantry's mission is to shrink the environmental footprint of American homes by making sustainably produced household products the most convenient option for busy consumers. Our technology provides each individual with customized ongoing delivery of branded sustainable consumables (e.g. soap, laundry detergent, paper towels) simplifying the process of never running out of the products he/she needs.  You will enjoy buying toilet paper!<p>WORTH KNOWING<p>* High-friction (private) MVP reached $200k run rate in first month with $0 marketing.<p>* Annual ARPU &#62;$500<p>* $40 billion niche with &#60;2% ecommerce penetration<p>* Well-funded by the entrepreneurs &#38; investors behind Hotwire, Friendster, Everfi, and Citysearch<p>* @RocketSpace<p>* Niche ecommerce works: Alice, Dollar Shave Club, Manpacks, Quidsi, Zappos<p>* Team of 4 full time.  Founder was employee #1 at twice startups that raised over $100mm<p>\\TECHNOLOGY LEADER: Experienced full stack web developer, knows his/her way around ecommerce, managing teams, lean-loving, not scared of big companies, desire to build something awesome. eco-warrior-ness not required.  All titles (CTO, co-founder) are on the table for the right person.<p>You Get: Competitive cash, above-market equity, full benefits, flexible/fun environment, passionate team, and to leave the world a little better than you found it.<p>CONTACT Would love to brainstorm about our challenges/opportunities over a coffee/beer any time.  sl@epantry.com","time":1362152917,"type":"comment"}