{"by":"pwang","id":5304846,"kids":[5307206],"parent":5304169,"text":"Austin, TX; NYC; Boston; or Remote - Front end Python web dev, and UI/UX designer for a Python data analytics startup<p>Continuum Analytics (<a href=\"http://continuum.io\" rel=\"nofollow\">http://continuum.io</a>) is building a Python-based advanced analytics platform in the browser, named Wakari (<a href=\"http://wakari.io\" rel=\"nofollow\">http://wakari.io</a>).  We have a solid team that's put together a great product, but we need a few more great people to help us really make this thing shine.<p>The front-end web developer position is going to mostly help us build out the most cutting-edge data visualization and dashboarding UIs, as well as be a general JS/HTML/CSS guru. Some knowledge of the backend stack (especially in Python) would be great, and there is a good chance that we'll be targeting tablets and mobile HTML designs down the road.<p>The UI/UX designer will not just help us develop refined workflows throughout the entire application, but will also be heavily involved in discussions about novel data analysis and data viz interfaces.  They will also be leaned upon to help us with print design, for marketing collateral.  We are also involved with a number of other open-source efforts, all of which can use some more design expertise for their web properties.<p>Continuum Analytics is building some of the coolest backend tools for Python in Big Data and high-performance computing.  We recently made some waves by winning a $3 mil contract from DARPA to build out a Python to x86/GPU compiler (<a href=\"http://numba.pydata.org\" rel=\"nofollow\">http://numba.pydata.org</a>), a distributed array/tabular processing system (<a href=\"http://blaze.pydata.org\" rel=\"nofollow\">http://blaze.pydata.org</a>), and a next-generation interactive graphing engine for JavaScript + Python (<a href=\"http://github.com/ContinuumIO/bokeh\" rel=\"nofollow\">http://github.com/ContinuumIO/bokeh</a>).<p>We are a very young startup based in sunny Austin, TX, but with many devs working remotely.  We have full benefits and have a very distributed workflow/infrastructure, relying on distributed collaboration tools.<p>Our founders are both technical but have a lot of business experience in the advanced analytics space.  Our team is absolutely world-class, consisting of authors and contributors to core Scientific Python / PyData packages like NumPy, Scipy, PyTables, Cython, Chaco, and others.  We are only a year old, but we are growing quickly and our products are gaining a lot of traction.<p>Email jobs@continuum.io and come join our team!<p>If you are going to be at PyCon in a few weeks, come by our booth and learn more about the company!  If you are going to be in Austin for SXSW, we'll be at the Door64 Startup Showcase on Friday March 8th, and we're one of the sponsors of the Austin Data Party on Sunday March 10th, so come see us then!","time":1362152863,"type":"comment"}