{"by":"0xa","id":5304680,"parent":5304169,"text":"Tumblr, New York, NY (NYC, Manhattan): FULL TIME Software Engineers (Scala, Java, Nginx, HBase).<p>TL;DR: Tumblr is actively hiring engineers with a passion for open source and the ability to develop high-performance distributed applicatons that empowers Tumblr to scale <a href=\"http://tumblr.com/jobs\" rel=\"nofollow\">http://tumblr.com/jobs</a><p>We have interesting projects for people with a knack for software design, a nose for efficiency, and a passion for massive scale and visibility. This month I’ll specifically talk about our Software Engineer--Distributed Services position, but you can see an awesome photo of Tommy the Pomeranian with Mayor Bloomberg, our great benefits, and the complete listing of open positions at <a href=\"http://tumblr.com/jobs\" rel=\"nofollow\">http://tumblr.com/jobs</a>.<p>Happy Dr. Seuss’s Birthday,<p>Matt, Director of Engineering<p>* Software Engineer--Distributed Services (<a href=\"http://bit.ly/QWZC0p\" rel=\"nofollow\">http://bit.ly/QWZC0p</a>): We typically hire experienced software engineers for this position, since we screen for productive coding ability, a well tuned design instict and a practical balance between solving problems in a generalized way with an iterative development process. Expertise in Java or JVM tuning is a plus, but not required.<p>How to Get Your Resume Noticed\n* Provide github, side projects, hackathon experience or other manners of code samples.  We love open source and we want productive, passionate coders who love it too.\n* Include a cover letter that talks about your experience scaling, performance tuning and distributing computational workload. Highlight times you have pushed a technology to its limit, and what you learned along the way.<p>How to Ace to Interview\n* Write clean, practical, idiomatic code in a statically typed language to answer coding questions.  We’re not looking for a trick ah-ah answers.  Focus first on a reasonable, functionally correct implementation and then iteratively improve on it if necessary.\n* Show off your technical knowledge, experience and instincts discussing your implementation’s run-time, scalability pain-points and how you would horizontally scale.\n* Excitedly talk about how you’ve worked at scale or high throughput, and what technical challenges you overcame as it ramped up.\n* Be a genuinely nice, collaborative and ambitious person.<p>About Tumblr (<a href=\"http://www.tumblr.com/about\" rel=\"nofollow\">http://www.tumblr.com/about</a>)<p>Founded by David Karp in New York City in 2007, Tumblr empowers millions of users to create and explore content. Tumblr now hosts more than 96 million blogs and 44 billion posts. We work in an open, friendly and positive environment that encourages intellectual curiosity and a love for open source. As engineers, we are focused on building technologies that advance massively scaled websites. We are also excited to deliver a range of new products that will enable users to share their own creative content, discover content, and connect to one another in new ways.","time":1362151653,"type":"comment"}