{"by":"morganb180","id":5304796,"parent":5304169,"text":"San Diego, CA - Full time - UX Designers for products &#38; services company.<p>We're digital-telepathy, but our friends call us dt. We're the UX Agency and Products shop behind SlideDeck, Hello Bar, Flare and more. We focus on ideas that are challenging, rewarding and fun. We're growing on both the products and client side of the fence and are looking for great UX &#38; Interface Designers to be a part of our team.\n...Interested?<p>On any given day, you may spend your time:<p>- Collaborating and strategizing with fellow designers or strategists to bring client and product ideas to life<p>- Focusing on betterment – finding new ways to make ourselves and the things we make better<p>- Sharing your creative vision with your team and clients<p>- Teaming with developers to craft compelling interactions<p>- Using design research and analytics to inform new designs and refine existing ones<p>- Writing a blog post on UX, if that’s what you’re into<p>- And most important – crafting beautiful and elegant web interfaces<p>* Who you are. We’re looking for someone to help us bring forth new ideas, interactions and experiences that work well across not only devices, but audiences as well. You should be fun to work with, because you love what you do, right? You’re comfortable pitching ideas to your team and clients, and iterating on them swiftly. You’re constantly redesigning things in your head, both on and offline to reduce friction and improve experiences. It also won’t hurt if you have a love of interjecting well-timed movie quotes and a penchant for witty-banter.<p>Position Requirements<p>- You have significant experience creating highly-effective and beautiful user-focused interfaces across a variety of environments (mobile, web apps, dashboards, e-commerce, etc)<p>- You bend the Adobe Creative Suite to your will (particularly Photoshop and Illustrator).<p>- You have experience planning and executing both redesigns as well as new-concept design projects, from start to finish<p>- You have a strong understanding of use-cases, user flows and information architecture<p>- You have the ability to see and communicate your ideas to clients and the team<p>- Your design is well thought out, purposeful and has intent<p>Learn more at <a href=\"http://www.dtelepathy.com/careers/ux-designer\" rel=\"nofollow\">http://www.dtelepathy.com/careers/ux-designer</a> and apply at jobs [at] digital-telepathy [dot] com.","time":1362152451,"type":"comment"}