{"by":"glaugh","id":5305159,"kids":[5307975],"parent":5304169,"text":"SF - full-time, Front End Engineer<p>About Statwing:<p>We love analyzing data. We love the feeling of getting an idea, exploring some hypotheses, and finding a surprising story in the data. And we love enabling others to have that feeling. That’s why we’re creating the modern data analysis tool, so anyone can get as much value out of their data as a trained expert, and much faster.<p>Most statistical analyses are conceptually simple, but they’re so dressed up in the arcane language of t-tests and p-values that they’re off limits to most humans, and painfully time-consuming for experts. Most people fall back to the much less powerful Excel (and its PivotTables), spending their time shuffling data around an interface that’s barely changed in 15 years. Statwing democratizes data analysis by making statistics easier to use and interpret than even Excel.<p>We’re two Stanford alums and we work in San Francisco’s Mission District, near the 16th and Mission BART stop. Our investors include Y Combinator, Jeff Hammerbacher (cofounded Cloudera, coined the term \"Data Science\", built the Facebook data team) and Jason Seats (cofounded Slicehost, runs TechStars Cloud).<p>About the job:<p>Radically improving the UI for data analysis is the core challenge of our company. As our first hire and only front-end specialist, you'll drive the function and feel of our UI, creating entirely new ways of interacting with data. You’ll meet weekly with the designer of the TiVo UI (an advisor of ours) to sketch out solutions to extremely challenging usability problems, which you'll then implement. You'll code in HTML, CSS/LESS, Ruby, and Coffeescript, using Bootstrap, Backbone, Underscore, jQuery, and d3. And as the first hire, you’ll earn significant equity and help shape our culture.<p>The ideal candidate:<p>Excited about taking responsibility and ownership over big pieces of the product<p>. Comfortable with UI and UX challenges. Graphic design skills are a bonus (we currently have none).<p>. Interested in data analysis.<p>. An extremely talented programmer, skilled with front end tools like HTML, CSS, and Javascript/Coffeescript.<p>. Familiarity with the other tools listed above is a bonus.\nDeeply concerned with system reliability, code quality, and front end architecture.<p>. Open to asking for help, taking feedback, collaborating, and generally being a team player.<p>. Humor. Has a sense of it.<p>Email us at jobs@statwing.com","time":1362155454,"type":"comment"}