{"by":"kamoto","id":5305574,"parent":5304169,"text":"New York, NY / San Francisco, CA - Animoto<p>We're Animoto, a video creation platform that automatically produces stunning music videos using images, video clips, and music.  Here are our current openings:<p>Senior Software Engineer – Engine<p>You'll work on the cloud based rendering, animation and design tools at Animoto.  We're looking for experienced engineers interested in growing their skills in a unique new intersection of domains.  There are opportunities in story-telling, motion design, cinematography, audio systems &#38; analysis, tools, build pipeline, infastructure, and rendering.<p>Full details: <a href=\"http://animoto.com/blog/senior-software-engineer-engine/\" rel=\"nofollow\">http://animoto.com/blog/senior-software-engineer-engine/</a><p>Software Engineer – Platform<p>We're looking for great software engineers to build out the Animoto Platform.  These services operate at scale to power internal applications such as Animoto.com, the Animoto iPhone app, the Animoto Facebook app in addition to external APIs.  We want to significantly expand the Platform's capabilities in 2013 and need excellent engineers to help.<p>Full details: <a href=\"http://animoto.com/blog/software-engineer-platform/\" rel=\"nofollow\">http://animoto.com/blog/software-engineer-platform/</a><p>Software Design Engineer in Test<p>We're looking for someone who loves to write software to break software, but isn't above doing some manual testing, too.  Want to fuzz our rendering engine?  Want to do some model-based testing of Animoto.com?  Want to rip open all the tiny cracks in our infrastructure to see what bursts into flames?  Then we want you.<p>Full details: <a href=\"http://animoto.com/blog/software-design-engineer-in-test/\" rel=\"nofollow\">http://animoto.com/blog/software-design-engineer-in-test/</a><p>Mobile Software Engineer:<p>We're looking for talented mobile software engineers who want to work on cutting edge problems in the video, image and service-oriented architecture domains!  In the process, be an integral part of a team that is rapidly innovating how users create and share their memories through video.  A strong background in Computer Science is highly desirable, as is a background building iOS and Android apps in the past.<p>Applying: Check out our mobile apps and email devjobs@animoto.com with your info!","time":1362158667,"type":"comment"}