{"by":"aprasad","id":5305949,"parent":5304169,"text":"LearnStreet (<a href=\"http://www.learnstreet.com\" rel=\"nofollow\">http://www.learnstreet.com</a>) | Palo Alto, CA | Full-time and Intern, Engineers &#38; Designers<p>LearnStreet is an early-stage startup focused on changing the way people of all backgrounds and skill levels learn how to code.<p>We are a small, passionate team of product craftsmen, hackers and designers doing what we love—building a service that inspires users to tap into their amazing potential. We believe putting the power of coding in more hands can unleash a wave of creativity that makes the world a better place for all of us.<p>The LearnStreet team is based in Palo Alto, California and backed by Khosla Ventures.<p>Software Engineer (Full-Time, Intern)<p>We are looking for front-end and back-end engineers who care deeply about using technology to make an impact in education, by making it easier for people to learn programming and computer science on the web. We want people who are ambitious and who will relish the challenge of building a product to educate millions of people around the world.<p>Although we aren't looking for a precise background or skill set, here are some traits we like: You like programming and building products. You’ve done some side projects on your own initiative. You enjoy working hard, figuring out what you need to do to get the job done, and then quickly learning what you need to get it done. You enjoy the excitement of working at an early-stage and ambitious Silicon Valley start-up.<p>Some of the technologies we use include Python (Flask), JavaScript, JQuery, MongoDB, and Node.js.<p>UI/UX designer (Full-Time, Intern)<p>We are looking for user interface / experience designers to join our design team. In this role, you will help create intuitive, usable and visually appealing user interfaces for online programming education. As part of the team, you will help define user models and interfaces for new and existing LearnStreet products and features, develop storyboards and mockups to communicate design ideas, assess the usability of new and existing products, and make constructive suggestions for changes. Background in interaction design is helpful. Experience with Photoshop, HTML and CSS is required.<p>If interested, please email jobs@learnstreet.com with your resume and portfolio if applicable.","time":1362162146,"type":"comment"}