{"by":"old-gregg","id":5305952,"kids":[5335515],"parent":5304169,"text":"<a href=\"http://mailgun.com\" rel=\"nofollow\">http://mailgun.com</a> (SOMA, San Francisco)<p>About us:<p><pre><code>    - We're not \"yet-another-email sender\": we are busy working on \"what's next for email\".\n    - We love Linux, server clusters, big data, distributed everything, task queues and network protocols.\n    - Our favorite GUI is ssh/bash, preferably served grey on black.\n    - We use Python, Flask, Fabric, Chef, MongoDB, Riak, Redis, Nginx and logic. \n    - We have a hot key for everything.\n    - We don't serve ads to eyeballs and we're not in the cloud.\n    - We are 50/50 on vi/emacs and everyone is anxious to get to know you better. :)\n    - We don't know what our code/test ratio is.\n    - We've built a lot of great tech and we need your help to open source it.\n    - Some of us have never dragged or dropped anything.\n\n</code></pre>\nAbout you (role #1):<p><pre><code>    - You believe the actor-model concurrency is a better idea.\n    - You are an intellectually curious US-based hacker.\n    - Messaging and queueing systems are cooler than ad networks and retargeting.\n    - You want to have an enormous impact on a product developers love.\n    - You know what an architecture astronaut is and you're not one.\n    - On a few occasions you've decided on a hashtable instead of an AVL tree and vice versa.\n    - You have strong opinions about MongoDB, PostgreSQL, threads and build systems. \n    - You love UNIX and hate meetings as much as we do.\n    - You often wish you were smarter, coding in Haskell or LISP full-time.\n    - You want to learn from us and you have something to teach.\n    - You're fine with duck typing but also mastered at least one lower level language: C, C++ or similar.\n    - You've managed your own memory on multiple occasions (successfully).\n\n</code></pre>\nAbout you (role #2):<p><pre><code>    - You are an intellectually curious US-based hacker.\n    - You can tell a beautiful API design when you see it.\n    - You believe you could design a better REST API than some products you've used.\n    - You can explain the difference between REST and HTTP in polite English.\n    - There is something about programming languages. You've played with most and learned a few.\n    - You want to learn from us and you have something to teach.\n    - You enjoy writing and want to get better at it.\n    - You've spoken publicly, it was scary at first. You loved the experience.\n    - When you go to technology conferences you have a good time.\n    - You're ashamed because you're spending too much time on Hacker News and Stack Overflow and Quora.\n</code></pre>\nTalk to us:\n    - jobs@mailgun.com","time":1362162170,"type":"comment"}