{"by":"VERSIVO","id":5305134,"parent":5304169,"text":"Arlington, VA - FULL TIME - .NET Developer<p>About Us:\nVersivo, a certified veteran-owned small business, was founded with the belief that it is possible to offer high end Information Technology consulting services while maintaining the flexibility, responsiveness and cost structure of a smaller company. This commitment to delivering exceptional IT services, providing outstanding value and producing meaningful results for every client has enabled Versivo to grow steadily since its inception. Located in the heart of the Washington, D.C. metropolitan area, Versivo serves clients onsite locally and throughout the country.<p>====================<p>SOFTWARE DEVELOPER<p>Position Summary:<p>Versivo is searching for a Software Developer to join our team. This position is ideal for a talented developer / consultant with three to five years of development experience who strives to be a master in multiple technologies, including .Net and Java. The successful candidate will be a quick-learner who can leverage his or her development experience making an immediate impact on Versivo's projects from day one. Flexibility is key, as this position may often require participation in all software development life cycle phases. Versivo encourages all team members to grow within the company, making this position perfect for a motivated individual looking to grow their knowledge in technical domains while getting further involved in all phases of the software development life cycle.<p>Essential Duties and Responsibilities:<p>▪\tCreate innovative software solutions with multi-tier\n        architectures integrating various technology  \n        platforms\n▪\tDevelop applications in .NET or Java per\n        requirements and design specifications\n▪\tUtilize Microsoft SQL Server to perform queries of\n        relational databases \n▪\tParticipate in the full software development life \n        cycle activities including requirements analysis,\n        design, development, testing, training and\n        deployment\n▪\tContinually seek to advance knowledge in\n        technologies important to Versivo including, but not\n        limited to, .NET and JAVA\n▪\tProduce technical documentation relating to \n        developed applications<p>Qualifications<p>Candidates must possess:<p>▪\tA four year college degree, preferably in Computer \n        Science, Information Systems or a related field\n▪\tExposure to the full software development lifecycle\n▪\tExceptional, polished interpersonal skills, a \n        creative mind, and a can-do attitude\n▪\tDemonstrated success at diagnosis, management, and \n        resolution of complex analytical and technical \n        issues\n▪\t3+ years of experience in software development\n        utilizing .NET or Java/J2EE<p>Preference will be given to candidates who have:<p>▪\tExperience in development work using web services\n▪\tDemonstrated UI proficiency with ASP.NET and AJAX\n▪\tExperience with API and OpenSource development<p>Most importantly, the candidate should have passion, to support Versivo’s execution on its mission, to help our clients Compete. Advance. Thrive.<p>Work Environment:<p>Professional office environment/Remote work available.<p>How To Apply:<p>If this opportunity to join the Versivo team excites you, please send your resume, cover letter, and salary requirements to resumes@versivo.com.<p>Versivo is an equal opportunity employer and does not discriminate in employment opportunities or practices based on race, color, religion, sex, national origin, age, or any other characteristic protected by law.","time":1362155270,"type":"comment"}