{"by":"fryed7","id":5307023,"parent":5304169,"text":"Inbound.org\nLead PHP Developer\nREMOTE<p>We're Hacker News for Inbound Marketers and we're looking for a PHP developer who can work from anywhere and create kick-ass products for 100ks of people.<p>The Problem<p>Inbound.org started as a Wordpress hack, but this was replaced in October 2012 with a purpose-built backend. The team that put it together and have maintained it since then are moving on to focus on their own startup. Meanwhile, we've got an ever growing list of improvements and demand for rolling out many sister sites.<p>We recognise we need a freelance lead developer to take ownership of the technical side of the site, and work with the rest of the team to produce an great product for the community.<p>About Inbound.org<p>Inbound.org is \"Hacker News for Inbound Marketers\".<p>The community launched in February 2012. We have an active community around 11,000 users, 60,000 visits per month and 24,000 unique visits per month. Current revenues from our jobs board vary between $1,200-$1,800/month, with further products in the pipeline.<p>Users can submit, upvote and comment on articles, discussion threads (including “Ask Me Anything” community interviews of industry experts) and tools. These are organized by hot (trending submissions - posted to @Inboundorg), incoming (new submissions) and all time.<p>We also have a jobs board where companies can list their jobs for $50. This is our only revenue stream at the moment.<p>The backend is built with the CodeIgniter Framework for PHP on a MySQL database. The front-end is customized Twitter Bootstrap with some jQuery.<p>The community is founded and funded by Rand Fishkin and Dharmesh Shah, and managed day-to-day by Ed Fry. There is a team of 14 volunteer evangelist-moderators who fight spam and promote the site.<p>You can see more on The Future of Inbound.org right here.<p>About You<p>You’re a fan of Inbound Marketing. You believe in what Inbound.org and the team behind it stands for. You understand why we get up in the morning to do this.<p>You have a strong working knowledge of PHP, MySQL and jQuery which you can show us on your GitHub profile or an equivalent. (Bonus if you’re familiar already with CodeIgniter).<p>You have an excellent grasp and strong opinions of what makes a great product. Maybe you’ve made a few personal projects, or written about them on a personal blog?<p>You’re smart, can get shit done and can have fun whilst doing it.<p>You have excellent written communication skills.<p>The Role and Rewards<p>You’ll be taking ownership for all the technical side of Inbound.org.<p>You’ll be leading the technical roll out of up-and-coming sister sites from the main codebase.<p>You’ll be at the heart of designing and planning for the future products for Inbound.org<p>You can work anywhere, anytime.<p>Let us know your salary requirements. This is a freelance role, perfect for someone who wants experience with building a popular product for 100ks of people. We anticipate paying ~$75/hour - let us know what you'd be happy to work for in your application.<p>Apply For This Job!<p>If you firmly believe you can fill this role and make a real difference to our community, please send us an email right away to ed.fryed+jobs [at] gmail.com.<p>Tell us briefly what do you want to do and how you plan to do it in the first 3 months as Lead Developer for Inbound.org, tell us how much you'd like be paid, share links to your GitHub, Inbound.org, LinkedIn profiles and share anything else you believe is hyper-relevant for considering your application.<p>Look forward to hearing from you!","time":1362172982,"type":"comment"}