{"by":"acquia1","id":5307030,"parent":5304169,"text":"Acquia is hiring! We have fulltime openings in Burlington, MA and Portland, OR. Contact me directly at michael.brown@acquia.com.<p>Does building massive cloud platforms get your creative mind racing? Do you like creating automation and tooling to manage n-scale environments? ... solving tough architecture problems? ... developing software to control thousands of servers?<p>Summary:\nAcquia runs one of the world's largest platform as a service offerings. Our Drupal tuned cloud runs on over 5000 AWS Servers and delivers billions of page views monthly. We are seeking exceptional cloud infrastructure engineers who desire to deliver world-class performance and powerful tools for software developers to scale their web applications. At Acquia, we are obsessive about our customers' uptime and scalability and are looking for the same.<p>Job Requirements:\n•Strong software development and technical leadership skills\n•Passion for web site configuration, tuning and troubleshooting\n•Deep, working knowledge of OS, web server, and database systems (Linux, Apache, and MySQL preferred)\n•Holistic understanding of the Internet and hosting from the network layer up through the application layer.\n•2 to 8 years of related experience<p>Basic Qualifications:\n•Design and develop tools that automatically deploy, maintain, and monitor LAMP-based hosting environments\n•Research, specify, and test hosting architectures leveraging your web, database, and OS knowledge\n•Debug the toughest web service production issues\n•Share your expertise with customers, partners, and the open-source community via blogs, papers, talks, etc.<p>Extra Credit:\n•Languages: Ruby, PHP\n•Cloud hosting experience (e.g., Amazon Web Services, VMWare, Eucalyptus)\n•Web Development (e.g., Drupal, CSS, JSON, jQuery)\n•Configuration management (e.g., Puppet, Chef, Subversion, Git)\n•Web security (e.g., IDS systems, DOS prevention)\n•Networking (e.g., TCP/IP, load balancing, clustering)\n•Linux packages (e.g., Debian or RPM packages); Ubuntu experience\n•Excellent organizational and communication skills, both verbal and written\n•BS in Computer Science or equivalent experience","time":1362173133,"type":"comment"}