{"by":"jonimius","id":5320387,"parent":5304169,"text":"Location: San Francisco<p>Position: Lead Developer - Ruby on Rails<p>Company Description: Threshold is a privately funded company about to raise its seed round. We’ve been self funded for about 1.5 years and are 1-2 months away from raising money.<p>~We have paying customers and a growing user base.~<p>www.thresholdcm.com<p>Application Description: Threshold is a web and iOS application that tackles the needs of the construction industry by rapidly improving the communication and documentation process. We believe elegant design and intuitive UI isn’t just for consumer-focused companies.<p>What we're looking for: A full stack Ruby on Rails developer located in San Francisco. It will be a contract position to start but we’re looking for a technical co-founder with a good amount of equity.<p>What we’re looking for: The position will touch on all aspects of our app including backend and frontend coding (strong JS skills a must), database management and optimization, and deployment and server administration. A keen eye for design is a plus. You MUST be comfortable iterating quickly and pushing code that’s not 100% tested. We’re strong believers that faster feature pushes are more important than ironclad code at this phase in our company.<p>What you’re looking for: To join a small and focused team that’s looking to revolutionize an old and antiquated industry. You want to build a real company with real revenue. You want to be part of a team and have a say in the direction our company takes.<p>Job Requirements: \nExcellent knowledge of Ruby and jQuery. \nStrong background in CSS and Javascript\nMySQL experience. \nLinux experience, and setting up web servers with Nginx. \nComfortable with merchant processing integration (Stripe) a plus.<p>Requirements: Any applicants must submit URLs to dynamic websites that they have built. Any submissions without examples of previous work will be disregarded. We are particularly interested in strong problem-solving skills, and the ability to iterate and build things quickly. This is a start-up, and being able to rapidly prototype and build out new features is critical.<p>Compensation: Contractor with an hourly wage depending on your experience level. We’re looking for a third co-founder so equity in our company should be something that motivates you. Full salary / benefits when funding occurs.<p>Learn More: www.thresholdcm.com\nContact: E-mail resumes and cover letters to:  jobs@383studio.com","time":1362426685,"type":"comment"}