{"by":"kuty","id":5344939,"parent":5304169,"text":"REMOTE: Rockstar JS Developer at clevertech.biz<p><a href=\"http://clevertech.theresumator.com/apply/xWaZRh/Remote-Rockstar-Developer.html?source=HN\" rel=\"nofollow\">http://clevertech.theresumator.com/apply/xWaZRh/Remote-Rocks...</a><p>REMOTE: Front End Designer at clevertech.biz<p><a href=\"http://clevertech.theresumator.com/apply/aMFLCm/Remote-Front-End-Rockstar.html?source=HN\" rel=\"nofollow\">http://clevertech.theresumator.com/apply/aMFLCm/Remote-Front...</a><p>Let me introduce Clevertech, where we help companies hatch and grow to reach their ambition. We’ve been doing that for over 13 years and have over 35 developers, scattered all over the world working together. Our clients have been featured in the NY Times, Forbes, TechCrunch and Mashable. You can see our CEO’s Kuty Shalev’s presentation at Lean Startup Conference <a href=\"http://goo.gl/MsTcp\" rel=\"nofollow\">http://goo.gl/MsTcp</a> or go to our website clevertech.biz<p>We have a ton of work from amazing companies who are starting up and testing the market with their ideas. And we help them find out if its worth pushing ahead or try to find something else. Some of our clients have raised money and featured in the press. Others have successful businesses. Some discover that its worth trying something else.<p>We use the latest technologies - our focus in is full stack javascript. Node + Angular + Postgres ( + Mongo + Solr/Lucene as needed)<p>Who are you?\nYou are clever, able to communicate complex concepts clearly. You can handle a huge load, and find a way to elegantly solve the business need. You know when to ask more questions. Where to look for answers. You know how to talk to a client whether it be the secretary or the owner. You enjoy sharing with colleagues.<p>You want to participate in the new economy working wherever you happen to be, as long as you have a good internet connection and some quiet space to video chat or share screen to do a code review.<p>You want to create ! There is a magic in understanding the complexity that reality requires and crafting a delightful interface that has the users remarking how easy it is to use.<p>You know how to communicate - whether it is the spoken word, written word, or drawings. It's all about making distinctions that add value to the process.<p>If this is you -- contact us with some recent work and tell us a story about your ambition and how working with us will help you achieve it.","time":1362767897,"type":"comment"}