{"by":"TadSmithFlyer","id":5344006,"parent":5304169,"text":"CTO for NYC Event-Recommendation App (Flyer)<p>This position could be ideal for an up &#38; coming Ruby/Obj-C developer looking to grow into a CTO role, or an established CTO who feels like the excitement with their current setup has fizzled…either way, someone looking for a growth opportunity and great ride at a startup. We’re looking to replace our previously incoming CTO, who was promoted unexpectedly at his current full-time employer. We plan to pay salary commensurate with an established NYC startup, with meaningful equity…not a sub-percentage that you might find elsewhere. Flyer has been founded by two former finance professionals and is building out its team in advance of a July pilot. We've been funding to date on our own and have ~$1mm of capital lined up at ~$10mm valuation.<p>Our team is looking to get your advice, input and guidance on a range of important technology elements of our organization. Areas of focus over the next year will include scalability of the platform as we launch and grow the user base and volume of content in our system, and feature additions as we learn what users want/need.<p>Backend: we’re building our our Ruby-based API in the Padrino framework, which should allow us better performance than Rails, while utilizing a similar structure. We’d like to incorporate your vision as the API is developed, and want your input on solving a number of challenges around the database and data model, all of which tie in to Flyer’s core goal of delivering relevant event-related content to users.<p>Front-end: a native iOS app using native iOS tools, developed in Objective-C using the Cocoa framework. We will only use the most proven open source libraries to make the code reliable and enjoyable. My co-founder and I have been working on the UX for seven months: two full wireframing processes, weeks of FieldTest user testing and tweaking UI, etc. We're looking forward to getting these screens fully functional so we can continue to test and improve.<p>Overall, it’s been a very engaging challenge finding solutions across the many aspects of creating this product. We’re looking forward to adding another member of our team as excited about this project as we are.<p>Please email tadsmithflyer@gmail.com if interested!","time":1362757653,"type":"comment"}