{"by":"mattdennewitz","id":5375530,"parent":5304169,"text":"Pitchfork (<a href=\"http://pitchfork.com\" rel=\"nofollow\">http://pitchfork.com</a>)<p>Chicago<p>Hey all, Pitchfork (<a href=\"http://pitchfork.com\" rel=\"nofollow\">http://pitchfork.com</a>) is expanding its dev team. We’re looking for a someone with sharp UX skills and some level of Django experience.<p>If you want to hack on things like:<p><pre><code>  - http://pitchfork.com/peopleslist/\n  - http://pitchfork.com/features/cover-story/reader/bat-for-lashes/\n  - http://pitchfork.com/advance/\n</code></pre>\nand help push us further, this is the job for you. Your contributions will be seen daily by millions of people around the world, and you'll be a part of a design and dev team whose work has been praised for not only redefining music journalism, but influencing the medium itself.\nAbout you: You should have real-world experience w/ Django 1.3+ as well as MySQL or Postgres. You should have a good eye for design even if you're not designing the project. You should love music; ideally you're familiar with the music we cover and the audience we cater to. Bonus points for experience with Jinja, Sass, Backbone, RQ, Redis, ElasticSearch or Solr, audio/video encoding, Vagrant; with AWS offerings such as EC2, RDS, SES, and CloudFront; with typography and grid layout fundamentals. Extra bonus points for familiarity with the infield fly rule, the ARP 2600, 2600 Quarterly, and/or Green Flash Brewery.<p>About us: We're a small team of full-stack devs. We move quickly and fluidly because the publishing environment demands it — not that we'd have it any other way. We juggle a few large sites and several satellite projects, so we make sure we spend our time coding, not staring at whiteboards.<p>We code a lot, we're rewarded by what we do (and win awards for it), and we've been known to have a beer while doing so. If you're interested in doing those things with us, send your resume and/or Github/Bitbucket profile to mattd /at\\ pitchfork /dot\\ com.","time":1363274577,"type":"comment"}