{"by":"rekihattori","id":10829425,"parent":10822019,"text":"Datacoup | <a href=\"https:&#x2F;&#x2F;datacoup.com\" rel=\"nofollow\">https:&#x2F;&#x2F;datacoup.com</a> | New York City, Seattle, San Francisco | Full-Time | REMOTE, ONSITE<p>Datacoup helps individuals capture, control and extract value from their own personal data. We are leading the fast growing market for user-controlled data and have been featured in The Economist, Time, CNBC, MIT Technology Review and others. In 2016, we will release new tools that vastly reshape how personal data is collected, transmitted and owned on the internet.<p>We are looking for a senior engineer with experience building and scaling both web and mobile platforms. The role will require systems architecture experience around data, user-scalability, and cross-channel presence.<p><i>Requirements:</i><p>- Has previously built&#x2F;scaled a consumer facing application\n- Knows how and when to incorporate OOP design patterns\n- Has extensive experience provisioning servers on cloud platforms like AWS or Rackspace\n- Understands basic web server configuration for Nginx, Puma or Passenger\n- Understands the strengths of Ruby and Javascript as languages to produce productive code with small footprints<p><i>What to send:</i><p>- Links to your GitHub&#x2F;Stack Overflow or somthing else you&#x27;ve built\n- A resume or LinkedIn profile<p><i>More technical background:</i><p>- We maintain a suite of apps that runs on a range of technology including Rails, Mongodb, MySQL, ReactJs, AngularJS, Elasticsearch, Redis, PHP and a little Go. We write tests where necessary, enforce design patterns frequently, and support engineering best practices all the time.\n- Our stack is built on AWS using ec2, vpc, rds, elb, beanstalk, route53 and sqs. We handle our deployments for our main system with Capistrano while devops process for the smaller apps use docker. We use newrelic to monitor server performance and help diagnose system issues.<p><a href=\"https:&#x2F;&#x2F;datacoup.com&#x2F;docs#jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;datacoup.com&#x2F;docs#jobs</a>, email us at info@datacoup.com<p>Thanks!","time":1451793262,"type":"comment"}