{"by":"mattcaldwell","id":10824200,"parent":10822019,"text":"Endgame combines the industry&#x27;s deepest understanding of enterprise vulnerabilities and evolving threats with proven science and the software automation necessary for federal and commercial organizations to &quot;turn the map around&quot; and think like an adversary. Endgame enables customers to successfully automate the hunt - pursue, contain and eliminate the most advanced adversaries before they cause damage and loss.<p>Why Endgame?<p>At Endgame, people are everything. Our Arlington team operates at the cutting edge of technology, building products that protect enterprises against the most committed cyber adversaries.<p>Our team boasts some of the industry&#x27;s brightest and most sought after minds in this field. We are passionate about what we do. We take our business seriously, but our environment is fun, energetic and highly collaborative. We understand that to build a great product, you need great people. This is a unique opportunity to be part of a team of talented individuals who are out to shape the future of cyber security.<p>Endgame is characterized by a high degree of autonomy and flexibility, intellectual engagement, and a competitive compensation structure that rewards performance. We do not discriminate on the basis of age, disability, gender, national origin, race, religion or sexual orientation.<p>Endgame is hiring (for the positions below and more)!<p>- QA Engineer, Arlington, VA: <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3hPwKhw8\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3hPwKhw8</a><p>- Senior Back End Engineer, Arlington, VA: <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3nQwKhwf\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3nQwKhwf</a><p>- Senior Software Engineer - Windows Kernel, Arlington, VA or San Francisco, CA: <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3wQwKhwo\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3wQwKhwo</a><p>- Front End Engineer - Arlington, VA: <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3FQwKhwx\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3FQwKhwx</a><p>- Senior DevOps Engineer - Arlington, VA: <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3HQwKhwz\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3HQwKhwz</a><p>- Senior Back End Engineer - San Francisco, CA: <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3SQwKhwK\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3SQwKhwK</a><p>- Senior Customer Support Engineer - San Francisco, CA: <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?34QwKhwW\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?34QwKhwW</a>","time":1451692528,"type":"comment"}