{"by":"vaxtrac","id":10822760,"parent":10822019,"text":"VaxTrac | QA Software Engineer | Washington, DC | ONSITE<p>VaxTrac is looking for talented QA engineer who shares our passion for making a difference in the world. We build tools to improve the delivery of health care to those that need it most. QA Engineers at VaxTrac are the primary conduit between our users and Software Engineers. They condense many, sometimes unclear, reports into actionable bugs. Once a fix is applied, the QA engineer tests the software and generates relevant documentation about the fix for internal teams and external users.<p>QA Engineers are primarily responsible for: maintaining the bug-fix lifecycle, gathering supporting technical information from field reports, improving processes for bug reporting and features requests, testing fixed bugs for completeness, maintaining changelogs and providing technical support for the coordination of trainings.<p><i>We are looking for those who</i><p>+ Are committed to using their skills to generate real social impact.<p>+ Have an interest and passion for emerging technologies and novel use cases.<p>+ Thrive in loosely structured environments.<p>+ Share the conviction that we can make the world just a little bit better.<p><i>Skills and Requirements</i><p>+ Experience programming web, mobile or desktop applications<p>+ Extraordinary skill in distilling and communicating complex concepts<p>+ Eagerness to travel and spend time in remote corners of the globe<p><i>Bonus points</i><p>+ Experience writing or testing native Android applications<p>+ Demonstrable programming talent<p>+ Computational data analysis experience<p>+ A keen eye for visual elements and design<p>+ French language fluency<p>+ Primary or secondary technical support experience<p>+ Bachelor&#x27;s degree or higher in a technical discipline<p>Please email your updated resume and cover letter as attachments to careers@vaxtrac.com with “QA Engineer” as the subject of the message.","time":1451673612,"type":"comment"}