{"by":"jbleich89","id":10822718,"parent":10822019,"text":"CLVmetrics |Full Stack Engineer - Early Employee | Philadelphia and NYC | Onsite w&#x2F; some Remote<p>CLVmetrics is revolutionizing the way brands understand their customer base and their marketing initiatives by providing every marketer with an instant, accurate prediction of the long term, lifetime value of every customer. Our technology equips marketing professionals with the predictive intelligence they need to quickly and easily discover who their highest value customers will be in the future, retain those customers for the long term, and acquire more customers like them.<p>Our approach is horizontal and we&#x27;re taking our fast, accurate, and actionable predictive intelligence engine to companies of all sizes across many verticals. We are revolutionizing how marketers interact with hundreds of millions of customers each and every day. We need you as we are building a world-class team of engineers, data scientists, statisticians, marketers and more to bring this enterprise-grade predictive technology to life.<p>We are looking for Full Stack Engineers with a passion for dreaming up efficient and scalable cloud-based technologies and then making those dreams into a reality through elegant code. In a sea of open-source technology, you know the right tool for the job and if you haven’t used that tool before, you are eager to master it and add it to your arsenal.<p>You will be working directly with our statisticians and data scientists to push the boundaries of predictive models for customer lifetime value and consumer behavior in terms of both theory and implementation. As a full stack engineer, you’ll be developing different pieces of the application from our predictive intelligence engine through the user interfaces which companies to discover who will be their most valuable users in the future.<p>Our stack includes Python, C++, and Javascript and technologies we&#x27;re currently working with include:<p>- Apache Mesos<p>- Apache Spark<p>- React.js<p>Please email careers@clvmetrics.com to apply.<p>Also check out <a href=\"http:&#x2F;&#x2F;www.clvmetrics.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.clvmetrics.com</a> to see more roles we&#x27;re hiring for including frontend and backend engineers as well as data scientists.","time":1451672939,"type":"comment"}