{"by":"lexicography","id":10822914,"parent":10822019,"text":"Keen IO | San Francisco, CA | Full-time | Engineers | Onsite or Remote | keen.io<p>Hey HN community! We&#x27;re an analytics API that lets developers collect and study custom events at massive scale. We&#x27;re hiring Platform Engineers and DevOps engineers to help build and support our analytics infrastructure.<p>keen.io - <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;keenio#.VobL9pMrLVr\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;keenio#.VobL9pMrLVr</a><p>First, here a few things we believe in: • Honesty &amp; empathy, introspection, Distributed innovation, the importance of laughter &amp; relationships, play to your strengths; patch your weaknesses with diverse collaborators. You can learn more about the humans behind Keen IO here -&gt; keen.io&#x2F;team.<p>A little bit more about the roles we&#x27;re hiring for:<p>1. Platform Engineer<p>By centralizing a data pipeline for thousands of companies, we operate at a scale that none of them have to worry about. Looking to the horizon, we need to look at every piece of our infrastructure with a critical eye. We need to stay ahead of the curve. You will help us be thoughtful and deliberate about tackling the right bottlenecks at the right time. You’ll help make working on the platform easier and easier. You’ll have the opportunity to gain deep understanding of distributed systems and teach others! Most importantly, you’ll collaborate with some pretty amazing humans.<p><pre><code>  Skills: Cassandra, Scala, Python, Java, Tornado, Go, Zookeeper, Storm, Kafka, Mesos\n</code></pre>\n<a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;keenio&#x2F;jobs&#x2F;98480#.VobNRpMrLVo\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;keenio&#x2F;jobs&#x2F;98480#.VobNRpMrLVo</a> OR email humans@keen.io<p>2. DevOps Engineer<p>By centralizing a data pipeline for thousands of companies, we operate at a scale that none of them have to worry about. That means we have to stay on top of the operational work implied by that scale, and we have to stay ahead of the curve as we continue to grow. To be successful we have to invest heavily in smart operational choices that reduce or eliminate manual interaction.<p>You’ll help make those choices, implement them, monitor what’s working well and what isn’t, and continually iterate. You’ll collaborate closely with architects and developers to ensure new features and new systems integrate seamlessly with deployment and operations. Most importantly, you’ll be an integral member of a team of pretty great humans who emphasize trust, respect, humility, and self-improvement.<p><a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;keenio&#x2F;jobs&#x2F;124948#.VobMSZMrLVo\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;keenio&#x2F;jobs&#x2F;124948#.VobMSZMrLVo</a> OR email humans@keen.io<p>Thanks for reading!","time":1451675487,"type":"comment"}