{"by":"jonathanwoahn","id":10826250,"parent":10822019,"text":"Catalant - <a href=\"http:&#x2F;&#x2F;catalant.co\" rel=\"nofollow\">http:&#x2F;&#x2F;catalant.co</a> | Greensboro, NC | CTO<p>===== WHO ARE WE? =====<p>Catalant is a realtime employee engagement platform, tackling the Gallup estimated $0.5tn (yes, that&#x27;s trillion!) in annual losses due to employee disengagement. We know it&#x27;s a big ocean to swim in, and so we&#x27;re starting by focusing on operations based industries, particularly manufacturing in CMO and lab based environments. How do we do this? To greatly over simplify things, think of the principles that have made the FitBit so successful (i.e. data tracking, goal setting, social accountability, personal ownership), and apply them to work. It&#x27;s kind of like that.<p>===== WHAT ARE WE LOOKING FOR? =====<p>We are looking for a rockstar javascript developer with strong leadership capabilities who is ready to join a team on the ground floor and help the business grow. In less than 12 months we have launched the product, closed a number of big deals, and have a pipeline of potential customers waiting on us. However, our biggest impediment from growth at this time is myself - I&#x27;m currently playing CEO&#x2F;CTO, and I need someone to takeover the role of CTO. This person will be able to step in and play that role shortly after joining the team.<p>Our ideal candidate will have UI&#x2F;UX expertise, with full stack development experience in our technologies. What are we currently using? Angular.js, node.js, sequelize.js, ionic. We are not married to these for the long haul, and as the CTO - you would have a great deal of input on where we go with this.<p>===== CONTACT US =====<p>Interested? Contact me at jonathan@catalant.co, or visit our full description at <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs2&#x2F;view&#x2F;104149711\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs2&#x2F;view&#x2F;104149711</a>","time":1451744481,"type":"comment"}