{"by":"qbi_","id":10834918,"kids":[10838519],"parent":10822019,"text":"Tetrane - <a href=\"http:&#x2F;&#x2F;tetrane.com&#x2F;en&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;tetrane.com&#x2F;en&#x2F;</a> | Mâcon, France (near Lyon) | ONSITE | SW engineer &amp; Reverse engineer<p>We&#x27;re a small startup building a dynamic tool for reverse-engineers: recording the entire execution of a VM (on a limited timespan) &amp; replaying it on our custom symbolic CPU for manual analysis. The user gets to see, down to the assembly language, exactly what happened on the machine. It&#x27;s a really, really cool project to work on:<p>- no such tool exist on the market yet<p>- we get to have a strong relationship with some of our clients which are at the top of their field<p>- it&#x27;s down to earth, down to the metal<p>- it&#x27;s all developed on Debian, but we may have to dive into any OS&#x27; internals<p>The kind of problems we face every day look like:<p>- managing the amount of data we generate &amp; reworking our backend to scale it up<p>- fixing our emulation engine, extending the x86 support and planning new architectures<p>- providing insight through new, relevant data visualizations<p>We&#x27;re looking for very autonomous software engineers for R&amp;D and UX developments (see <a href=\"http:&#x2F;&#x2F;tetrane.com&#x2F;recrutement.html\" rel=\"nofollow\">http:&#x2F;&#x2F;tetrane.com&#x2F;recrutement.html</a>):  C++ &amp; python, Qt, basic computer architecture knowledge but more importantly a strong, strong ability - and will - to learn.<p>If you&#x27;re a reverse-engineer, we need you as well! Basically, we want you to eat our own dogfood and give us bug-reports, insights and visibility :) You&#x27;ll have the opportunity to help create the next-gen set of tools, you&#x27;ll have a lot of freedom in what you choose to work on, you&#x27;ll have time to improve your skills and your network of relations. Working with us could be a very interesting step in your career.<p>All in all, we are looking for people who are self-driven, creative but rigorous and good team-players. We believe in giving a lot of room in choosing what you work on based on what you perceive as the most urgent, but the whole team must be involved and support your decisions.<p>If you&#x27;re interested, shoot us an email at jobs (at) tetrane dot com !<p>Hope it&#x27;s not too late to post here, and hope to see you soon :)","time":1451906268,"type":"comment"}