{"by":"jlvdh","id":10843106,"kids":[10883349],"parent":10822019,"text":"We are Iamb&amp;b and we’re enabling homeowners to rent out their home while they’re on a holiday and earn money from their hammock. We’re currently looking for a lead software developer (first technical hire).<p><i>Job Description</i><p>Your job will be working shoulder to shoulder with the CTO spec&#x27;ing out, road mapping and building the platform and also working with and leading our team of freelancers. We are a tech driven company and you will be working with state of the art technology to keep us in the game. The role gives a lot of freedom and responsibility, you’ll be making key decisions from day one.<p>- Work from our amazing office at Kerkstraat 61 in the center of Amsterdam.<p>- Be part of a small but amazing team where you will be behind the steering wheel making key decisions from day one.<p>- Competitive salary<p>- Possibility to work remote<p>- Office lunch<p><i>Skills &amp; Requirements</i><p>- Passionate about ECMAScript;<p>- Broadly orientated and likes to do both backend and frontend as well as testing and dev-ops;<p>- Experienced and seasoned with proven trackrecord in building and maintaining complex software (preferably, but not necessarily in the travel industry) as well as designing systems from scratch.<p>- Able to translate between business requirements and technology.<p><i>About Iamb&amp;b</i><p>Iamb&amp;b is a startup in Amsterdam enabling our customers to earn money from their hammocks. We do this by renting out their homes when they are on a holiday. Our mission is to enable everyone on the planet to rent out their homes while they are away. We&#x27;re a bootstrapped company that has been cashflow positive from day one and maintained a triple digit growth every quarter. We all like to work hard, but there is also plenty of time to blow off some steam during our in office table tennis tournaments or weekly friday bars.<p>Remote is possible though it has our preference to have someone in the office.<p>Interested? Contact: jorg@iambnb.nl","time":1452000459,"type":"comment"}