{"by":"HillarE","id":10882008,"parent":10822019,"text":"DHARMA PLATFORM: Lead Developer | Washington, DC | Onsite<p>OUR COMPANY<p><a href=\"http:&#x2F;&#x2F;dharmaplatform.com\" rel=\"nofollow\">http:&#x2F;&#x2F;dharmaplatform.com</a><p>Dharma is changing the way people use field information. We provide a complete data management solution unlike anything on the market today, and it&#x27;s designed to work for anyone, anywhere. We’ve built and extensively tested our software in some of the world&#x27;s most difficult environments over the last few years, and we’re excited to scale our product into a variety of new markets.<p>THE JOB<p>We’re hiring an experienced lead developer to help us scale and refine the Dharma Platform. You will provide strategic guidance on technical issues to our team and be responsible for translating our vision into code, as well as managing a mobile developer and a front-end developer.<p>We are a dedicated, social impact-minded team. We’re looking for someone who wants to work in a startup environment--long hours, intense creative processes, and a small team committed to changing the way we collect and manage data. We want passionate, brilliant, and driven new team members who are up for a challenge.<p>We are looking for someone who:<p>- Has served in a leadership role during a software build, either as a lead developer or CTO\n- Is comfortable working throughout the entire stack (Postgres, Django, Angular.js, Ionic)\n- Has 3-5 years experience with an emphasis on front end development, preferably Angular.js\n- Can lead and manage a small team of developers\n- Has succeeded in small teams and fast-paced environment, juggling multiple deliverables on tight timelines\n- Is able to be based in our Washington, DC office<p>MORE DETAILS<p>Start date: February 2016\nLimited travel required (&lt;5%)\nCompetitive compensation, equity options, and full benefits<p>To view the full scope of work and apply, visit <a href=\"http:&#x2F;&#x2F;dharmaplatform.com&#x2F;join-us\" rel=\"nofollow\">http:&#x2F;&#x2F;dharmaplatform.com&#x2F;join-us</a>.","time":1452535872,"type":"comment"}