{"by":"phantomas1234","id":10909260,"parent":10822019,"text":"Denmark, Copenhagen | DTU Biosustain, Technical University of Denmark | ONSITE | VISA<p>The Novo Nordisk Foundation Center for Biosustainability (DTU Biosustain) at the technical university of Denmark (DTU) is seeking to hire two highly motivated and skilled software engineers to help build a web-based software platform for data-driven design of microbial cells and communities.<p>The Center conducts research on metabolic engineering and synthetic biology of microbial and mammalian cell factories for chemical and therapeutic protein production. The position will be within EU funded project to develop new bioinformatics approaches that leverage system-level data for biotechnological applications.<p>With advances in synthetic biology, genomes can now be edited at unprecedented speed and fidelity allowing making multiple changes in the same genome at the same time. This increases the need for computational tools to design cells and communities of cells analogous to the tools used in Computer Aided Design (CAD) of cars, buildings and other man-made objects. The European Commission has awarded 6.3 million Euros to a four-year collaborative project to build such a CAD tool for data-driven design of cells and microbial communities. Applications will range from human health to sustainable production of chemicals.<p>As a successful applicant, you will be part of a diverse team of scientists and engineers from leading academic institutions and innovative companies that will work towards this common goal.<p>For more details of the two positions, and to apply, please visit:<p>* Scientific Software Developer – Data Science for Synthetic Biology (<a href=\"http:&#x2F;&#x2F;www.biosustain.dtu.dk&#x2F;english&#x2F;About&#x2F;Vacant-Positions&#x2F;job?id=f1b9700d-6be4-439c-ab85-40330604bda5\" rel=\"nofollow\">http:&#x2F;&#x2F;www.biosustain.dtu.dk&#x2F;english&#x2F;About&#x2F;Vacant-Positions&#x2F;...</a>)<p>* Scientific Software Developer – Cell Factory Design Methods (<a href=\"http:&#x2F;&#x2F;www.biosustain.dtu.dk&#x2F;english&#x2F;About&#x2F;Vacant-Positions&#x2F;job?id=1bd3af44-312a-4378-af7a-e034a43896ee\" rel=\"nofollow\">http:&#x2F;&#x2F;www.biosustain.dtu.dk&#x2F;english&#x2F;About&#x2F;Vacant-Positions&#x2F;...</a>)","time":1452865946,"type":"comment"}