{"by":"asbromberg","id":17208978,"parent":17205865,"text":"Trumid Labs | New York, NY | Full-time | Onsite | Multiple Data Science Positions<p>Trumid Labs is the quantitative analytics group within Trumid. Labs uses data science to maximize the network effect across Trumid’s products and services. Trumid Labs&#x27; marquee product, FVMP, is an adaptive model that produces real time prices for approximately 22,000 corporate bonds based on price movements from multiple data sources.  Additionally, Labs is responsible for drawing business insights from Trumid&#x27;s internal data, and building out the company&#x27;s data infrastructure. Check out FVMP here: <a href=\"https:&#x2F;&#x2F;www.trumid.com&#x2F;labs.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.trumid.com&#x2F;labs.html</a><p>About Trumid\nTrumid is a financial technology startup bringing efficiency to credit trading through data, technology and beautifully simple products. Trumid was founded in 2014 by credit professionals with over 100 years of combined trading experience and is headquartered in New York.<p>If you’re interested in any of our roles, email me with your resume at abromberg@trumid.com<p>== Junior Data Scientist &#x2F; Engineer ==\nTrumid Labs is looking for a junior data scientist &#x2F; engineer eager to make an impact at a growing company. The products you work on directly affect business operations and our clients. This is a position where you’ll be expected to take on tasks that range from higher level data modeling to low level infrastructure and network setup. The successful candidate possesses intellectual curiosity and the ability to collaborate with other teams across the organization.<p>Example Projects\n- Write an ETL pipeline to report metrics on user activity and create corresponding visualizations in Tableau\n- Improve the natural language processing behind our internal chatbot tool\n- Collaborate with the sales team to provide business analytics and reporting\n- Research incremental improvements to our FVMP product and productionize your improvements<p>== Quant Researcher &#x2F; Engineer ==\nTrumid Labs is looking for an experienced quant research &#x2F; engineer to take ownership of Trumid Labs’ core product, FVMP. You will be responsible for driving innovations in FVMP as well as providing day-to-day support. You will also take lead on building new data products to complement FVMP. The successful candidate will be a self-starter, intellectually curious and possess the ability to see a project through from research to production. (Note: Trumid writes all of our own production code).<p>Example Projects\n- Research and productionize improvements to the underlying process model that drives FVMP\n- Improve outlier detection of the data going into FVMP using a machine learning model\n- Build derivative products from FVMP, such as a service that generates pairs trading ideas by looking at historical correlations of FVMP<p>For more details visit <a href=\"https:&#x2F;&#x2F;www.trumid.com&#x2F;careers.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.trumid.com&#x2F;careers.html</a> or email abromberg@trumid.com","time":1527880623,"type":"comment"}