{"by":"mshahRCS","id":17208229,"parent":17205865,"text":"Royal Circuits | Software Engineer - Automation | Bay Area - Hollister, CA | Full-Time | ONSITE | <a href=\"https:&#x2F;&#x2F;www.RoyalCircuits.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.RoyalCircuits.com</a><p>We&#x27;re a printed circuit board manufacturer that specializes in quick turn prototype orders. We&#x27;re one of Silicon Valley&#x27;s best kept secrets – we manufacture printed circuit boards (PCB’s) for thousands of customers nation-wide, including engineers at some of the world&#x27;s biggest tech companies. We’re building up a team of engineers at our internal startup, dubbed “Factory of the Future”, to completely revolutionize the electronics manufacturing industry.<p>We had an exciting reception to this ad last month, and are looking to bring on additional developers to round out our team to work on custom software that enhance and streamline the PCB manufacturing process. You&#x27;ll be involved in developing tools that get orders through production as seamlessly as possible, with the opportunity to drive interesting projects involving automation, data visualization, and machine&#x2F;3rd party integration. A major piece of this involves optimizing our factory processes to get real-time feedback to and from jobs on the floor, and offering real-time feedback on the manufacturability of a customer’s design the instant design files are uploaded.<p>Proficiency in C++ is a must, with Visual Basic, Genesis, UCam, and Python experience being a bonus.<p>We&#x27;re happy to offer excellent benefits, competitive salaries, and flex hours. Our main office is in Hollister, CA, just south of San Jose. Love nature? We&#x27;re conveniently near Pinnacles National Park, the country&#x27;s newest national park. In addition, our Flex-PCB shop is in LA, where we do a lot crazy work with a certain Space company you may have heard of making waves in the industry.<p>I’m Mihir, Director of Special Projects here at Royal, and a former electrical engineer at companies like Tesla and Taser. If you’re interested in joining our team and genuinely changing the electronics manufacturing industry, send your resume to jobs@royalcircuits.com and we’ll get back to you right away!","time":1527876480,"type":"comment"}