{"by":"nfriedly","id":17207443,"parent":17205865,"text":"Tanium | Emeryville, CA (SF) or Morrisville, NC (RTP) or REMOTE | <a href=\"https:&#x2F;&#x2F;www.tanium.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.tanium.com&#x2F;</a><p>Tanium&#x27;s product is basically computer security &amp; management software for government and large enterprises. For networks with 20k+ computers, it&#x27;s the best option by a long shot, and it scales to over a million endpoints without breaking a sweat.<p>Lt. Gen. Bill Bender, the recently-retired CIO of the US Air Force, said that Tanium is &quot;game-changing ... allowing a tremendous amount of automation and reduced workloads for our network operations people significantly, meaning things that used to take them months is now down to seconds, or minutes.&quot; <a href=\"https:&#x2F;&#x2F;www.fedscoop.com&#x2F;air-force-cio-says-role-become-much-prominent-prepares-retire&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fedscoop.com&#x2F;air-force-cio-says-role-become-much...</a><p>There are quite a number of roles open in Engineering, Technical Account Management, Security, Sales, Legal, Marketing, Finance, HR, Accounting, and more. Take a look at <a href=\"https:&#x2F;&#x2F;tanium.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;tanium.com&#x2F;careers&#x2F;</a> and let me know if there&#x27;s one you&#x27;re interested in. I also included a couple of interesting ones below.<p>Benefits include healthcare, 401k match, and self directed&#x2F;unlimited vacation (most folks take 4~5 weeks).<p>I can&#x27;t name salary ranges, but my total comp is around $320k ($165k base, ~$100k bonus, and ~$55k stock).<p>Feel free to ask me about anything, reply here or email nathan.friedly@[company site].<p>--<p>Senior Software Engineer: The core is mostly C++, and then JavaScript for the modules and admin interface (AngularJS&#x2F;Node.js). There&#x27;s also a growing amount of Python for endpoint scripting and a tiny bit Rust.<p>On site or US Remote (pick the closest one) - SF: <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;ixfioowp1\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;ixfioowp1</a> | RTP: <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;bxio4pg51\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;bxio4pg51</a><p>--<p>Associate or Director of Technical Account Management: The TAM organization is central to our company, and doesn&#x27;t have any real parallels that I&#x27;m aware of. As a TAM, you&#x27;d be expected to set up a home lab with a network of machines (or VMs) running our software, and you&#x27;d be primarily responsible for advising 2~5 customers on how best to use Tanium. TAMs come from all kinds of backgrounds including sysadmin, ops, programming, and security, and really work together as a team to support each other and meet the needs of each customer.<p>On site or remote in Canada, France, Japan, UK, or USA.<p>Director TAM: <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;r64ytqkl1\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;r64ytqkl1</a> (Note: &quot;Director&quot; is indicative of the responsibility level, but this is not a people-managing role.)<p>Associate TAM: <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;slpflp3j1\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;slpflp3j1</a>","time":1527872562,"type":"comment"}