{"by":"alasano","id":17207840,"parent":17205865,"text":"Coveo | Solution Developer - Implementation | Montreal &amp; Quebec City, Canada | Full-time, ONSITE<p>You&#x27;ll implement search based applications that change the digital experience for our customers and their customers. We warn you: it will be no simple task… Coveo has game-changing features out-of-the-box, but you will need great business acumen and technical skills to configure it perfectly to our customer’s environment. We are not talking about the color of the UI here: indexing, in the cloud, billions of documents in hundreds of different systems and deliver search results that are relevant to the user’s situation in less than a second brings its own particular challenges. You&#x27;ll be making use of JavaScript&#x2F;TypeScript, Python, C# and ASP.NET and are comfortable working on both Windows and Linux.<p>While we offer all the perks people come to expect of a job (great new offices, top of the line equipment, competitive salaries and insurance, unlimited cappucinos and snacks, nerf gun battles), we think the best part about working with us is simply being excited about going to work every day. On a day to day basis you&#x27;ll continually face interesting challenges, have great autonomy and you&#x27;ll be able to bring your ideas to the table knowing that your team genuinely wants to hear them.<p>Coveo is positioned as the top leader for Insight Engines in Gartner&#x27;s 2017 Magic Quadrant (<a href=\"http:&#x2F;&#x2F;blog.coveo.com&#x2F;coveo-leads-gartner-magic-quadrant-for-insight-engines&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.coveo.com&#x2F;coveo-leads-gartner-magic-quadrant-for...</a>). We&#x27;re growing quickly and hiring talented, passionate developers to join our worldclass team. Our Montreal offices are brand new (<a href=\"http:&#x2F;&#x2F;blog.coveo.com&#x2F;coveo-montreal-finally-home&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.coveo.com&#x2F;coveo-montreal-finally-home&#x2F;</a>) and we&#x27;ve also rebuilt our entire Quebec City office to accomodate all our new hires in a great environment.<p>Interview Process: phone screen - interview - tech test - offer.<p>To get in touch : aasanovic (@) coveo.com","time":1527874451,"type":"comment"}