{"by":"suhailpatel","id":17206683,"parent":17205865,"text":"Citymapper | Backend&#x2F;iOS&#x2F;Android Engineers | London, UK | ONSITE, VISA | <a href=\"https:&#x2F;&#x2F;citymapper.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;citymapper.com&#x2F;jobs</a><p>Cities are complicated. We use the power of mobile and open transport data to help humans survive and master them. We are building the best public transit app, one that caters for the needs of commuters. We are building a routing engine which is truly multimodal. We&#x27;re running our own services to fill gaps in the transit network. To power all of this, we&#x27;re leveraging open data as well as building the tools necessary for agencies to add and fix data.<p>We recently launched our new Smart Ride service, aimed at encouraging better shared mobility in cities. Read about The Responsive Network: <a href=\"https:&#x2F;&#x2F;medium.com&#x2F;citymapper&#x2F;the-responsive-network-part-3-...\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;citymapper&#x2F;the-responsive-network-part-3-...</a>. This is super interesting and rewarding work from a technical perspective, we&#x27;re constantly iterating and improving our planning, routing and simulation algorithms for Smart Ride to better serve our network. If you are interested in this sort of problem space, now is a fantastic time to get involved from the ground up.<p>See all our open positions at <a href=\"https:&#x2F;&#x2F;citymapper.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;citymapper.com&#x2F;jobs</a><p>We&#x27;re hiring for Backend (Python, Go, C&#x2F;C++, AWS), Frontend (Web, React, ES6) and iOS&#x2F;Android engineers as well as Data Science.<p>Read our other blog posts at <a href=\"https:&#x2F;&#x2F;medium.com&#x2F;@Citymapper\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;@Citymapper</a>. We&#x27;ve also launched an engineering blog: <a href=\"http:&#x2F;&#x2F;engineering.citymapper.com\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.citymapper.com</a>, if stuff like that interests you, definitely apply!<p>If you have any questions, feel free to drop me an email at suhail -at- citymapper -dot- com","time":1527869103,"type":"comment"}