{"by":"galori","id":17208097,"parent":17205865,"text":"San Francisco, CA | REMOTE OK in the US | US based only | Experienced Full Stack Rails Developer | Stitch Fix | Full-time<p>Hello, we&#x27;re continuing to do a ton of hiring at Stitch Fix. I&#x27;m responsible for a small team working on cross functional projects; Last year we worked on expanding Stitch Fix to support Mens clothing, and then we also built the engine that drives Stitch Fix&#x27;s Style Profile and made it more flexible. We work closely with the Data Science team, and our goal is always to serve our customers better using the information they provided while not being creepy :-)<p>Stitch Fix is a clothing &#x2F; style personalization service. Search Instagram for #stitchfix, which will tell you a whole lot about us, how much our customers love us and you&#x27;ll get an idea of our business. Come back when you&#x27;re done.<p>There are a slew of other super interesting open dev roles across Stitch Fix, including in:<p><pre><code>    * the Consumer Facing team\n    * the Warehouse Tools teams\n    * the Styling Tools teams\n    * (and many others)\n</code></pre>\nYou can reach out directly to me (gal at stitchfix.com) - I&#x27;m a Principal Engineer and a hiring manager at Stitch Fix. Here is a job posting roughly covering the role I&#x27;m hiring for: <a href=\"https:&#x2F;&#x2F;www.stitchfix.com&#x2F;careers?gh_jid=455296&amp;gh_src=r8m5v\" rel=\"nofollow\">https:&#x2F;&#x2F;www.stitchfix.com&#x2F;careers?gh_jid=455296&amp;gh_src=r8m5v</a> Stitch Fix&#x27;s &quot;Multithreaded&quot; Tech Jobs blog &amp; site (<a href=\"http:&#x2F;&#x2F;technology.stitchfix.com\" rel=\"nofollow\">http:&#x2F;&#x2F;technology.stitchfix.com</a>) has a lot more about the team and other positions (we’re also hiring iOS, DevOps, and UX) (BTW I used to include an ASCII sweater in this post but then Hacker News mods told me to stop, so now you have to go here if you want to see it: <a href=\"http:&#x2F;&#x2F;ascii.co.uk&#x2F;art&#x2F;jumper\" rel=\"nofollow\">http:&#x2F;&#x2F;ascii.co.uk&#x2F;art&#x2F;jumper</a>)","time":1527875785,"type":"comment"}