{"by":"bckmn","id":17208211,"parent":17205865,"text":"OfficeLuv | Chicago | Full-time | <a href=\"https:&#x2F;&#x2F;www.officeluv.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.officeluv.com</a><p>OfficeLuv is a three-year-old, venture-backed startup, based in Chicago. We streamline dozens of vendors into a single real-time platform for offices to order thousands of products and manage supplies across all their locations. We are focused on leveraging vendor consolidation and automation, a world-class team, and sophisticated operations.<p>We’re growing rapidly here at OfficeLuv and are looking for a Full-stack Engineer to help us continue the momentum! The Full-stack Engineer will help develop, solve, and produce the technology that helps power OfficeLuv and our loyal customers. You will work with the entire tech&#x2F;product team to build applications in the cloud, in the browser, and on device that will iterate rapidly and provide direct benefit both inside the company and externally. We&#x27;re building with some great tools and ideas in mind, like 12-factor apps and service-oriented, API-first architecture.<p>What you&#x27;ll do:<p><pre><code>  - Help build and deploy production services.\n  - Be a valued voice in the direction of our products.\n  - Build applications for one or all of our cloud services, mobile apps, and client-side apps.\n  - Architect and maintain our front-end JavaScript components.\n  - Architect and maintain our back-end components (Ruby, JS, Elixir) and API services.\n  - Help make decisions about database architecture (both SQL and noSQL).\n  - Provide useful feedback in code reviews for other developers.\n  - Write tests for your own code.\n  - Identify and build new skills, in software and personal development, with the help of team leaders.\n</code></pre>\n<a href=\"https:&#x2F;&#x2F;officeluv.applytojob.com&#x2F;apply&#x2F;Lv6mQy0m2I&#x2F;Full-Stack-Engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;officeluv.applytojob.com&#x2F;apply&#x2F;Lv6mQy0m2I&#x2F;Full-Stack...</a>","time":1527876372,"type":"comment"}