{"by":"luddaite","id":17208638,"parent":17205865,"text":"SimX | Oakland, CA | Remote Software Engineer, Unity VR<p>SimX is a fast-growing startup bringing virtual and augmented reality to medical simulation training. Our product is the first comprehensive professional-grade VR medical simulation system, and it is used by our customers to train physicians, nurses, and other allied health professionals. Since our product has become generally available, demand has exploded and we&#x27;re in need of new engineering team members to move our product forward.<p>Our company has an ambitious and high-impact purpose: to transform the way physicians and allied health professionals are trained in order to take a dent out of the more than 400,000 people who die every year from preventable medical errors. We&#x27;re a high-powered team consisting of about half physicians and half engineers, all of whom have dedicated their time to achieving our mission. As an early startup, we&#x27;re looking for new team members who are excited about our mission and have the drive to thrive in the startup environment.<p>Our company is based in the Bay Area, but we&#x27;re interested in applicants from around the country - remote work is encouraged.<p>THE JOB<p>As a Unity engineer, you&#x27;ll be working on our core VR product, which is a multiplayer first-person virtual simulation environment experienced by learners on the Vive Pro. As a startup team member, you&#x27;ll have a wide variety of responsibilities that will evolve as our needs change. Your primary responsibility will be to develop new features from initial concept to deployment. You&#x27;ll also help provide support to our customers, including new or modified features and addressing technical issues. You&#x27;ll be working on features within the VR environment as well as features in our standalone &quot;moderator&quot; application used by teachers to run our simulations. Our software is primarily written in C# in Unity on Windows. This is a full-time remote work position with cash and stock option compensation.<p><a href=\"https:&#x2F;&#x2F;www.indeed.com&#x2F;m&#x2F;viewjob?jk=4491db8ea12652fa&amp;dupclk=0\" rel=\"nofollow\">https:&#x2F;&#x2F;www.indeed.com&#x2F;m&#x2F;viewjob?jk=4491db8ea12652fa&amp;dupclk=...</a><p><a href=\"https:&#x2F;&#x2F;www.simxar.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.simxar.com</a>","time":1527878496,"type":"comment"}