{"by":"contingencies","id":17206653,"parent":17205865,"text":"Infinite Food | Mechanical Engineers &#x2F; Operations Researchers &#x2F; Food Safety and Quality Manager | HK, Shenzhen and Zhuhai, China | $neg + equity available | Full-time or REMOTE | <a href=\"http:&#x2F;&#x2F;infinite-food.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;infinite-food.com&#x2F;</a><p>Infinite Food will define and dominate a completely new segment of global food retail by rethinking the distribution and edge of the supply chain with novel approaches based upon robotics and machine learning. We&#x27;re a Series A, Shenzhen-based, Hong Kong registered company with 2.5 years of IP and a business method patent. We&#x27;ve optimized for growth, not time to market, but will launch in three markets (HK&#x2F;Macau&#x2F;mainland China) in 2019.<p>(1) Talented Mechanical Design Engineers with fluency in Solidworks. Working language is English, Mandarin or regional languages well regarded. Broad range of interesting work focusing on automation and industrial products, rapid prototyping and iteration with supporting electrical, software, logistics and machine learning engineers. Experience with CFD (heat, fluid and airflow modeling), electrical and food safety regulation in any market, production in thermoform, injection molding, blow molding, extrusion well regarded. Private office in Shenzhen (Houhai, near HK&#x2F;Shenzhen Wan border crossing). Physical presence encouraged but not a daily requirement.<p>(2) Operations Researchers. Opportunity to get involved creating, shepherding and managing fast-growing greenfield operations processes using the latest technology with supporting software and machine learning engineers. Areas include manufacturing and real time perishable goods logistics networks as well as network planning and spatial configuration of new sites.<p>(3) Food Safety and Quality Manager. Background in microbiology, chemistry, software or operations research, national or international experience in the food safety industry well regarded. Initial jurisdiction will be mainland China but global knowledge will be critical as we move from domestic through regional and global markets. Interface with manufacturing, design and government relations teams, author and run world first automation systems for food safety and traceability.<p>Mandarin speakers well regarded, but Chinese knowledge is not required. Clear written technical communication in English is mandatory. Skills and experience first, qualifications a distant second. We respect execution.<p>Email in profile, please include &#x27;Candidate: &lt;job title&gt;&#x27; in subject. No recruiters.","time":1527868897,"type":"comment"}