{"by":"bigtex1988","id":17208532,"parent":17205865,"text":"Stride Consulting | Software Consultant &#x2F; Senior Software Consultant | New York, NY | Full-Time | ONSITE<p>Stride Consulting is a mission-driven, engineering-centric software consulting firm. We seek developers who place a high value on continuous learning and value diversity. If you consider yourself a non-dogmatic engineer, have a thirst for learning, and an eye for process, you’ll be in great company.<p>Our goal is to leave our client teams functioning at a higher level than when we found them.  We do this by writing high quality code alongside our clients’ development teams, as well as mentoring their developers, product teams, and stakeholders in software development best practices.<p>We believe that practices like Test Driven Development, Pairing, and Refactoring are the foundation of a high-functioning software team. And, we believe that not all Agile practices provide equal value to all teams at all times.<p>We have great benefits (described in more detail in the links below), including an ample budget for professional development PLUS paid-time for professional development as well as standard healthcare and retirement benefits.<p>We do not travel - all of our clients are located in NYC.  However, we are open to relocating developers from other cities.<p>Consulting experience is not required for the Software Engineer role.  For the Senior role we usually look for candidates with 3+ years of consulting experience.<p>Stack (Depends on Client): Ruby on Rails, React, Angular, Python, Scala, Java 8, Elixir, Node and more. Open to other languages &#x2F; technologies if you have other expertise.<p>Email me at mcarradine@stridenyc.com for more information and an introduction to our recruiters, or apply below and mention in your cover letter that you were referred by Malcolm.<p>Software Engineer: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;stride&#x2F;jobs&#x2F;1034667?gh_src=ksicj6m01\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;stride&#x2F;jobs&#x2F;1034667?gh_src=ksic...</a><p>Senior Software Engineer: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;stride&#x2F;jobs&#x2F;562476?gh_src=gucob2rq1\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;stride&#x2F;jobs&#x2F;562476?gh_src=gucob...</a>","time":1527878014,"type":"comment"}