{"by":"dberg","id":17207188,"parent":17205865,"text":"iHeartRadio | NYC | OnSite | Full-Time<p>Scala, React, Node, Data Eng, Python, SRE, Data, Spark, EMR, Redshift<p>iHeartRadio is the No. 1 all-in-one digital audio service with over 800 million downloads; it reached its first 20 million registered users faster than any digital service in Internet history and reached 80 million users faster than any other radio or digital music service and even faster than Facebook.<p>We are seeking passionate, motivated and skilled engineers looking to make a major impact on the music world. We have a great work&#x2F;life balance, free lunch on Fridays, Bagels on Thursdays, collaborative open floor space, in-office performances from up and coming artists and a bike room. We also believe heavily in open source and being engaged in the wider tech community.<p>You can also read about us at <a href=\"http:&#x2F;&#x2F;tech.iheart.com\" rel=\"nofollow\">http:&#x2F;&#x2F;tech.iheart.com</a><p>Please apply at <a href=\"http:&#x2F;&#x2F;jobs.iheart.com\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.iheart.com</a> or email us at recruitment@iheartradiocareers.com<p>Senior Software Engineer, Web - Along with Facebook and Netflix, iHeartRadio is one of the largest React applications around. We are small, focused team committed to produce our best work. We are undertaking a major re-architecture of the iHeartRadio website&#x2F;Web application, and just open-sourced a number of modules [1] as part of this effort. We intend to contribute increasingly more to the React open-source community.<p>Senior Site Reliability Engineer - We are looking for a Senior Site Reliability Engineer who is a knowledgeable software engineer and infrastructure engineer that has a background in programming, infrastructure, and networking to help take ownership of various parts of our infrastructure and create new components into self-service, automated solutions that we can expose to our 120+ software engineering organization.<p>Data Engineer - Seeking engineers with a passion for solving large data problems. Our data platform helps provide insights and analytics, reporting, business intelligence and many other functions for the business. We rely on tooling such as Hadoop, Hive, Kafka, Redshift, Airflow, Spark.<p>Senior Software Engineer , Scala - Come work with a world class engineering team who is very active in the Scala community. We have a Scala based microservice framework and we are doing some really exciting things at scale using AWS, Docker, Kubernetes, Kafka, Dynamo and a variety of other tooling.<p>Python Engineer  - Work with our content and ingestion engineering teams to figure out how to manage millions of music tracks at scale. Working with our open source Henson framework you will help build the backbone of our core ingestion infrastructure that manages all of our music, talk and podcast infrastructure, encoding infrastructure as well as search and advanced catalog heuristics.","time":1527871457,"type":"comment"}