{"by":"davidsenior","id":17205977,"parent":17205865,"text":"iVendi Limited | Senior &amp; Mid-Level C# Developers | Full Time | Manchester, UK | Onsite | £30k - £55k+<p>Who: iVendi develops e-commerce solutions that make vehicle selling easier for dealers, vehicle buying easier for consumers and vehicle finance easier for all.<p>What: We are looking for talented C# developers to join our rapidly expanding team. Both mid-level, senior and principle positions are available. Our core micro services are written in .net core and hosted in k8&#x27;s on the cloud and on-prem, we embrace open source frameworks and packages such as nginx, nancyfx, geteventstore and reactjs. Whilst you will have good knowledge of the .net framework and C#, you will also embrace the value of looking outside the gates. A passion for cutting edge technology is essential.<p>Key Skills: C#, Design, EventSourcing, CQRS, Messaging, NoSQL Databases<p>Where: Manchester, UK. We have just moved to a brand new, purpose-built high spec office in Salford Quays. This location is easily accessible by foot, car and tram.<p>Why: We are constantly developing new products for the motor finance industry as well as improving our existing ones. We are also moving into the German market which has meant that our current products are being modified for the differences the German market brings.<p>When: We are looking for developers to join the team as soon as possible. We have multiple positions available.<p>Benefits: We have an excellent benefits package including flexible working, 25 days annual leave plus bank holidays, up to 5% matched company pension scheme, market leading private healthcare, relaxed dress code and free parking and refreshments. Not only this we also fly the entire team abroad for our winter conference each year. For the last three years we have been to Lisbon, Barcelona &amp; Madrid.<p>More information: <a href=\"https:&#x2F;&#x2F;ivendi.com&#x2F;recruitment\" rel=\"nofollow\">https:&#x2F;&#x2F;ivendi.com&#x2F;recruitment</a><p>Application: Please send your CV and covering letter to hr@ivendi.com","time":1527865710,"type":"comment"}