{"by":"skrebbel","id":17206530,"parent":17205865,"text":"TalkJS (<a href=\"https:&#x2F;&#x2F;talkjs.com\" rel=\"nofollow\">https:&#x2F;&#x2F;talkjs.com</a>) | Eindhoven, the Netherlands | ON-SITE or REMOTE (Europe only)<p>TalkJS is the chat platform for platforms. We help online marketplaces build great user-to-user communication. Our product is a fully powered pluggable chat UI + real-time infrastructure so that our customers can focus on their market instead of on their messaging features.<p>SENIOR FULL STACK PROGRAMMER:<p>We&#x27;re looking for an experienced programmer - the kind that could make it to &quot;software architect&quot; at a boring bigco but prefers to get their hands dirty. Our stack is made of Elixir, ES6, React, PostgreSQL and a little bit of Node. Some key challenges: cross platform SDKs, making excellent forward compatible APIs, combining great UX with high customizability, and scaling up to millions of concurrent requests.<p>We&#x27;re particularly looking for true full stack engineers who can work on both the frontend and the backend. Sure, everybody has a sweet spot, but we&#x27;re not currently looking for &quot;true backenders&quot; or &quot;mobile devs&quot; or something like that. No need to already know all of our stack if you&#x27;re a fast learner. Bonus points if you&#x27;re good at keeping things simple!<p>CONTENT MARKETER &#x2F; WRITER &#x2F; JUNIOR PROGRAMMER WHO LOVES TO BLOG:<p>We&#x27;re looking for someone who a knack for tech who loves writing stories about how people use chat to make their lives and&#x2F;or their apps better. Bonus points if you&#x27;re good at happy customers or at SEO.<p>Junior programmers with good writing skills are particularly welcome. Want to join a fast-moving environment where you can both improve your coding skills and do great writing? We don&#x27;t do blogspam - our product is highly technical and so is our content.<p>ABOUT YOU:<p>Our team is small and highly proactive, and we expect the same from you. If you need to be told what to do all the time, don&#x27;t apply. If you want to be the smartest person in a (chat) room full of interns, don&#x27;t apply. If you want to move fast with an experienced team, get in touch.\nWe&#x27;re a semi-distributed team and we work primarily online (like a fully distributed team). Both on-site and remote are OK, but Europe only: We&#x27;d like you to come over to our Eindhoven office frequently and keep timezones relatively close. Unfortunately we can&#x27;t finance relocation at this moment.\nApply by sending an email to hey@talkjs.com.<p>(no recruiters or agencies please)","time":1527868333,"type":"comment"}