{"by":"chris_clue","id":17211125,"parent":17205865,"text":"Clue | Platform Engineers &amp; Data Engineers | Berlin, Germany | On-site | Full-time | Relocation &amp; visa support<p>As a VC-backed startup based in Berlin, Clue is on a mission to advance the state of menstrual and reproductive health.<p>We reach over 10 million people every month via our Android and iOS apps, helping them track data about their bodies, and gain insights into their health.  Our website, helloclue.com, is filled with a vast array of articles on the topic of menstrual health, helping to close the global knowledge gap on these topics.  We also further our mission by publishing the outcomes of our scientific research in conjunction with top universities and institutes.<p>To join our 50-strong team of designers, developers, data scientists, product owners, scientific researchers, and writers, we are looking for:\n* Platform Engineers — to work with our development teams, having production experience in AWS, Kubernetes, monitoring, observability, security, and software development\n* Data Engineers — to work with our data science and development teams, having experience in building data pipelines, machine learning, with strong programming skills\n(these two positions are not _yet_ on our website, but feel free to contact us with a CV etc.)<p>Random selection of keywords: AWS, Airflow, Redash, Postgres, Kinesis, RabbitMQ, Kubernetes, Jenkins, TypeScript, Kotlin, Python, Slack, GitHub<p>At Clue, we offer everyone a competitive salary and participation in our all-employee option pool. We believe in providing our team with little extras that are high quality and meaningful. For example, we currently give everyone opt-in access to free private sessions from a qualified professional coach on a weekly basis, have plenty of healthy snacks, and a fancy coffee machine. We also offer free yoga classes once per week, and have two team catered meals per week.<p>Website: <a href=\"https:&#x2F;&#x2F;helloclue.com&#x2F;jobs.html\" rel=\"nofollow\">https:&#x2F;&#x2F;helloclue.com&#x2F;jobs.html</a>\nOur tech blog: <a href=\"https:&#x2F;&#x2F;medium.com&#x2F;bleeding-edge\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;bleeding-edge</a>\nContact: natasha@[website-domain]","time":1527893160,"type":"comment"}