{"by":"lmeyerov","id":17215106,"parent":17205865,"text":"Graphistry.com | Frontend Engineers | SF+Austin | onsite | full-time<p>Graphistry is powering the future of human-in-the-loop investigations. Analysts use us to untangle fraud, hacks, system operations, and other connect-the-dots problems.<p>We work with banks, Fortune 2000s, the US federal gov, and representative of our community program, our most recent project is with an anti-human-trafficking organization.<p>TECH<p>* First GPU client&lt;&gt;cloud visual analytics stack<p>* First interactive visual playbooks stack for visually querying across Splunk, ElasticSearch, Spark, SQL, graph databases, APIs, and more<p>* Largest interactive graph renderer: &gt; 1 million nodes+edges<p>* Building towards a 1B+ interactive-time multi-GPU backend<p>TEAM<p>* We helped build: the first parallel browser (-&gt; new Firefox), the first functional reactive web framework (-&gt; React), RxJS, Falcor, and more recently, Apache Arrow &amp; GOAI<p>* Started &amp; ran various enterprise security startups<p>* ... We&#x27;re small, so room for huge &amp; compounding impact<p>* Practice non-violent communication, modern project management (product designer, jira&#x2F;confluence, sprints, ...), modern infra (docker and now k8s, ...)<p>ROLE<p>* Frontend engineering<p>* Collaborate with our product designer and fullstack team to go from mocks through design iterations to deployment.. and as a small team, influence the entire process<p>* Near-term ownership opportunities: interactive visual playbook&#x2F;querying system, teams collaboration layers<p>* Use modern JS tools like React, Falcor, RxJS, Node, Apache Arrow<p>* Depending on interest: WebGL&#x2F;OpenCL, and GOAI (Apache Arrow, Python Pandas but on multi-GPUs)<p>* Depending on experience, opportunities for management<p>LOCATION<p>* SF (ONSITE): Office near union square<p>* Austin (REMOTE): Multiple remote workers, aiming to open office by year-end<p>COMPENSATION<p>Salary + meaningful equity. We&#x27;re at the sweet spot of a small product team that is getting into amazing accounts &amp; preparing to grow.<p>Please email build@ with your CV, why you are excited, and portfolio examples of relevant projects.","time":1527955303,"type":"comment"}