{"by":"davidfstr","id":17210942,"kids":[17212292],"parent":17205865,"text":"TechSmart | (Sr.) Platform Software Engineer | Full-Stack | Seattle | FULL-TIME | ONSITE<p>Does making a difference in K-12 education and teaching the next generation how to code sound exciting? My company TechSmart is now hiring full-stack engineers to build out our teaching-and-learning rich web application and in-browser IDE!<p>TechSmart is a Seattle-based education-technology company that empowers teachers to reach all students with coding &amp; computer science. We believe every student deserves the opportunity to learn to code and make their mark on the world, regardless of their race, gender, socioeconomic background, or language. We partner with school districts to provide Teacher Coding Bootcamps, a K-12 Curriculum Pathway, and a cloud-based Teaching &amp; Learning Platform.<p>We are bootstrapped and cash-flow positive, with a single recent round of funding to enable us to grow to handle an influx of new school district customers. We are presently a small engineering team (&lt;5) hoping to add 3 more engineers in the short-term. You will help define our early culture.<p>As a platform engineer at TechSmart you&#x27;ll build the rich web application that is our Teaching &amp; Learning Platform, which delivers our world-class coding curriculum to tens of thousands of teachers and students around the country. You will own features end-to-end: frontend, backend, database schema, testing, and operations.<p>For more information see our two job descriptions and website below:<p>* Platform Software Engineer - <a href=\"https:&#x2F;&#x2F;bit.ly&#x2F;techsmart-engineer-2018\" rel=\"nofollow\">https:&#x2F;&#x2F;bit.ly&#x2F;techsmart-engineer-2018</a><p>* Sr. Platform Software Engineer - <a href=\"https:&#x2F;&#x2F;bit.ly&#x2F;techsmart-senior-engineer-2018\" rel=\"nofollow\">https:&#x2F;&#x2F;bit.ly&#x2F;techsmart-senior-engineer-2018</a><p>* TechSmart website - <a href=\"http:&#x2F;&#x2F;techsmart.codes&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;techsmart.codes&#x2F;</a><p>If you have additional questions feel free to email me at david.foster@techsmart.codes . I&#x27;m the CTO, one of your fellow engineers, and would be working closely with you. ^_^<p>Apply by emailing your resume to careers@techsmart.codes . Please include a paragraph or two in the email highlighting why you&#x27;d like to join us and how you think you would be a good fit, as this will help you receive the best consideration.","time":1527891368,"type":"comment"}