{"by":"RichardPrice","id":17212333,"parent":17205865,"text":"Academia.edu | Full Stack Engineer | San Francisco, CA | Onsite\nAcademia.edu is addressing two problems:<p>- Open access. The goal here is to put every academic pdf ever written on the internet, available for free.<p>- Robustness. The goal here is to produce a set of signals around any given academic paper that indicate how robust the paper’s claims and findings are.<p>It has emerged over the last few years that 65-90% of the academic literature is not reproducible. What this means is that if you try to reproduce the experiments described in a paper, 65-90% of the time you will not get the same findings. This is known as &quot;the reproducibility crisis”. Peer review is not a robustness filter; we need a separate filter to indicate robustness.<p>With regard to open access, Academia allows academics to upload papers to Academia, and make them freely available. Academics have uploaded about 19 million pdfs to Academia.edu. About 30 million people come to Academia each month to access and share papers.<p>With regard to robustness, we think the way to build a robustness layer on top of papers is a) to mine the existing graph of citations for commentary and (b) crowd-source commentary&#x2F;peer review from the academic community.<p>Academia has built a recommendation system which is the basis of our approach to (b), and a citation graph infrastructure that is the basis of our approach to (a). We believe that addressing robustness is a challenge and an opportunity. We need mission-driven engineers to come and help us.<p>We have raised $33 million from Tencent, Khosla Ventures, Spark Capital, and True Ventures. The company is profitable off a premium subscription model. Bijan Sabet from Spark Capital writes &quot;We believe open science is really important. We believe Academia.edu is going to have a profound impact on the world.&quot;<p>We are looking to hire full stack software engineers. Technologies we use include Ruby, Rails, Postgres, DynamoDB, React. Our office is in downtown San Francisco. For more information, visit <a href=\"http:&#x2F;&#x2F;academia.edu&#x2F;hiring\" rel=\"nofollow\">http:&#x2F;&#x2F;academia.edu&#x2F;hiring</a>.<p>If you are interested to learn more, please email the CEO, Richard Price, at richard [at] academia.edu","time":1527907333,"type":"comment"}