{"by":"ninjakeyboard","id":17210119,"parent":17205865,"text":"FunnelCloud | Toronto | Software Engineers | ONSITE | Full Time<p>We use a blend of Elixir&#x2F;OTP, Scala&#x2F;Akka, Ruby&#x2F;Rails (API, migrations), and Ember, alongside Kafka, Postgres, and Redis to build a Manufacturing Execution System which listens to signals from machines used in manufacturing, and writes back to them to track parts and control manufacturing processes. There are many interesting features to tackle, and a good start on the v2 architecture with many small elixir apps interacting through kafka (via command and event topics). Scala is used for individual part tracking on a model of the physical process route.<p>The domain is physical, and is a great fit for event driven systems and domain driven design. We talk about things in terms of aggregates, commands and events more or less daily. The code is well covered. It is a small company so we have a few opportunities in terms of process maturity but generally the technical approaches are reasonable.<p>The company is young but bootstrapped and profitable and growing with substantial equity available for really strong hires. We have some very smart people kicking around as is common in my experience in startups that end up turning out pretty well. I was working at Google for a bit - I&#x27;m trying to bring examples from my experiences there into the culture here as we grow.<p>I worked here on contract and flipped to full time on seeing the equity package, problem space, and rate of growth. It&#x27;s a good opportunity with smart people in an interesting technical space.<p>I&#x27;m currently hoping to fill a spot for one of those ember&#x2F;ruby&#x2F;elixir people (any 2 would be good). I come from a more functional background with scala but I think with the current technology having 2 of 3 of ember&#x2F;ruby&#x2F;elixir would be good.<p>Strong Scala or FP candidates would also be welcome to come if they&#x27;re alright trying on dynamic typing in elixir as there is a lot of work to be done squarely in elixir and scala right now. You&#x27;d be able to pick up rails easily enough for what it&#x27;s used for.<p>contact: ...jason...at...funnelcloud...dot...io...","time":1527886190,"type":"comment"}