{"by":"ryan_imbellus","id":17220504,"parent":17205865,"text":"Imbellus | Senior Game Engineer | Location: Los Angeles, CA or Remote | Full-time | $100k - $150k | Experience: Mid Level to Principal Level<p>Imbellus Overview:\nWe are looking for exceptional people who share our mission: to reinvent how we measure human potential. At Imbellus, we build technology-enabled assessments that evaluate how people think instead of what they know.  We believe our society must prioritize developing minds that do what computers cannot. By changing assessments, we reorient the education system and employers to measure what matters.<p>We love this challenge. We know that what has worked for decades in other contexts, might not work in ours. So we don’t default on expertise, instead we test every assumption with logic, each idea with reasoning, and all conclusions with “prove it.” We choose learning over ego so that our product and our people become the best.<p>As an Imbellus Senior Game Engineer, you will envision how to translate feature designs into gameplay mechanics, and delight players with engaging moments. You will prototype and discover new solutions for complex systemic challenges, and orchestrate the game to ensure a flow state for the player. You will collaborate with engineers, designers, artists and learning scientists to apply playtest feedback and polish gameplay interactions to result in a high-quality user experience and effective assessment.<p>What you’ll be doing at Imbellus:\n- Create, refine and polish complex and varied gameplay systems\n- Prototype alongside the Game Designer to determine optimal strategies for creating a user experience that exceeds our players expectations\n- Help develop art pipeline tools that streamline our artists&#x27; processes and simplify building an awe-inspiring virtual world\n- Support the UI Designer in implementation, functionality, and feature integration\n- Document and peer review technical designs with engineering team\n- Innovate on technical challenges using state of the art engineering methods to automate development processes<p>What you’ll need to succeed at Imbellus:\n- 10+ years of software development experience overall\n- 5+ years working in the game industry\n- Expertise across multiple languages including Python, C++, and JavaScript\n- 1+ years experience with Unity a plus\n- Simulation experience a plus<p>Apply at Imbellus.com or contact Ryan Fitzpatrick on LinkedIn","time":1528045842,"type":"comment"}