{"by":"jayschools","id":17249809,"parent":17205865,"text":" Abl Schools | Sr. Front-end Engineer|San Francisco, CA | Full-Time | ONSITE | <a href=\"http:&#x2F;&#x2F;ablschools.com\" rel=\"nofollow\">http:&#x2F;&#x2F;ablschools.com</a><p>== About Abl Schools ===============================================================<p>We are a 19 person mission-driven startup located in San Francisco. Abl’s dynamic school scheduling platform makes it easy to design and manage the daily life of your school. Our simple, cloud-based tools work alongside your student information system and eliminate the need for spreadsheets, magnet boards, and stacks of papers.\nOur first product is a next-generation Master Scheduler that simplifies and streamlines the entire master scheduling process. Developed in collaboration with secondary schools from around the country, Abl’s Master Scheduler is a smart, flexible platform that enables school leaders to quickly visualize tradeoffs and meet the unique needs of every student and teacher.<p>We are seeking a Front-End Software Engineer to join our team and help build products that support our mission. We are growing quickly and there is a lot to do! Your contributions will have a meaningful impact on our company.<p><pre><code>  == Qualifications ===============================================================</code></pre>\n- Experience with Javascript frameworks such as React, Backbone, Angular etc.\n- You should have a great feel for user experience and an eye for beautiful designs<p>- Bring a deep understanding of best practices in design, optimization, interaction, and usability<p>- Continual learning of emerging technologies&#x2F;industry trends<p>- Familiarity with the whole web stack, including protocols and web server optimization techniques<p>Here is an article from edweek that will tell you more about our mission: <a href=\"http:&#x2F;&#x2F;edweek.org&#x2F;ew&#x2F;articles&#x2F;2018&#x2F;01&#x2F;10&#x2F;a-silicon-valley-en..\" rel=\"nofollow\">http:&#x2F;&#x2F;edweek.org&#x2F;ew&#x2F;articles&#x2F;2018&#x2F;01&#x2F;10&#x2F;a-silicon-valley-en...</a>.<p><pre><code>  == Interested? ==================================================================\n  Click this link to apply: http:&#x2F;&#x2F;grnh.se&#x2F;madgwy621</code></pre>","time":1528310266,"type":"comment"}