{"by":"ChrisSenseye","id":17268963,"parent":17205865,"text":"Senseye | Austin, TX (ONSITE) | Full-time | $80k - $100k + Equity | Machine Learning Software Engineer | <a href=\"http:&#x2F;&#x2F;www.senseye.co&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.senseye.co&#x2F;</a><p>Senseye aims to revolutionize the way humans communicate with technology. We are developing a unique, sensory interface technology to create a direct link from a computer to a human’s mind via the complex dynamic properties of the human eye.<p>We&#x27;re looking for a machine learning engineer that loves solving meaningful problems to join our team in downtown Austin. We are a diverse group of people with a broad range of backgrounds, experience, and perspectives who have a lot of work to do and we&#x27;re excited to have your help to achieve our visionary goals.<p>• From deep learning to gradient boosting, apply your experience and training to select, develop, and refine a variety of machine learning systems.<p>• Utilize frameworks such as TensorFlow, Keras, scikit-learn, Torch&#x2F; PyTorch, XGBoost, et al. to implement ML into production.<p>• Use your knowledge in an Object Oriented language (we primarily use Python) to write and maintain safe, clean, and testable code and combine your efforts.<p>• Sift through data to preprocess, feature engineer, visualize, and prepare for machine learning applications.<p>• Join forces with our research and engineering resources to interpret and apply existing research where possible and develop and conduct new trials when needed.<p>• Stay sharp by finding ways to grow your knowledge and help us to continually improve. We’re embarking on a new path, and don’t know everything that we don’t know yet.<p>• Find ways to apply your adaptability and flexibility. We&#x27;re a small group and need all the teamwork we can get to reach our goals.<p>Apply here: <a href=\"https:&#x2F;&#x2F;senseye.workable.com&#x2F;j&#x2F;330EE30405\" rel=\"nofollow\">https:&#x2F;&#x2F;senseye.workable.com&#x2F;j&#x2F;330EE30405</a>","time":1528486433,"type":"comment"}