{"by":"gwyner","id":17273586,"parent":17205865,"text":"Fluent Forever | REMOTE | Full-time Contract | $90-130k + equity | Senior Software Development Engineer | <a href=\"http:&#x2F;&#x2F;fluent-forever.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;fluent-forever.com&#x2F;careers&#x2F;</a><p>The Fluent Forever mobile application is the most successful crowdfunded app in history, and for good reason: we are about to build the most powerful language learning platform in the world. We are looking for key team members who want to help us ship an amazing product, and then actively help us make it even better. We also want people who believe in the same things we do about what makes an awesome team (<a href=\"https:&#x2F;&#x2F;fluent-forever.com&#x2F;pfard&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;fluent-forever.com&#x2F;pfard&#x2F;</a>).<p>Our JavaScript-based technology stack encompases mobile, web, and service layers. We&#x27;re looking for an SDE who can make and own major contributions to all aspects of the product.<p>Core Skills &amp; Experience:<p>- Passion for excellence and a commitment to continuous self growth\n - Excellent development skills using multiple languages and environments\n - Strong Javascript and SQL\n - Expertise in service layer development, including REST, data access layer, authentication, and maintenance\n - Experience designing software components for a professional product\n - Experience shipping professional software product(s) through the entire SDLC\n - Experience shipping a professional mobile application\n - Experience shipping a professional product on AWS or other cloud environment\n - Excellent English language communication skills (written and spoken)<p>Preferred Skills &amp; Experience:<p>- 5+ years of development experience\n - 2+ years of AWS or other cloud experience\n - Experience directing or mentoring other developers\n - Experience collaborating closely with software testers\n - Typescript, Node.js, Express, React Native, React are strongly desired\n - Experience with globalization and an understanding of the issues involved in supporting multiple languages<p>Apply here: <a href=\"http:&#x2F;&#x2F;fluent-forever.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;fluent-forever.com&#x2F;careers&#x2F;</a>","time":1528559747,"type":"comment"}