{"by":"gwyner","id":17273596,"parent":17205865,"text":"Fluent Forever | REMOTE | Full-time Contract | $60-90k + equity | Automation Engineer&#x2F;Software Development Engineer in Test | <a href=\"http:&#x2F;&#x2F;fluent-forever.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;fluent-forever.com&#x2F;careers&#x2F;</a><p>The Fluent Forever mobile application is the most successful crowdfunded app in history, and for good reason: we are about to build the most powerful language learning platform in the world. We are looking for key team members who want to help us ship an amazing product, and then actively help us make it even better. We also want people who believe in the same things we do about what makes an awesome team (<a href=\"https:&#x2F;&#x2F;fluent-forever.com&#x2F;pfard&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;fluent-forever.com&#x2F;pfard&#x2F;</a>).<p>As a back-end software development engineer in test, you will own the testing of our service layer.<p>Core Skills &amp; Experience:<p>- A special blend of curiosity, passion, and technical expertise\n - Strong software development skills, including solid data structures and algorithms knowledge\n - Experience testing relational databases\n - Experience designing and implementing automation for SaaS solution\n - Ability to create automation and tools from scratch (C#, Java or C++ is a plus)\n - Experience testing web services including performance, scalability and reliability testing\n - Excellent Javascript&#x2F;TypeScript skills (Node.js + Express is a huge plus)\n - Experience shipping professional software product(s) through the entire SDLC\n - Excellent English language communication skills (written and spoken)<p>Preferred Skills &amp; Experience:<p>- 5+ years of QA experience including 3+ years of SDET&#x2F;Automation&#x2F;Development experience\n - Amazon Web Services, REST, SQL, JSON, bash, telnet, SSL, globalization\n - Ability to assist with cloud infrastructure, build systems, and operations is a huge plus<p>Apply here: <a href=\"http:&#x2F;&#x2F;fluent-forever.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;fluent-forever.com&#x2F;careers&#x2F;</a>","time":1528559979,"type":"comment"}