{"by":"ppinnovations","id":17270434,"parent":17205865,"text":"PPI | BMS Firmware Engineer | $120K-$150K + Equity | San Jose, CA |Onsite, Full Time<p>PPI is seeking a highly motivated candidate to join its Engineering team. As a BMS Firmware  Engineer you will lead the planning, execution, and delivery of the BMS firmware for prototype and production battery modules and packs.<p>Required Duties:\n•Provide engineering expertise in the area of battery management system firmware\n•Lead integration of BMS firmware  by working closely with battery pack team\n•Design test methodology and perform tests to ensure product meets industry specifications and safety requirements\n•Start to finish ownership of computer code for battery management, functional safety and fail safe requirements – from specification to design, prototype, and manufacturing\n•Develop requirements documentation and software change requests\n•Collaborative work with mechanical, digital control, thermal design, and manufacturing\n•Collaborate on controller architectural decisions to drive robust system design\n•Advanced battery controls and new concept development<p>Key Qualifications:\n•5-10 years firmware development experience\n•BS in EE&#x2F;CE&#x2F;CS, MS preferred, or equivalent experience and exceptional ability \n•Proficient in C&#x2F;C++ development for embedded systems\n•Experience in development of digital and analog interfaces\n•Familiar with GIT version control\n•Knowledge of automotive networking standards (e.g. CAN, LIN, UART, SPI, I2C) \n•Experience in implementing RTOS\n•Low level driver development (e.g. CAN, SPI, 12C, ADC, PWM)\n•Strong background with debugging tools \n•General familiarity with basic control theory and digital implementation of controls. \n•Experience in obtaining product safety certification through a NRTL (e.g. UL, CE, CSA, CCC, etc.)\n•Familiarity with lithium-ion battery handling, safety, and usage\n•Experience with cross functional team interaction (technical and non-technical)<p><a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;675707440&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;675707440&#x2F;</a>","time":1528499019,"type":"comment"}