{"by":"myhusky","id":17285015,"parent":17205865,"text":"Dessa | Toronto,Canada | Full-time | Full-Stack Python Software Engineer (Product Team - WebDev) | <a href=\"https:&#x2F;&#x2F;www.dessa.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dessa.com&#x2F;</a><p>Dessa is a technology company transforming the way enterprises work with AI around the world. Based in Toronto, Dessa collaborates with enterprise teams across industries to blueprint, build and deploy customized AI systems that reinvent what’s possible for business. Dessa’s creation of enterprise AI systems is powered by our end-to-end platform Dessa Foundations, designed to optimize team collaboration on enterprise AI systems.<p>We are also an active player in the AI community, and have partnerships with industry leaders including NVIDIA, the Vector Institute and Amazon Web Services. In 2017, we were named AI Company of the Year by the DFI Institute and received Series A funding.<p>We are looking for a Full-Stack Python Software Engineer for our Product Engineering Team who is passionate about code craftsmanship, continuous improvement and agile development. Experience with Python is a must, with bonus points for any experience with Flask, Pandas, NumPy, JavaScript, CSS, and strong unit testing. If you are eager to help build the best applied AI company and industry changing tools, then you need to join us.<p>Working with a diverse range of technologies and clients across industry verticals, you will have the opportunity to become a leading expert in delivering transformative machine learning solutions to industry designed for real-world results. As part of a vibrant and growing team, you will be at the frontier of the AI revolution.<p>Must have:\n    3+ years of proven experience delivering scalable, distributed platforms in Python\n    Hands-on experience developing backend services in Python\n    Demonstrable experience with agile&#x2F;SCRUM or similar methodologies for continuous development of product and technology\n    An Engineering, Computer Science, Physics, Math, or similar undergraduate degree\n    Penchant for great algorithm design and strong CS fundamentals\n    Strong passion for QA, usability and accessibility\n    Fundamental understanding of TDD practices\n    Ability to work on a diverse team or with a diverse range of people, and in a rapidly changing multi-disciplinary work environment<p>Apply today! <a href=\"https:&#x2F;&#x2F;deeplearni-ng.breezy.hr&#x2F;p&#x2F;f55890137745-full-stack-python-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;deeplearni-ng.breezy.hr&#x2F;p&#x2F;f55890137745-full-stack-py...</a>","time":1528730577,"type":"comment"}