{"by":"tonydev","id":4184910,"parent":4184755,"text":"Boston, MA. Full Time.<p>Peddl - <a href=\"http://www.peddl.com\" rel=\"nofollow\">http://www.peddl.com</a><p>Jobs -  <a href=\"http://www.peddl.com/jobs\" rel=\"nofollow\">http://www.peddl.com/jobs</a><p>– About Peddl –<p>Peddl makes selling as easy as snapping a photo. With the push of a button, Peddl automatically prices and categorizes whatever it is you’re selling, creating an instant online storefront which accepts credit card payments. Peddl turns the mobile device into the most efficient tool for selling things to the people around you.<p>We’re a small team spun out of the MIT Media Lab set to change the way people think about buying and selling second hand goods online and we aren’t stopping until it’s done. Learn more about the founding team at <a href=\"http://www.terrarium.io\" rel=\"nofollow\">http://www.terrarium.io</a><p>– Current Positions –<p>Back End Engineer:<p>We’re building a next generation transaction platform which brings insanely simple payment to the masses. We care deeply about both external and internal craftsmanship of our products and look for candidates that do too.<p>Android Engineer:<p>We’re looking for a talented front-end engineer to help us create best in class mobile apps for Android and iOS. We care about every pixel and look for candidates that do too.<p>Growth Hacker:<p>We’re looking for an exceptional marketer with a high level of exposure to technology and experience with code. We believe that marketing, product, and engineering work together to make the product market itself.<p>Intern:<p>We are looking for a handful of super smart, passionate interns who have serious interest in local marketplaces. If you’re interested in app development, the mobile web, and have a sense for great design, Peddl has a spot for you.<p>–<p>More information and application instructions can be found at <a href=\"http://www.peddl.com/jobs\" rel=\"nofollow\">http://www.peddl.com/jobs</a>","time":1341154860,"type":"comment"}