{"by":"brianmwang","id":4184906,"parent":4184755,"text":"New York, NY - Fitocracy (<a href=\"http://fitocracy.com\" rel=\"nofollow\">http://fitocracy.com</a>)<p>iOS Developer<p>Who We're Looking For<p>- Considerable experience building and shipping iOS apps.<p>- You are obsessed with delivering a great user experience.<p>- You work well with small, tight-knit teams.<p>- You prioritize strong communication above all else. A team that stays in sync is a team that gets shit done.<p>About Us<p>Fitocracy is a social network that empowers everyone to reach their next level of fitness. Nearly half a million people use our web and mobile apps to track their progress, compete against their friends, and get real world results. We turn life into the ultimate RPG where you are the hero that levels up, beats quests, and finds the best version of yourself.<p>We aim to connect you to a community that provide the motivation, information, and inspiration needed necessary to \"re-wire\" people's brains so they make sustainable, impactful changes in their lives.<p>We are a small, 6-person team based out of NYC that recently raised money from a variety of VCs and angels, including 500 Startups and Eniac Ventures. The founders, having gone through significant fitness transformations in their own personal lives, originally started Fitocracy in late 2010 as a way to marry their love of fitness with their years growing up playing classic role playing games like Final Fantasy and Everquest.<p>We put a lot of time into making sure our iPhone app was beautifully designed and fun to use. We've received thousands of rave reviews in 3 months and we aim to continue building the app into the best social fitness experience available. Download it here: <a href=\"http://itunes.apple.com/us/app/fitocracy-fitness-social-network/id509253726?mt=8\" rel=\"nofollow\">http://itunes.apple.com/us/app/fitocracy-fitness-social-netw...</a><p>Contact<p>Email me at brian@fitocracy.com","time":1341154830,"type":"comment"}