{"by":"bensummers","id":4184786,"kids":[4184857,4225530],"parent":4184755,"text":"London, UK. Full time<p>Software craftsman required. Expertise in JavaScript and web development essential.<p>Could you be employee #1? We're looking for a brilliant developer to join two busy co-founders to help take the product and company to the next level.<p>== About you ==<p>You're passionate about producing beautiful, elegant code. You want to work in a company where quality counts, not just out of professional pride, but because great code makes for robust products, rapid development, and a beautiful user experience.<p>You've got a keen interest in security and take it into account in every piece of code you write. You graduated from a good university with a numerate degree, and have developed software in a commercial environment.<p>== About us ==<p>ONEIS solves complicated information management problems for information intensive small and medium organisations.<p>What does that mean? Each of our clients faces a different problem in how to manage the information in their business. Our current clients include consultancies, private health, insurance, training, and a tax information provider. Standard small business tools aren't good enough, but the large enterprise solutions are overkill and user-hostile. We work with our clients to design a customised solution built on our core information management platform, and host their data ongoing.<p>We launched to our first clients three years ago and have steadily built an enthusiastic user base. We're a bootstrapped company, funded entirely by revenue from our clients. With no investors, we can focus solely on producing a great product for happy clients.<p>ONEIS is a collaboration between myself, a developer, and my co-founder, an Information Architect. We've used her expertise to radically rethink how digital information should be managed, and our client satisfaction shows we got it right.<p>== About the role ==<p>You'll start by building server-side JavaScript plugins to implement custom features for our clients. These are quick to write, so you'll work on lots of interesting and varied projects from the start.<p>When you're happy with that, your responsibilities will expand. This will be a bit of everything from developing the core Platform to a spot of systems admin. You may not be familiar with the full stack yet, but you'll be keen to learn it all in a fast-paced environment.<p>== More info ==<p>* We primarily use JavaScript (Rhino interpreter), JRuby and PostgreSQL, and develop on Mac OS X.<p>* Documentation for our JavaScript API: <a href=\"http://docs.oneis.co.uk/dev/plugin\" rel=\"nofollow\">http://docs.oneis.co.uk/dev/plugin</a><p>* Some of our clients talking about the system: <a href=\"http://www.oneis.co.uk/openday\" rel=\"nofollow\">http://www.oneis.co.uk/openday</a><p>* Our jobs page: <a href=\"http://www.oneis.co.uk/jobs\" rel=\"nofollow\">http://www.oneis.co.uk/jobs</a><p>My contact details are in my profile. Send me your CV and an example of code you've written!","time":1341152563,"type":"comment"}