{"by":"drags","id":4185303,"parent":4184755,"text":"SF - Rails/JS - HALF-TIME-ISH :)<p>I've mentioned before that we have a couple of engineers who work half-time-ish (and do their own things the rest of the time) and it got some positive feedback: <a href=\"http://news.ycombinator.com/item?id=3850480\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3850480</a><p>We're ready to hire a couple more in this vein, so if it sounds interesting let me know!<p>=========<p>Advantages for you:<p>- you get 2-3 extra weekend days for fun and profit<p>- we provide health insurance and all that jazz<p>- if some weeks you don't have lots to do and want to work more, and other weeks you have lots to do and want to work less, we can be flexible<p>- we're profitable and growing! so if you decide \"wow I really love Verba and want to spend every waking moment there\" we can make that dream come true<p>Advantages for us:<p>- you have more time to learn new things, meet new people and generally be a friendlier, happier, more knowledgeable person in our workplace<p>- we can hire faster with less anxiety (instead of the \"gulp i just committed $100k/yr\" feeling, we have the \"smaller gulp i just committed $50k/yr\" feeling :)<p>- you get to be a part of what we're doing, we get to hear about all the cool stuff you're doing, and that can only lead to good things for both of us<p>Anyway, I've included our spiel and \"what we're looking for\" summary below, so shoot me an email if you're interested (ragalie@verbasoftware.com).<p>========<p>The college textbook market is currently being disrupted. Verba helps college bookstores transform themselves so that they a) understand and embrace the power of the nets, b) become agents of change in the textbook industry instead of agents of reaction and c) continue to make a healthy profit.<p>We're a B2B company working with just about 200 colleges and universities, and we're looking for people familiar with Ruby, Rails, MySQL and JS who can help us grow faster. We (thankfully) don't have too many scaling problems, but we have a ton of opportunities (product and partner-based) that we could move on much faster with a few more hands on deck. The ideal person has strong Rails knowledge, solid testing practices, a good head for architecture and knows enough JS to help out on front-end.<p>Be sure to check out our website (<a href=\"http://www.verbasoftware.com\" rel=\"nofollow\">http://www.verbasoftware.com</a>) so you can read all about our current products and hear people say nice things about us.","time":1341161715,"type":"comment"}