{"by":"ViktorasJucikas","id":4185455,"parent":4184755,"text":"London, UK - full time<p>YPlan - early team - Generalist Developers<p>Want to be one of the first members of a ground-breaking mobile commerce startup? Join YPlan, a pre-launch stealth startup backed by venture capital and angel investors (unannounced) who helped build the world's most loved mobile, consumer and social companies.<p>At YPlan, we are grabbing a huge, inefficient industry and flipping it on its head through a mobile-only approach. We obsess about simplicity, beauty, great consumer experience and build amazing products by questioning the standard way of doing things. We are looking for an outstanding technology leader who lives and breathes mobile, builds stuff that “just (somehow) works”, genuinely loves to code, and shares our passion for excellence and changing the world for the better.<p>What you'll do:<p>* Develop category defining mobile apps for iOS and Android.\n* Build out and maintain backend systems for data management and analytics.\n* Build a frictionless mobile payment experience for our users.\n* Improve our machine learning technology to aid content discovery and targeting.\n* Implement social integration and sharing.<p>We are looking for Mobile Application Engineers and Backend Engineers who are/have:<p>* Passionate and enthusiastic about changing the world.\n* Have attention to detail and relentless drive for quality.\n* Independent and product-focused, able to work both independently and in larger teams.\n* Passion for maintainable, extensible, testable, and reusable code as well as fast iteration.\nSolid understanding of data structures and algorithms.\n* University degree in Computer Science or related discipline preferred.\n* For Mobile Application Engineers, expert knowledge of iOS SDK/Objective C or Android SDK/Java is a must-have. Interface design expertise and ability to work with UI designers much wanted.\n* For Backend Engineers, experience with high performance, scalable, mission-critical applications, recommendation systems and payment systems prized. Python fluency required, experience with Java or other JVM languages would be an advantage.<p>Remuneration:\nVery attractive including stock options.<p>Location:\nCentral London<p>Why us:\nBe one of the first YPlan team members! You'll have a say in all parts of the company and get to shape our culture and development methodologies. We advocate data-driven decision making, put product quality first, promote open culture and flat hierarchy. You’ll be joining a small team of hard-charging people, who have built and worked with tech startups in the past and are committed to building excellent products.<p>To apply:\nDrop me a line to viktoras@yplanapp.com and let's chat!","time":1341164051,"type":"comment"}