{"by":"luluvise12","dead":true,"id":4186119,"kids":[4186206],"parent":4184755,"text":"London, England<p>Senior Web Analyst at Luluvise<p>--<p>Luluvise is an innovative and fast growing social and communications platform dedicated to women. Our vision is to become the social destination for women around the world.<p>Launched in December 2011, Luluvise is strongly supported by some of the most respected investors and tech advisers in Europe &#38; the US.  We have received considerable global press from Wired, Tech Crunch, The Sunday Times, Wall Street Journal, Financial Times, Venture Beat, Glamour and Cosmopolitan, to name a few.<p>We have an enthusiastic, open-minded and international team. We are looking for extraordinary individuals who are passionate about their work and who can join us in building this exciting new company.  We want to push boundaries and build something that will be used by millions of women.  We are just at the beginning of this journey!<p>Job Description<p>You will be responsible for implementing and managing effective business measurement processes to ensure that the technical solutions being developed will satisfy the needs of the business.  You will oversee the end-to-end tagging process, from inception and design through implementation and QA.<p>You will be working in a collaborative environment, which is diverse and open-minded.<p>Responsibilities<p>•\tQuickly understands the business issues and data challenges of the business. \n•\tReviews and edits requirements, specifications, business processes and recommendations related to proposed solution. \n•\tWork closely with Creative, Marketing and Commercial teams to drive execution of new features, testing, campaigns and other initiatives\n•\tBe a driving force to identify areas of improvement and innovation based on thorough data analysis\n•\tMonitor, track and evaluate business performance analytics, based on KPI targets and baselines<p>Experience<p>•\tExperience in advanced web analytics methodologies such as experimentation and testing, competitive analysis, surveys and market research; in web, mobile, gaming, Facebook applications.<p>Skills<p>•\tProven ability to work with cross functional teams to drive the implementation of new features as well as resolve operational issues \n•\tFantastic analytical skills, great product instinct\n•\tAn extensive understanding of web analytics platforms and target devices (desktops, mobile, tablet)\n•\tExtensive experience with data collection methodologies and advanced tagging\n•\tExcellent knowledge of Google Analytics and similar tools\n•\tFacebook Insights knowledge is a plus\n•\tOperational start-ups experience is a plus\n•\tProject management skills\n•\tExcellent interpersonal skills and an eagerness to work as a member of a team<p>The role will be based in London’s buzzing tech scene, a truly fantastic place to work and live. This is a great opportunity for international applicants to relocate to London and join this thriving community.<p>Apply by sending us your CV to careers@luluvise.com","time":1341176399,"type":"comment"}