{"by":"icelancer","id":15605752,"parent":15601729,"text":"<i>Driveline Baseball | Quantitative Analyst | Seattle, WA, USA | ONSITE | FULL-TIME</i><p>Home Site: <a href=\"https:&#x2F;&#x2F;www.drivelinebaseball.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.drivelinebaseball.com</a><p>Driveline Baseball is looking for a highly-skilled quantitative analyst to join our growing Research and Development team in Seattle. Driveline Baseball secures contracts with multiple MLB teams year-round, providing external amateur draft reports, player development assistance, and on-site implementation of our physical products we manufacture and develop in-house. Driveline Baseball also trains hundreds of elite collegiate and professional hitters and pitchers in their three warehouse complexes in Kent, Wash. (20 minutes south of downtown Seattle).<p>The ideal candidate will have interest in both sports science and sabermetrics, with a desire to broaden their horizons into other fields we are pursuing, such as logistics, manufacturing, and rapid prototyping. Candidates will not be judged based on their formal education background, or lack thereof; the best candidates to come through Driveline Baseball have a varied and colorful history with a portfolio of failed, half-completed, and blocked sports projects of all types. Self-starters, initiative-takers, and those with a healthy skepticism of authority fit in well in the R&amp;D department of Driveline Baseball.<p>Unlike MLB organizations, at Driveline Baseball the members of the R&amp;D team work directly and regularly with minor and major league players. You will be communicating directly with big leaguers who will depend on your statistical and quantitative reports to improve their training methods and their pitch selection. You will also deal directly with front office executives and will be expected to take a managerial role in directing quantitative interns and organizing third-party vendors within months of joining our team.<p>This isn’t your average quantitative analyst position where you’d be siloed in the front office and seen but not heard – you’ll be on the lines of battle and you’ll be crushing R code at a standing desk.<p>More information at our Fangraphs job listing link:<p><a href=\"https:&#x2F;&#x2F;www.fangraphs.com&#x2F;blogs&#x2F;instagraphs&#x2F;job-posting-driveline-baseball-quantitative-analyst&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fangraphs.com&#x2F;blogs&#x2F;instagraphs&#x2F;job-posting-driv...</a>","time":1509572679,"type":"comment"}