{"by":"baflatfair","id":15601969,"parent":15601729,"text":"flatfair | Senior Software Engineer | London, UK | Onsite | <a href=\"https:&#x2F;&#x2F;flatfair.co.uk\" rel=\"nofollow\">https:&#x2F;&#x2F;flatfair.co.uk</a><p>flatfair solves an affordability problem by offering alternative to rental deposit to millions of tenants in the UK. Instead of locking away a hefty tenancy deposit, tenants pay flatfair only a small fee (the flatbond). In exchange, landlords get up to double the usual protection compared to the usual deposit. The flatbond is a market entry product, we intend to build a platform that will be at the center of renting experience.<p>Our company was founded at the beginning of 2017, you’ll be joining the team of three founders. We’re about to go live with our first major client. In preparation for growth after that we’re looking to hire engineer #1. Day to day you’ll be working with CTO (myself) building our web app, APIs, infrastructure and helping to grow our team.<p>For the first version of our platform we’ve decided to keep our product as simple as possible. It’s small monolithic application written in python (django), deployed on aws, using circleCI for builds, our infra is defined with terraform, we’re using postgresql for data store and pure html&#x2F;js for frontend. Experience with specific technologies we use right now is not required as long as you have worked with more than one stack during your career. We’re planning to keep open mind when selecting tech for new parts of our product.<p>Responsibilities<p>* design, build, and maintain new features for our web application and APIs<p>* architectural planning (inc. security &amp; data)<p>* define engineering standards, tooling<p>* help to hire new team members<p>We’re looking for someone who<p>* is an experienced developer who have worked on live web applications before.<p>* have great backend skills and given our small team is also comfortable with basic frontend work<p>* thinks every good feature deserves a test or two<p>* has opinions on product and system design. You’ll have a chance to make a lot of decisions that will help us build secure, scalable product that will delight our users<p>flatfair is based in London, so you must have the existing right to work within the UK. We offer competitive salary (£60-£85k depending on experience), flexible hours and the chance to make a big impact, quickly. If you’re interested email us at careers@flatfair.co.uk or apply through <a href=\"http:&#x2F;&#x2F;smrtr.io&#x2F;9SBWtw\" rel=\"nofollow\">http:&#x2F;&#x2F;smrtr.io&#x2F;9SBWtw</a>","time":1509549454,"type":"comment"}