{"by":"yunong","id":15606024,"parent":15601729,"text":"Netflix | Senior Software Engineer, Edge Device Services | Los Gatos, CA, Full-time | ONSITE | <a href=\"https:&#x2F;&#x2F;jobs.netflix.com&#x2F;jobs&#x2F;861260\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.netflix.com&#x2F;jobs&#x2F;861260</a><p>Ping me directly on twitter @yunongx DMs are open!<p>Netflix is shaping the future of global entertainment and reinventing how people watch television.  Netflix applications are among the most successful and widely used in the world across a wide range of devices, including phones, tablets, game consoles, TVs, and desktop&#x2F;laptops.<p>Our team is passionate about building and advancing core libraries, platforms, and services that are used across our device platforms.  We design systems to be reliable at scale and flexible to product innovations.  The projects you work on will not only help to continually improve how we deliver a better experience to our 100+ million members but also boost the productivity of over 200 engineers.<p>Challenges for 2017<p>In the coming year, our big goal is to migrate teams to the next-generation of the Netflix API, the system which processes and orchestrates all requests from devices to backend services.  We’re building a high-scale platform that leverages Node.js and Docker containers to enable UI client teams to easily write and deploy their own services to the cloud.  These services will be sitting in the middle of much of the action.  Every request from every device from our 100+ million users will go through this new stack.<p>This is a highly cross-functional project with implications for many teams at Netflix.  It will make our system more usable and developer friendly as well as more reliable, scalable, and performant as we continue to grow globally.  There is no shortage of opportunities to shape the future of our product.<p>How you will help<p>Build, optimize and scale our Node.js platform and infrastructure\nWork on first-class integration of Node.js in the Netflix cloud ecosystem\nEnsure full observability into the state of Node.js services and real-time analytics\nCollaborate with engineers to identify common pain points, develop solutions, and evangelize best practices\nProvide technical leadership across UI engineering and help guide the overall engineering vision\nImprove developer productivity through better tools, processes and frameworks","time":1509574827,"type":"comment"}