{"by":"applehire","id":15603496,"parent":15601729,"text":"Apple | Cupertino, CA | Data Engineer |Full time | Onsite<p>The Fraud, Engineering, Algorithms and Risk group is responsible for combating fraud and abuse for Internet Software and Services at Apple. \nThe FEAR engineering team is tasked with building mission-critical, robust and scalable distributed systems that can keep pace with data across a number of high-profile and large-volume Apple cloud properties.<p>We are building the next-generation libraries, platforms and data pipelines to empower our data scientists to rapidly build and deploy complex models to production.<p>Key Qualifications:<p>* MS or BS in Computer Science or related field<p>* 3 or more years experience building large-scale<p>* distributed systems<p>* Skilled in Scala or Java<p>* Working knowledge with at least two of: Spark, MapReduce, HDFS, Cassandra, Kafka<p>Description:<p>We engineer high-quality, scalable and resilient distributed systems that power data exploration, model building and production models.Our core systems need to work seamlessly across different execution contexts (real-time, near real-time and batch) and support diverse big data stacks such as Spark, Hadoop, Kafka, Cassandra and beyond. We work at a unique intersection of huge data volumes and adversaries that are continuously adapting, which means we are operating at and beyond the limits of conventional big data systems.\nOn our team you can be sure that every commit you make will come with the satisfaction that you are helping protect and improve the user experience of hundreds of millions of users.\nThis role requires in-depth knowledge with cutting-edge big data technologies. Tuning, troubleshooting and scaling these big data technologies are a key part of our work, where having a curiosity with the internal workings of these systems is key to being successful. \nThis is a hard-core software engineering role, where a large part of an engineer&#x27;s time is spent writing code with the remainder being spent on designing and architecting systems, tuning and debugging big data systems, supporting production systems and supporting our data scientists.<p>if interested send your resume to mansur.ashraf@apple.com with [HN] in email subject","time":1509557229,"type":"comment"}