{"by":"famousactress","id":15602225,"kids":[15603086,15603024,15608287,15616748],"parent":15601729,"text":"Elation Health | Senior Software Engineers | SFO or Remote | Full Time<p>I want to post an apology. A few months ago our recruiting process was going well enough that we had a comment in our HN post from a candidate we&#x27;d passed on who was happy enough with the experience that they recommended us in the thread [1]. Last month, however we had the exact opposite experience. Two candidates commented about investing significant effort in the process, only to be ghosted [2].<p>I arrived at those comments too late to reply, so I&#x27;m using this month&#x27;s post to apologize. I dug into what happened here and found that we did indeed drop the ball with a few candidates and failed to follow up. Certainly it wasn&#x27;t our intent and doesn&#x27;t reflect our values. We&#x27;ve audited the entire candidate pool and have reached out to anyone that fell through the cracks to properly close the loop.  I personally apologize for your poor experiences and the criticism is well deserved.<p>I also want to thank the people who commented. I think posting that kind of feedback warning others is an excellent way to keep other members of the community informed, and hold each-other accountable. In this case we&#x27;ve overhauled and streamlined our processes so that we&#x27;re confident this won&#x27;t happen again in the future. So thank you for helping us do better, and I&#x27;m very sorry that this improvement came at the expense of your time.<p>We are hiring, positions are here: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;elationhealth\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;elationhealth</a> and more about what we do at <a href=\"https:&#x2F;&#x2F;elationhealth.com\" rel=\"nofollow\">https:&#x2F;&#x2F;elationhealth.com</a><p>As always, my contact info is in my profile and I&#x27;m happy to chat with anyone directly or answer any questions transparently in the comments (I&#x27;ll monitor those today).<p>[1] <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14901945\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14901945</a><p>[2] <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=15384536\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=15384536</a>","time":1509550528,"type":"comment"}