{"by":"pjan","id":15606423,"parent":15601729,"text":"Paidy | Platform Engineer &amp; Data Engineer | Tokyo, Japan | ONSITE | VISA<p>We’re hiring Scala Engineers to scale, support and contribute to the continued building of our financial services, including our core product – Paidy. Paidy is Japan’s largest cardless online payment service, handling thousands of transactions per day for famous local and international brands.<p>We use Scala of the functional kind to solve the unique challenges of operating a complete payments stack, where we are the issuer, acquirer and payment gateway. As a member of the Paidy engineering team you will be thoughtful and deliberate about tackling bottlenecks, developing new features and improving existing systems. You’ll have the opportunity to develop a deep understanding of functional programming, distributed systems, data stream processing and machine learning. You’ll also be positioned to teach or mentor others.<p>We&#x27;re an international team based in the heart of Tokyo, and will soon be one of the biggest Scala teams in all of Japan. We sponsor &amp; manage the visa process.<p>Stack: Scala, typelevel libraries, some low-level akka, cassandra, elastic, docker, ...<p>The job descriptions we&#x27;re hiring for are the following:<p>- Platform Engineer: <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;466697084&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;466697084&#x2F;</a><p>- Data Engineer: <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;466817215&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;466817215&#x2F;</a><p>and we have multiple openings for each of them, with a focus that may vary based on your experience and interests. For the current batch of hires, we focus on people with relevant previous experience.<p>Usual interview process:<p>1) CV check and 30 minute video call about your past, passion &amp; interest in Paidy<p>2) Take home challenge, followed by a review interview<p>3) Final interview with one of the founders<p>Interested, or have more questions? pjan+hn@paidy.com","time":1509578637,"type":"comment"}