{"by":"caseus515","id":15606906,"kids":[15607445,15607573],"parent":15601729,"text":"Preferred Networks | AI Engineers | Tokyo and California | ONSITE, VISA, <a href=\"https:&#x2F;&#x2F;www.preferred-networks.jp&#x2F;en&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.preferred-networks.jp&#x2F;en&#x2F;</a><p>We are a growing startup with more than 100 members based in Tokyo, focusing on developing AI solutions for autonomous driving, robotics, and bio-healthcare. We love open source; we are actively developing the deep learning framework Chainer (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;chainer&#x2F;chainer\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;chainer&#x2F;chainer</a>).<p>In August, we received an investment of $95 million from Toyota: <a href=\"http:&#x2F;&#x2F;newsroom.toyota.co.jp&#x2F;en&#x2F;detail&#x2F;18012355&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;newsroom.toyota.co.jp&#x2F;en&#x2F;detail&#x2F;18012355&#x2F;</a><p>We are looking for great engineers that are able to handle challenging tasks related to:<p>- Edge devices, Embedded programming, Compilers, LLVM backend development.<p>- Computer Networking, SDN&#x2F;SDI, Network optimization and congestion control enhancement, Mobile devices reliability enhancement<p>- HPC, High Speed Interconnect, Supercomputer design and operation<p>- Hardware description languages (VHDL, Verilog, RTL)<p>- Software engineering, Software testing, CI,  UI, front-end development<p>- Cloud service integration, Container technology, OS virtualization<p>- etc. (please see our website for all available roles)<p>We have a western-style working environment with attractive salaries and benefits in the heart of Tokyo. Ability to communicate in either English or Japanese is OK. We have a flat hierarchy, so you can expect your opinion to count. Experience a Silicon Valley-like culture - while living in Japan! We are mainly hiring for our Tokyo office, but some positions are also available at our Berkeley office in California.<p>More job details and application instructions can be found at <a href=\"https:&#x2F;&#x2F;www.preferred-networks.jp&#x2F;en&#x2F;job\" rel=\"nofollow\">https:&#x2F;&#x2F;www.preferred-networks.jp&#x2F;en&#x2F;job</a>","time":1509583727,"type":"comment"}