{"by":"pixelmonkey","id":15603223,"parent":15601729,"text":"Parse.ly | Frontend Engineer | Remote | Full-Time | <a href=\"http:&#x2F;&#x2F;parsely.com\" rel=\"nofollow\">http:&#x2F;&#x2F;parsely.com</a><p>What&#x27;s Parse.ly? A real-time content measurement layer for the entire web.<p>Parse.ly is trusted by over 250 enterprises, used by over 2,500+ high-traffic websites, and has tens of thousands of active user seats. We are an established, but quickly-growing, company with a 20+ person product team and millions of dollars in revenue.<p>Our beautiful dashboards visualize data flowing from over 1 billion monthly unique devices and 65 billion monthly user actions.<p>The mission of our lean distributed team is described here:<p><a href=\"https:&#x2F;&#x2F;blog.parse.ly&#x2F;post&#x2F;4736&#x2F;mission&#x2F;?utm_campaign=oct2017_job\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.parse.ly&#x2F;post&#x2F;4736&#x2F;mission&#x2F;?utm_campaign=oct201...</a><p>We happily skip commutes by working out of our ergonomic home offices. Here&#x27;s a photograph of mine running two full-screen Parse.ly dashboards on my monitors:<p><a href=\"https:&#x2F;&#x2F;flic.kr&#x2F;p&#x2F;v1NZ73\" rel=\"nofollow\">https:&#x2F;&#x2F;flic.kr&#x2F;p&#x2F;v1NZ73</a><p>As a frontend engineer, you&#x27;ll join the small sub-team that owns the core experience of Parse.ly’s customer-facing SaaS dashboard. You&#x27;ll have an opportunity to ship new features to customers -- working in JavaScript, HTML5, CSS &amp; LESS, Python, and some other technologies.<p>For this role, you’ll need to be strong in JavaScript; have a keen sense of good design; have experience with web&#x2F;mobile frameworks; and enjoy D3.js.<p>For bonus points, you&#x27;d develop some comfort level implementing native iOS or Android applications.<p>In short, we&#x27;re looking for people who enjoy crafting beautiful user experiences &amp; products, and who also enjoy shipping to customers regularly.<p>You need to be technical enough to do real Python&#x2F;Django programming (possibly after some training&#x2F;practice); to build up a portfolio of real D3.js visualizations; to navigate JS frameworks like Angular, React, Vue; to evaluate open source code; and to develop some experience with native mobile development.<p>Join us to build the world&#x27;s best content analytics dashboard. Apply at work@parsely.com with a couple paras describing why you&#x27;re interested, a link to any portfolio&#x2F;code you think is relevant, and&#x2F;or your resume or LinkedIn profile. Make sure to mention HN and the &quot;Frontend Engineer&quot; role. Also, please list your timezone, working hours, and location. Note that though we can hire from most locations, we will prioritize those near US_Eastern or GMT timezones, due to our current team working hours.","time":1509555556,"type":"comment"}