{"by":"moiramreilly","id":15602552,"parent":15601729,"text":"Flexport | Software Engineers, Staff Engineers, Data Scientists, Product Managers and Product Designers | San Francisco | flexport.com &#x2F; flexport.engineering<p>Flexport&#x27;s mission is to fix the user experience in global trade and bring the world free trade through technology. Here at Flexport, we share a vision where any two businesses can trade with each other without regard for geographic distance, logistical complexity, or regulatory challenges.<p>Our services put clients back in control of their logistics and supply chain needs. We offer faster freight quotes, lower prices, improved visibility and notifications, and advanced analytics. Our lean team of ~35 engineers are building products flexible, maintainable products that are reshaping this fragmented industry.<p>Started in 2013, we&#x27;ve raised $204M from investors that include Peter Thiel’s Founders Fund, Google Ventures, First Round Capital, Bloomberg Beta, Y Combinator, &amp; more.<p>Check us out if you: \n-Want to be part of a close-knit engineering team that releases new code every day\n-Take a product-first approach to building software\n-Care about the real world functionality of your programming\n-Desire to build scalable programs that standardize information flow and increase operational capacity\n-Have amazing coding skills and CS fundamentals; and\n-Know modern javascript frameworks.<p>Our stack\nWe deploy every 20 minutes with our Buildkite CI setup (<a href=\"https:&#x2F;&#x2F;flexport.engineering&#x2F;how-flexport-halved-testing-costs-with-an-auto-scaling-ci-cd-cluster-8304297222f\" rel=\"nofollow\">https:&#x2F;&#x2F;flexport.engineering&#x2F;how-flexport-halved-testing-cos...</a>). Our frontend is built with Flow-typed ES2017. We have around 1500 React components and 100 Flux stores, though we’re beginning to use GraphQL &amp; Relay to replace Flux. We test the frontend with Jest and enzyme. On the backend, we&#x27;re a Rails shop riding on Postgres RDS and AWS.<p>Learn more about our work<p>1.The Flexport engineering blog: <a href=\"https:&#x2F;&#x2F;flexport.engineering&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;flexport.engineering&#x2F;</a>\n2.TechCrunch doesn’t think we’re sexy enough: <a href=\"https:&#x2F;&#x2F;techcrunch.com&#x2F;2016&#x2F;06&#x2F;07&#x2F;flexport&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;techcrunch.com&#x2F;2016&#x2F;06&#x2F;07&#x2F;flexport&#x2F;</a>\n3.Our CEO, Ryan, on FastCompany’s “Challengers” series (don’t worry, he’s not so dramatic IRL): <a href=\"https:&#x2F;&#x2F;www.fastcompany.com&#x2F;3066043&#x2F;if-flexport-succeeds-everything-you-buy-will-cost-less\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fastcompany.com&#x2F;3066043&#x2F;if-flexport-succeeds-eve...</a><p>Want to learn more?  Email kristen.hayward@flexport.com or check us out at flexport.com.","time":1509552219,"type":"comment"}