{"by":"earlz","id":15606625,"parent":15601729,"text":"Qtum (<a href=\"https:&#x2F;&#x2F;qtum.org\" rel=\"nofollow\">https:&#x2F;&#x2F;qtum.org</a>) | Global | Remote | Full-time | Software Engineer<p>Qtum is a smart contract platform built on a blockchain model similar to Bitcoin. We aim to drive the entire smart contract space forward with this project. Qtum is still young, and has been around for around 1.5 years. We use a fully remote workflow but typically try to all meetup in Shanghai once a year or so. We have team members based around the world, including China, USA, Canada, Sweden, Morocco, Colombia, and many others.<p>We are currently looking to expand our engineering team by 1 or 2 well experienced people. First of all, no blockchain experience is necessary (though it is always helpful). Qtum is aiming to implement an x86 virtual machine on which smart contracts can be executed. So, we need people to help us build the virtual machine, and test it to make sure it is correct (since fixing mistakes is very hard). We are also looking not just for engineers to build the virtual machine, but also to craft an operating system-like environment in which smart contracts can run. So, this may provide common necessities like memory allocation, string manipulation, etc... along with porting languages like C++, Rust, and Go to be easily used within the smart contract environment.<p>So, in summary we are looking for someone that loves working at the low level, bare metal level. If you have operating system development experience, that&#x27;s a plus. If you live and breathe assembler, we&#x27;d like to speak with you. No matter if your preferred architecture is x86, ARM, or whatever. Even if you made a cool Z80 assembly program for your TI-84. It&#x27;s all good stuff. We will be implementing most of the core logic in C++, but Rust and Go experience is a plus, especially with low level experience porting or dealing with the low-level details of the compilers and operating environment.<p>We take testing and code reviews seriously, being a blockchain project where mistakes can cost millions or more. We use a pull-request model, where each PR must be approved, and we have an always growing set of automated tests. Attention to detail and experience with working on security critical software is a plus. We&#x27;d prefer highly experienced senior people at this point, but we are accepting of anyone with experience in bare metal or assembly development. (Yes, we include open source hobby projects as experience)<p>I&#x27;m the Lead Developer and one of three Co-founders of Qtum, Jordan Earls. Email me with your resume or CV at earlz@qtum.org, and make sure to include a brief description of why this sounds interesting to you, and what makes you qualified for it.<p>PS: Unlike the common misconception, we do not require that you accept Bitcoin for your salary despite being a blockchain project.","time":1509580562,"type":"comment"}