{"by":"nsrivast","id":15609283,"parent":15601729,"text":"Twine Labs | Senior Full-Stack Developer | New York, NY | ONSITE | $100-150k + equity | <a href=\"https:&#x2F;&#x2F;www.twinelabs.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.twinelabs.com</a><p>Twine helps people find jobs they love inside their companies. And we help companies keep their best employees by moving them to better-fitting positions. We&#x27;re making internal labor markets more efficient with a predictive engine for employee success - we just closed a seed round with top NYC&#x2F;SV investors and are growing quickly.<p>Our SaaS application is built and running in production for paying clients. We use Django&#x2F;Postgres&#x2F;AWS, including a custom-built data&#x2F;ETL pipeline for processing jobs and employee data through our recommendation engine. This engine is built in Python and uses pandas&#x2F;scikit-learn. Our front-end uses JavaScript and related frameworks, with some canvas and d3.js<p>These are senior positions at an early stage startup - you&#x27;ll be the first engineers on the early team, aside from the CTO. You&#x27;ll work directly with the founders and other early engineers to build products and features that help enable our business goal: driving internal hiring for our clients. You&#x27;ll launch and customize the product for new customers, and you&#x27;ll work on product experiments that move us closer to product-market fit.<p>We&#x27;re hiring for:<p>* Senior Full-Stack Engineer: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;twine-labs&#x2F;jobs&#x2F;294661-senior-full-stack-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;twine-labs&#x2F;jobs&#x2F;294661-senior-full-stack-en...</a><p>* Front-End Engineer: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;twine-labs&#x2F;jobs&#x2F;293405-front-end-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;twine-labs&#x2F;jobs&#x2F;293405-front-end-engineer</a><p>Please email jobs@twinelabs.com with a resume or portfolio and brief motivation for applying.","time":1509620420,"type":"comment"}