{"by":"chrstphrhrt","id":15604672,"kids":[15624784,15659791],"parent":15601729,"text":"Finn.ai | Senior Engineer | salary $90k-$140k | Vancouver BC, Toronto ON, Montréal PQ | FULL TIME | VISA | ONSITE<p>Hey folks, I&#x27;m one of the engineers at Finn. The product is a personal banking NLP + ML system with chat frontends. Our customers are tier one and two banks. We started on Facebook Messenger, later added Slack for human customer service, Google Assistant for voice, and most recently our own SDK for Android, iOS and web.<p>We&#x27;re looking for new teammates on the product and data science teams.<p>On product (my team), we use and&#x2F;or plan to use:<p>- node 7.10+ (tracking&#x2F;testing latest stable) for multiple medium-sized, feature-oriented services<p>- postgres, redis, elasticsearch&#x2F;logstash&#x2F;kibana, low level drivers and query builders, no byzantine object mappers :)<p>- GraphQL<p>- ES2017+ without transpilers on the server<p>- Native functional&#x2F;immutable style to avoid null and undefined issues<p>- react for web and react-native hybrid for mobile<p>- Experimenting with OCaml and ReasonML<p>On data science, we use and&#x2F;or plan to use:<p>- python for services, tracking 3.5+ for type annotations and asyncio but mostly holding steady at 2.7 due to dependencies<p>- bottle + uwsgi for web, open to whatever<p>- Stanford NLP for dates and times<p>- NLTK for tokenizing&#x2F;stemming etc<p>- Scikit for basic transformations<p>- pandas for tabular data<p>- numpy for matrices and the nice math syntax<p>- spark for the actual model<p>Current headcount for the company is ~42 people. We&#x27;re from many different places, ethnicities, genders, and backgrounds. Women, LGBTQIA+, indigenous, racialized people, immigrants, people with disabilities and those from other marginalized groups are strongly encouraged to get in touch.<p>If you have shipped anything using any of the stuff above, send me an email to chris.hart@finn.ai to arrange a call.","time":1509564304,"type":"comment"}