{"by":"lonb42","id":15604706,"parent":15601729,"text":"Warby Parker | NYC | Onsite | Full-Time | Security Engineer, Senior Software Engineer, Fullstack Software Engineer, Senior Product Manager of Business Systems, Technical Product Manager<p>Hello. I&#x27;m the CTO of Warby Parker, we make eyewear and lots of software (and a little hardware).<p>Really though, Warby Parker is a socially conscious business rapidly changing the shopping experience for customers of fashion eyewear and medical devices both online and offline. We are currently the third most profitable retailer per square foot in the US and for three years running, Fast Company has named us one of the world’s most innovative companies.<p>Since 2010, we’ve grown to over 60 retail locations in the U.S. and Canada, opened our first optical lab in upstate New York, and launched two of our own iOS apps (one is patented technology and one is rated top 10 app by Apple last year).<p>Our Technology Team and business is growing &amp; we’ve got some exciting work ahead! Check out some of the open roles here:<p>Security Engineer: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;warbyparker&#x2F;jobs&#x2F;850904#.WfofExNSxTY\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;warbyparker&#x2F;jobs&#x2F;850904#.WfofEx...</a>\nSenior Software Engineer: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;warbyparker&#x2F;jobs&#x2F;843698#.WfofHhNSxTY\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;warbyparker&#x2F;jobs&#x2F;843698#.WfofHh...</a>\nFullstack Software Engineer: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;warbyparker&#x2F;jobs&#x2F;856476#.WfofLBNSxTY\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;warbyparker&#x2F;jobs&#x2F;856476#.WfofLB...</a>\nSenior Product Manager, Busines Systems: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;warbyparker&#x2F;jobs&#x2F;902674#.WfofNRNSxTY\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;warbyparker&#x2F;jobs&#x2F;902674#.WfofNR...</a>\nAnd many more: <a href=\"https:&#x2F;&#x2F;www.warbyparker.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.warbyparker.com&#x2F;jobs</a><p>Our team is thoughtful, collaborative, and we&#x27;re big believers in an iterative, approach with continuous improvement.<p>We build most of our tech in-house, anything from our e-commerce systems and business systems (finance, inventory, supply chain, etc.) to the Point of Sale systems in our 60+ retail stores across North America and lately even some hardware devices. It&#x27;s an exciting opportunity to work on building, optimizing, or securing innovative products at the intersection of medical devices, e-commerce, retail, and fashion.<p>Our current stack includes Python, React, Postgres, Swift, and some Go. A sprinkle of all your favorite flavors (others not listed).<p>We’d love to hear from you! Feel free to apply directly on the site or send your resume &amp; any questions to our head of Tech Recruiting: lucille.lam@warbyparker.com or you can find me on twitter @lonbinder - I&#x27;m happy to answer any questions!","time":1509564509,"type":"comment"}