{"by":"nad7vx","id":15604265,"parent":15601729,"text":"McKinsey &amp; Company | Engineering | Waltham, MA or New York, New York | Full-Time | Onsite<p>Come join McKiney&#x27;s Public and Social Sector Analytics team to build analytics-enabled applications to solve mission-critical challenges in the public and social sectors. If getting exposure to turning machine learning outputs into solutions, working in cross functional teams with designers, data engineers, data scientists and business leaders, tackling large scale distributed system problems and owning the engineering process end to end gets you excited please reach out to the email below and apply!<p>You will contribute to the architecture across the technology stack, from database to native apps. You will create rapid prototypes, usually in 2 to 3 weeks, as well as full-scale applications (typically within 2 to 3 months), by working collaboratively through design and development to deliver applications that have a direct real world impact. This team offers the freedom and flexibility of a start-up with the backing of a deep network of Firm wide colleagues.<p>Tech: you have the freedom to pick the right tool for the job (the general platform is AWS, Docker + Kubernetes, Node, React + Webpack + Babel with Vue gaining popularity in some projects, general microservices architecture with CircleCI and also the ability to leverage any MVC framework you see best fit for the job)<p>Senior Software Engineer (<a href=\"https:&#x2F;&#x2F;www.mckinsey.com&#x2F;careers&#x2F;search-jobs&#x2F;jobs&#x2F;senior-analytics-application-developer-4001130002\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mckinsey.com&#x2F;careers&#x2F;search-jobs&#x2F;jobs&#x2F;senior-ana...</a>) \nSenior Data Engineer (<a href=\"https:&#x2F;&#x2F;www.mckinsey.com&#x2F;careers&#x2F;search-jobs&#x2F;jobs&#x2F;senior-data-engineer-public-sector-analytics-4001133002\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mckinsey.com&#x2F;careers&#x2F;search-jobs&#x2F;jobs&#x2F;senior-dat...</a>) \nSenior Data Scientist (<a href=\"https:&#x2F;&#x2F;www.mckinsey.com&#x2F;careers&#x2F;search-jobs&#x2F;jobs&#x2F;data-scientist-public-sector-analytics-4001132002\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mckinsey.com&#x2F;careers&#x2F;search-jobs&#x2F;jobs&#x2F;data-scien...</a>)<p>Example of the kind of output our team has produced: <a href=\"https:&#x2F;&#x2F;www.mckinsey.com&#x2F;about-us&#x2F;new-at-mckinsey-blog&#x2F;our-n..\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mckinsey.com&#x2F;about-us&#x2F;new-at-mckinsey-blog&#x2F;our-n...</a>.<p>Reach out to nithin_donnipad[at]mckinsey.com if interested with resume and the role you are applying for with &quot;Hackernews&quot; in the subject line! Please apply above!","time":1509561836,"type":"comment"}