{"by":"andytw","id":15602154,"parent":15601729,"text":"ThoughtWorks | Senior Developer, Lead Developer | Denver, CO | Full Time | On Site &amp; Travel | VISA transfer OK | www.thoughtworks.com&#x2F;<p>ABOUT US:<p>ThoughtWorks is a global software consultancy with a reputation for being thought leaders in agile software delivery and a community of incredibly passionate and diverse technologists. We work with the mission of using technology to improve humanity and work with clients to solve some of their toughest problems.<p>Each client we work with gives us a new perspective and a broad exposure to different technologies, which leads to a pretty unlimited learning environment. We are constantly questioning the status-quo, innovating, and delivering. If you have a passion for exploring new technologies, chances are you’ll fit right in.<p>Our developers have been contributing code to major organizations and open source projects for over 25 years now. They’ve also been writing books, speaking at conferences, and helping push software development forward -- changing companies and even industries along the way.<p>TECHNOLOGY:<p>The nature of consulting means that the languages we code in and technical environments vary from project to project. ThoughtWorks looks for individuals with expertise in multiple technologies, but most importantly, those who are always willing to learn more. Keywords: java, ruby, javascript, c#, scala, python, continuous integration (CI), continuous delivery (CD), infrastructure as code (IaC), test driven development (TDD), agile, lean<p>AN IMPORTANT NOTE:<p>Projects are almost exclusively on customer site, so ThoughtWorkers should be flexible and open to extensive travel. While we do work with clients in our city, many of our consultants travel to other cities every week and fly home for weekends.<p>APPLY:<p>Senior Developer: <a href=\"https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;257322\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;257322</a><p>Lead Developer: <a href=\"https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;244948\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;244948</a>","time":1509550201,"type":"comment"}