{"by":"nosh","id":15604360,"parent":15601729,"text":"HealthRhythms | Multiple Positions | New York City | ONSITE<p>At HealthRhythms [<a href=\"http:&#x2F;&#x2F;healthrhythms.com\" rel=\"nofollow\">http:&#x2F;&#x2F;healthrhythms.com</a>] we are working to make it easy to measure and care for everyone’s mental health. Our products leverage real-time mobile measurements with data analysis and modeling to create truly personalized just-in-time interventions. We are helping people and their clinicians detect and characterize their mental health from passively available data from their mobile phones.<p>You can read a recent news article here:\n<a href=\"http:&#x2F;&#x2F;www.mobihealthnews.com&#x2F;content&#x2F;healthrhythms-behavioral-health-platform-snags-21m-nih\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mobihealthnews.com&#x2F;content&#x2F;healthrhythms-behavior...</a>\nWe&#x27;re looking for independent thinkers who care deeply about the problems we&#x27;re solving. Our mission is to redefine not only how we measure and treat mental illness, but how we optimize wellbeing as a whole. If being one of the first 10 employees at a promising startup in an exploding field sounds exciting to you, please get in touch.<p>Positions:<p>iOS Engineer (Swift, Objective-C) - we are looking for a candidate who will head up our efforts on iOS - this will involve working both on low-level sensing capabilities (e.g. Location&#x2F;GPS, HealthKit, Core Motion, etc) as well patient-facing portions of our app<p>Backend Engineer (Python, AWS) - Our backend runs on AWS, is primarily built in Python, and uses services such as AWS Lambda, DynamoDB, RedShift, etc. We are looking for someone who is well versed in both Python and AWS. Responsibilities will involve automating and scaling our current setup, as well continuing to build out our data capture and data analytics capabilities<p>Email us your resume and tell us a bit about yourself at jobs@healthrhythms.com<p>We are looking forward to hearing from you!","time":1509562310,"type":"comment"}