{"by":"blakeweb","id":15604809,"parent":15601729,"text":"Recursion Pharmaceuticals | SLC, Utah | Onsite, full-time<p>We&#x27;re about 80 people and just closed our $60M series B to apply ML and data science to our lab&#x27;s hundreds of millions of cellular images to find treatments for hundreds of diseases. Our long term vision is to use images and many other kinds of experiments plus modern ML to solve cellular biology enough to fix most things that go wrong in our bodies. Yoshua Bengio is an advisor, and he helps our ML team come up with novel ways of tackling these problems. I&#x27;m the technical co-founder and CTO.<p>We’re looking for:<p>* Data Scientists&#x2F;ML researchers: Looking for experienced and senior&#x2F;principal-level data scientists and machine learning researchers who want a challenging problem, lots of rich data, and knowledge that their breakthroughs will seriously help people. No bio background needed.<p>* Software Engineers: Looking for highly experienced full-stack and backend senior&#x2F;principal-level engineers who like interacting heavily with internal customers and building complex systems quickly, for a good cause. No bio background needed.<p>* Biologists, computational biologists, automation scientists, and drug discovery experts.<p><a href=\"http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;careers</a> for more details and to apply.<p>Logistics: Salt Lake City, Utah. Hiking&#x2F;running&#x2F;biking is literally out our back door, and it&#x27;s half an hour to 5 ski resorts. Great pay, health insurance, 401k, relocation assistance (onsite is required), equity, a top-caliber team, and help make a massively positive impact. Happy to sponsor&#x2F;extend visas, but you need to already be authorized to work in the US--we can’t handle the lottery at this stage.<p>Tech: Data science: python scientific stack (pandas, numpy, scikit-learn, matplotlib, bokeh, etc). Software engineering: go, python, angular.js, react, javascript on aws and gce. Deep learning (e.g. convolutional networks) we&#x27;re mainly using the python frameworks (keras, theano, tensorflow, etc).<p>Our team so far: <a href=\"http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;team\" rel=\"nofollow\">http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;team</a>","time":1509565427,"type":"comment"}