{"by":"dmangot","id":15606788,"parent":15601729,"text":"AppOptics (SolarWinds Cloud) | Site Reliability Engineer (SRE) | VAN, ATX, BOS, RTP | ONSITE | FULL-TIME |<p><a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2z4qmId\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2z4qmId</a>\nFor more information, email dmangot[at]librato[dot]com with the subject line [Hacker News AppOptics SRE]<p>Metrics, monitoring, observability.  You live and breathe it every day.  Now you want to take it to the next level and work on a product that does the same.  AppOptics is looking for an SRE to help build, improve, and manage our high performance stream processing pipeline.  This is truly one of those jobs where you and your developer&#x2F;ops friends can use the tool you operate every single day.<p>The AppOptics (<a href=\"https:&#x2F;&#x2F;www.appoptics.com&#x2F;introducing-appoptics&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.appoptics.com&#x2F;introducing-appoptics&#x2F;</a>) stack is largely Ruby, Java, Kafka, Python, and Cassandra, processing millions of metrics and traces every second.  The SRE team uses a mix of Terraform, Packer, Python, Vagrant, and SaltStack to run our 100% AWS platform.  This is your opportunity to join a talented SRE team at a company that is growing every month.  Plus, with the backing of SolarWinds behind it, there are no worries about running out of VC funding, or where the next round is coming from.   We&#x27;re a distributed team where everyone writes code, building for now and the future and we&#x27;re looking for the next piece of the puzzle to collaborate in creating that future.<p>If this sounds interesting to you, we&#x27;d love to open up a conversation about whether we&#x27;re a good match, setup some interviews and a coding test. You can find the contact info above.<p>About the company:\nAppOptics is an extensible application performance management (APM) and metrics platform that grows with your team. It’s a zero-configuration APM with distributed tracing, host and IT infrastructure monitoring with dozens of integrations, and custom metrics that all feed into the same dashboarding, analytics, and alerting pipelines.  AppOptics is a wholly owned subsidiary of SolarWinds Inc.","time":1509582179,"type":"comment"}