{"by":"julbaxter","id":15603924,"parent":15601729,"text":"Robotmaster | Montreal, Canada | Full-time | Onsite<p>Do you have an extreme passion for robotics and high technology? Are you looking for a stimulating career path by investing your skillset to the advancement of next generation robotic software technology? Would you like the dynamic stimulus of a tech startup work environment with the stability of a well-established company?<p>Hypertherm Robotic Software is the world leading developer of revolutionary programming software enabling the emerging demands of robotics for the future.  We develop out-of-the-box software solutions in the CAD&#x2F;CAM (Computer Aided Design, Computer Aided Manufacturing) domain specifically catering to industrial robotics.  Our main product, Robotmaster, is an award winning and industry trend setting approach to software technology for quick and easy programming of industrial robots.  We are a 100% employee owned company, consistently winning awards for “best and most ethical company in the USA” with a 49 year no layoff history.  Competitive compensation, employee stock ownership, profit sharing, and a corresponding opportunity for individual and professional development are guaranteed in our dynamically growing, employee owned company.<p>Hypertherm Robotic Software is seeking a highly skilled and motivated software developer.  You will be joining a dynamic multi-disciplinary team of robotic and software engineers&#x2F;scientists in a peer-led agile development environment.  Together, we will expand our capacity to develop ground breaking applications, using out-of-the-box thinking, and ultimately making an extreme impact to the global robotic community.<p>What will you do?\n• Join a dynamic team of robotics researchers, developers and applications engineers\n• Develop CAD&#x2F;CAM and simulation based applications for robotics \n• Bridge our software with various CAD&#x2F;CAM packages using relevant SDK (Software Development Kit)\n• Design and develop contemporary user interfaces using C# comprised of WPF controls\n• Contribute in the development, extension and maintenance of the infrastructure to support continuous delivery<p>What do you need?\n• B.S. in Software Engineering or related degree\n• Knowledge of C# or Java&#x2F;C++, .NET, and object oriented programming\n• Knowledge or interest in robotics, CAD&#x2F;CAM software, OpenGL and applied math would be a strong asset<p>julien@robotmaster.com","time":1509559851,"type":"comment"}