{"by":"bgriggs1","id":15612233,"kids":[15614090],"parent":15601729,"text":"Knack | US Remote | Front-end Engineer | <a href=\"https:&#x2F;&#x2F;knack.com&#x2F;work-at-knack\" rel=\"nofollow\">https:&#x2F;&#x2F;knack.com&#x2F;work-at-knack</a><p>We&#x27;re looking for a JavaScript expert with Vue.js experience and a passion for usability to help lead our front-end architecture.<p>Here&#x27;s some cool stuff about Knack:<p>* REMOTE - We&#x27;re a 100% remote company that has been 100% remote from the beginning and spends a lot of time thinking about how a small 100% remote team can build a world class product.<p>* PRODUCT - Knack is a DIY data platform that makes it easy to build custom apps that make your data useful. It&#x27;s constantly evolving and intersecting with the latest technology.<p>* IMPACT - If impact is your thing (it&#x27;s ours!) Knack impacts a lot of people, including countless non-profits, educational institutes, and small businesses.<p>* TEAM - We&#x27;re a small team that really enjoys getting to work together and it shows. It&#x27;s all about enjoying the ride, taking ownership, pushing each other to excel at our craft, and doing work that makes a difference.<p>* COMPANY - We&#x27;re 100% bootstrapped, so we know how to build a product customers will pay for. We believe in growth without compromise, not growth at all costs. We don&#x27;t have a VP layer or management, and want to keep it that way as long as we can.<p>Find out more at <a href=\"https:&#x2F;&#x2F;knack.com&#x2F;work-at-knack\" rel=\"nofollow\">https:&#x2F;&#x2F;knack.com&#x2F;work-at-knack</a> and <a href=\"https:&#x2F;&#x2F;knack.com&#x2F;about\" rel=\"nofollow\">https:&#x2F;&#x2F;knack.com&#x2F;about</a>.<p>Apply at <a href=\"https:&#x2F;&#x2F;www.knack.com&#x2F;jobs&#x2F;front-end-engineer#job-applications&#x2F;apply2&#x2F;5420897dd3385df425055419&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.knack.com&#x2F;jobs&#x2F;front-end-engineer#job-applicatio...</a>.","time":1509642573,"type":"comment"}