{"by":"krishnakulkarni","id":15632465,"parent":15601729,"text":"Healthify | CTO | New York City, NY<p>Jobs Page: <a href=\"https:&#x2F;&#x2F;healthify.workable.com&#x2F;jobs&#x2F;593625\" rel=\"nofollow\">https:&#x2F;&#x2F;healthify.workable.com&#x2F;jobs&#x2F;593625</a><p>Company Stage: Series A, ~40 Employees<p>Stack: Rails, React, Postgres, Elasticsearch, Docker<p>At Healthify we&#x27;re fundamentally rethinking how healthcare organizations and communities work together to connect struggling populations to social services.<p>Healthify is looking for a CTO to lead our diverse, growing, and highly empathetic technical team into its next phase. This is an excellent opportunity for someone with engineering leadership experience who enjoys thinking deeply about technology, teams, and scaling. The ideal candidate for the position exhibits the wisdom to have strong opinions, weakly held on all aspects of the product development process and is energized by creating a collaborative and productive work environment for their team.<p>-------------------------------------------------<p>Healthify |  Software Engineer (Front End)  | New York City, NY | On Site<p>Jobs page: <a href=\"https:&#x2F;&#x2F;healthify.workable.com&#x2F;jobs&#x2F;589652\" rel=\"nofollow\">https:&#x2F;&#x2F;healthify.workable.com&#x2F;jobs&#x2F;589652</a><p>Company Stage: Series A, ~40 Employees<p>Stack: Rails, React, Postgres, Elasticsearch, Docker<p>At Healthify we&#x27;re fundamentally rethinking how healthcare organizations and communities work together to connect struggling populations to social services.<p>Healthify is looking for a Front End Engineer to join our growing Product Engineering team. This is an opportunity for someone with production front-end experience and an interest in improving health outcomes for a large and diverse patient population to join our small yet mighty company of developers. The ideal candidate for this position is studied in modern Javascript frameworks, motivated by learning and improving, and excited to work on a product at an early stage.","time":1509925066,"type":"comment"}