{"by":"ydnew","id":15648680,"parent":15601729,"text":"Tencent Cloud | Senior Site Reliability Engineer | Palo Alto, CA | Full-time |ONSITE<p>Tencent Cloud is seeking an experienced Senior Site Reliability Engineer to join our Global Technical Support Center, and directly assist both startup and enterprise customers, to streamline adoption of Tencent IaaS and PaaS&#x2F;DBaaS cloud solutions.  This person will quickly become an authority in Tencent’s public cloud APIs, work with research and development (R&amp;D) teams to extend the current capabilities, and contribute to achieving full application stack provisioning.  They will have extensive experience in managing secure large scale Mobile and Web application services in one or more public cloud environments, and have a passion for developing automated approaches to configuration management, deployment, and incident response.<p>What we’re looking for…<p>You love automation! You really love automation!!  You want to automate everything!!!<p>You love making things faster, and always think about the rebuild and recovery times associated with everything you do.<p>You are knowledgeable, resourceful and show initiative. You always keep the customer’s objectives in mind.<p>You are positive by nature and are also a great team player; dependable and autonomous.<p>If you are interested in the position please apply at <a href=\"https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?cj=o6iQ5fw3&amp;s=Email\" rel=\"nofollow\">https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?cj=o6iQ5fw3&amp;s=Email</a>  or email me directly at wendyachen@tencent.com<p>For more information about the company, please visit:<p>Employee Benefits: \n<a href=\"http:&#x2F;&#x2F;careers.tencent.com&#x2F;global&#x2F;us&#x2F;Benefits.html\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.tencent.com&#x2F;global&#x2F;us&#x2F;Benefits.html</a><p>Product Information: <a href=\"https:&#x2F;&#x2F;cloud.tencent.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;cloud.tencent.com&#x2F;</a>","time":1510097081,"type":"comment"}