{"by":"jtso","id":15664284,"parent":15601729,"text":"App Academy | Full Time Senior Software Engineer | $120-160k, equity package, benefits, Unlimited PTO | San Francisco, CA<p>Apply here - <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2AnuS4g\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2AnuS4g</a><p>As a Senior Engineer at App Academy, you’ll lead and mentor a team of 3 software engineers as we build both internal and external facing features across our product lines (Full Time, App Academy Online, 10x Club, Bootcamp Prep, and TalentMatch). You’re eager to play a dual role of contributing actively to our code base, while mentoring and guiding our team members by reviewing their code submissions, code pairing, and championing best practices. You must have experience designing and building large and complex (yet maintainable) systems, and you should be able to do so in about one-third the time that most people think possible.<p>What you’ll do\n-Collaborate closely with your team to contribute to the core App Academy codebase.\n-Participate in all phases of the software lifecycle including discovery, prototyping, technical design, defining scope with Product Managers, implementation, testing and rollout.\n-Meeting 1-1 with team members on a regular basis, giving guided performance feedback, exploring technical tradeoffs with the team and serving as a coach and mentor\n-Champion best practices, high quality code, and proper test coverage. We ship code frequently and fast, but stability and reliability must never be compromised!\n-Drive changes to improve the architecture and make it more scalable, maintainable, testableIdentify opportunities for improvement by challenging the status quo, come up with alternative and creative solutions, and push change.<p>Requirements for this role\n-4+ years of experience in Software Engineering or the equivalent\n-Experience with a Ruby on Rails and Javascript stack\n-Sound understanding of web application development and agile development practices.\n-A holistic approach to development and testing, including TDD where appropriate.\n-Experience building insanely scalable, fault-tolerant, and robust products and platforms\n-Experience in setting product strategy\n-Great communication skills, both written and verbal","time":1510249523,"type":"comment"}