{"by":"EduardoNJF","dead":true,"id":15671779,"parent":15601729,"text":"Site Reliability Engineer&#x2F;DevOps (Machine learning driven hedge fund) | New York, Chicago, San Fran, London | Onsite | Full-­time | Comp: Best across all industries<p>Opportunity to join a leading machine learning, tech-driven hedge fund. We are seeking awesome SRE’s&#x2F;Production&#x2F;DevOps Engineers to work in a front-office environment solving complex problems and supporting trading infrastructure and high performance applications for high frequency trading and asset management teams. The role at its core is a mixture of DevOps, Linux SysAdmin with a lot of scripting and automation.<p>The required technical skills are:\n<i>Python scripting, automation and deployment of new software versions across Linux environment (RHEL and other Linux flavors).\n</i>Experience in Deployment, Integration and Automation.\n<i>Experience in CI&#x2F;CD; Continuous Integration and Continuous Delivery. (Ansible, Atlassian, Docker, Splunk, Stork or others).\n</i>Automation is key, we are seeking candidates with the ability to automate workflows.\n<i>Troubleshooting and resolving production issues.\n</i>Ability to interact across different teams to drive scalability.\nHigh speed networking knowledge is beneficial.\n<i>Open-source contributors and followers are highly sought by us. We are looking for candidates with passion for technology.\n</i>Financial experience is <i>not</i> required<p>Compensation is the best across all industries, much higher than silicon valley&#x2F;tech firm packages; substantial base, bonus and potential profit share. The role can be based in New York, Chicago, San Francisco or London. Sponsorship available for US based candidates.<p>We will consider candidates with the right skills across all levels of seniority. Junior Engineer to Senior Tech Leads&#x2F; Hands-on Managers.<p>If you are interested in discussing in more details, please send me an email at: eduardo[dot]herrera[at]njfsearch[dot]com","time":1510337946,"type":"comment"}