{"by":"tomasztomczyk","id":6827836,"parent":6827554,"text":"uSwitch.com -- London, UK. <a href=\"http://www.uswitch.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.uswitch.com&#x2F;</a>\nWe&#x27;re a comparison website for insurance, broadband, mobiles, gas&#x2F;energy providers and finance services.<p>------------<p>Hiring:<p>Backend, Frontend and DevOps - full time.\nWe&#x27;re looking for experienced developers to expand our team and help us deliver new products.<p>------------<p>Tech stack:<p>Backend: Apache, nginx, Varnish, puppet, capistrano, Ruby (Sinatra and RoR), PHP (mostly legacy - we&#x27;re moving away from it), Clojure, MySQL, mongoDB, R, Hadoop<p>Frontend: Responsive HTML5, JS &#x2F; CoffeeScript, HAML &#x2F; Twig<p>------------<p>About us:<p>* regular dev catchups across all teams &#x2F; show &amp; tell to share experience<p>* we host &#x2F; sponsor &#x2F; attend hackathons and conferences<p>* we maintain healthy work&#x2F;life balance - no extra long hours, weekends are for you to relax after a beer on a Friday in the office &#x2F; local pub<p>* we deploy to production multiple times a day<p>* we&#x27;ll give you the tools you need to do your job (Macbook or other machine of your choice, whatever software you need) and help you progress (budget for conferences, books and time to learn new tech)<p>------------<p>About you:<p>* able to own a problem and work with others towards a solution<p>* you&#x27;re open minded and flexible - you can pick up new skills &#x2F; languages<p>* you can work well in a team environment (occasional remote work is ok, but we&#x27;re mostly in the office)<p>* skilled at table tennis or table football (optional)<p>* comfortable in *nix<p>------------<p>Next steps:<p>Contact me directly - tomasz.tomczyk@uswitch.com - I&#x27;m a developer in one of the teams you could be joining, tell me about yourself (whatever you think represents you best) and ideally let&#x27;s meet up - will give you a tour of our new London Bridge office and talk about the projects we&#x27;ve been working on.","time":1385914531,"type":"comment"}