{"by":"vivekrkumar","id":6827892,"kids":[6828080,6828061],"parent":6827554,"text":"User Experience Developer at Qlicket | Delhi | <a href=\"http://qlicket.com\" rel=\"nofollow\">http:&#x2F;&#x2F;qlicket.com</a><p>Software Engineer - Java at Qlicket | Delhi | <a href=\"http://qlicket.com\" rel=\"nofollow\">http:&#x2F;&#x2F;qlicket.com</a><p>Executive Assistant at Qlicket | Delhi | <a href=\"http://qlicket.com\" rel=\"nofollow\">http:&#x2F;&#x2F;qlicket.com</a><p>INTRODUCTION TO QLICKET<p>Qlicket is an angel-backed technology company that focuses on deploying and monetizing WiFi hotspots in India. We have a new and highly disruptive business model to make public WiFi free in India by leveraging our patent-pending ad technology. In the last year alone, we&#x27;ve entered agreements that give us access to display our 100% guaranteed engagement format at over 250 locations across 50 different cities in India. We&#x27;re running campaigns for some of India&#x27;s most well-recognized brands, and we&#x27;ve now built our own WiFi hotspot using customized hardware and software that provides users with a much better public WiFi experience. Qlicket has been funded by 16 angels who are located across three continents, have provided the company $250k in total commitments, and maintain affiliations with Google, Microsoft, Boingo, One97, McKinsey, Blackstone, Bharti, TRAI, Wharton&#x2F;Penn and CMU, among other organizations. Techcircle has described us as &quot;one of India&#x27;s 10 most promising tech startups.”<p>USER EXPERIENCE DEVELOPER ROLE<p>&quot;Where Design Meets Code” … UX Developers take descriptions of UI layouts and screens — that are provided either verbally or through some combination of sketches, screenshots and mockups — and then convert these descriptions into flexible HTML, CSS and JavaScript files, so that the files can be appropriately rendered across major laptop, tablet and mobile browsers. UX Developers are comfortable working independently and coding in the latest front-end languages. We are looking for someone who wants to join a highly talented team of four that is dedicated to providing reliable and free Internet access for over a billion people.<p>USER EXPERIENCE DEVELOPER REQUIREMENTS<p>- Strong HTML, CSS and JavaScript skills<p>- Bachelor’s degree from a top-tier university<p>- Ability to build what you or your teammate’s design<p>- Comfortable working in Adobe Photoshop and Illustrator<p>- A portfolio of active websites, links and self-started projects<p>SOFTWARE ENGINEER - JAVA ROLE<p>Software Engineers take descriptions of use-cases — that are provided either verbally or through some combination of UML sketches or mockup — and then convert these use-cases into required classes, along with necessary database tables, entities and unit tests. Software Engineers must be adept at converting such requirements to productive code, and must also be comfortable using jQuery or similar JavaScript frameworks to achieve restful calls using AJAX. Software Engineers may be required to write basic front-end code to complete necessary use-cases. We are looking for someone who wants to join a highly talented team of four that is dedicated to providing reliable and free Internet access for over a billion people.<p>SOFTWARE ENGINEER - JAVA TECHNOLOGIES<p>Java 7 core, JSP 2.2+, JSF, Servlets 3+, JPA 2+, EJB 3+, JAX-RS, Tomcat 6+, MySQL&#x2F;MariaDB 5+ (SQL knowledge a must), JUnit&#x2F;TestNG, Maven&#x2F;Ant&#x2F;Gradle, JavaScript (jQuery, AJAX knowledge a must)<p>SOFTWARE ENGINEER - JAVA REQUIREMENTS<p>- Strong set of Java skills<p>- Bachelor&#x27;s degree from a top-tier university<p>- Preferably, three years of relevant work experience<p>- A portfolio of active websites, links and self-started projects<p>EXECUTIVE ASSISTANT ROLE<p>Executive assistants support teammates who focus primarily on devising better ways to help bring every Indian online for free. You need to be quick on your feet, thoughtful, meticulous, down to earth, and most importantly, trustworthy. We are looking for someone who wants to join a highly talented team of four that is dedicated to providing reliable and free Internet access for over a billion people.<p>EXECUTIVE ASSISTANT RESPONSIBILITIES<p>- Schedule &#x2F; coordinate meetings and phone calls<p>- Keep track of client interactions by updating our proprietary CRM database<p>- Save people&#x27;s time (e.g., pick up lunch, order office supplies, scan docs, etc.)<p>EXECUTIVE ASSISTANT EXPERIENCE &#x2F; SKILLS<p>- Prior administrative experience preferred<p>- Bachelor&#x27;s degree from a top-tier university<p>- Familiarity using the calendar system in Google Apps for Business<p>- Comfortable with English and the idea of working at a leading tech startup<p>- Avid Internet user who enjoys accessing free public WiFi at venues across India<p>BENEFITS FOR ALL POSITIONS<p>- Smartphone with voice and data plan<p>- Laptop including external monitor and mouse<p>- Competitive compensation with salary and stock options<p>- Office with AC, bean bags and only five-minute walk to Metro<p>- Opportunity to learn a lot, love your work, and change the world<p>APPLICATION<p>Please send a brief email along with your links, portfolio and CV to careers@qlicket.com","time":1385915233,"type":"comment"}