{"by":"leapingllamas","id":6828680,"parent":6827554,"text":"Warby Parker, New York City. \nData scientist &amp; software engineer on data team<p>Warby Parker is a transformative fashion brand offering designer eyewear at a revolutionary price while leading the way for socially-conscious businesses. We’re looking to hire a stellar Software Engineer to join our Data Science team and help build the next great lifestyle brand.<p>Since all work and no play make a dull office, we’re thoroughly committed to infusing our days with surprises, brain-stimulating activities and, when appropriate, costumes. As a team member at Warby Parker you can look forward to company outings, guest speakers, and all sorts of other goodness.<p>===========================================<p>What you&#x27;ll do (software engineer):<p>- Write, document, test, deploy and maintain SQL, Java, Python, and Pentaho ETLs\n - Implement APIs, as well as build and deploy underlying production servers\n - Build Django or Tornado micro apps to sanity check, review, and debug data\n - Automate manual or suboptimal data-related business processes and analyses\n - Participate in code reviews and help maintain high standards of code quality\n - Work with data scientists to implement tools such as recommendation and personalization engines<p><a href=\"http://jobs.warbyparker.com/apply/bRozkI/Software-Engineer-Data-Science.html?source=carlhn\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.warbyparker.com&#x2F;apply&#x2F;bRozkI&#x2F;Software-Engineer-D...</a><p>===========================================<p>What you&#x27;ll do (data scientist):<p>- Identify opportunities for business improvements using predictive modeling, classifiers,  \n - recommenders, and NLP\n - Implement, document, and maintain models, data products, and visual dashboards\n - Participate in code reviews and help maintain high standards of code quality\n - Write, document, test, deploy, and maintain SQL&#x2F;Java&#x2F;Python&#x2F;Pentaho ETLs\n - Mentor other analysts and junior data scientists (Awww...)<p><a href=\"http://jobs.warbyparker.com/apply/xJEJy3/Data-Scientist.html?source=carlhn\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.warbyparker.com&#x2F;apply&#x2F;xJEJy3&#x2F;Data-Scientist.html...</a>","time":1385925003,"type":"comment"}