{"by":"andy_campanella","id":6828523,"parent":6827554,"text":"Loci Controls - <a href=\"http://www.locicontrols.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.locicontrols.com</a> - Boston, MA<p>We are looking for: Backend Software Engineer * Data Scientist<p>Loci Controls is developing real time control systems to extract energy from waste in landfills.  Many landfills use methane from waste to generate and sell electricity to the power grid. We have developed custom hardware to measure and control the extraction of methane, and have successfully deployed our technology at a pilot site south of Boston.  We are coupling connected devices and data analytics to increase the electricity output at these power plants, and you can be an integral part of the team.<p>We are currently working out of the Bolt (bolt.io) space in downtown Boston. It is a great office with great people, a ton of rapid prototyping equipment, idea paint conference rooms, full kitchen, and free coffee and beer. Come check it out!<p>------------------------------------------------------------<p>Backend Software Engineer<p>Blend open-source technology with our custom hardware to deliver real time data to customers quickly and efficiently. Build a robust interface between the control hardware and the web so that not a single data point is lost. And archive data so that it can be accessed years from now.  You will lay the groundwork for some of the most advanced statistical models ever developed in the industry.\nResponsibilities:<p>* Build database and web server applications that scale to store and retrieve an enormous amount of data<p>* Define&#x2F;build an API to feed real-time data to an analytics engine and into a customer-facing interface<p>* Develop debugging and monitoring systems customized for a single piece of hardware\n* Diagnose and solve hard problems as we deploy and scale<p>* Gain an understanding of the market to see the impact of the tools you develop<p>Requirements:<p>* Deep understanding of Linux file system architecture<p>* Knowledge of cloud hosting and storage services (AWS, etc.)<p>* Proficient in at least one of the following: Java, Ruby, Python, C&#x2F;C++, or PHP<p>* Experience in databases such as MySQL, PostgreSQL, MongoDB, Hadoop, or Couchbase<p>------------------------------------------------------------<p>Data Scientist<p>Correlate data from thousands of connected devices to build mathematical models of complex natural phenomena.  Develop state estimation and control models based on real world measurements, and oversee the implementation of those models across our network of devices.  Be a part of the core team in a world-class technology organization.<p>Responsibilities:<p>* Mine large amounts of data for insights into complex and highly variable systems<p>* Build mathematical models that incorporate predictive analytics and self-learning control algorithms so we are constantly improving our performance<p>* Work closely with our designers and engineers to implement your ideas in the real world<p>* Develop the IP and proprietary models that will maintain our competitive edge<p>Requirements:<p>* Expert knowledge of statistical data modeling tools and mathematical software (R, MATLAB, Mathematica, etc.)<p>* Experience building web applications and server side frameworks that can bring your models to life (Ruby, NodeJS, Scala, etc.)<p>* Passion for debugging and iterating to make robust code and models<p>* Self-starter: learn new languages and techniques on the fly to account for new problems<p>To apply, please send a resume and a description of yourself to andy@locicontrols.com","time":1385923054,"type":"comment"}