{"by":"mookerji","id":6829465,"parent":6827554,"text":"The Climate Corporation (San Francisco, Seattle) - <a href=\"http://climate.com/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;climate.com&#x2F;careers</a><p>The Climate Corporation&#x27;s mission is to help all the world&#x27;s people and\nbusinesses manage and adapt to climate change. We use a combination of weather\nmonitoring, agronomic modeling, and weather simulation to provide real-time\npricing and purchasing of customizable weather insurance to farmers in the\nUnited States.<p>Climate&#x27;s technical staff numbers around 80, and we&#x27;re hiring full-time\nemployees and interns across many teams as we expand efforts on a new class of\ndecision support tools for growers (see <a href=\"http://goo.gl/e2uu9v\" rel=\"nofollow\">http:&#x2F;&#x2F;goo.gl&#x2F;e2uu9v</a>). Work is split\nacross groups focusing on web applications for farmers and agents, risk and\ninsurance policy management, internal platform and data services, and\nscientific modeling and research, with roles for:<p>1. Software engineering generalists with solid CS fundamentals, particularly\nanyone interested in building (i) entirely new, large-scale distributed data\nservices for scientific computing (we use Clojure); and (ii) web applications\n(Rails, Python, Javascript, and iOS) used by farmers to manage weather risk.<p>2. Quantitative researchers in statistics&#x2F;ML, stochastic optimization, remote\nsensing, atmospheric physics, and agronomics. Our goal is to forecast\nstatistical distributions of crop yield for any piece of arable land,\nsynthesizing satellite images, digital elevation models, weather data,\nagricultural statistics, and geological surveys into multiscale models that\nunderly our data services.<p>3. Experienced technical team leads, operations engineers, product managers,\nand designers to pull all this together into compelling products.<p>The scale and interdiscplinary nature of the work drive a lot of\ncross-collaboration within the company, supported by a pressing need to build\ndurable solutions to some very important problems.<p>Competitive salary, excellent benefits, stock options, etc. Our 25% time is\nlumped into two-week sabbaticals. The usual details about these positions are\nhere:\n<a href=\"https://hire.jobvite.com/j?bj=o7B8Wfww&amp;s=hackernews\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j?bj=o7B8Wfww&amp;s=hackernews</a><p>I write Clojure for a small scientific software engineering team building\nClimate&#x27;s agricultural yield models. If you&#x27;re interested or have any\nquestions, send me an email at bmookerji@climate.com with [dec2013-hn] in the\nsubject heading.","time":1385933893,"type":"comment"}