{"by":"jetcom","id":6829246,"kids":[6835733],"parent":6827554,"text":"Iterable (<a href=\"http://iterable.com\" rel=\"nofollow\">http:&#x2F;&#x2F;iterable.com</a>) - San Francisco, CA.\nCome join Iterable, the next generation email optimization company.<p>Email usage is changing, but the technology and capabilities haven&#x27;t caught up to the 21st century. We&#x27;re a small team of hackers and thinkers who are creating the next generation email optimization platform. Our team has experience at big tech companies (Twitter, Google, SIG) and we want to bring and improve the technology that powers user growth and commerce at these places to everyone. This means writing code that improves the lives of our customers (series seed and series A companies) and their millions of email subscribers.<p>One of our top level goals is to build a uniquely fun and growth oriented company culture. This is a journey, not a rat race. Knowledge sharing in any capacity is highly valued here -- are you interested in prediction markets or PGP encryption? Do you enjoy teaching posture techniques or purely functional data structures to others? We pair program, design together, and generally create a learn-and-teach environment here.<p>If you&#x27;re interested in coming on board, you can help with some challenges we face: - Scale our API to beyond millions of requests - Design and write performant, beautiful interfaces - Write software to build machine learned user models - Make data visualizations for our email and user data - Design an immutable infrastructure for our platform\nSome aspects of our culture that make us different: - We are all very focused on self improvement - Our company has egalitarian and transparent values: work when you want, on what you want. - We are chill and empathetic people - The company is completely transparent<p>You&#x27;ll get to work with us at our office at Kleiner Perkins&#x27; startup incubation space in SoMa.\nIf this sounds like an interesting opportunity for you, please email me. -- YW5kcmV3QGl0ZXJhYmxlLmNvbQ==","time":1385931039,"type":"comment"}