{"by":"ilz","id":6829182,"parent":6827554,"text":"Blue Apron (New York, NY): Rails Developer<p>Blue Apron (<a href=\"http://www.blueapron.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.blueapron.com</a>) is a NY start-up that delivers original recipes and all the fresh ingredients you need to make them in exactly the right proportions. We&#x27;ve raised $8M from First Round Capital, Bessemer Venture Partners, and Dave Tisch [1] and have been featured in the New York Times [2].<p>We are experiencing explosive growth and ship more than 250,000 meals a month (up from 100k just over a few months ago), and now deliver nationwide. We&#x27;re looking to add a full stack developer to our core team to get in on the ground floor and help build out our platform. Since we manage fulfillment in-house, we need unique, well-designed systems that can scale with our business.<p>Our ideal candidate believes in our mission of changing the way people eat and wants to work closely with our founding team to help fuel our growth. This person will:<p>- Solve unique UI, scheduling, and logistics challenges that impact our customers on a daily basis<p>- Help evaluate, prioritize, design and build new features<p>- Make key platform decisions and be comfortable jumping into and evaluating new technologies<p>Our stack: Rails, HAML, Bootstrap, SASS, JQuery, AJAX, Git, Heroku, PostgreSQL<p>The role comes with a full-time salary and equity. To apply, please submit a short email outlining your experience and why you are interested along with your resume to jobs@blueapron.com.<p>[1] <a href=\"http://www.forbes.com/sites/natalierobehmed/2013/08/15/blue-apron-now-delivering-100000-meals-a-month/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.forbes.com&#x2F;sites&#x2F;natalierobehmed&#x2F;2013&#x2F;08&#x2F;15&#x2F;blue-...</a><p>[2] <a href=\"http://www.nytimes.com/2013/02/13/dining/the-dinner-kit-is-served.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nytimes.com&#x2F;2013&#x2F;02&#x2F;13&#x2F;dining&#x2F;the-dinner-kit-is-s...</a>","time":1385930199,"type":"comment"}