{"by":"paf31","id":6829369,"kids":[6836692],"parent":6827554,"text":"DICOM Grid, Phoenix, AZ or REMOTE<p>Overview<p>DICOM Grid, a SaaS start-up in the healthcare technology field, is looking for a Compliance Lead to build DICOM Grid’s compliance policies and procedures. You will report to the CFO. We are looking to build the Compliance Lead by sending the qualified candidate to appropriate training. You do not need experience in healthcare regulations to apply. However, you need to convince DICOM Grid’s leadership that you can learn the healthcare regulations and quickly build appropriate policies and procedures. This is a great opportunity to build out a critical part of the company, to get involved in a healthcare startup that is gaining traction with big ambitions, and to develop skills that are in high demand.<p>Position Responsibilities<p>- Build and document processes and procedures that align DICOM Grid with relevant healthcare regulations.<p>- Monitor company initiatives that might be affected by law<p>- Educate employees on ethics, compliance, and patient privacy rights<p>- Oversee risk management and patient-privacy related programs<p>- Write, update policies on patient data integrity and ensure the company is safeguarding client privacy based on these policies (HIPAA, HITECH, and other federal, state, and local&#x2F;municipal regulations)<p>- Develop detailed understanding of relevant regulations including 21 CFR Part 11, FDA Level One Medical Device classifications, and relevant European regulations.<p>- Audit the company as defined by the processes and procedures that you develop<p>- Assist in the reviews we undergo from outside auditors<p>- Investigate any issues or concerns coming from staff, clients, or outside  personnel<p>What qualifies you to join?<p>- Recent college graduate with 0-3 years work experience, preferably with a major in business or engineering, and a GPA of 3.3 or higher.<p>- Liberal arts, law, or business majors with strong GPAs (3.3 or higher) are encouraged to apply.<p>- General interest in healthcare and regulations.<p>- Strong communication and interpersonal skills.<p>- Strong ability to write clearly is mandatory.<p>- High enthusiasm and desire to work on an entrepreneurial team.<p>- Roll-up-the sleeves attitude is a must.<p>- Meticulous attention to detail with strong organization skills<p>- Heavy emphasis will be placed on problem solving skills, personal initiative and good people management&#x2F;relationship skills. Sense of humor is mandatory.<p>Logistics<p>- Must be located in or willing to relocate to Phoenix, AZ or Boston, MA.<p>- This is virtual position, you must be able to work from home effectively<p>- Base salary is $60,000; stock options will be granted commensurate with experience; annual bonus will be awarded depending on performance; health insurance, paid holidays and vacation are part of the package.","time":1385932504,"type":"comment"}