{"by":"noahbrier","id":6829263,"parent":6827554,"text":"New York, NY. Full time. We&#x27;re looking for vp engineering, jr &amp; sr python engineers, jr &amp; sr frontend (js&#x2F;backbone) engineers + sr. android &amp; iOS engineers.<p>As you can tell from the job openings, Percolate is a very quickly growing SAAS company in NYC. We are building a platform that helps brands create content. What makes us unique is that we&#x27;re the only marketing technology solution that focuses on creation instead of publishing.<p>We&#x27;re looking for a VP to lead the team of nearly 30, as well as backend (all levels), frontend engineers (we run backbone.js alongside our RESTful API) and mobile (iOS + android). On the backend, we&#x27;re especially interested in folks with good experience working with lots of data and excited to build real-time systems.<p>Here&#x27;s thirteen reasons why you should come work here: (1) Your chance to work with big data (2) You come in early: We&#x27;re only a year-and-a-half old (3) As we get bigger, you will be able to focus on what you are good at (4) We are all different and we love it (5) GPL compliant company (6) You choose your workstation (7) You choose your tools (8) No worries, free your mind: NY salary + medical + dental (9) No vacation policy (we don&#x27;t count the # of days you take in a year) (10) Company invests in you: Fly to PyCon and other conferences (11) We prefer quality over quantity: Focus on clean code and test coverage (12) Your voice will be heard (13) Every employee gets salary + equity<p>Lots more info about us at our new about pages: <a href=\"http://percolate.com/about\" rel=\"nofollow\">http:&#x2F;&#x2F;percolate.com&#x2F;about</a><p>If you&#x27;re interested email us at jobs@percolate.com or apply at <a href=\"http://percolate.com/about/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;percolate.com&#x2F;about&#x2F;jobs&#x2F;</a><p>If you have any questions you can email me (I&#x27;m co-founder and CEO) directly at noah@percolate.com. Thanks.","time":1385931183,"type":"comment"}