{"by":"mattsprig","id":6829219,"parent":6827554,"text":"Sprig - San Francisco, CA<p>Senior Mobile Engineer<p>At Sprig, we&#x27;re bringing delight back to your dinners. We feature a daily rotating menu of three seasonal, sustainable, healthy, and delicious meals designed and crafted by executive chef Nate Keller. With a few taps, our Sprig servers will brave rain and fog to whisk your order over faster than you can say dinner on demand.<p>To that end, we’re looking for a senior engineer to help us build an amazing experience for Sprig customers. You’ll be the first engineering hire outside of the co-founders, so this is a great opportunity to help define our engineering culture and product focus. We&#x27;re well-funded and just launched in SF.<p>Right away you’ll be working on:<p>- Our customer-facing mobile apps (aka our &quot;front of the house&quot;)<p>- Mobile apps for our servers, helping them efficiently whisk meals from kitchen to table<p>- Our delivery dispatch algorithm, the key to getting food in people&#x27;s hands as fast as possible<p>In the future you might be working on:<p>- Bringing our app ordering experience to as many customers as possible<p>- Simulating delivery routing optimizations so we can tune our dispatch<p>- Scaling the backend to launch new cities<p>Our stack includes:<p>- iOS, Rails, Postgres, RabbitMQ, Heroku, AWS<p>You should have:<p>- Significant iOS or Android experience, having shipped at least one app<p>- Some Rails or other backend experience<p>- Previous startup experience<p>- Passion for food! You’re joining our engineering team, but we are first and foremost a food company<p>- A sense of humor, and&#x2F;or a mild love of accidental food startup puns (too many cooks in the kitchen, let the idea simmer, put it on the back burner...list goes on)<p>Let us know why you&#x27;re interested in Sprig and shoot us any relevant links (github, linkedin, blogs, roomba you rigged up to open doors for guests, whatever). Contact Matt (engineering lead) directly at matt@eatsprig.com.","time":1385930670,"type":"comment"}