{"by":"jeffschenck","id":6830812,"parent":6827554,"text":"Chewse (www.chewse.com) - San Francisco, CA<p>FULL STACK ENGINEER<p><i>Who are you?</i><p>You love solving real problems with computers. Programming challenges are fun, but you want to make a real dent in the world, and code is your tool of choice.<p>You&#x27;re fluent in MVC frameworks and web programming because you understand the power of the Internet. You&#x27;re scrappy, not dogmatic, and tackle new features knowing perfect is the enemy of good.<p>You get users, and feel their pain. Code is not a world to itself; it&#x27;s a powerful and elegant means of solving complicated problems for users and bringing simplicity to people&#x27;s lives.<p><i>Who are we?</i><p>We are Chewse, and we make ordering office lunches a delight. We believe good food is a powerful force for uniting people, and we want to wield it to build stronger communities everywhere.<p>We are a young startup and a small, passionate team that&#x27;s hungry to tackle really big problems. We&#x27;re located in a work loft in San Francisco&#x27;s SOMA neighborhood. We have a kitchen. (And we like to use it.)<p><i>What is the job?</i><p>- Deploy new features and bugfixes in Python and JavaScript every week\n- Work with product and design to understand our users\n- Contribute to product strategy and business decisions<p><i>What do we need?</i><p>- Experience building production web applications\n- Comfortable coding frontend and backend\n- Also nice: familiarity with Python, Django, Angular.js, and a passion for food<p><i>Why should you join us?</i><p>- Do something that matters!\n- Work with a talented and friendly team\n- Weekly lunch and learn events\n- Real, meaningful equity\n- Free food! We cook together, we eat together<p><i>How do I apply?</i><p>Send a cover letter and resume to jeff@chewse.com with the subject &quot;Solving real problems&quot;.<p>UX AND JAVASCRIPT ENGINEER<p><i>Who are you?</i><p>You work comfortably in two worlds: design and code. Because you know that&#x27;s how shit actually gets done.<p>You get users. You feel their pain like it was your own, and you never stop thinking about how good design can solve their problems. Navigating the tradeoffs to achieve simplicity is what you live for because you know good design isn&#x27;t always pretty.<p>But it&#x27;s not just design for you — you feel a drive to build your own solutions. You know the ins and outs of the beast that is JavaScript. You know how closures work and how to tame prototypal inheritance. You want to work with power tools like Angular.js to bring your designs to life.<p><i>Who are we?</i><p>We are Chewse, and we make ordering office lunches a delight. We believe good food is a powerful force for uniting people, and we want to wield it to build stronger communities everywhere.<p>We are a young startup and a small, passionate team that&#x27;s hungry to tackle really big problems. We&#x27;re located in a work loft in San Francisco&#x27;s SOMA neighborhood. We have a kitchen. (And we like to use it.)<p><i>What is the job?</i><p>- Design user flows and create mockups for new functionality\n- Deploy new features and bugfixes with Angular.js every week\n- Dabble in backend programming (in Python) to make things happen\n- Contribute to product strategy and business decisions<p><i>What do we need?</i><p>- Visual design and UX chops, and a portfolio to back it up\n- Backward and forward knowledge of the latest in HTML and CSS\n- Deep understanding of JavaScript\n- Experience with JavaScript MVC frameworks (we use Angular.js)\n- Also nice: Python experience, and geeking out about food<p><i>Why should you join us?</i><p>- Do something that matters!\n- Work with a talented and friendly team\n- Weekly lunch and learn events\n- Real, meaningful equity\n- Free food! We cook together, we eat together<p><i>How do I apply?</i><p>Send a cover letter and resume to jeff@chewse.com with the subject &quot;Solving real problems&quot;.","time":1385949294,"type":"comment"}