{"by":"sokratisp","id":6833688,"parent":6827554,"text":"<a href=\"http://www.togethera.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.togethera.com</a> - Remote (London preferred)<p>We’re building the easiest way for families to stay connected through private sharing of thoughts, photos and videos. We&#x27;re just getting started, but already have users who tell us that Togethera: &quot;is enriching our lives&quot; and &quot;bringing our family closer together even though we&#x27;re scattered across the world&quot;, “I’d be very disappointed if Togethera wasn’t there tomorrow”. Some of those users are 90-year old grandparents and some young children - both using connected devices to share with those closest to them for the first time.<p>We have big plans and are backed by impressive angel investors in London and the U.S. - most are successful entrepreneurs themselves.<p>Our product is driven by a RESTful API built in Python and Django. The web front-end runs on AngularJS and we’re currently working on our mobile apps running on Phonegap for Android and full native for iOS.<p>We’re hiring for two roles: 1) a versatile developer who’s comfortable with our stack and an expert in front-end development, and 2) an iOS engineer who is obsessed with building the absolute best user experience that iOS can provide.<p>PERKS &amp; CULTURE<p>We&#x27;ve worked with excellent contractors for our MVP, and we&#x27;re now looking for people who are ready to commit to a startup and (if possible) join us in London. You&#x27;ll have real influence on the product, strategy, team and culture with the freedom and responsibility to turn plans and ideas into reality.<p>We believe that you need to work when and how you’re most productive to deliver results, so we have flexible work hours and don’t count your days off (and insist you take at least 22 of them per year).<p>You&#x27;ll help define our company culture and decide what perks would interest you - conference&#x2F;travel budget, ideal workstation setup, free lunch...?<p>We want our team to share in the success of the company, so you can choose a combination of cash and equity to suit your financial situation.<p>If you&#x27;re not in London, but are happy to move here from somewhere else in the UK&#x2F;Europe, then we&#x27;ll help you with expenses, finding accommodation and settling in.<p>To apply please send us an email at jobs@togethera.com with a bit about yourself and products you’ve built.","time":1385993441,"type":"comment"}