{"by":"dorkitude","id":6836200,"parent":6827554,"text":"Systems Programmer &#x2F; Infrastructure Engineer at Keen IO - <a href=\"https://keen.io\" rel=\"nofollow\">https:&#x2F;&#x2F;keen.io</a> (San Francisco only, for now)<p><i>Analytics Backend as a Service for modern developers</i> (web + mobile + internet of things)<p>Our API&#x27;s usage is doubling every 6-8 weeks.  We need help supporting that load.<p>Keen IO is a fully managed cloud API that lets developers build complex, hyper-custom, large-scale analytics and data science features directly into their web, mobile, or Internet of Things applications.<p>Our currency is event data, and events are a pretty broad abstraction. Every time someone draws a breath, clicks a link, loads a website, pauses a song, or starts a car, there&#x27;s an event. Events like these, in large aggregate, are extremely useful -- and therefore valuable :)<p>It&#x27;s probably worth mentioning that we&#x27;re a platform company, not a product company. This means our customers are using the platform to build for an emergent and rapidly growing set of use cases. The same flexibility that makes us future-proof for a given customer also makes us future-proof from a market perspective. So while a product company seeks a certain kind of product-market fit, we allow product-market fit to come to us: our customers build it for themselves.<p>Things we look for in a new team member:<p><pre><code>  • Learning agility \n  • Abstract reasoning \n  • Empathy\n  • Potential is more important than credential \n  • Confidence, but tempered by humility &amp; the drive to get even better\n</code></pre>\nSome things we believe in:<p><pre><code>  • Mission = The Discovery of Truth.\n  • Radical transparency \n  • Design with a capital &quot;D&quot; \n  • Introspection \n  • Distributed innovation \n  • The importance of laughter \n  • Relationships are everything \n  • Play to your strengths; patch your weaknesses with diverse collaborators\n</code></pre>\nApply:  <a href=\"https://angel.co/keen-io/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;keen-io&#x2F;jobs</a>","time":1386015246,"type":"comment"}