{"by":"garyp","id":6844535,"parent":6827554,"text":"OnTheGo Platforms - Portland, OR - <a href=\"http://www.otgplatforms.com/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.otgplatforms.com&#x2F;jobs&#x2F;</a><p>We&#x27;re a funded, early-stage startup developing software to make smart glasses easier to use and the applications on them more powerful. We&#x27;re hiring two senior software engineers, who would be key, early members of our development team. Comment here or contact me privately with any questions. To apply, email us at jobs@otgplatforms.com with the job title you are inquiring about in the subject line. Attach a résumé and include links to any projects you have worked on.<p>---<p>We are dedicated to taking our vision of tomorrow and making it happen NOW. We are not locked in a lab someplace; we’re building software for the real world, testing in the real world, and quickly iterating as we meet real obstacles. If you’re interested in smart glasses, have a passion for augmented reality, and want to join a team where your efforts will have immediate impact (on the product, the company, and the next wave of computing technology), then we want to hear from you.<p>* Senior Software Engineer, Computer Vision: We&#x27;re looking for a senior software engineer to be one of our early team members. You’ll be a lead architect of and contributor to our visual gesture recognition platform, focused on code that will ship on real products and not just experiments that work great in the lab. We&#x27;re working on tough problems that involve scaling state-of-the-art computer vision techniques to the limited processing, battery power, and sensing capabilities of today&#x27;s smart glasses.<p>* Senior Software Engineer, Android: We&#x27;re looking for a senior software engineer to be one of our early team members. You&#x27;ll be a lead architect of and contributor to our Android-based platform for app development on smart glasses. We&#x27;re working on everything from HUD and AR user interfaces, to sensor fusion, to inter-device Bluetooth communication.","time":1386122632,"type":"comment"}