{"by":"devops_marketo","id":6876503,"parent":6827554,"text":"Marketo - San Mateo CA - Full Time<p>Marketo is a leader in cloud software and are growing like crazy.  We are delighting our customers and hiring some of the best minds in Silicon Valley. Our headquarters is located in San Mateo, California and we continue to expand globally. We offer competitive salaries, great benefits, and a high-energy environment with lots of room for personal and professional growth.<p>Would you like to join one of the fastest growing companies in the valley? Would you like to apply your technical skills and experience to blazing new trails in the Marketing Automation space? Would you like to join a team comprised of some of the valley’s best engineers in defining this new and exciting emerging market? Then Marketo is the place for you.<p>About the Job<p>As a DevOps Engineer you participate in the design, implementation, rollout and maintenance of tools and applications critical to the business and used across various groups. You will bridge the gap between product, development and infrastructure by building intuitive, reliable and efficient automations.<p>Who we’re looking for:<p>•\tYou have solid CS fundamentals<p>•\tYou love to write &amp; read code<p>•\tYou write modular, reusable, testable code<p>•\tYou have good communication skills and are good team player<p>•\tYou enjoy working in a dynamic environment<p>•\tYou are a go getter, you get things done with minimal supervision<p>Your skills and experience:<p>•\tExperience developing applications running on Linux or BSD<p>•\tExperience with open source database systems (Mysql, PostgreSQL,etc)<p>•\tExperience with versioning system (Subverion, Git,etc)<p>•\tExperience writing and maintaining bash shell scripts<p>•\tRuby experience a big plus<p>•\tPHP experience a big plus<p>•\tRails experience a big plus<p>please apply @ <a href=\"http://hire.jobvite.com/j/?aj=oIUbYfwv&amp;s=HN\" rel=\"nofollow\">http:&#x2F;&#x2F;hire.jobvite.com&#x2F;j&#x2F;?aj=oIUbYfwv&amp;s=HN</a>","time":1386619872,"type":"comment"}