{"by":"lingumi","id":16967766,"parent":16967543,"text":"Lingumi (<a href=\"https:&#x2F;&#x2F;www.lingumi.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lingumi.com</a>) | London, UK | Software Engineer | Full-time | GBP 30-40k + equity | INTERN, ONSITE<p>We’re a fast-growing EdTech startup with a mission to make English learning fun, affordable and effective for the next billion young learners. Our flagship product is a mobile app with a digital curriculum full of mini-games for 2-6 year-olds making their first steps into English (as a second language).<p>We’re looking for our fourth engineer to help us iterate on the app (Unity, C#) and build out our backend systems (AWS, node.js) to deal with scaling globally and personalizing the experience for every child. We&#x27;re a team of ten, with an open work culture that permits flexible working time, remote-friendly work, and team members with young families.<p>We’re iterating on our hiring process to be both fair and effective for both parties, but roughly speaking it works like this: application, take-home technical challenge, phone call, on-sites&#x2F;video calls, offer.<p>The full job specification and application form can be found here: <a href=\"https:&#x2F;&#x2F;lingumi.workable.com&#x2F;j&#x2F;8727CCF3F9\" rel=\"nofollow\">https:&#x2F;&#x2F;lingumi.workable.com&#x2F;j&#x2F;8727CCF3F9</a>. If you’re looking for an internship, email me directly at george (at) lingumi (dot) com.<p>Disclaimer: We’re not yet able to sponsor visas, therefore we don’t want to waste anyone’s time by promising on something we can’t deliver. Similarly, although we do support remote employees, we’re not able to include candidates who are not able to start off in one of our offices (for onboarding). We have offices in Cardiff and London.<p>I’m one of the software engineers on the team, but I’ll also be handling the recruitment process so I welcome questions about the company, the team, the engineering and the application process via an email to george (at) lingumi (dot) com or a comment below!","time":1525188084,"type":"comment"}