{"by":"sasper","id":16967977,"parent":16967543,"text":"4PatientCare | Multiple Positions — QA, Software Development | Fully Remote | Full-Time | www.4patientcare.com<p>4PC is a growing SaaS company providing automated communication services for increasing patient engagement in healthcare. Our services are used to send more than 5,000,000 automated communications per month from phone calls to text messages to emails. These communications help bring more patients into more offices more often.<p>Everyone in our organization (30+ people) works remotely. We believe in empowering our employees with the freedom to choose their schedule, and both where and how they would like to work. Even though our staff are spread out across the country (and world), we do our best to create a tight-knit culture so no one feels like they are alone. We pride ourselves in a laid-back, yet incredibly self-disciplined culture. There&#x27;s a high level of autonomy involved in all positions.<p>We&#x27;ve been a growing healthcare company for over 2 decades, and it&#x27;s time for our family to expand again! We have a number of exciting, industry shifting technology solutions that we are bringing to market, and we are looking for the right software developers to add to our existing team to make it happen.<p>We are looking for both those with serious development experience and those with less experience, but with the drive to learn quickly and see your hard work in the hands of our clients.<p>- QA Engineer<p>- Developer - MEAN Stack<p>- Junior Developer - MEAN Stack<p>- Developer - C#.net<p>- Front End Developer &amp; Designer<p>Learn more — <a href=\"https:&#x2F;&#x2F;docs.google.com&#x2F;document&#x2F;d&#x2F;1d13G_sVabdqb_cJtNJinX8bC62u1KuVrXskSLSaM_IU&#x2F;edit?usp=sharing\" rel=\"nofollow\">https:&#x2F;&#x2F;docs.google.com&#x2F;document&#x2F;d&#x2F;1d13G_sVabdqb_cJtNJinX8bC...</a><p>Apply here — <a href=\"https:&#x2F;&#x2F;4patientcare.typeform.com&#x2F;to&#x2F;nMQhvv\" rel=\"nofollow\">https:&#x2F;&#x2F;4patientcare.typeform.com&#x2F;to&#x2F;nMQhvv</a>","time":1525189279,"type":"comment"}