{"by":"Domenic_S","id":16969463,"parent":16967543,"text":"PayPal | Senior Fullstack Javascript Developer | Full-time | Onsite - San Jose, CA<p>Stack: Node&#x2F;React<p>I lead a couple teams at PayPal that are working on next-generation merchant solutions. We build things that don&#x27;t exist yet in PayPal, and sometimes don&#x27;t exist in the market. We move quickly and work with modern technology to create brand-new products seen and used by millions of people worldwide.<p>This is not a KTLO job in a forgotten corner. We don&#x27;t drop specs from an ivory tower. I&#x27;m looking for someone who doesn&#x27;t just want to code, but wants to shape the vision of the products we build. Developers on this team have a voice -- we work in a &quot;3-in-a-box&quot; model (Design&#x2F;Product&#x2F;Tech) and develop well-rounded product experiences together.<p>Many of us in the team come from startups and we use those lessons to inform our jobs. For example, we have no QA department -- developers test, release and monitor their own code. We keep the team in sync with daily stand-ups and have regular retrospectives to discuss things that are going well and opportunities for improvements. We value unique perspectives brought by diverse backgrounds and experiences.<p>In addition to interesting and challenging work, we offer world-class benefits like untracked vacation, a full gym with fitness classes, and top-notch medical insurance. Our campus is vibrant and comfortable, and includes beach volleyball and tennis courts and a brand-new outdoor café serving beer &amp; wine around a cozy firepit.<p>We&#x27;ve got an incredible JS and open source community at PayPal. See private talks from industry leaders such as Douglas Crockford and Kent C. Dodds, or even share a stage if presenting is more your thing!<p>Read more here: <a href=\"https:&#x2F;&#x2F;rolp.co&#x2F;oCHQd\" rel=\"nofollow\">https:&#x2F;&#x2F;rolp.co&#x2F;oCHQd</a> or email me directly if you want to informally chat about how you might fit: dosantangelo@paypal.com (mention HN in the subject line).","time":1525197254,"type":"comment"}