{"by":"alasano","id":16968574,"parent":16967543,"text":"Coveo | Security Analyst | Montreal &amp; Quebec City, Canada | Full-time, ONSITE<p>Are you fearless ? Come be a part of a growing security team with a real challenge: ensuring that our products are 100% safe for our clients all over the world. In other words, making sure that neither our internal nor Cloud environments can be disturbed by external dangers.\nAs a security analyst, you will participate in 4 important processes: designing, implementing, supporting and maintaining policies and security solutions.<p>In collaboration with your colleagues you will:<p>* Help the development team translate security requirements into feature sets;<p>* Implement and maintain the ISMS, the GRC tools and the security policies, processes and procedures;<p>* Provide support with third party security risk assessments and audits to maintain our hard-earned certifications;<p>* Support the development, documentation, training and user guidance to ensure consistent and effective implementation of policies and procedures;<p>* Explain and warn others about the risk of an exploit in technical terms.<p>And the best part is...<p>* Testing security products and systems to detect security weaknesses;<p>* Researching potential threats;<p>* Analyzing results of penetration tests and vulnerability scans;<p>* Configuring and validating secure systems and physical controls;<p>* Developing metrics and reports on the efficiency of security measures and suggesting recommendations;<p>* Developing and recommending integrated security systems and physical control solutions that will ensure that proprietary&#x2F;confidential data and systems are protected;<p>While we offer all the perks people come to expect of a job (great new offices, top of the line equipment, competitive salaries and insurance, unlimited cappucinos and snacks, nerf gun battles), we think the best part about working with us is simply being excited about going to work every day. On a day to day basis you&#x27;ll continually face interesting challenges, have great autonomy and you&#x27;ll be able to bring your ideas to the table knowing that your team genuinely wants to hear them.<p>Coveo is positioned as the top leader for Insight Engines in Gartner&#x27;s 2017 Magic Quadrant (<a href=\"http:&#x2F;&#x2F;blog.coveo.com&#x2F;coveo-leads-gartner-magic-quadrant-for-insight-engines&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.coveo.com&#x2F;coveo-leads-gartner-magic-quadrant-for...</a>). We&#x27;re growing quickly and hiring talented, passionate developers to join our worldclass team. Our Montreal offices are brand new (<a href=\"http:&#x2F;&#x2F;blog.coveo.com&#x2F;coveo-montreal-finally-home&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.coveo.com&#x2F;coveo-montreal-finally-home&#x2F;</a>) and we&#x27;ve also rebuilt our entire Quebec City office to accomodate all our new hires in a great environment.<p>Interview Process: phone screen - interview - tech test - offer.<p>To get in touch : aasanovic@coveo.com","time":1525192220,"type":"comment"}