{"by":"dmangot","id":16968222,"parent":16967543,"text":"SolarWinds Cloud | Site Reliability Engineers (SRE) | VAN, ATX, BOS, RTP, SLC | ONSITE<p><a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2z4qmId\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2z4qmId</a>\nFor more information, email dmangot[at]solarwinds[dot]cloud with the subject line [Hacker News SRE]<p>Metrics, monitoring, observability.  You live and breathe it every day.  Now you want to take it to the next level and work on a product that does the same.  The SolarWinds Cloud teams are looking for SREs to help build, improve, and manage our high performance stream processing pipelinse.  This is truly one of those jobs where you and your developer&#x2F;ops friends can use the tool you operate every single day.<p>The Cloud teams (Loggly, Papertrail, AppOptics, Pingdom) stack is largely Ruby, Java, Kafka, Python, Elasticsearch, Clickhouse, and Cassandra, processing millions of metrics, logs, and traces every second.  The SRE team uses a mix of Terraform, Packer, Python, Vagrant, and SaltStack to run our 100% AWS platform.  This is your opportunity to join a talented SRE team at a company that is constantly growing (7 acquisitions in 4 years).  Plus, with the backing of SolarWinds behind it, there are no worries about running out of VC funding, or where the next round is coming from.   We&#x27;re a distributed team where everyone writes code, building for now and the future and we&#x27;re looking for the next piece of the puzzle to collaborate in creating that future.<p>If this sounds interesting to you, we&#x27;d love to open up a conversation about whether we&#x27;re a good match, setup some interviews and a coding test. You can find the contact info above.<p>About the company:\nThe SolarWinds Cloud companies are a collection of tools that can be used together or independently to give best of breed monitoring to cloud, hybrid, and on premise installations.  Offering metrics, traces, and events, the products cover all aspects of the observability triad.   Having been grown through acquisition, each product has a high throughput stream processing pipeline that serves thousands of customers.","time":1525190520,"type":"comment"}