{"by":"brikelly","id":16967908,"parent":16967543,"text":"CyberArk (Conjur team) | Front End &#x2F; Backend &#x2F; DevOps &#x2F; Security | REMOTE (OR ONSITE NEWTON, MA) | FULL-TIME<p>The CyberArk Conjur team helps people write super reliable software that&#x27;s hard to hack. We&#x27;re building tools that make the best security practices convenient for developers, ops, and security teams. We&#x27;re hiring engineering managers, product owners, and of course, engineers.<p>ABOUT US<p>We&#x27;re a fast-growing team, thanks to the increasing success of our product: the Conjur appliance secures the entire software development and deployment lifecycle for companies who want to ship features as fast as possible without increasing their risk of security breaches.<p>We are looking for experienced software engineers to join our team. Conjur engineers work on a wide variety of projects, from integrations with some of today&#x27;s most popular DevOps tools to moonshot projects that seek to revolutionize the way engineering teams factor in security when deploying applications.<p>We know that if you&#x27;re a professional engineer, experience with specific tools or languages can usually be picked up quickly. That being said, Conjur engineers are using the following tools on a more-or-less daily basis:<p>* Ruby, Rails, Golang, Postgres, and JS<p>* Docker, Git, and Jenkins<p>* Kubernetes, OpenShift, Cloud Foundry<p>* Puppet, Chef, Ansible<p>FOR MORE INFORMATION<p><a href=\"https:&#x2F;&#x2F;conjur.org\" rel=\"nofollow\">https:&#x2F;&#x2F;conjur.org</a> (our secret service, AGPLv3) <a href=\"https:&#x2F;&#x2F;www.conjur.org&#x2F;careers&#x2F;engineering.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.conjur.org&#x2F;careers&#x2F;engineering.html</a> (about our team, and our DevOps puzzle!) <a href=\"https:&#x2F;&#x2F;conjur.org&#x2F;blog\" rel=\"nofollow\">https:&#x2F;&#x2F;conjur.org&#x2F;blog</a>  (our blog, which talks more about who we are and what we do)","time":1525188897,"type":"comment"}