{"by":"LyalinDotCom","id":16968735,"parent":16967543,"text":"Microsoft | Product Marketing Manager (PMM, technical) | Redmond, WA | Full-time | ONSITE | <a href=\"https:&#x2F;&#x2F;careers.microsoft.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.microsoft.com&#x2F;</a><p>These are the jobs for teams supporting cutting edge work our product teams are doing around Azure (cloud), DevOps tools&#x2F;services for developers, AI and more. Our PMM&#x27;s that focus on developer topics are all expected to be very technical. So while they don&#x27;t write code for a living, they do work in coordination with product teams daily to build product strategy, help products go to market and get to do many creative things (training programs, partnerships, developer video content, etc).<p>All these jobs are also considered senior level as you&#x27;d be working with engineering and marketing leadership on a regular basis. Its a dream job for anyone who is willing not to write code at their day job but make huge impact that effects millions of developers daily. I have been doing this job for 5 years, more then any other in my 19 year career and can answer any questions.<p>(Disclaimer these are NOT &quot;PM&quot; jobs in engineering, these are the counterparts in technical marketing. but We have a TON of PM jobs open too, just search our career site linked above)<p>Current PMM Openings:<p>(1) Sr. Product Marketing Manager – AI developer tools, DM me if interested on Twitter @lyalindotcom (we&#x27;re posting this soon)<p>(2) Sr. Product Marketing Manager - Bot frameworks and services on Azure as part of Cognitive Services, DM me if interested on Twitter @lyalindotcom (we&#x27;re posting this soon)<p>(3) Product Marketing Manager - DevOps (VSTS, App Center &amp; Azure OSS DevOps integration), apply: <a href=\"https:&#x2F;&#x2F;t.co&#x2F;WIFDIOehP2\" rel=\"nofollow\">https:&#x2F;&#x2F;t.co&#x2F;WIFDIOehP2</a><p>(4) Sr. Product Marketing Manager - Container Technology for devs, apply: <a href=\"https:&#x2F;&#x2F;t.co&#x2F;ATX9OrRTJP\" rel=\"nofollow\">https:&#x2F;&#x2F;t.co&#x2F;ATX9OrRTJP</a>","time":1525193183,"type":"comment"}