{"by":"JerryH","id":16969546,"parent":16967543,"text":"ONSITE, Vancouver, BC. Frontend dev in esports.<p><a href=\"http:&#x2F;&#x2F;www.askottentertainment.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.askottentertainment.com</a> - creates award winning products for the entertainment and regulated gaming space.<p>One of our products is ESP, the largest esports fantasy site and an all-in-one portal for esports betting, fantasy leagues and casino-style games.<p>--- Why you should join us ---<p>Enjoy your work, enjoy your life:<p>We offer all our employees competitive salaries, flexible work schedules, regular remote working, a generous flexible vacation policy and a comprehensive benefits plan.<p>Building the future:<p>The esports space is growing exponentially, and it&#x27;s exciting to be building products as new territory emerges.<p>The Role Implement new features and enhance the user experience using our React (ES6+), Angular  (TypeScript), and LESS CSS dev stack Ensure code quality through unit testing, proper tooling, and peer code review Push code and see it go live the same week.<p>- You love to ship things You have a passion for technology and the desire to champion ideas and share your knowledge \n - You take pride in your work and have an appreciation for the user experience \n - You are receptive to feedback and are excited to learn and share with your colleagues \n - You have the ability to learn new technologies quickly \n - You are comfortable working independently in a small team \n - Skills and qualifications Ideally 2+ years of industry experience \n - Experience with React (ES6+), Angular (TypeScript), CSS preprocessors \n - Experience with git or similar VCS Experience using secure, RESTful web APIs Experience using Node.js and NPM \n - Experience with Grunt, Webpack, and front-end build tooling in general<p>You can email your resume, link to your GitHub, and any other relevant information to gimmeajob@askottentertainment.com.","time":1525197583,"type":"comment"}