{"by":"fortysixpercent","id":16967625,"kids":[16969732],"parent":16967543,"text":"Replicated | Director of Engineering, Solutions Architect, Sales Engineer | $100k - $210k + equity | Los Angeles ONSITE| <a href=\"https:&#x2F;&#x2F;www.replicated.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.replicated.com</a><p>At Replicated we are helping software vendors be enterprise ready, and deploy their applications to any environment.<p>We are looking for a few roles to help scale our organization and work with our customers to help them evaluate the product and be successful after the sale.<p>The Director of Engineering will be leading the engineering team, helping drive the product roadmap, manage a talented team of experienced engineers and lead recruiting as we grow. In addition to having been a manager in a technical organization, experience with DevOps, knowledge of tools we are working with like Docker and Kubernetes, and a strong programming background are big plusses.<p>This role will exclusively be onsite at our office in Culver City, CA.<p>We are also building on the sales and customer side.<p>As a Solutions Architect you will be working with customers to ensure they have all the tools to deploy to customers. You’ll be working with Linux system automation, Docker, various schedulers, and a lot of other technologies.<p>This role will be onsite in our office.<p>The Sales Engineer position will involve working with customers as they evaluate and do an initial deployment of Replicated. You’ll be working closely with our Director of Sales to help customers validate our solutions. The buyer is highly technical so in this role you will often be handling sophisticated questions and customers looking to deeply understand our product.<p>Onsite is preferred, candidates in the Bay Area will also be considered.<p>If you are interested please email austin (at) replicated (dot) com<p>Or check out <a href=\"https:&#x2F;&#x2F;www.replicated.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.replicated.com&#x2F;careers&#x2F;</a>","time":1525187323,"type":"comment"}