{"by":"navd","id":16968598,"parent":16967543,"text":"Ardan Labs | Mid - Senior Software Engineer | Miami, FL | Full Time | REMOTE | ONSITE | <a href=\"https:&#x2F;&#x2F;www.ardanlabs.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ardanlabs.com&#x2F;</a><p>Ardan Labs is a high performance software development firm that builds and delivers reliable solutions and applications. We&#x27;re looking for several Mid-level and Senior Backend Engineers to help us develop solutions for our clients.<p>This is a great opportunity to be part of a culture of caring, cooperation, reliability and growth. We are based in Miami, Florida, but our team is spread across North America. Some roles may be location dependent, but we welcome remote work.<p>Ideally you are a responsible, self-motivated individual that is looking to work with the latest technology and create uncompromising user experiences.<p>Responsibilities:<p>Design and build REST&#x2F;gRPC APIs with speed and reliability in mind.\nDesign and use SQL and NoSQL databases to support both relational and nonrelational performance and storage requirements.\nWrite tests.\nDocument web services for public consumption.\nImplement proper instrumentation and logging.\nLeverage Kubernetes&#x2F;Docker to deploy and manage a scalable infrastructure across multiple geographical regions.\nRespond to system level issues as necessary to provide the best overall customer experience.<p>Qualifications:<p>Minimum 2+ years of professional experience developing REST based web services.\nExperience developing in more than one backend language preferrably Go, C&#x2F;C++, Java, Ruby, Python, Node.js, etc.\nExperience with the Linux operating system and the Bash shell.\nAbility to communicate and articulate architecture decisions and the reasons behind them.<p>Nice to Haves:<p>Experience with Go, Postgres, Message Queuing, Websockets&#x2F;Server Sent Events highly desired.\nExperience working on a highly scalable platform.\nFamiliarity with Asynchronous communication protocols.\nExperience using Docker for development and deployment to production environments\nExperience supporting&#x2F;developing mobile platforms.<p>We have a straightforward interview process. So no surprises there!<p>If you&#x27;re interested, feel free to email us with your resume at careers @ ardanlabs.com or apply on our website: <a href=\"https:&#x2F;&#x2F;www.ardanlabs.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ardanlabs.com&#x2F;careers</a>","time":1525192366,"type":"comment"}