{"by":"hgrimmett","id":16967551,"parent":16967543,"text":"Blue Vision Labs | London, United Kingdom | Onsite, Visa, <a href=\"http:&#x2F;&#x2F;www.bluevisionlabs.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bluevisionlabs.com&#x2F;</a><p>A collaborative Augmented Reality (AR) company that is enabling the next-generation of AR and robotics. Funded by Google Ventures, Accel, Horizon Ventures, SV Angel and others, we spent two years developing city-scale AR Cloud technology. Our mission is to empower developers to revolutionise how people interact with technology, their environment, and each other.<p>Our team comprises experienced engineers, accomplished entrepreneurs, and PhDs from top universities. We offer a friendly and dynamic atmosphere where everyone learns, grows and contributes to our core product.<p>We are seeking ambitious women and men with industry experience to join our team:<p><pre><code>  Field engineer (San Francisco)\n  Field engineer (London)\n  Research engineers   | Computer Vision (+internships)\n  Research scientist   | Computer Vision\n  Account Manager      | Technical\n  Software engineer    | iOS Developer\n  Software engineer    | Android Developer\n  Software engineer    | Mathematical Optimisation\n  Software engineer    | Backend, Data, Pipeline (+internships)\n  Finance Officer\n</code></pre>\nWe offer:<p><pre><code>  A competitive salary\n  Pension scheme\n  Unlimited holiday (we promote a healthy life balance!)\n  Autonomy to make business-critical decisions and propose impactful solutions\n  A working atmosphere that values equality and diversity, knowledge-sharing and personal development\n  A knowledgeable team with extensive domain expertise - some of the brightest minds in the continent\n  A beautiful working space in bustling central London, near the famous Old Spitalfields Market\n  Breakfast, lunch, and dinner\n  Coffee reimbursements (including Starbucks!)\n  Spa breaks\n  Health and wellness plan (e.g. swimming, yoga, pilates, gym, music lessons)\n  A social team atmosphere and weekly activities.</code></pre>","time":1525186943,"type":"comment"}