{"by":"erinl","id":16970211,"parent":16967543,"text":"Symetria | Business Intelligence Manager | Vancouver, Canada | Full-time | ONSITE | <a href=\"https:&#x2F;&#x2F;symetria.io\" rel=\"nofollow\">https:&#x2F;&#x2F;symetria.io</a><p>Symetria is an upcoming fully-funded cryptocurrency exchange &amp; wallet based out of Vancouver, Canada. We are currently in development and planning a token launch this summer with product release later this year. We are a centralized exchange however we are introducing an element of decentralization through Personal Blockchains. These are private blockchains between us and each user which provide immutable proof of action and can be made public should anything go wrong. This enables us to bring the speed and privacy of a centralized exchange with the fairness of decentralization. We also have a beautiful and intuitive UX and a ton of features to improve user experience.<p>We are looking for high energy Business Intelligence Manager to join our team. This person should be comfortable in a start-up environment and able to work with minimal direction. This is a growth position with the potential to build your own team as we grow.<p>Our ideal candidate should have experience with: \n- Pulling data from structured and unstructured sources, such as:\n     - SQL Databases\n     - Azure Event Hubs &amp; Streaming Analytics\n     - Cosmos DB Tables\n- Presenting the collected data in reports for less technical consumers<p>Benefits&#x2F;Office:\n- highly competitive wages\n- signing bonus\n- free gym membership\n- located in the Harbour Centre, minutes from Waterfront Station\n- bright and airy office\n- full-kitchen with beverages and plenty of snacks (and homemade cookies!)\n- standing desk\n- fun and close-knit team<p>If this sounds exciting and you think you&#x27;d be a good fit, please send your resume and a quick message to Erin at jobs@symetria.io. Make sure to prefix your subject with [Business Intelligence Manager].","time":1525200967,"type":"comment"}