{"by":"khalilravanna","id":16971014,"parent":16967543,"text":"The Predictive Index | UI Designer | Westwood, MA | ONSITE<p>Company:<p>The Predictive Index (PI) is an award-winning workforce assessment platform. 60 years of proven science, assessment software, and our curriculum of management workshops make PI the perfect option for any company looking to assess, predict, and better manage their people anywhere in the world. Over 6,000 clients use PI to define behavioral and cognitive job requirements, hire the best-fitting candidates, and keep them engaged. AT&amp;T, DocuSign, the LA Clippers, Hugo Boss, and Subway are just a few of our notable clients.<p>Who you are:<p>A graphic designer specializing in interactive design and flow.  Consistent goals, but able to adapt to new feedback. Cares about the little things that make MVP into MLP (M-Lovable-P).<p>Appreciates and understands UX research, but isn&#x27;t primarily focused on it.  May not possess any coding skills at all, but does understand enough about how things are made that designs are practical&#x2F;feasible and not just pretty.<p>An arbiter of preferences. This role is going to hear feedback from Brand design, UX, Product, and Developers. They need to hear all of these things, digest them, and come to a wise decision they believe in.<p>What you&#x27;ll be building:<p>We recently listened to our customers in a big way and redesigned our entire software experience. We wanted our customer voice to be the loudest, so we completed this re-design of the software quickly so we could put it out there and iterate on it live as we collected a ton of feedback. We are over the bulk of that initial redesign and are looking for a world-class UI designer to come in and truly take our design to the next level.<p>There&#x27;s a lot of opportunity here as we have a vastly used product with a lot of functionality that really needs a visionary to unlock its true potential. Both in terms of visual appeal but also in exposing the latent functionality in a usable manner so that people get the real value out of the product that they&#x27;re paying for!<p>Apply:<p>If interested please apply here and include your resume and portfolio (must-have):\n<a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;g7yy88hu2\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;g7yy88hu2</a><p>If you like you can also hit me up on LinkedIn directly. Please include &quot;Hacker News&quot; in your message so I don&#x27;t ignore your message from all the recruiter spam :)<p>www.linkedin.com&#x2F;in&#x2F;stefan-valentin<p>ALSO HIRING:<p>We are also going to be spinning up a new engineering team so we will be hiring engineers as well! This will be working on a new greenfield product that doesn&#x27;t event exist today! We&#x27;re looking for mid level + engineers and a potential lead position in the future depending on the candidate.<p>Our current stack is .NET backend with Angular&#x2F;TypeScript on the frontend but this team may lean more towards technologies like Node&#x2F;RoR&#x2F;Whatever-theyre-comfortable-with-that-enables-them-to-iterate-quickly-and-provide-value-to-customers<p>If you&#x27;re applying for this role, message me on linkedin directly with &quot;Hacker News Engineer Role&quot; in your message!","time":1525205462,"type":"comment"}