{"by":"eslaught","id":16971694,"kids":[17022366,16973658],"parent":16967543,"text":"SLAC Computer Science Research Dept. | Software Engineer | Menlo Park, CA | Full-time, Relocation Available<p>As part of a collaboration between the Computer Science Research Dept. at SLAC and the LCLS-II project, we&#x27;re looking for a full-time engineer to help us build a high-performance monitoring system that will be used every single day once the machine comes up. This is a mission-critical system. The monitoring system will ingest between 100s of GB&#x2F;s to 1 TB&#x2F;s of data and be responsible for rendering it to the user in a way that will enable the science users to drive their experiments. Performance is obviously a goal here, but so are maintainability and extensibility. Building a system with low technical debt is a must for this project.<p>That project will be about 50% of your time; the other 50% will be more flexible and may involve engineering work on the next-generation runtime system Legion, which is a major project within our group. (<a href=\"http:&#x2F;&#x2F;legion.stanford.edu&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;legion.stanford.edu&#x2F;</a>)<p>Everything we do is open source.<p>We expect the monitoring system to be built primarily in Python and C++ on Linux using some combination of UI technologies (Qt), fault-tolerant storage technologies (Redis), high-performance compute (MPI or Legion), and high-performance networking (to interface with the data acquisition system).<p>For more information about the department, see:<p><a href=\"https:&#x2F;&#x2F;www6.slac.stanford.edu&#x2F;news&#x2F;2016-05-26-slac%E2%80%99s-new-computer-science-division-teams-stanford-tackle-data-onslaught.aspx\" rel=\"nofollow\">https:&#x2F;&#x2F;www6.slac.stanford.edu&#x2F;news&#x2F;2016-05-26-slac%E2%80%99...</a><p>For more information on LCLS-II, see:<p><a href=\"https:&#x2F;&#x2F;portal.slac.stanford.edu&#x2F;sites&#x2F;lcls_public&#x2F;lcls_ii&#x2F;Pages&#x2F;default.aspx\" rel=\"nofollow\">https:&#x2F;&#x2F;portal.slac.stanford.edu&#x2F;sites&#x2F;lcls_public&#x2F;lcls_ii&#x2F;P...</a><p>We&#x27;re working to put the official job ad out now. Please contact eslaught@slac.stanford.edu if you are interested (subject line &quot;AMI Project&quot;) and I will forward the link when it is ready.","time":1525209101,"type":"comment"}