{"by":"alexbellunity3d","id":16977013,"parent":16967543,"text":"Company: Unity Technologies [<a href=\"https:&#x2F;&#x2F;unity3d.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;unity3d.com&#x2F;</a>]<p>Location: Worldwide (Main Engineering - San Francisco US, Bellevue US, Copenhagen Denmark, Helsinki Finland) \nType: : Full-Time and Contract roles. ONSITE, REMOTE, VISA, INTERNS.<p>All open roles [<a href=\"https:&#x2F;&#x2F;careers.unity.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.unity.com&#x2F;</a>]<p>Description: Unity Technologies builds and maintains Unity, the world&#x27;s best content creation platform. Used to develop games, VR &amp; AR applications on a staggering range of platforms; Unity is also fast becoming a number one choice for video production, automotive vehicle design, photogrammetry and just about anything you can visualise in 3D, and 2D. Unity applications and software reaches 1.2 Billion people a month - a number that continues to grow, as we offer more and more features to Developers such as Machine Learning, an unparalleled Analytics platform and our Asset Store.<p>We are growing, and require senior Developers to help us maintain and enhance our Engine, improve our Monetization &amp; Machine Learning products, and improve performance and optimaztion of Unity on Hardware Platforms.<p>We have a flat, non-hierarchical working environment and put a huge emphasis on work-life balance. Our core principles are Democratising Game Development, Solving Hard Problems and Enabling Success for Developers. We&#x27;ve never waived in our mission to make Unity a globally accessible tool, that can empower creators to make the content they want to share with the world.<p>We offer stock options, comprehensive benefits, catering in offices and above market pay grades. We also run global events such as Unite, and regularly bring teams out to Industry events such as GDC. Every year our Dev teams get together for a spectacular Hackweek in Copenhagen<p>Visa Sponsorship in certain territories, where possible.<p>Technologies: C++, C#, Golang, Node.js, ReactJS, NATS, Kafka, Docker, Terraform, Kubernetes, Redis, Cassandra, Drupal, Major Graphics APIs (Metal, Vulkan, OpenGL).","time":1525270203,"type":"comment"}