{"by":"sjanaway","id":16975339,"parent":16967543,"text":"Bloom &amp; Wild | Multiple Roles | London, UK | Onsite | Full Time<p>We’re Bloom &amp; Wild, the UK’s most loved online florist. We&#x27;re using technology to create the UK&#x27;s fastest growing flower and gifting company, with cutting edge tech work on user level personalisation in particular. With the leading app and website in the flower industry our customers can explore our carefully curated range and checkout in seconds anywhere.<p>We’re hard-working with a relaxed culture, supportive of flexible working, with a strong and collaborative vibe. We use the best bits of agile with a real focus on learning, code reviews and plenty of chances to pair up and solve problems.<p>We&#x27;re looking to fill four different positions in our tech team<p>1. Principal Developer<p>o A deep Ruby specialist with a significant background setting technical direction, training and mentoring teams, and setting an example around code craft and quality<p>o Good understanding of front end frameworks and preferably also DevOps<p>o A great opportunity to apply technical leadership across a rapidly growing company<p>2. Front–End Developer (Angular)<p>o Work in one of our full stack teams, and closely with our other FE developers<p>o We are about to migrate our single page AngularJS application over to Angular (6) so it&#x27;s a great time to get involved in a brand new codebase<p>3. Test Lead<p>o Our first Tester to join the team, with a mix of manual and automated testing experience, gained in an Agile environment<p>o Helping define how we test at B&amp;W and rolling out quality processes across the organisation<p>4. Senior Ruby Developer<p>o A strong Ruby on Rails developer who has experience in similar industries - eCom, fast growth, operations focused business<p>o Strong people&#x2F;mentoring skills but stronger Ruby skills<p>If any of these roles are of interest then full job descriptions and much more information about us is on our careers site: <a href=\"https:&#x2F;&#x2F;www.bloomandwild.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bloomandwild.com&#x2F;careers</a>","time":1525253744,"type":"comment"}