{"by":"thejash","id":16970772,"parent":16967543,"text":"Sourceress | Senior Engineer | San Francisco | Full-time | Onsite | <a href=\"https:&#x2F;&#x2F;www.sourceress.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sourceress.com&#x2F;jobs</a><p>We pay for coaching for all employees. We want you to grow into a great engineer (or great engineering leader).<p>We strongly value personal growth, and help people join organizations where they will grow and learn. We&#x27;re a (human-assisted) AI sourcing platform that delivers great results (customer quote: &quot;I&#x27;d have a panic attack if you guys stopped existing&quot;). We worth with some of the most exciting companies in tech, focusing on diversity and finding overlooked candidates<p>Qualifications:<p>- Are you empathetic, driven, and intellectually curious? See our values here [1]<p>- Do you understand the value of shipping quickly and of software craftsmanship, and have the judgment to know when to apply each?<p>- Do you enjoy collaborating with other developers and helping them grow?<p>Stack:<p>Python (Django, nltk), AWS PostgreSQL, Javascript (React)<p>About:<p>We raised $3.5M from OpenAI researchers and Lightspeed [2] at one of the highest ever valuations coming out of YC. Our team has previously sold companies, published machine learning research, and has the former Chief of Staff at Dropbox, and previously worked at Google, Airbnb, McKinsey, etc<p>We have machine learning problems that are core to our product, data infrastructure and scaling problems to tackle, and interesting product work as well.<p>To Apply:<p>email me at josh@sourceress.com<p>[1] <a href=\"https:&#x2F;&#x2F;www.sourceress.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sourceress.com&#x2F;jobs</a><p>[2] <a href=\"https:&#x2F;&#x2F;techcrunch.com&#x2F;2017&#x2F;11&#x2F;07&#x2F;sourceress-raises-3-5m-to-find-candidates-that-managers-want-without-realizing-it&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;techcrunch.com&#x2F;2017&#x2F;11&#x2F;07&#x2F;sourceress-raises-3-5m-to-...</a>","time":1525204096,"type":"comment"}