{"by":"vldr","id":16971327,"kids":[17047607],"parent":16967543,"text":"GUTS Tickets | Product owner, project manager, QAS tester | Amsterdam, The Netherlands | ONSITE €45k-€70k p.a. depending on experience, part-time&#x2F;full-time, ESOP&#x2F;token plan available.<p>GUTS Tickets is searching people to fill several less technical (non development) roles.<p>GUTS Tickets is a ticketing platform &amp; service that puts an end to disgraceful secondary ticket prices and ticket fraud. We&#x27;re currently a small team of committed entrepreneurs, designers, developers, a lawyer and a dog.<p>We have a working product, paying customers and we&#x27;re already helping tens of thousands of fans not overpaying for tickets or buying fake tickets.<p>Ourtech-stack:<p>Backend: Python &#x2F; Django &#x2F; REST API, Golang<p>Blockchain: Ethereum &#x2F; Solidity &#x2F; Cryptocurrencies<p>Frontend: Vue.js &#x2F; Ember.js &#x2F; React Native<p>We&#x27;re looking for anyone who does &amp; loves any of the roles:<p>- Product Owner<p>- Project Manager<p>- QA (Quality Assurance) Software Tester - IOS&#x2F;Android&#x2F;Web<p>Overlapping skills and experience with software development &#x2F; IT processes in general are considered a plus.<p>We tend to work Agile: Scrum &#x2F; Kanban, and create our workflow based on the team (members) instead of forcing it on you. We don’t work to punch out a time card, we work hard to give fans what they deserve.<p>Competitive salary based on experience: part-time or full-time is negotiable. Employee-based conference, hardware and training budget is available.<p>We&#x27;re located at the top floor of Pakhuis de Zwijger, in Amsterdam with a beautiful view over the water and inner city.<p>Perks: PS4 Pro and 4K TV gaming-battles, ping-pong tournaments, Friday-afternoon drinks on roof terrace , committed team-members from all over the world (all on-site), meetups &amp; lightning talks, access to &quot;fill in whatever you want&quot; events &amp; conferences.<p>Got GUTS? Join our team and send your CV to jobs (at) guts.tickets (soliciting is NOT appreciated) or check <a href=\"https:&#x2F;&#x2F;guts.tickets&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;guts.tickets&#x2F;jobs</a> and <a href=\"https:&#x2F;&#x2F;guts.tickets\" rel=\"nofollow\">https:&#x2F;&#x2F;guts.tickets</a> for more info.","time":1525207154,"type":"comment"}