{"by":"kookster","id":16971921,"parent":16967543,"text":"PRX | <a href=\"https:&#x2F;&#x2F;www.prx.org\" rel=\"nofollow\">https:&#x2F;&#x2F;www.prx.org</a> | Software Engineer | Full-time | Cambridge, MA or REMOTE<p><a href=\"https:&#x2F;&#x2F;prx.workable.com&#x2F;j&#x2F;43FACFCD68\" rel=\"nofollow\">https:&#x2F;&#x2F;prx.workable.com&#x2F;j&#x2F;43FACFCD68</a><p>PRX is shaping the future of audio by building technology, training talented producers and connecting them with supportive listeners.<p>We work with some of the biggest and best podcasts and public radio shows: The Moth, This American Life, TED Talks, Serial, and our Radiotopia network (<a href=\"https:&#x2F;&#x2F;radiotopia.fm\" rel=\"nofollow\">https:&#x2F;&#x2F;radiotopia.fm</a>) with all-stars like 99% Invisible, and Criminal.<p>Join us in building things people love.<p>We help podcasters and public radio producers grow audience and make money. The PRX team builds publishing, marketing, analytics, and distribution tools that connect producers to listeners, buyers, fans, and funders.<p>If you check out our public GitHub repositories, you’ll see our projects, team members, technologies and how we work: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;PRX\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;PRX</a>. (If you find something that could be improved or fixed, please send us a pull request.)<p>We believe in open source, and share as much as possible. We follow proven practices of quality software development: PRs for contributions, requiring tests, code reviews, style and coverage checking, continuous integration and deployment, infrastructure as code, and documentation where readable code and tests aren&#x27;t enough.<p>Stack: Our applications are primarily Ruby on Rails, Angular, Node.js, and Elixir deployed to AWS using Docker. We make extensive use of a range of AWS services.<p><a href=\"https:&#x2F;&#x2F;prx.workable.com&#x2F;j&#x2F;43FACFCD68\" rel=\"nofollow\">https:&#x2F;&#x2F;prx.workable.com&#x2F;j&#x2F;43FACFCD68</a>","time":1525210507,"type":"comment"}