{"by":"nazeer_ahmed","id":16974198,"parent":16967543,"text":"Delixus | Bangalore, India | onsite | Principal and Senior Software Engineers | Rs. 20 to 39 lakh<p><pre><code>  1.) Principal Software Engineer | Rs. 30 to 39 lakhs | 6+ years of experience\n</code></pre>\nDelixus is hiring several Principal Software Engineers. You will lead the development of API integrations and create a scalable data pipeline using a microservices architecture, Kafka, Java and&#x2F;or Kotlin, and AWS Aurora (PostgreSQL). This is an exciting role with substantial growth opportunities. In your role as a Principal Software Engineer, you are able to turn business requirements into detailed technical designs. You are able to identify multiple solutions for each business requirement and make rational tradeoffs based on the customer&#x27;s needs. You write clean, tested code.\n\f<p><pre><code>  2.) Senior Software Engineer | Rs. 20 to 30 lakhs | 5+ years of experience\n\n</code></pre>\nDelixus is hiring several Senior Software Engineers. You will develop API integrations and create a scalable data pipeline using a microservices architecture, Kafka, Java and&#x2F;or Kotlin, and AWS Aurora (PostgreSQL). This is an exciting role with substantial growth opportunities.<p><pre><code>  # Common skills (applies to both Principal SWE and Senior SWE)\n  - Proven experience with Java 8 or higher (or another JVM language)\n  - Experience developing microservices that expose and consume REST APIs to receive&#x2F;send JSON\n  - Experience with DevOps, test automation and CI&#x2F;CD\n  - Must be comfortable writing tested code using automated tests (such as JUnit or similar)\n  - ElasticSearch and PostgreSQL including advanced SQL and schema design\n  - Cloud native development (AWS, Azure or GCP)\n  - Strong written and verbal communication skills\n  - Experience with the Cyber Security industry a significant plus\n\n  # Our stack\n  - Kotlin, Groovy, Java\n  - AWS Aurora (PostgreSQL) &#x2F; SQL\n  - ElasticSearch\n  - Kafka\n  - Jira, Confluence and Bitbucket (Git)\n  - Kubernetes\n</code></pre>\nEmail hn@delixus.com with your cv.","time":1525237583,"type":"comment"}