{"by":"kobigurk","id":16971389,"parent":16967543,"text":"QED-it | Software Engineer - Protocol | Tel Aviv | ONSITE<p>QED-it, a funded Tel-Aviv based startup, is looking for experienced software engineers to join its core team. We are tackling the hardest and most interesting problems in the Blockchain space - solving the consensus&#x2F;privacy paradox, using zero-knowledge-proofs. ZKP is a new technology, that up until recently was solely explored in academia.<p>We are funded by smart money from top tier angels, and have assembled a team of experts in cryptography, computer science, security and distributed systems. We’re at the heart of the private Blockchain industry. The founders built and sold successful businesses in the space, and are focusing on privacy as the key to Blockchain deployment, impacting industries from banking to aerospace.<p>QED-it is building a unique product combining cutting-edge technology, design and implementation of cryptographic protocols and user&#x2F;developer-facing APIs. We’re looking to expand our team with more great individuals!<p>=As a Software Engineer working on Protocol, you will:=<p>* Apply zkSNARKs and design protocols in a variety of use-cases\n* Collaborate with research scientists to implement cutting-edge cryptography efficiently\n* Develop tools to make cryptographic constructions deployable in a multitude of environments<p>=About you=<p>* You have a few years of work experience in software engineering roles, preferably with some experience in using experimental technologies, cutting-edge environments, languages and algorithms\n* Have a strong sense of long-term&#x2F;delivery trade-off\n* Looking to be a part of a product bridging multiple levels of complexity in its first stages\n* Having an academic background in advanced mathematics or equivalent knowledge is an advantage\n* Good communication skills and able to quickly adapt to new challenges when needed\n* Without using Google, you know what Q.E.D. means, possibly even 2 different meanings<p>=What you get=<p>* Competitive full-time compensation\n* A driver seat at an expanding, global technology company in an exciting, emerging industry\n* Great office location in Tel Aviv\n* Sharp, motivated peers who can’t wait to meet you :)<p>=Join QED-it!=<p>* Send an email to jobs@qed-it.com","time":1525207494,"type":"comment"}