{"by":"aaroneous","id":16970150,"parent":16967543,"text":"ShopPad | Software Developer | Oakland, CA | ONSITE | <a href=\"https:&#x2F;&#x2F;www.theshoppad.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theshoppad.com</a><p>ShopPad is the largest solution provider for Shopify&#x27;s eCommerce platform. Tens of thousands of eCommerce stores are powered by our SaaS products and are seen by millions of shoppers every day.<p>We work with exciting companies like Tesla Automotive, General Electric, Sundance Film Festival, Acer Computers, and Starwood Hotels &amp; Resorts.<p>About You: You&#x27;ll be working primarily with PHP 7, JavaScript (React), the Linux command line, and MongoDB. Familiarity with eCommerce, Shopify, 3rd-party API&#x27;s and AWS are a plus, so be sure to mention if you have a background in any of those. Experience comes in many forms and passion goes a long way, so please consider applying even if you aren&#x27;t familiar with our entire stack.<p>About The Role: As a full-stack developer, you&#x27;ll work with a close-knit team of other passionate devs to create beautiful products that operate at significant scale. Each dev is empowered to make decisions that materially affect the company&#x27;s future. This is a great place for builders, makers, and hackers who want to be part of building something great. You will own what you build, being responsible for architecture decisions and scaling your solution to meet demand.<p>Compensation includes: Competitive salary &amp; equity, medical&#x2F;dental&#x2F;vision&#x2F;commuter benefits, fully-stocked kitchen with food &amp; beverages, the latest hardware. A fun office environment filled with smart, passionate and genuinely kind people. PTO with some neat paid holidays like Valentine&#x27;s day, St. Patrick&#x27;s Day, Halloween, your birthday, etc. Flexible hours and everyone works from home once a week. ShopPad&#x27;s office is located in Oakland&#x27;s Uptown neighborhood — just a few steps from 19th Street BART station.<p>We&#x27;d love to hear from you if you&#x27;re excited about having a big influence on the software seen by millions of shoppers every day: <a href=\"https:&#x2F;&#x2F;shoppad.recruitee.com&#x2F;o&#x2F;fullstack-developer\" rel=\"nofollow\">https:&#x2F;&#x2F;shoppad.recruitee.com&#x2F;o&#x2F;fullstack-developer</a>","time":1525200656,"type":"comment"}