{"by":"jordannoone","id":16973234,"kids":[16974915],"parent":16967543,"text":"Relativity | Los Angeles, CA | Full Time | ONSITE ONLY | Engineering | <a href=\"https:&#x2F;&#x2F;relativityspace.com\" rel=\"nofollow\">https:&#x2F;&#x2F;relativityspace.com</a><p>Since forming in 2015, Relativity has built the world’s largest metal 3D printer and completed over 100 rocket engine test fires on our quest to build our own rocket constructed almost entirely of 3D printed parts. The custom-built rockets launch Earth-orbiting satellites with large payloads (i.e. a satellite the size of a small car), six times the size of its competitors’ abilities. Relativity stands apart from other launchers in the space by not just employing 3D printing as a supplemental technique, but for over 95% of major components.<p>We recently announced the close of our $35 million Series B financing in March 2018, led by Playground Global with full participation from existing Series A investors Social Capital, Y Combinator Continuity and Mark Cuban. We&#x27;re looking for a variety of roles, including Director of Additive Manufacturing and a Director of Software to expand our leadership team as we grow. These roles will include program management and technical leadership for their respective teams. All roles are onsite at our Los Angeles headquarters.<p>Additionally, there are a variety of engineering roles open on our website: <a href=\"https:&#x2F;&#x2F;www.relativityspace.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.relativityspace.com&#x2F;careers&#x2F;</a>.<p>Recent media: <a href=\"https:&#x2F;&#x2F;arstechnica.com&#x2F;science&#x2F;2018&#x2F;03&#x2F;that-3d-printed-rocket-company-just-got-35-million-in-private-financing&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;arstechnica.com&#x2F;science&#x2F;2018&#x2F;03&#x2F;that-3d-printed-rock...</a> <a href=\"https:&#x2F;&#x2F;arstechnica.com&#x2F;science&#x2F;2018&#x2F;03&#x2F;relativity-space-reveals-its-ambitions-with-big-nasa-deal&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;arstechnica.com&#x2F;science&#x2F;2018&#x2F;03&#x2F;relativity-space-rev...</a>","time":1525222989,"type":"comment"}