{"by":"finkin1","id":16995909,"parent":16967543,"text":"Stratosphere Digital | Full-stack developer | REMOTE, NYC preferred | $70k-$90k DOE | 35-hour workweek, 4 weeks&#x2F;year PTO<p>ABOUT US:<p>We’re a small, remote, full-stack digital agency that designs and develops websites, web apps, mobile apps, and other custom software for clients around the world. We understand the value of enjoying life outside of work, and think of our business as a means to create fulfilling, balanced lives. Learn more about us at <a href=\"https:&#x2F;&#x2F;stratosphere.digital\" rel=\"nofollow\">https:&#x2F;&#x2F;stratosphere.digital</a>.<p>WHAT WE&#x27;RE LOOKING FOR:<p>We’re looking for a developer to write code on a variety of custom software projects. You’d work solo as well as in tandem with our lead developer, and would also work with our lead designer to implement his designs. You’d need to be comfortable interacting with clients directly from time to time.<p>QUALIFICATIONS &amp; REQUIREMENTS:<p>* At least 5 years of software development experience<p>* Proven experience leading the development of complex software applications<p>* Ability to interact with clients and communicate with non-technical stakeholders<p>* Basic comfort with technologies listed below (does not necessarily imply extensive experience - a willingness to learn and improve is what’s most important)<p>- C# (.NET, WPF)<p>- SQL<p>- MongoDB<p>- PHP (Laravel)<p>- Node.js<p>- JavaScript&#x2F;TypeScript (Vue.js, React, Angular, ES6+)<p>- CSS3&#x2F;Sass<p>- HTML5<p>- Python (Django)<p>- Ruby (Rails)<p>- AJAX, WebSockets<p>- Mobile apps (Java, Objective-C, Swift, React Native, Cordova)<p>To apply, email your resume to contact@stratosphere.digital, with DEVJOB: [Your Name] in the subject line.<p>Full job info: <a href=\"https:&#x2F;&#x2F;docs.google.com&#x2F;document&#x2F;d&#x2F;19SJgt8cVoORbDt2Tasjgp1-nHxWaHd334O9yUDl5QCY\" rel=\"nofollow\">https:&#x2F;&#x2F;docs.google.com&#x2F;document&#x2F;d&#x2F;19SJgt8cVoORbDt2Tasjgp1-n...</a>","time":1525451756,"type":"comment"}