{"by":"raunaq_b","id":17064286,"parent":16967543,"text":"Humanising Autonomy | Computer Vision &#x2F; Deep Learning Engineer | FULL-TIME | ONSITE | London, UK | £30k - £40k + Share Option Plan | No Visa Sponsorship<p>Who we are:<p>Humanising Autonomy envisions a future where people around the world can naturally and intuitively interact with autonomous systems, and is creating a new category of human-centred products that help people and autonomous systems to better understand, interact, and work with each other.<p>We are currently developing multiple industrial solutions, primarily in the automotive industry, where we are developing a platform to  understand human behaviour and body language across cultures to improve the decision making of autonomous vehicles. Our current partners include Daimler-Mercedes Benz, Cisco and Honda, and are looking to work with select other partners to realise this future.<p>The role:<p>As employee number 6, you will be part of the core team and help build the foundation of the software stack, using computer vision to generate valuable information from data sources. You will help in creating deep learning architectures and models and eventually integrate them to create innovative decision-making systems for the major players in the autonomous revolution.<p>Your work will impact how autonomous systems will interact with people - a field whose relevance is rapidly expanding, and from which you can expect a fast-moving adventure! Your main responsibilities will include:<p>- Developing and analysing deep learning and computer vision models\n- Developing evaluation metrics and model testing procedures\n- Working with data scientists &#x2F; anthropology teams to understand how insights can be applied to the deep learning models.<p>The role will involve large responsibility and autonomy within the company, and require the ability to work both independently as well as part of a creative core team of designers, engineers and social scientists.<p>Apply to us via Angel List: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;humanising-autonomy&#x2F;jobs&#x2F;351268-deep-learning-computer-vision-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;humanising-autonomy&#x2F;jobs&#x2F;351268-deep-learni...</a>","time":1526294001,"type":"comment"}