{"by":"massung","id":17068801,"parent":16967543,"text":"The Knowledge Portal Network Group at the Broad Institute [0] is looking to hire a senior, front-end, Java&#x2F;Groovy engineer to maintain, extend, and improve our complex-disease knowledge portals [1]. You can find the complete job listing (and apply) here:<p><a href=\"https:&#x2F;&#x2F;broadinstitute.wd1.myworkdayjobs.com&#x2F;broad_institute&#x2F;job&#x2F;Cambridge-MA&#x2F;Senior-Principal-Software-Engineer_6186\" rel=\"nofollow\">https:&#x2F;&#x2F;broadinstitute.wd1.myworkdayjobs.com&#x2F;broad_institute...</a><p>Our team aggregates and stores statistical data for billions of genetic variants and organizes them to be rapidly queried and visualized by biologists, statistical geneticists, pharmaceutical researchers, and clinicians to find genetic associations, treatment targets, etc. The size of the data we work with is expected to grow by at least an order of magnitude in the coming years.<p>The current portal code is built on the Spring framework, is primarily coded in Groovy, and makes heavy use of jQuery and D3 for visualizations. Our team also make significant use of Scala. Although not a requirement for this role, if learning and&#x2F;or using Scala is of interest to you, there will be ample opportunities to do so. We also use Python, R, and some Perl.<p>You would be working with small team of ~12 people and have a major impact on the future development and directions of the project.<p>Working remote may be an option for the right candidate (some team members are currently remote). As the Broad is based in Cambridge, MA, there is a requirement that you be within a few hours of EST time-zone, a willingness to travel on-site periodically, and go to various meet-ups&#x2F;conferences.<p>This position does not require an immediate working knowledge of genetics, but such knowledge is a plus. The willingness to learn the biology to better serve the computational biologists on the team and better understand the needs of Portal users would be of long-term benefit to the team and yourself. This is much easier on-site as there are constant lectures and learning opportunities at the Broad, MIT, and Harvard for all employees. Some of these are also streamed.<p>You will also be exposed to several other projects at the Broad which our team collaborates with such as HAIL [2], WDL [3], FireCloud [4], and more.<p>If you are interested, please apply online via the job posting above. If you have any additional questions, feel free to email myself, Jeffrey Massung, or Mafruha Haque:<p>jmassung [at] broadinstitute [dot] org\nmhaque [at] broadinstitute [dot] org<p>[0]: <a href=\"https:&#x2F;&#x2F;www.broadinstitute.org&#x2F;diabetes&#x2F;type-2-diabetes-knowledge-portal\" rel=\"nofollow\">https:&#x2F;&#x2F;www.broadinstitute.org&#x2F;diabetes&#x2F;type-2-diabetes-know...</a>\n[1]: <a href=\"http:&#x2F;&#x2F;www.type2diabetesgenetics.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.type2diabetesgenetics.org&#x2F;</a>\n[2]: <a href=\"https:&#x2F;&#x2F;hail.is&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;hail.is&#x2F;</a>\n[3]: <a href=\"https:&#x2F;&#x2F;software.broadinstitute.org&#x2F;wdl&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;software.broadinstitute.org&#x2F;wdl&#x2F;</a>\n[4]: <a href=\"https:&#x2F;&#x2F;software.broadinstitute.org&#x2F;firecloud&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;software.broadinstitute.org&#x2F;firecloud&#x2F;</a>","time":1526327187,"type":"comment"}