{"by":"sethhochberg","id":12203021,"parent":12202865,"text":"AudioAddict | Full-time REMOTE or Denver, CO, USA<p>- Senior Backend Engineer (Ruby &#x2F; Rails and Go)<p>This is a permanent position with a thriving music company building the infrastructure that powers DI.FM, RadioTunes.com, JazzRadio.com, RockRadio.com, ClassicalRadio.com, and other expertly curated internet radio properties.<p>We’re looking for a senior backend engineer who is a well-rounded generalist, understanding everything that happens behind the scenes of a well-performing web application. The ideal candidate will be able to manage their own time (read: working remote isn’t for everyone) and is comfortable taking initiative in a small team.<p>- Mobile Architect<p>We currently support native apps for iOS and Android, with other devices of all sizes and shapes still to come. We’re looking for someone with the expertise to plan for and support our current apps, and the foresight to adapt as our needs grow and change while assisting with management of a small team of mobile developers across multiple platforms.<p>This role is flexible in its nature. The position requires the skills of a strong technical lead and a strong project manager, but the blend of these two skillsets can be discussed and is open for interpretation. Experience with media streaming is a strong plus.<p>---<p>We&#x27;re a midsized (~30 full time employees) organization where almost everyone works remote from wherever they are around the globe. We don&#x27;t watch the clock or mandate any set schedule outside of occasional (teleconference) meetings - we&#x27;re just looking for kickass work. We&#x27;re great about ensuring you&#x27;re set up with whatever you need to make your home office work, and music isn&#x27;t just our business, it runs in the blood of the company - we&#x27;re DJs, audio engineers, performers, and more... all supporting streaming of great music to a fanbase who has been listening to us for more than a decade.<p>Our interview process is simple: An initial phone screen to get a feel for your background, interests &#x2F; desires in the future, and salary needs; a 30 minute technical QA with an engineer; a 1 hour programming lab with an engineer; and a final meet-and-greet with various executives from the organization. All interviewing is done remotely.<p>More details and a full list of desired qualifications here - <a href=\"https:&#x2F;&#x2F;www.audioaddict.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.audioaddict.com&#x2F;jobs</a><p>Feel free to email seth[at]di.fm or with any questions, or see the link above to apply.","time":1470064697,"type":"comment"}