{"by":"stunder","id":12206594,"kids":[12225835],"parent":12202865,"text":"Hart (<a href=\"https:&#x2F;&#x2F;hart.com\" rel=\"nofollow\">https:&#x2F;&#x2F;hart.com</a>) | Javascript&#x2F;Frontend Engineer | Anaheim, CA | Full-time, onsite<p>OK its Eric (eric@hart.com) from Hart.  I post in the HN forum every month and have found some great people.  Here is the deal our hiring process is to have a phone interview, a culture fit, and a code challenge.  We require everyone do a challenge no matter what the position is (even the chef).   Here are some of the perks we offer.<p>* 100% Medical, Dental and Vision coverage for you and your family\n* Unlimited Vacation Policy\n* Paid Paternity and Maternity Leave\n* 401k Match up to 7% of annual salary\n* Life Insurance\n* AD&amp;D Insurance\n* Educational Reimbursement\n* Gym Membership\n* Advancement Program - Hart University\n* 15” MacBook Pro, Thunderbolt Display, Magic Mouse and Keyboard\n* Noise cancelling Headphones\n* Stocked kitchen with coffee, drinks, and snacks\n* Daily catered team lunches<p>Thats just the stuff off of the website.  I there are so many more that you really only get to witness by working here.   Listen I am just a DevOps guy if you would like to work here feel free to send me your resume eric@hart.com. or you can check the job link <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;7a63oy\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;7a63oy</a><p>As a Javascript Engineer at Hart you will work with the company&#x27;s software development lifecycle to design and develop new enhancements to the software as well as new development and architecture. Primary responsibilities include requirements analysis to gain an understanding of business needs to develop level of effort estimates, software design and development, unit testing, performing design and code reviews, and development of technical documentation. Additional responsibilities include performing system analysis, code modifications, and functional testing to troubleshoot application production issues.<p>You’ll work with the team to build products on the cutting edge of usability, interaction, and design. Our ideal candidate is someone who’s comfortable taking ownership of their work and effectively searching for creative solutions to the complex problems we encounter.<p>You’ll work in a high-communication environment where collaboration with the Design, Data Science, and Backend Engineering teams is key to your day-to-day success.","time":1470090948,"type":"comment"}