{"by":"jaz46","id":12204938,"parent":12202865,"text":"Pachyderm | Lead front-end&#x2F;JS engineer | San Francisco Onsite<p>pachyderm.io, github.com&#x2F;pachyderm&#x2F;pachyderm<p>Email: jobs@pachyderm.io<p>Pachyderm is looking for a Javascript expert to lead and own the entire web front-end, dashboard UI, and data visualization layer of Pachyderm! Experience with D3 or other visualization libraries is a plus.<p>Pachyderm is just 5 people right now, so you&#x27;d be getting in right at the ground floor and have an enormous impact on the success and direction of the company as well as building the rest of the engineering team.<p>Experience with full product life cycles and designing interfaces that are easily updated over time as products evolve is a must. Some backend server-side experience is also a nice plus, but not a strict requirement.<p>Right now Pachyderm&#x27;s core technology just hit v1.1 and is production-ready. The next phase is to build a hosted service including administration panel and advanced data visualization tools.<p>Salaries start at $100k and go up from there based on experience. We also offer significant equity, full benefits, and all the usual startup perks. This position is based in SF.<p>Positions:<p>* Lead Front-end JS engineer<p>* Core distributed systems&#x2F;infrastructure engineer : Golang<p>Our hiring process is focused around strong communication skills and simulating our actual work environment, not BS coding questions.<p>Read more about our company vision and goals:<p>What would data analytics infrastructure (namely Hadoop) look like if we rebuilt it from scratch today? We think it would be containerized, modular, and easy enough for a single person to use while still being scalable enough for a whole company. Tools like Docker and Kubernetes provide the perfect building blocks for us revolutionize data infrastructure!<p><a href=\"https:&#x2F;&#x2F;medium.com&#x2F;pachyderm-data&#x2F;lets-build-a-modern-hadoop-4fc160f8d74f\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;pachyderm-data&#x2F;lets-build-a-modern-hadoop...</a><p>pachyderm.io&#x2F;dsbor.html","time":1470077722,"type":"comment"}