{"by":"stunder","id":12205005,"parent":12202865,"text":"Hart (<a href=\"https:&#x2F;&#x2F;hart.com\" rel=\"nofollow\">https:&#x2F;&#x2F;hart.com</a>) | SDET | Anaheim, CA | Full-time, onsite<p>OK its Eric (eric@hart.com) from Hart.  I post in the HN forum every month and have found some great people.  Here is the deal our hiring process is to have a phone interview, a culture fit, and a code challenge.  We require everyone do a challenge no matter what the position is (even the chef).   Here are some of the perks we offer.<p><pre><code>   - 100% Medical, Dental and Vision coverage for you and your family\n\n   - Unlimited Vacation Policy\n   - Paid Paternity and Maternity Leave\n   - 401k Match up to 7% of annual salary\n   - Life Insurance\n   - AD&amp;D Insurance\n   - Educational Reimbursement\n   - Gym Membership\n   - Advancement Program - Hart University\n   - 15” MacBook Pro, Thunderbolt Display, Magic Mouse and Keyboard\n   - Noise cancelling Headphones\n   - Stocked kitchen with coffee, drinks, and snacks\n   - Daily catered team lunches\n</code></pre>\nThats just the stuff off of the website.  I there are so many more that you really only get to witness by working here.   Listen I am just a DevOps guy if you would like to work here feel free to send me your resume eric@hart.com. or you can check the job link <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;ld86pr\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;ld86pr</a><p>We are looking for a strong SDET to round out our team.  The ideal candidate would have strong experience in automated testing, with a strong understanding of Object Oriented Programming.  This team player would work well in an independent work environment to identify areas with a testing deficit, and act appropriately to improve those areas of the greatest need. This highly driven individual would also demonstrate flexibility and an eagerness to learn, in order to provide support in codebases across multiple languages, operating systems, and platforms.","time":1470078156,"type":"comment"}