{"by":"rlonstein","id":12203327,"parent":12202865,"text":"Datapipe | Platform Engineering | Remote | Full-Time<p>What: Want to work on hard problems? We have them. We are building our next-generation managed service cloud platform.<p>You&#x27;ll be doing process engineering, best practices development, automation, templating, common library development, and platform evangelism. You will be actively involved in strategizing how to leverage automation and DevOps for our internal teams and external clients. We are a fully remote team and collaborate via familiar tools and services (slack, github enterprise, et.al.).<p>We are looking for:<p>* Ability to design and implement new technologies where little documentation exists.<p>* 3+ years as a software developer with expertise in designing and developing web services for scalable and complex systems with Java, Ruby, Python, Node, Go, C++, or C#.<p>* 3+ years managing, diagnosing and debugging matrixed problems across multiple disciplines (apps, infrastructure, db)<p>* Experience with one or more configuration management tools and how to leverage them within application management and deployment processes with Chef, Puppet or Ansible. CI&#x2F;CD experience a plus.<p>* Deep understanding of various architectures: Client&#x2F;Server, Pub-Sub, microservices, service-oriented.<p>* Knowledge of RDBMS and NoSQL patterns are a must.<p>* Virtualization experience with: docker, kubernetes, vSphere ESXi, AWS, and&#x2F;or Azure.<p>About us: Datapipe is a global provider of Managed Services and data center infrastructure for IT and Cloud Computing, with data centers throughout the U.S., London, Hong Kong and Shanghai.<p>We offer:<p>* Competitive salaries<p>* Personal time off<p>* Medical, dental, and vision insurance<p>* 401k, life insurance, and disability benefits<p>* Annual training and career development<p>* Company-provided equipment, including cell phones<p>* Weekly catered lunch in the office (but we&#x27;re working remotely so don&#x27;t get excited)<p>Ask me questions in pm or email a recruiter: ddankin@datapipe.com","time":1470066501,"type":"comment"}