{"by":"frabrunelle","id":12205210,"parent":12202865,"text":"MaidSafe (<a href=\"http:&#x2F;&#x2F;maidsafe.net\" rel=\"nofollow\">http:&#x2F;&#x2F;maidsafe.net</a>) | Troon, Scotland | Full-time | REMOTE<p>MaidSafe has created the SAFE (Secure Access For Everyone) Network (<a href=\"https:&#x2F;&#x2F;safenetwork.org\" rel=\"nofollow\">https:&#x2F;&#x2F;safenetwork.org</a>), an open source (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;maidsafe\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;maidsafe</a>), decentralised data communications network made possible by efficiently combining the unused hard drive space, CPU power and internet connections of its users. It is a global network without servers that has the potential to revolutionise the existing Internet and we are looking for engaging individuals to join our team.<p>MaidSafe&#x27;s aim is to provide privacy, security and freedom to everyone on the planet. This has been our unwavering ambition since we started on this journey in 2006, and it remains our driving force today.<p>DEVELOPER OUTREACH MANAGER<p>As the roll out of the network commences, we require developer outreach managers to grow support for the 3rd party developers who are building the next generation of applications and businesses on the network.<p>More info here: <a href=\"http:&#x2F;&#x2F;www.indeed.co.uk&#x2F;cmp&#x2F;MaidSafe&#x2F;jobs&#x2F;Developer-Outreach-Manager-d120902a5dcaba2e?q=maidsafe\" rel=\"nofollow\">http:&#x2F;&#x2F;www.indeed.co.uk&#x2F;cmp&#x2F;MaidSafe&#x2F;jobs&#x2F;Developer-Outreach...</a><p>RUST ENGINEER<p>Essential Requirements:<p>- Experience programming in Rust.<p>- Commercial experience of working to tight deadlines as part of a team.<p>- Skilled in producing clear and user-focussed documentation.<p>- The ability to liaise with a growing community of enthusiasts.<p>More info here: <a href=\"http:&#x2F;&#x2F;maidsafe.net&#x2F;careers.html\" rel=\"nofollow\">http:&#x2F;&#x2F;maidsafe.net&#x2F;careers.html</a><p>FULL STACK DEVELOPER<p>Essential Requirements:<p>- Experience programming in multiple languages with a particular focus on Rust.<p>- A minimum of 2 years commercial experiences as an end to end &#x2F; full stack developer.<p>- The ability to work to tight deadlines as part of a team.<p>- Version control knowledge (GIT).<p>- Skilled in producing clear and user-focussed documentation.<p>- The ability to liaise (both written and verbal) with a growing community of enthusiasts.<p>More info here: <a href=\"http:&#x2F;&#x2F;maidsafe.net&#x2F;careers.html\" rel=\"nofollow\">http:&#x2F;&#x2F;maidsafe.net&#x2F;careers.html</a><p>---<p>If you would like to help, please send your CV along with a covering letter detailing why you’re a great ﬁt for the position to: careers@maidsafe.net and we will get back to you as soon as we can.","time":1470079906,"type":"comment"}