{"by":"trcollinson","id":12202900,"parent":12202865,"text":"Elevated Billing | Salt Lake City (South Jordan), UT | Full-Time | ONSITE<p>Hey there, this is Tim, I am the Engineering Lead for Elevated Billing. Elevated Billing is a medical billing company which specializes in billing for substance abuse, addiction recovery, mental. and behavioral health facilities. Our core values are the key to our business success. “We relentlessly advocate for people in need of treatment”. Elevated Billing has been in business and profitable for nearly a decade. It was recently acquired and is working to advocate for even more people in need of treatment through expansion and strategic partnerships.<p>We’re building a number of new internal systems to improve the efficiency with which our employees and the facilities we serve can advocate for people in need to treatment. We are a small team of software engineers looking to grow! We are looking for two people to help round out our team. We’re looking for the following skills:<p><pre><code>  * Angular 2 experience (Angular 1 acceptable with some familiarity with the newer paradigms).\n  * Typescript experience\n  * Some experience with javascript build automation tools (we use Webpack)\n  * A good understanding of CSS and layouts (currently using bootstrap)\n  * A solid understanding of automated testing\n  * Some experience with a hybrid mobile app framework (Ionic, NativeScript)\n</code></pre>\nIf you hadn’t noticed our stack is Angular 2 in Typescript, build with Webpack, and deployed to an AWS S3 bucket. We believe in and follow solid automated testing procedures. We are looking to make a hybrid mobile app using Ionic (or possible NativeScript). We are built on a Rails 5 api and a PostgreSQL Database.<p>This is a full-time, salaried position in South Jordan, UT. We have a great office space, a fantastic group of co-workers, and a solid working environment. We’d love to tell you all about our benefits and perks but this is going to start getting too long. So email me! Send me your resume, any questions you have about me, the company, or the position, and your salary requirements! I would love to chat with you. tim@elevatedbilling.com","time":1470063914,"type":"comment"}