{"by":"cosylab","id":12208640,"parent":12202865,"text":"Cosylab | Ljubljana, Slovenia OR BayArea, CA | System programming | Full Time | Onsite<p><a href=\"http:&#x2F;&#x2F;www.cosylab.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.cosylab.com</a><p>Description:<p>We are a company that specializes in development of control systems for nuclear particle accelerators and other large physics facilities. We are working with major physics institutes around the world including ITER, ESS, PSI, SLAC and others, see our reference page for details.\n\tCurrently we are looking for C&#x2F;C++ developers with at least couple years of experiences to work on an upcoming projects. The actual work will vary based on the project, but it is not unusual to work on a full-stack solutions, ranging from kernel drivers, high performance network middleware as well as GUI development. Since we specialize in custom solutions we really appreciate input and suggestions from all developers (everyone is encouraged to be involved in design phase)<p>- In addition to C++, knowledge in the following areas is appreciated:<p>- Development in&#x2F;for Linux and other *nix systems<p>- System programming (Linux)<p>- Network programming<p>- Low latency real time systems (VxWokrs&#x2F;Preempt-RT&#x2F;Xenomai)<p>- Relational databases and SQL<p>- OS-level virtualization<p>Linux Kernel driver development<p>Note: Cosylab d. d. was declared the best Slovenian employer in 2015, in the Golden Thread (Zlata nit) Competition, and was also a 2015 finalist in the Golden Practice (Zlata praksa) Contest.<p>Location:\nCurrently we have positions available in:<p>1.) Cosylab USA: Palo Alto &#x2F; CA. Apply by sending a CV to  jobs-us@cosylab.com<p>2.) Cosylab HQ:\tLjubljana, Slovenia. Due to nature of the work an occasional travel to the customer premises might be needed (as it is somewhat unpractical to ship the fusion reactors around ;) ), but we are very flexible and always try to accommodate our developers wishes. Apply by sending a CV to jobs-sensw@cosylab.com","time":1470128818,"type":"comment"}