{"by":"adelgaw","id":12204861,"parent":12202865,"text":"Amazon AWS | Seattle | ONSITE | Full Tim<p><a href=\"https:&#x2F;&#x2F;www.amazon.jobs&#x2F;en&#x2F;jobs&#x2F;415804\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.jobs&#x2F;en&#x2F;jobs&#x2F;415804</a><p>DynamoDB is synonymous with NoSQL. It has been at the heart of the NoSQL revolution, powering the experiences delivered by Amazon.com and many other companies that have become an indispensable part of modern life. We are the store of choice for authoritative, highly durable, highly available, low-latency data and as such are a foundational tier zero service for Amazon and the many customers who have built their services on top of DynamoDB.<p>DynamoDB is looking for a Senior Engineer who would help propel DynamoDB to new levels of manageability and profitability. As a Senior Engineer on the DynamoDB team, your initial focus will be on building self-healing&#x2F;self-service services to automate the release pipeline. You will be a business owner for our services. You will understand the customer workflows and be able to make prioritization calls based on your deep understanding. DynamoDB’s sustained success is dependent on being able to release new features frequently and with no friction. This is no easy feat for a stateful distributed system. Automating performance and destructive test verification in a noisy distributed system is the next challenge we are undertaking. This is an area where we need to bring our creativity and curiosity to use statistical analysis and ML to simplify our customer’s workflow. As a leader in the Test Infrastructure team, you will work directly with our service’s customers (Dynamo DB engineers) to understand their workflows, and what would delight them.<p>We have barely scratched the surface in terms of creating a service that requires no manual work, and are cheap to support. We will be using cloud paradigms to isolate our customers from noise introduced by the environment. Our goal is that our services will isolate developers from having to worry about test resource’s health and availability.<p>In the larger scope of the role, you will be responsible for rethinking the assumptions behind how traditional database services were built and thinking how to build database services best suited for the cloud. You will own the design, development, testing and deployment of these database services. You will draw from a deep and broad technical expertise to mentor engineers, complete hands-on technical work and provide leadership on complex technical issues. You will lead and be responsible for delivering some of our most strategic technical projects, deliver large scalable systems, design new software systems at the cutting edge of distributed database technology and have a significant bottom-line impact on our business and competitive position.<p>As a Senior Engineer in AWS, you will be a part of the larger technical leadership community that forms the backbone of the company, plays a critical role in the broad business planning, working closely with senior executives, influences our long-term technical and business strategy, helps us hire talented team of engineers and ultimately enables us to deliver innovative new solutions rapidly.<p>This position within the Database Services team represents a unique and rare opportunity to get in on the ground floor within a fast growing business and help shape the technology, product and the business. A successful candidate will bring deep technical and software expertise, strong business acumen and judgment, an ability to define visionary, ground breaking products, ability to hire and lead a team, desire to have an industry wide impact and ability to work within a fast moving, startup environment in a large company to rapidly deliver services that have a broad business impact.","time":1470077185,"type":"comment"}