{"by":"shedd","id":12207140,"parent":12202865,"text":"Zoomer (YC S14) - <a href=\"http:&#x2F;&#x2F;www.zoomerdelivery.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.zoomerdelivery.com</a> - Multiple Roles - REMOTE<p>Zoomer is focused on helping high volume delivery restaurants wow their customers and grow their business. We&#x27;ve taken a unique approach to changing the food delivery space - a platform to handle an extraordinarily high volume of concurrent deliveries from restaurants that already deliver (i.e. pizza, wings, sandwiches, etc.).  We’re bringing much needed change to local high-volume delivery restaurants that are still doing delivery the way they’ve always done it.  We are backed by some of the best investors in the world, including Y Combinator, Foundation Capital, First Round Capital, SV Angel, and other amazing funds and individuals.<p>Zoomer connects high volume delivery restaurants with independent delivery drivers. Restaurants leveraging the Zoomer platform are able to provide a better &amp; more consistent delivery experience for their customer, which ultimately leads to a stronger bottom line. Independent drivers on the Zoomer platform have the ability to create their own schedule &amp; increase their own efficiency, resulting in more earnings.  And of course, customers receive their orders dramatically faster than the status quo.<p>We’re making key hires to expand our globally distributed core team. You’ll have a ton of impact – lots of freedom to evolve our processes, systems, partners, platform, stack and apps.  We follow strong dev practices, put an emphasis on testing, and deploy rapidly.  Our team is distributed across the US and Europe.<p>Help us build cutting-edge technical solutions to:<p><pre><code>  - tough logistics problems, quickly routing orders to optimal drivers\n  - on-demand prediction and forecasting models\n  - scalable compute and data infrastructure\n  - multiple mobile apps - for restaurants, drivers, and diners\n  - range of complex real-time frontend interfaces\n </code></pre>\nSome roles we’re currently hiring for:<p><pre><code>  - Logistics technology engineers\n  - Ruby engineers\n  - DevOps engineer\n </code></pre>\nIf this sounds interesting, you can learn more and apply here: <a href=\"http:&#x2F;&#x2F;www.zoomerdelivery.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.zoomerdelivery.com&#x2F;careers</a>","time":1470098130,"type":"comment"}