{"by":"nmec","id":12203298,"parent":12202865,"text":"JustPark | London, UK | ONSITE | Full-Time<p>We’re looking for super smart engineers to join the JustPark team and help us take our product to the next level. Current open roles include:<p>- Back End developer<p>- Full Stack developer<p>- Senior Full Stack developer<p>- Junior Android developer<p>- Data Scientist<p>The stack<p>Frontend: Gulp, Sass, Browserify, Babel, React<p>Backend: PHP, Python, MySQL, MongoDB<p>About us<p>Parking is a broken industry. It drains our fuel tanks, our wallets, our time and our sanity. It&#x27;s been clogging up our towns for too long. At JustPark, we&#x27;ve officially had enough, and life&#x27;s too short not to fix things.\nWe connect the dots to ensure that those who need parking find the people who have it going spare. Our business is unlocking potential: we help homeowners, churches, schools, hotels, pubs and commercial car parks to boost their income by filling their empty spaces, making the most of the assets they have.\nJustPark is one of London&#x27;s most exciting and fast-growing startups - with a record-breaking £3.7m equity crowdfunding round under its belt, on top of investment from BMW and Index Ventures. In 2015 alone, JustPark were featured in WIRED’s top 10 hottest startups, crowned winners of Richard Branson&#x27;s &#x27;Pitch to Rich&#x27;, and nominated for the Growing Business Awards UK Employer of the Year.<p>Interview process<p>We usually review and reply to applications within 48h (either way) if it looks like a good fit we&#x27;ll arrange a short phone call with someone from the team you&#x27;ll be joining. Next is a technical task which you can complete in your own time and shouldn&#x27;t take more than a couple of hours. After that will be onsite interviews with your team members and manager, we usually try and schedule this so you can join us for lunch as well. If all has gone well we&#x27;ll make you an offer - we made an offer on the spot (which was accepted) for our last hire - obviously you&#x27;re free to make the decision in your own time too.<p>Benefits<p>- A salary that is actually competitive.<p>- Generous stock options to match.<p>- Unlimited holiday.<p>- Free daily gourmet lunches, prepared by our lovely in-house chef.<p>- MacBook Pro.<p>- Table tennis and Friday beers on tap.<p>- Free parking at any JustPark space.<p>Learn more about the roles and apply: <a href=\"https:&#x2F;&#x2F;justpark.workable.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;justpark.workable.com&#x2F;</a> or email jobs@justpark.com","time":1470066306,"type":"comment"}