{"by":"johanmena","id":12205769,"parent":12202865,"text":"Johan (jmena@pulsepoint.com) from PulsePoint here! Both of these roles are for my team (I&#x27;m a engineer here), so if you have any questions (technical or otherwise) or are interested in applying feel free to reach out directly. Please include your resume and anything else of interest. :-)<p>------\nPulsePoint (<a href=\"https:&#x2F;&#x2F;pulsepoint.com\" rel=\"nofollow\">https:&#x2F;&#x2F;pulsepoint.com</a>) | Senior Backend Engineer, Scala | New York, NY | Full-time, remote or onsite<p>We&#x27;re looking for an Senior Backend Engineer to help us architect and scale our micro-service oriented advertisement platform. Some technologies we use on a daily basis: Scala, Akka (cluster, http, fsm, pubsub, many more), Play, Docker, Mongo, PostgreSQL and Jenkins. We also have some Clojure and Ruby sprinkled around, and we&#x27;re looking to introduce some more of both. We like functional programming and hopefully you do too!<p>Other teams have an array of services that we can take advantage of like Mesos, Kafka, Spark, Cassandra, Zookeeper, ELK, Hadoop, etc. Ideally you&#x27;ll have hands-on Scala and Akka experience, but Java experience is ok as long as you can hit the ground running really quickly!<p>-------\nPulsePoint (<a href=\"https:&#x2F;&#x2F;pulsepoint.com\" rel=\"nofollow\">https:&#x2F;&#x2F;pulsepoint.com</a>) | Full-Stack Engineer (Scala, JavaScript) | New York, NY | Full-time, remote or onsite<p>Similar role to the above, but we&#x27;d expect that you have JavaScript experience. We&#x27;re currently running on Angular 1 (CoffeeScript, JavaScript), and we&#x27;ll be migrating to Angular 2 (TypeScript, webpack, etc.) soon. If you&#x27;re interested in being part of, or even leading this migration, please reach out!<p>-------\nAbout PulsePoint:<p>We are profitable company in the advertising technology (AdTech) industry, so we&#x27;re not going away any time soon. We also have nice benefits like good Medical, Dental, Vision, 401k match up to 6%, life insurance, stocked fridges, beers, etc. (everything you&#x27;d expect from a company these days and then some): Check it out: <a href=\"http:&#x2F;&#x2F;www.pulsepoint.com&#x2F;Benefits&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.pulsepoint.com&#x2F;Benefits&#x2F;</a> — We were also voted one 50 best places to work in 2016 by Inc.!<p>Finally, to save you the trouble, here&#x27;s our Glassdoor page: <a href=\"https:&#x2F;&#x2F;www.glassdoor.com&#x2F;Overview&#x2F;Working-at-PulsePoint-EI_IE483561.11,21.htm\" rel=\"nofollow\">https:&#x2F;&#x2F;www.glassdoor.com&#x2F;Overview&#x2F;Working-at-PulsePoint-EI_...</a> :-)","time":1470084180,"type":"comment"}