{"by":"johnrball","id":12203919,"parent":12202865,"text":"Spreemo| Senior Data Scientist |  Full Time |  NYC<p>Would you like the opportunity to work with  unique healthcare datasets that cover all phases of care delivery (referral, diagnosis, therapy, and outcome&#x2F;follow-up) from the perspective of all key stakeholders (patients, providers, payers).We offer a great Salary, Bonus and Equity!!!<p>As a Senior Data Scientist at Spreemo, you will work with a growing multidisciplinary team of talented Data Scientists, Statisticians, Healthcare Economists&#x2F;Epidemiologists, and Big Data Technology Experts. Together, you will create new and improved methods for assessing and predicting the quality of care delivered by healthcare providers and determining the impact that care quality has on overall patient outcomes and cost. In addition, you will  develop related analytics tools for the payers, providers, and patients who use Spreemo’s platform to facilitate and coordinate delivery of care. You will have the opportunity to work with unique healthcare datasets that cover all phases of care delivery (referral, diagnosis, therapy, and outcome&#x2F;follow-up) from the perspective of all key stakeholders (patients, providers, payers).<p>Your responsibilities will include helping to further build and extend the data analytics environment at Spreemo. You will be implementing data pipelines for ETL, data integration, and data exploration. You will develop regression and machine learning models for classification and prediction. Your responsibilities will also include helping to shape Spreemo’s data analytics strategy by identifying new opportunities and helping to lead and mentor junior members of the analytics team.<p>PhD or Master’s degree from elite institution in relevant technical discipline<p>5+ year’s work experience as a Data Scientist<p>Experience with regression and machine learning models for classification and prediction<p>Experience with methods for feature selection, dimension reduction, and quantifying goodness of fit<p>Experience implementing data pipelines for ETL, data cleaning, and data integration<p>Experience with R and&#x2F;or Python<p>Join our team!! Send your resume to  john.ball@spreemo.com<p><a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;spreemo.com&#x2F;77d4ceb6-be11-45b0-885f-8193ca1a32a2\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;spreemo.com&#x2F;77d4ceb6-be11-45b0-885f-81...</a>","time":1470070249,"type":"comment"}