{"by":"mkrn","id":12207321,"parent":12202865,"text":"MethodExists Inc. (<a href=\"https:&#x2F;&#x2F;methodexists.com\" rel=\"nofollow\">https:&#x2F;&#x2F;methodexists.com</a>) | Calgary, Canada | Multiple Positions | Full-time | Both ONSITE Calgary + REMOTE<p>We are a Calgary-based, remotely operated company, with our teams currently spread over Russia, Spain, the Caribbean and Canada. Our company creates enterprise-ready fully customizable web applications. We have a lot of challenging work in front of us, and want driven people to join for a new and exciting experience. You will be empowered by our great processes (continuous integration, test-driven development, nicely concern-separated codebase, linting, task management in Phabricator, code reviews, continuous deployment, communication in Slack, unobtrusive meeting practices, open vacation policy and more) and positive work culture.<p>We have successfully delivered solutions for clients in a variety of areas including energy exploration, operations management, hsse management, agriculture operations, tourism, risk management and learning systems.<p>In our next phase, we will be delivering solutions to meet a variety of technical needs. We will be working to integrate RFID readers for inventory management, map optimum routes through supply chains and do market analysis, and build front end interfaces to configure complex systems, among other projects.<p>We are hiring the skill sets below, but are open to hear from anyone who thinks they&#x27;re a fit or wants to learn more. We are looking to fill some Canadian roles at the moment (preferably in the Calgary area), but are also hiring internationally. All jobs are full time.<p>Front-End Ninja<p>Role is a front-end developer with a focus on great UX, attention to detail, extensive knowledge of Javascript &#x2F; CSS. In particular experience with React, (+Redux), ES6, PostCSS, D3.js, Leaflet, Electron, React Native is a bonus since we work with these technologies. Additional benefits would be node.js, frontend test driven development experience, deep understanding of relational databases, experience creating complex data visualizations, designing drag &amp; drop user experiences, performance testing, and mobile testing. This job will require collaborative interactions and communication with our clients and business partners, for gathering specs and usability feedback and for building custom functionality.<p>Other positions:<p>- Database Gangsta<p>- Devops Mafioso &#x2F; Full-Stack Warrior<p>- Security Hacker<p>See more and apply at <a href=\"https:&#x2F;&#x2F;methodexists.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;methodexists.com&#x2F;jobs</a>","time":1470101624,"type":"comment"}