{"by":"robandrews","id":12204268,"parent":12202865,"text":"Renaissance Learning | San Francisco (Montgomery BART stop) | Full-Time, ONSITE | VISA | <a href=\"https:&#x2F;&#x2F;www.renaissance.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.renaissance.com&#x2F;</a><p>Help us disrupt education and personalize it in a way that creates lifelong learners and therefore improve society.  We are a Google owned (<a href=\"http:&#x2F;&#x2F;www.googlecapital.com&#x2F;companies&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.googlecapital.com&#x2F;companies&#x2F;</a>), financially stable company and a market leader in the  Ed-Tech space since 1984. We are looking for exceptional candidates to join our San Francisco team who would like to develop products that truly make a difference in the lives of millions of students globally. \nRenaissance Learning is a world leader in cloud-based assessment and teaching and learning solutions that fit the K12 classroom, raise the level of school performance, and accelerate learning for all. By delivering deep insight into what students know, what they like, and how they learn, Renaissance Learning enables educators to deliver highly differentiated and timely instruction while driving personalized student practice in reading, writing, and math every day. Renaissance Learning delivers its products in over one-third of U.S. schools and more than 60 countries worldwide.\nAs a member of our Lean&#x2F;Agile team, you will work with incredibly smart, collaborative, and mission-driven people to develop our cloud-based web applications to the K-12 education market that positively impact millions of students and teachers around the world. Visa is OK. ONSITE.<p>1 Prescreen with Recruiter, 2 Phone Interviews, 1 onsite interview, 1 phone interview with CTO.<p>We&#x27;re hiring:<p>SENIOR FRONT END ENGINEER: <a href=\"http:&#x2F;&#x2F;renaissance.submit4jobs.com&#x2F;index.cfm?fuseaction=85377.viewjobdetail&amp;CID=85377&amp;JID=217535\" rel=\"nofollow\">http:&#x2F;&#x2F;renaissance.submit4jobs.com&#x2F;index.cfm?fuseaction=8537...</a><p>SENIOR BIG DATA ENGINEER: <a href=\"http:&#x2F;&#x2F;renaissance.submit4jobs.com&#x2F;index.cfm?fuseaction=85377.viewjobdetail&amp;CID=85377&amp;JID=223683\" rel=\"nofollow\">http:&#x2F;&#x2F;renaissance.submit4jobs.com&#x2F;index.cfm?fuseaction=8537...</a><p>Email me at rob.andrews (@) renaissance.com if you&#x27;d like to learn more.","time":1470072663,"type":"comment"}