{"by":"stunder","id":12205143,"kids":[12229213],"parent":12202865,"text":"Hart (<a href=\"https:&#x2F;&#x2F;hart.com\" rel=\"nofollow\">https:&#x2F;&#x2F;hart.com</a>) | Product Owner Agile | Anaheim, CA | Full-time, onsite<p>OK its Eric (eric@hart.com) from Hart.  I post in the HN forum every month and have found some great people.  Here is the deal our hiring process is to have a phone interview, a culture fit, and a code challenge.  We require everyone do a challenge no matter what the position is (even the chef).   Here are some of the perks we offer.<p>* 100% Medical, Dental and Vision coverage for you and your family\n* Unlimited Vacation Policy\n* Paid Paternity and Maternity Leave\n* 401k Match up to 7% of annual salary\n* Life Insurance\n* AD&amp;D Insurance\n* Educational Reimbursement\n* Gym Membership\n* Advancement Program - Hart University\n* 15” MacBook Pro, Thunderbolt Display, Magic Mouse and Keyboard\n* Noise cancelling Headphones\n* Stocked kitchen with coffee, drinks, and snacks\n* Daily catered team lunches<p>Thats just the stuff off of the website.  I there are so many more that you really only get to witness by working here.   Listen I am just a DevOps guy if you would like to work here feel free to send me your resume eric@hart.com. or you can check the job link <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;m6f5g1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;m6f5g1</a><p>As a product owner at Hart you will work on managing multiple complex mobile, web and technology projects using Agile methodology working with Hart design and engineering teams. The product owner role is a critical one in our organization to ensure that we consistently deliver the highest quality products to our customers. Specifically, the product owner will coordinate the activities of projects from inception to finish to ensure that all aspects the projects are clearly defined, have appropriate milestones and remain on track to completion.<p>This position requires an equal mix of customer management, project management, and strong business and engineering acumen. The ideal candidate will have a strong drive for results, interpersonal skills, fantastic attitude and be comfortable managing and coordinating cross functional teams. You must have strong organization, planning skills with a consistent track record for delivering commitments on time. You’ll work in a fast paced, high communication environment where collaboration with the customer’s, design, product management, quality assurance and engineering teams is key to your day-to-day success.","time":1470079338,"type":"comment"}