{"by":"johnbellone","id":12203283,"parent":12202865,"text":"Bloomberg | NYC, Washington D.C. | SRE, Infrastructure Engineer | Onsite | Full-time<p>Bloomberg&#x27;s Platform Engineering team builds infrastructure automation services that focus on configuration management and cloud orchestration. We play an active role in advising other infrastructure engineering teams on the best practices of modern application and infrastructure development.\nWe have a clear roadmap of where we want to be, but we need your expertise in building large-scale distributed systems to develop mission-critical system infrastructure. You will be part of a team that builds the foundation to support a multi-cloud environment. We develop best practices, tools and processes that have a direct impact on how thousands of engineers at Bloomberg interact with infrastructure.<p>We will trust you to:<p>- Take responsibility for the development and deployment of Bloomberg&#x27;s platform services<p>- Identify and automate manual tasks<p>- Implement industry-wide best practices around public and private cloud infrastructure<p>- Develop and maintain documentation, training and SLA for managed infrastructure and systems<p>- Help replace legacy systems with modern, Internet-scale design patterns<p>We are looking for:<p>- 3+ years of experience working on highly available, fault-tolerant distributed systems<p>- A strong understanding of operating systems and the nuances of Linux<p>- Experience with datacenter network troubleshooting including IP fundamentals, DNS, load balancing, proxies and firewalls<p>- Familiarity with configuration management systems such as Chef, Puppet or Ansible<p>- Proficiency in at least one of the following languages: Python, Ruby, C&#x2F;C++, Go or Java<p>- A solid understanding of the modern software development lifecycle (SDLC) processes such as Continuous Integration and delivery<p>Apply online:<p><a href=\"https:&#x2F;&#x2F;careers.bloomberg.com&#x2F;job&#x2F;detail&#x2F;49659\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.bloomberg.com&#x2F;job&#x2F;detail&#x2F;49659</a>","time":1470066231,"type":"comment"}