{"by":"millzoarz","id":12211953,"kids":[12217490],"parent":12202865,"text":"AVAAZ | <a href=\"https:&#x2F;&#x2F;www.avaaz.org&#x2F;en&#x2F;hiring&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.avaaz.org&#x2F;en&#x2F;hiring&#x2F;</a> | Global | Full Time | REMOTE<p>Avaaz is changing the world, and we’ll give you the means to change it, too. Our team is a place to exercise your creativity and your leadership, while building never-before-seen tools for one of the world’s top online activism organisations. You can let your imagination run wild figuring out how to grow the platform and tools, improve rapid-iterative processes and integrate new technologies.<p>We are a nimble team working on creating opportunities to bring about the world most people everywhere want -- one of justice, peace, and freedom. The work environment is quite unique: whether you’re in the office or working from home, our collaborative culture ensures everyone is heard and treated respectfully, with a strong focus on personal development.<p>Our tech build comprises the latest technologies (cloud computing, distributed systems, big data) using great languages (Python, PHP, JS) with proven and cutting-edge datastores (MySQL, Redshift, MongoDB, Redis, Memcache). At Avaaz, your work will have an impact on a huge scale: we have more than 40 million members, who have taken over 200 million actions, told over 500 million friends about Avaaz campaigns and donated more than $50 million online.<p>Our global and distributed tech team creates beautiful, efficient code that works across browsers, platforms and localisations. It’s backed by developers with a proven track record of designing, building and debugging large web applications.<p>We’re roaming the world in the search for challenge-driven hard-working developers and senior developers with excellent spoken and written communication in English who are able to adapt and learn, with talents for creativity and abstract thinking. The quest is for people who fit that profile; we know specific skills can always be trained and developed.<p>We are currently hiring senior developers and devops engineers  in the Americas, EU and African timezones.<p>Salary is competitive in the non profit space with generous benefits but we can not match corporate tech salaries.<p>Apply here: <a href=\"https:&#x2F;&#x2F;www.avaaz.org&#x2F;en&#x2F;hiring&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.avaaz.org&#x2F;en&#x2F;hiring&#x2F;</a>","time":1470162008,"type":"comment"}