{"by":"HitmanH","id":12217318,"parent":12202865,"text":"Alcova Asset Management LLP | London, UK | Full-time | ONSITE | EU RIGHT TO WORK NEEDED<p>We’re an entrepreneurial London based quantitative hedge fund manager that is looking to grow our team.  We were founded 4 years ago by a small team of ambitious partners with tier 1 banking, proprietary trading and hedge fund backgrounds who everyone works with directly.  The firm is small enough for everyone to have an immediate effect on the results, and we’re all enthusiastic about finance, systematic trading and the technology that underpins it.  We’re based in Knightsbridge, overlooking Hyde Park.<p>You’ll be working with the team here to create trading algorithms and their associated analytic tools; you will maintain feed &amp; line handlers to process large amounts of market data in a low-latency environment.  In time you will grow to get an understanding of all aspects of the trading systems, and will look to further improve and automate processes in a constant drive for efficiency.<p>You’ll be a Quantitative Developer who has worked in a professional environment, know knows their C++, C++11, Templates, network-level programming, and libraries such as Boost &amp; Boost Asio inside out. We use Python elsewhere – so a working knowledge of that is a big plus (along with NumPy, SciPy, pandas for calculations, and Python&#x2F;PySide for GUI work), as is messaging protocols such as QPID to get data around the place.  This stack sits on Linux, both hosted and cloud (AWS).<p>Ideally, you’ll have a strong educational background, such as a degree, an advanced degree or PhD in a quantitative field, and you definitely will be able to communicate effectively with people of variable technical abilities and be able to demonstrate enthusiasm &amp; drive in the space.<p>We offer a challenging environment, and reward well.  If this sounds interesting, please email me on russell.hart@alcova-am.com","time":1470225953,"type":"comment"}