{"by":"aerique","id":12217472,"parent":12202865,"text":"Arbor Networks | Delft, Netherlands | ONSITE | Full Time | <a href=\"https:&#x2F;&#x2F;www.arbornetworks.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.arbornetworks.com&#x2F;</a><p>Arbor does DDoS Mitigation and Advanced Threat Protection.<p>We&#x27;ve got a job opening for a front-end developer with the Arbor Delft team. The team is small so the job description describes where your main focus will be, but you will be expected to pick up tasks &quot;from the other side&quot; now and then.<p>The main focus is the front-end. UX experience very welcome although you will be mainly implementing (at least initially) instead of designing. Experience required with one or more of the following technologies: Rails &amp; Ruby, AngularJS, React, JavaScript.<p>Experience with Unix and the command line is preferred.<p>Also, the main language in the office is Dutch and you will be expected to learn it if you do not already know it. Initially you can get by with English.<p>For the job you&#x27;ll have an interview with two developers where we&#x27;ll talk with you about past projects, technologies, programming languages, your interests, etc. Then there will be a second interview with the local manager which will focus more on the &#x27;soft&#x27; side of things, perhaps even salary.<p>If you make it through those two interviews you&#x27;ll have a short (hour long), on-site coding exercise just to see how you go about solving a problem. It&#x27;s a relatively simple exercise, you can ask questions, look stuff up on-line and it doesn&#x27;t have to be finished. It&#x27;s to give us a global impression on how you handle things.<p>More information here: <a href=\"http:&#x2F;&#x2F;netscoutrccorp.peoplefluent.com&#x2F;viewjob.html?erjob=342\" rel=\"nofollow\">http:&#x2F;&#x2F;netscoutrccorp.peoplefluent.com&#x2F;viewjob.html?erjob=34...</a><p>If you&#x27;re interested contact gertjan.schoenmaker@arbor.net","time":1470227974,"type":"comment"}