{"by":"DiegoSM","id":12261372,"parent":12202865,"text":"Tenfold | Austin, TX | Full-Time | On-Site | Product Manger<p>We believe that access to data and rising customer expectations are driving a fundamental shift in the way businesses make decisions and develop products. Our customers need help drawing insights from data to discover opportunities for improvement and to measure the impact of their actions on customer behavior. We’re looking for a senior product person to build the analytics tools that will help our customers navigate this world.<p>Things you’ll own and do:<p>- A strong point of view and vision for Tenfold&#x27;s products<p>- Direct customer interaction with sales leaders at our strategic customers<p>- Organizing user focus groups and user testing<p>- Public facing advocate for Tenfold&#x27;s sales engine and test results<p>- Usability testing with engineering and UI&#x2F;UX teams<p>- A&#x2F;B testing feature releases<p>- Fostering a culture of deep customer empathy in our data and infrastructure engineering teams<p>- Define and own a set of customer-facing reporting SLAs<p>- Define and manage the analytics team backlog<p>REQUIREMENTS<p>- 3-5 years SaaS product management experience, preferably working with user centric products where daily usage is high (strong bias for building functional products that people enjoy using)<p>- A technical background--you’ll need to be comfortable working with engineers<p>- Experience partnering with customers, design, engineering, and go-to-market teams to define a strategic product roadmap<p>- An analytical mindset. You approach problems from an inquisitive and scientific perspective and are always looking for data to help make decisions, but you know how to balance quantitative and qualitative insights<p>- Great communication skills. Asking questions, listening and driving group decision-making<p>- An understanding of the online marketing&#x2F;web analytics landscape, supported by a background in statistics and experience with A&#x2F;B testing and experimentation techniques<p>- Demonstrated entrepreneurial or leadership activities<p>- A solid understanding of basic statistical concepts<p>Apply: <a href=\"https:&#x2F;&#x2F;tenfold.workable.com&#x2F;jobs&#x2F;313683\" rel=\"nofollow\">https:&#x2F;&#x2F;tenfold.workable.com&#x2F;jobs&#x2F;313683</a>\nContact: diego@tenfold.com","time":1470834685,"type":"comment"}