{"by":"atto","id":7679704,"parent":7679431,"text":"FortyTwo — Mountain View, CA — Frontend &#x2F; mobile &#x2F; backend (H1B okay, read below)<p>Hi all, I&#x27;m Andrew from FortyTwo. We&#x27;re a well-funded Series A startup (~10 engineers) in Mountain View building <a href=\"https://www.kifi.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kifi.com&#x2F;</a>. It&#x27;s a lot more than a bookmarking service: we&#x27;re building a search engine and content discovery system that blows away what&#x27;s out there by letting you organize everything super easily, while not asking you to change your searching habits. We have a product that we love, and have lots to do still.<p>Right now, we&#x27;re looking hard for:<p>• Frontend - we&#x27;re building a cross-browser browser extension and a site using AngularJS. Ideal candidate is very comfortable with JavaScript, at least one backend (non-JS) language, and has used a thick-client MV* style framework. Full description is here: <a href=\"http://www.42go.com/frontend.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.42go.com&#x2F;frontend.html</a><p>• Mobile - we&#x27;re building an iOS client as well as starting an Android client. Ideal candidate has experience releasing consumer mobile products, and has strong engineering skills to make an efficient and pleasant-to-use app. More here: <a href=\"http://www.42go.com/mobile.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.42go.com&#x2F;mobile.html</a><p>• Backend &#x2F; Full stack - we use Scala, Play!, and Akka to build a highly-available, reactive backend to serve our clients. Ideal candidate has experience on the JVM, functional programming, and continuous deployment. More here: <a href=\"http://www.42go.com/join_us.html#backend\" rel=\"nofollow\">http:&#x2F;&#x2F;www.42go.com&#x2F;join_us.html#backend</a><p>We blog at <a href=\"http://eng.42go.com\" rel=\"nofollow\">http:&#x2F;&#x2F;eng.42go.com</a>, so check out some of the stuff we&#x27;re working on. We&#x27;re okay to sponsor H1Bs, but prefer Bay Area candidates already so we can move faster. To apply, email towel@42go.com with your resume&#x2F;github&#x2F;LinkedIn.","time":1398952351,"type":"comment"}