{"by":"p5","id":7679449,"parent":7679431,"text":"Pond5 - Prague, Czech Republic or Switzerland - REMOTE POSSIBLE<p><a href=\"http://www.pond5.com/index.php?page=jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.pond5.com&#x2F;index.php?page=jobs</a><p>Software Engineer<p>Job Description: New York City based Pond5 is seeking an experienced, energetic, motivated and quick thinking software developer to join our Engineering team. We are a small team of experienced engineers and we are looking for a new team member!<p>The tasks will be all things engineering related at Pond5. These could include, but are not limited to: - Python&#x2F;Golang scripts for processing video&#x2F;image&#x2F;sound etc - Implementing new features on the website, improve existing functionality, improve performance - Working on exciting new projects<p>You should be able to work to deadlines, be able to think for yourself and work remotely without hand holding. You must speak and write fluent English. It would be preferable if you spoke a few languages. Our main office is in New York City, but we are looking for people for our Prague office or Switzerland, hence ideal candidates should be located in Prague, Czech Republic or in Switzerland, however remote candidates will be considered if they have an ideal skillset. Please note that you should be within the CET time zone, or not too far away from it. The very, very right person in EST time zone might also be considered.<p>Requirements: BS, MS or PhD in Computer Science or related engineering discipline and 3+ years of industry experience. Experience and expertise writing innovative and elegant code using Php, Javascript + at least another major language (e.g. Python, Go&#x2F;Golang, C++, Java) Excellent verbal and written communication skills, a team player with strong analytical, problem solving, debugging and troubleshooting skills. Experience with large traffic sites No stranger to Scrum, Linux, Git, Postgresql, Sql, jQuery<p>Nice to have: Node.js, Solr, Elasticsearch, Docker, Hadoop, EnterpriseDB, MongoDB, Redis, Nosql<p>About Pond5.com: Pond5 is the world’s most vibrant marketplace for creativity. Media makers find the content they need, and make money doing what they love. We allow our contributors to set their own prices, and we split the revenue 50&#x2F;50 on every sale — more than twice the industry standard.","time":1398949567,"type":"comment"}