{"by":"cmb2874","id":7679731,"parent":7679431,"text":"Fonality Inc. - Culver City, CA<p>iOS Engineer<p>Come Work for a Leader in Unified Communications Software!<p>Fonality is a well-funded Communications Software-as-a-Service (SaaS) company that provides unified phone systems and applications for growing businesses. We are a team of 250+ engineers, support professionals, operations and finance experts, sales reps and marketers who work together to delight our clients and have a little fun.<p>We are looking for an iOS Engineer for our growing Engineering team in Culver City. This person will be responsible for development and design of Fonality’s UI architecture and interface for our next generation iOS applications. The candidate will participate in design sessions, work closely with product &amp; other non-technical staff, perform heads down development, work with QA on test plans, and create necessary documentation.<p>At Fonality we know developers fear hate the dreaded hour long application process so we have made things easy on you. Our online application is one page and will take no more than 5 minutes. Your resume will go directly to someone on our recruiting team rather than be sorted for keywords.<p>What we’re looking for:<p>A candidate comfortable with front-end web application development in HTML, xHTML, JavaScript, CSS, VTL, AJAX, XML, XSLT or a similar environment\nExperience in iOS application architecture environment  consisting of code review, project scoping and debugging\nSomeone who has shipped applications to the iPhone App store\nFamiliar with other mobile application development technologies a plus but not required.<p><a href=\"http://fonality.catsone.com/careers/index.php?m=portal&amp;a=details&amp;jobOrderID=3741363\" rel=\"nofollow\">http:&#x2F;&#x2F;fonality.catsone.com&#x2F;careers&#x2F;index.php?m=portal&amp;a=det...</a><p>Manager, IT Systems Administration – Los Angeles, CA<p>Come Work for a Leader in Communications Software!<p>Fonality is a well-funded Communications Software-as-a-Service (SaaS) company. We provide VoIP phone system services which outperform brand-name, enterprise-level solutions for a fraction of the price. We’re looking for creative people with world-class skills who thrive in an energetic setting and are passionate about their lives and their work.<p>We are seeking a Manager of IT Systems Administration who’s primary responsibility will be to ensure a high degree of operational stability by effectively managing hardware, software, phone, and basic network support to the entire user community including remote workers. Operational stability is established by ensuring restoral procedures are maintained and tested. Production management procedures are needed to address any service disruption from a defect to a disaster. This position ensures that a high level of end user satisfaction is maintained by providing operational stability. The IT System Administration manager works with Director, IT to develop standards, policies and procedures.<p>Responsibilities:<p>(30%) Coordinate and act as gate keeper for all system related projects to ensure a standard configuration. Areas of focus include, but not limited to: Windows, Active Directory, linux, VoIP, software update solution, Anti-Virus, portals etc.\n(30%)  Hands on Implementation and project manage IT systems projects including: Corporate moves, account provisioning, standardize desktop images, software update infrastructure, file management and office automation including email.\n(20%) Lead specification, procurement and deployment of IT system services. Hands-on system administration and maintenance of IT services including the: users, groups, queues, directory structures, rights and security etc.\n(10%) Troubleshoot problems, respond to the needs of the users concerning access to resources including onboarding and off boarding processes\n(10%)  the following:\nRemain abreast of changes in industry standards and practices, keeping management informed of changes that have potential impact on company information technology resources\nTrain end users on new technologies and upgrades\nComplete special projects and priorities as assigned.\nPerforms other duties as assigned.<p>Preferred Skills and Experience:<p>Four-year college degree, or equivalent level of experience.\nFour or more years of experience managing IT systems related projects. Must have experience Windows server installations, technology evaluations and system management practices\nThree years of general IT management&#x2F;supervisory experience including managing sub-contractor relationships for technology-driven projects.\nTwo years of Disaster Recovery and Project Management experience is preferred\nExcellent Communication skills (Written, Verbal, and Presentation) with ability to sell concepts and ideas to a diverse range of internal and external customers\nMCSE or equivelant certification preferred\nProject Management certification, or equivalent preferred\nProven ability to lead, direct and supervise vendors. Experience in outsourcing technology processes and then managing the performance of a third party\nAbility to see the big picture and how the impacts of change and&#x2F;or a catastrophic event could affect the goals of the company\n24x7 On Call Availability expected<p><a href=\"http://fonality.catsone.com/careers/index.php?m=portal&amp;a=details&amp;jobOrderID=3697956\" rel=\"nofollow\">http:&#x2F;&#x2F;fonality.catsone.com&#x2F;careers&#x2F;index.php?m=portal&amp;a=det...</a><p>QA Engineer - Culver City, CA<p>Come Work for a Leader in Communications Software!<p>Fonality is a Communications Software-as-a-Service (SaaS) company based in Dallas, Texas. We provide VoIP phone system services which outperform brand-name, enterprise-level solutions for a fraction of the price. We’re looking for creative people with world-class skills who thrive in an energetic setting and are passionate about their lives and their work.<p>We are seeking a QA Engineer in our Culver City office. This person will be responsible for supporting test lab setup, documentation, execution and management of QA test plans and cases, tools, and best practices in a way that will produce high-quality, secure applications&#x2F;software that will meet functional requirements. The ideal candidate will provide both preventative actions to avoid similar future problems, and to make recommendations on corrective actions to resolve existing product and customer problems.<p>Responsibilities:<p>Build&#x2F;own the appropriate QA environment and integration systems testing\nDefine test plans and test specifications for functional, integration and regression testing, hands-on execution of test cases, and reporting product failures of all Fonality products\nFollow project milestones\nProvide guidance and expertise to QA team on testing methodologies and techniques for use in their daily activities.\nProvide guidance and support on troubleshooting production issues.\nReport status and team updates back to the Director of Quality Assurance in the US<p>Preferred Skills and Experience:<p>Five plus years of experience in a Quality Assurance or related field\nTwo plus experience with software quality assurance and testing methodologies\nTwo plus years of team lead&#x2F;management experience preferred\nFamiliarity with internet&#x2F;web development tools (PHP, browsers, JavaScript)\nHands-on experience in building test automation frameworks for complex enterprise applications\nAbility to perform all aspects of QA including functional testing, test planning, defect reporting, release management, and effective communication of status throughout the process.\nExcellent analytical and troubleshooting skills.\nOutstanding communication skills and attention to detail.\nOrganized and reliable, able to efficiently manage multiple tasks.<p><a href=\"http://fonality.catsone.com/careers/index.php?m=portal&amp;a=details&amp;jobOrderID=3714648\" rel=\"nofollow\">http:&#x2F;&#x2F;fonality.catsone.com&#x2F;careers&#x2F;index.php?m=portal&amp;a=det...</a>","time":1398952591,"type":"comment"}