{"by":"krg","id":7679541,"parent":7679431,"text":"TechEmpower - Los Angeles area, California (El Segundo, near LAX)<p>You may recognize us from the Web Framework Benchmarks that have been discussed on HN periodically: <a href=\"http://www.techempower.com/benchmarks/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.techempower.com&#x2F;benchmarks&#x2F;</a> (Look for Round 9 to be published later today!)<p>Here&#x27;s the job:<p>TechEmpower, a small custom software development firm located in El Segundo, seeks developers with good object-oriented experience, preferably in Java, JavaScript, Python, and&#x2F;or Ruby. We specialize in web application development but look for well-rounded application developers. If you are a solid programmer and a team player, this is an opportunity for you. Even if you don&#x27;t have experience with everything listed in this ad, we offer excellent learning opportunities for those who are eager to expand their skill sets. Job Responsibilities<p>Working in small development teams, programmers participate in the architecture, design, and implementation of primarily Java, JavaScript, Python, C#, Ruby, and PHP code to meet client requirements for robust, high-performance, and secure sites and applications. Developers get exposure to several client projects and a variety of technologies over time. Job Qualifications<p>In addition to overall programming capability, candidates must have experience working on collaborative development teams and very strong communication skills. While we employ and enjoy the company of extroverts and introverts alike, we reiterate that the ability to communicate clearly is a must-have for our technical staff. That means writing professional e-mails and interpreting the nuances of clients&#x27; requirements by asking good questions, for example.<p>We work hard to estimate projects accurately so that schedules are reasonable and developers work a normal amount of hours per week. We rely on developers to contribute to those estimates and provide feedback as a project goes along to keep things on track.<p>Ideal candidates will have experience building all facets of software systems including the data model, business logic, and front-end. 3+ years of object-oriented design and development in Java, JavaScript, Python, or Ruby is desired. On the front-end, HTML 5 and CSS experience is required.<p>Knowledge of some or all of the following specific tools and technologies is a plus:<p><pre><code>    Languages: Java, JavaScript, Python, C#, Ruby, PHP\n    Tools: Continuous Integration (Jenkins, Hudson, etc.), static code analysis (Sonar, etc.), Eclipse, IntelliJ, Ant, Maven\n    Web: vert.x, Play, Spring, Django, Rails, node.js, JSP, Servlets, jQuery, etc.\n    Mobile: iOS, Android, PhoneGap, jQuery Mobile or similar\n    Hosting: AWS (EC2, RDS, etc.), cloud servers, Linux configuration, application servers (Resin, etc.)\n    Data Persistence: ORM (Hibernate, etc.), MySQL, Postgres, MS SQL Server, Oracle, NoSQL (CouchDB, MongoDB, Cassandra, etc.) \n</code></pre>\nWe like technical people who are not afraid to have strong opinions about technology but simultaneously keep an open mind and are flexible enough to work with whatever technology the task at hand requires.<p>That said, we&#x27;re mostly looking for great developers who are great to work with. If you don&#x27;t have experience with everything listed above (and who does?) but are still a solid developer eager to learn new things, you might be a great fit here.<p>Please apply here: <a href=\"http://jobs.techempower.com/hn\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.techempower.com&#x2F;hn</a>","time":1398950688,"type":"comment"}