{"by":"ssharpe67","id":7679728,"parent":7679431,"text":"Datalex - Atlanta, GA\nReady to use your tech skills and join the travel retail revolution?\nEach year, Datalex’s award-winning software enables travel shopping requests for our customers all over the world. Our customers are leading travel retailers such as Delta Air Lines, Aer Lingus, Frontier Airlines, Trailfinders, STA Travel and many more. Join the revolution in travel shopping and loyalty for travelers worldwide.\nDatalex is seeking a Hosting Engineer to join our infrastructure team responsible for building and maintaining mission critical devices that host many of our customers.  Current technologies are Cisco switching, Cisco firewalls, Checkpoint firewalls, F5 BigIP load balancers, F5 ASM web app firewalls, Dell servers, Citrix XenServer virtualization, NetApp storage arrays, and a range of cutting edge open source software.  With a strong customer base and a significant customer pipeline, now is a perfect time to become part of this team.\nInitial projects and activities for the role will be in the network and load balancing realms, with an opportunity to, and an expectation that you will, increase your knowledge with the other technologies our team utilizes.  Ideal candidates will possess the following,\n- 2+ years with Network, Security, and Linux technologies\n- Hands on experience with virtualization technologies\n- Capacity planning, monitoring, and reporting\n- Ability to prioritize and compartmentalize based on service level agreements and agreed obligations\n - Team Player is a must\n- Scripting experience is a plus\nIf you would like to join an organization leading innovation in travel retail for the world’s most forward thinking airlines and agencies, send your resume to recruitment@datalex.com and tell us about yourself and how you can make both of us even more exceptional.\nPlease share the following in your cover letter:\n-What technology project are you most proud of that you did for fun?\n-What is the most impressive technology you have recently worked with and why?\n-Why do you think you would be great at this position?\nWe look forward to hearing from you!","time":1398952561,"type":"comment"}