{"by":"aj_icracked","id":7679995,"parent":7679431,"text":"iCracked (W12) is looking for full stack hackers to take over the warranty, repair, and buyback space for iOS devices- And we&#x27;re winning.<p>iCracked is looking for a Full Stack Developer to join its team and create the ultimate on-demand online and offline customer experiences. You should have Full Stack abilities, amazing PHP and SQL skills, and be all around awesome.<p>Think of us as the Uber meets AAA of iOS devices. iCracked started on a college campus repairing iPhones 2 years ago. Now, we have a geo-locational, on-demand dispatch service going out to over 500 iTechs in 11 countries around the world. This allows anybody to sell or repair their iPhone, iPod, or iPad whenever, wherever. We are Y Combinator (W12), very well funded, and looking for talented developers to join our team.<p>We have an incredible, core team of 55 with beautiful office spaces on the water in Redwood City. You&#x27;ll be joining a talented team of developers and designers to bring together the ultimate on-demand and on-location buyback and repair experience for thousands of existing customers and millions of potential customers around the world. We&#x27;re working with all kinds of fun data, visualization, APIs, and services to provide a new kind of market and customer experience never seen before.<p>We&#x27;re moving fast. We build, iterate and ship constantly so you will be pushing code to production all the time. This is an exciting time to get in a position at the company, as you&#x27;ll be able to be involved in a lot of the big picture development for our exciting projects in the pipeline.<p>What we’re looking for in you:<p>• Full Stack Abilities<p>• PHP Mastery (We’re always using the most of what PHP has to offer, so you should be well versed and unafraid to dive into the newer features of the language), SQL Dominance, and everything in between<p>• A love for grepping logs, SSHing around, and editing config files<p>• Drive (Our business is growing fast, so we need developers who aren’t afraid to take charge of a project and see it through to completion)<p>• All Around Awesomeness (Everyone here is friendly, intelligent, and very outgoing, and we want to invite more people like that to continue making the company an awesome place to work)<p>With iCracked, you wouldn’t be starting a new job; you would be joining a family. We take care of all team members and provide almost all amenities to make everybody’s lives better.  Salary is negotiable and we have set aside great equity packages and other benefits for you.","time":1398955073,"type":"comment"}