{"by":"splitrocket","id":7680489,"parent":7679431,"text":"Significance Labs - Brooklyn, NY - <a href=\"http://significancelabs.org/\" rel=\"nofollow\">http:&#x2F;&#x2F;significancelabs.org&#x2F;</a><p>We at Significance Labs believe that technology can help to solve real problems for low income Americans and we are looking for excellent engineers to help us in our mission. Significance Labs is a not-for-profit socially conscious tech incubator in the heart of Brooklyn, focusing on bringing the lean startup methodology to the world of charity.<p>We are looking for a handful of excellent, experienced full stack engineers who want to do more with their talents: take on a project that really matters, something that leverages the power of technology to help make the world a better place. To that end, we are offering a ten week residency, beginning in June, at our office in downtown Brooklyn, working with some of the best people in the business, experts in the field, academics, designers and technologists to tackle some of the real problems of poverty.<p>You will be working with our fellows, in small teams, developing an app from scratch, with direct feedback from the very communities we are trying to help. This isn&#x27;t a hackathon where your code gets left in the dustbin sunday night: we are going to be building projects that will continue to make a real difference long after the summer is over.<p>What you’ll get<p>* Co-Working space in downtown Brooklyn<p>* Expert engineers, entrepreneurs, UI and UX people as mentors<p>* Local collegiate interns as dedicated as you<p>* At the end of the cycle, we will do a demo day with VC’s, foundations, government organizations, etc. to help take the product and team to the next level.<p>* An honorarium to pay your rent and bills.<p>You are a talented engineer, and could work anywhere: Why join us?<p>This is an opportunity to build a greenfield project that really matters, something that leverages the power of technology to help make the world a better place. This is your chance to be the CTO of a social enterprise, level up your skills, and work with some of the best people in the business solving some of the most important problems of our time.<p>This isn’t just another gig, nor is it your friend’s crazy idea about how to disrupt some market... This is about changing the world for the better.<p>If this sounds like something you’d be interested in, you can find out more and apply here: <a href=\"http://significancelabs.org/hackers\" rel=\"nofollow\">http:&#x2F;&#x2F;significancelabs.org&#x2F;hackers</a><p>LOCAL\nREMOTE\nFULL TIME","time":1398959413,"type":"comment"}