{"by":"robotsasquatch","id":7680139,"parent":7679431,"text":"Whistle — <a href=\"http://whistle.com\" rel=\"nofollow\">http:&#x2F;&#x2F;whistle.com</a> — Mission, San Francisco, CA<p>Whistle is the world’s first technology company dedicated to helping pets live longer and healthier lives. Through intuitive devices and a comparative database of pet health information, Whistle is creating a new standard for preventative care and fueling groundbreaking insights to transform veterinary medical research.<p>We are a company filled with people who love their pets and are passionate about building great products. Between the pack we have collective experience across the Fortune 500 in technology and consumer products, including: Amazon, AOL, Apple, Bain, BCG, Genentech, Google, HP, Microsoft, Philips, Sierra, and TI.<p>---------------------------------------------------------<p>Android Engineer<p>Whistle currently seeks a Senior Mobile Developer with a strong background building top-notch mobile experiences on Android. You’ll work with our hybrid mobile team on both our iOS and Android apps building fun and intuitive interfaces for our pet-loving customers.<p>---------------------------------------------------------<p>Ruby on Rails Engineer<p>Whistle currently seeks a full-stack Ruby on Rails Developer with a strong background building reliable API platforms and top-notch web interfaces. You’ll work with our engineering staff on a variety of projects, including our mobile API, customer and internal facing web experiences, and scaling our platform as our number of customers grows.<p>---------------------------------------------------------<p>Electrical Engineer<p>Whistle is looking for a talented electrical engineer to assist in development of cutting-edge, small form-factor wireless products.<p>---------------------------------------------------------<p>Visit <a href=\"http://www.whistle.com/company/#careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.whistle.com&#x2F;company&#x2F;#careers</a> to apply.","time":1398956399,"type":"comment"}