{"by":"chriswoodford","id":7680760,"parent":7679431,"text":"Gobble (YC14) - Menlo Park, CA - <a href=\"http://gobble.com\" rel=\"nofollow\">http:&#x2F;&#x2F;gobble.com</a><p>Gobble works with top local chefs to bring the world’s favorite dishes freshly-made to your door. Each dish is prepared using local ingredients and healthier recipes, providing not-so-greasy versions of your &quot;go to&quot; takeout options. Our dishes are inspired by the individuality, creativity and cultural heritage of our chefs from around the globe. From Dragon Rolls to Braised Brisket, Gobble has something healthy and exciting for everyone. Local families absolutely love the service so far (4.5 stars on Yelp!), and we&#x27;re only just getting started.<p><i>Bay Area Community Manager</i><p>Calling all aspiring and veteran community managers who love cooking and learning about food! We are looking for someone who can be the voice of our exciting company and help us best communicate with our customers.<p>Now, this is where you come in... Our operations are up and running, and it&#x27;s time to go beyond doing the bare minimum. We need a smart, energetic team player to join our team of five as the first ever Gobble Community Manager.<p>We know this title usually suggests some kind of social media management, but this role goes way beyond that. When we say community manager, we mean that you will be the person who represents who we are to the outside world. You will also be responsible for bringing outside input to our team to help us continually improve our product. We want someone who can sit at the team meetings with us as an equal with the founders and really think about what we want to communicate to customers and how we can do better.<p>The kinds of things you&#x27;ll be doing are endless, but here&#x27;s a starter list of duties:<p>* Customer happiness - you will be talking directly with customers every day and making sure they&#x27;re happy with our product. If they&#x27;re not, you&#x27;ll also be the one to help us fix that. You will be the frontline of defense when it comes to making sure we are attending to customers&#x27; needs.<p>* Writing our weekly newsletter - this is our one source of outgoing communication so it&#x27;s pretty important to make sure it conveys exciting product updates and food world content that aligns spot on with our company values.<p>* Incorporating customer feedback into the product - You&#x27;ll be the one hearing all their feedback and making sure we can turn it into actionable product changes.<p>* Whatever occurs to you and whatever comes your way. You are joining an early early stage startup so we expect you to figure out what needs to get done so that we can successfully communicate with our clients and implement it as needed. We also expect you to be flexible and take on any necessary tasks that might not fit your job description.<p><i>Requirements:</i><p>* A bachelor&#x27;s degree. If you don&#x27;t have one, feel free to convince us of why you&#x27;re still a fit.\nTeam spirit. Have we mentioned we&#x27;re a tight-knit group? We want someone who wants to be part of a team and is a good team played and contributor.<p>* Willingness to dive in. We&#x27;re not looking for someone who wants a 9-5 job. This is just not what that is! We want someone who will join us and think and act like a company founder.\nPrecision. We&#x27;re a team that doesn&#x27;t miss a detail or a beat. You should be highly organized and 100% on your game at all times.<p>* Previous experience in a writing role. Whether it&#x27;s newsletters, emails, blog posts, or your college newspaper, you can quickly create content for our customers that is both creative and clear.\nPrevious experience in a people-facing role. Maybe you worked at an ice cream store one summer, or you worked in communications at a non-profit, or you made sales calls for a past startup. Grace under pressure is the key to success here.<p>* Excitement to join an early-stage company. Early-stage companies are a world of their own. They&#x27;re small and hectic, and it takes someone who loves this environment to succeed in it.\nExperience working at a startup is preferred, but not required. It would be helpful if you&#x27;ve been in this environment before and know what it&#x27;s about.","time":1398961452,"type":"comment"}