{"by":"Spoom","id":7680367,"parent":7679431,"text":"LDR Interactive — <a href=\"http://ldrinteractive.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;ldrinteractive.com&#x2F;</a> — Cleveland, OH — Full Time Local (Sorry, No Remote)<p>Come to LDR, and enjoy a fun and innovative environment. Our team is revolutionizing the media industry. LDR is growing, and we are looking for smart and driven people to join our team!<p>We&#x27;re a funded, profitable startup working in the broadcast media space.  We&#x27;re looking to expand our development team, and currently have two full time development openings available:<p>---<p>Lead Web Application Developer, TopicPulse<p>LDR Interactive has created an innovative social news platform called TopicPulse. TopicPulse provides publishers and broadcasters with automatic discovery of online content, such as news stories, as well as minute-by-minute analysis and insight into social activity (local or national) around a given story or piece of content. TopicPulse is a growing system with a great future!<p>LDR is looking to recruit a talented developer who can help expand TopicPulse’s feature set and positively influence the trajectory of the product. Our ideal candidate takes pride in finding elegant solutions to hard problems and writing efficient, understandable code.<p>---<p>Senior Web Application Developer<p>LDR has a team of highly talented software engineers who have built our scalable interactive platform that connects listeners with our AM &#x2F; FM &#x2F; Internet radio partners.<p>Now, we have an opening for a full-time software engineer on our evolving team. Our company and engineering team has been expanding this year, and we are looking for a special person for this new Web Application Developer position.<p>---<p>Stuff we like &#x2F; use (and things with which ideal candidates should have experience):<p>Backend:<p>- PHP (modular, object-oriented, 5.4+)<p>- MySQL (MariaDB technically)<p>- Apache (and nginx)<p>- Linux<p>- Chef<p>- ElasticSearch<p>- Node.js<p>- Redis<p>- MongoDB<p>- Memcache<p>Frontend:<p>- HTML (duh)<p>- Javascript<p>- jQuery<p>- Bootstrap<p>Missing a couple of these?  Apply anyway.<p>See <a href=\"http://ldrinteractive.com/careers.php\" rel=\"nofollow\">http:&#x2F;&#x2F;ldrinteractive.com&#x2F;careers.php</a> for more details on both positions (in addition to our other openings) and to apply.  We&#x27;d love to hear from you!","time":1398958259,"type":"comment"}