{"by":"alexbrynza","id":7681108,"parent":7679431,"text":"Senior Quality Software Engineer, Seattle WA, EMC Isilon\n_________________________________Send me an InMail on LinkedIn. (Alex Brynza)<p>Isilon Storage Division of EMC2 is seeking an experienced Senior Software Quality Engineer (SQE) to join our Certification Test team. This role will directly impact the improvement of the quality of released code to our customers. In this position, you will leverage your coding and automation skills to ensure that the final product is adhering to the engineering and design specifications and product requirements.  The Certification team is responsible for running and automating system and product level tests, filing defects, assisting in root cause analysis of defects, driving the resolution of defects, monitoring regression test case runs and lists, and assuming the role of the customer.  To that point, you will be directly responsible in helping to prevent issues from reaching our customers.<p>Career paths in the Isilon Storage Division are paved by those who believe they have the ability to make a difference.  Engineers in our company are not confined into a very narrow set of responsibilities.  The opportunity to innovate presents itself daily as you complete your assigned tasks, such as writing and running test plans, test cases, and automation.  It is this drive to innovate, to do the right thing, that will encourage you to do whatever it takes to further engineering as a whole, the company, and your career.  She&#x2F;he should be passionate, self-motivated, analytical, and detail-oriented, and ready to become a key contributor.\nKey words: Scale-out Storage, NAS, Cluster, SMB&#x2F;NFS, OneFS File System, Quota, Dedupe, Snapshot, Storage Management<p>Primary Responsibilities:\n•\tResponsible for defining system tests and test plans based on requirements and technical specifications\n•\tExpected to influence other SQEs toward the style of iterative test automation and development\n•\tUses internal test harnesses to write and exercise automation following the automation SDLC for all automation produced\n•\tResponsible for improving product testability and designing for test.\n•\tServes as the team lead for several functional or system areas. Responsible for the execution of team and individual test plans on schedule.\n•\tDebug and analyze test results to verify functionality and recommend corrective action in the case of failure\n•\tIsolate, reproduce and track bugs and verify bug fixes\n•\tWrite test automation in Python and Perl\n•\tMaintain tests and code in source control\n•\tOwn features or areas of the product certification and complete all aspects of the QA process on those areas- system integration and product certification\n•\tDesign and execute tests including performance benchmarking, stress, Longevity, Regression and BVT \n•\tWork closely with developers on defect resolution\n•\tFully competent in the design, implementation, and maintenance of a test environment, including necessary equipment, configuration, and software\n•\tProvide solutions for a wide range of complex problems\n•\tIndependently determines and develops approach to solutions, under limited direction\n•\tBuild and maintain testing tools, website and wiki\nJob Qualifications:\n•\tBS in Computer Science, related degree or equivalent experience\n•\tMinimum 5-10 years of experience in testing software, preferably in a\ncross platform environment (Windows, Unix)\n•\tInfluence the improvement of the automation framework and test infrastructure through the automation SDLC process\n•\tExperience logging&#x2F;resolving defect issues using a tracking system (like Bugzilla, Testopia) and source control like SVN preferable\n•\tStrong Unix&#x2F;Linux knowledge. Windows system administration skills a plus.\n•\tSolid experience with one or more of the following programming languages: C++, Python, Perl, sh&#x2F;bash scripting, Java or C. \n•\tFamiliarity with building open-source applications; (e.g. make, configure, automate).\n•\tExperience troubleshooting issues in large complex networks and systems including storage.\n•\tStrong ability to quickly learn new technology and new products.\n•\tAbility to work in a demanding environment while ensuring the highest quality of work.\n•\tAble to work independently or part of a team under pressure and against deadlines.\n•\tStrong written and verbal communication skills.\n•\tImpacts product delivery dates by executing all responsibilities within schedule and developing strategies to improve test time\n•\tIs a clear cross-functional leader and well respected.","time":1398964131,"type":"comment"}