{"by":"dermazer","id":7681293,"parent":7679431,"text":"Contact Jordan@scopely.com for more info!<p>Los Angeles<p>VISA, FULL TIME<p>SCOPELY (www.scopely.com)<p>Title: Lead&#x2F;Sr. Data Wizard&#x2F;Engineer&#x2F;Master&#x2F;Munger<p>Cloud hosting, external API consumption, data ingestion and batch processing services like Hadoop are your focus if this is the right position for you.<p>What will you do?<p>Build an A&#x2F;B testing service to help project revenue outcomes of potential games<p>Automate the import of data from a variety of sources (ad providers, for example) into a singular data source. \n(Technical: RESTful API, AWS, Command Line Code)<p>Aggregate, normalize and process data and work with Product Managers in an effort to gain perspective on user behavior and monetization strategy. (Technical: Python, RedShift, MySQL, Hadoop)<p>Produce automated high-level reports, dashboards and visualizations for many teams at Scopely including Revenue Operations and Product Management. (Technical: Pandas&#x2F;Python ---&gt; Tableau, d3)<p>Create the infrastructure to drive an ad-mediation service for determining optimal ad-selection for certain users via application of intelligent algorithms (Technical: Green field)<p>What do you need?<p>Batch processing service experience via Hadoop or similar proprietary variants (Voldermort, etc.)<p>Python or Perl or Shell Scripting programming experience (OO)<p>SQL Mastery. Inner and outer joins, windowing functions, you should know it all.<p>Experience with third-party API integration.<p>AWS or similar experience. Big plusses for S3&#x2F;Redshift experience.<p>Experience in large throughput environments.<p>Stats, for perspective:\nDaily data ingestion rate: ~100 GB per day\nSQS: approx. 35 million messages per day\nNumber of rows in the largest table &gt; 4 Billion\nSize of the largest table = ~ 1TB\nTotal row count in our Data Warehouse &gt; 35 Billion\nTotal size of our data warehouse &gt; 9TB\n1.2B API requests per week - all generating analytics events.","time":1398965609,"type":"comment"}