{"by":"curiousphil","id":7682478,"parent":7679431,"text":"Curious Media\nNampa, Idaho. (15 miles west of Boise)<p>Full-time Server-Side Engineer<p>Email: jobs@curiousmedia.com<p>Curious Media is a full service interactive agency that produces websites, games and interactive experiences for some of the leading children&#x27;s entertainment brands. (Disney, PBS Kids, Warner Bros., Random House, Scholastic) We produced the websites for both Wreck-It Ralph and Frozen from Disney Animation Studios to name just a couple high profile projects that we were responsible for.<p>We are also working on some cutting edge projects in-house, including one that is going to take robotics programming to kids all over the world in a way thats never been done before.<p>We have a highly creative team of 18 in our Nampa Idaho office. If you are looking to move to a beautiful, low cost of living area but continue working on cutting-edge, highly gratifying projects, check us out!<p>Duties and Responsibilities:<p>• Translate project requirements into scalable, reliable, and secure server-side web services and APIs<p>• Design and implement relational database schemas<p>• Configure, secure, and maintain Linux servers (CentOS, RHEL, Ubuntu)<p>• Configure and secure web server software (Apache, Nginx)<p>• Maintain internal software and tools (SVN, NFS, various workflow tools)<p>• Manage data archival, data backup and recovery strategy<p>• Communicate in technical and non-technical terms to various audiences<p>• Define technical project requirements, plan implementation, deploy changes, and evaluate performance<p>• Provide reasonable estimates of time and resources required to complete goals outlined by Project Managers<p>Required Skills and Experience:<p>• PHP<p>• Python<p>• Shell Scripting<p>• Apache and Nginx<p>• SVN administration<p>• API creation and consumption (REST, CRUD)<p>• Relational Database Architecture (MySQL, PostgreSQL)<p>• Web-scale environments (High traffic, load balancers, CDNs)<p>• Linux server administration and security (CentOS, RHEL, Ubuntu)<p>• Demonstrated ability to write organized and secure server-side code<p>Strong Plus:<p>• Django<p>• Flask<p>• Drupal<p>• Redis<p>• SQL performance tuning<p>• Client-side web development (HTML5, CSS3, JavaScript)<p>• Open source software contributions and personal projects<p>• Bachelors degree in Computer Science or equivalent degree<p>Send a note to jobs@curiousmedia.com if interested!","time":1398975605,"type":"comment"}