{"by":"cjwake","id":7682539,"parent":7679431,"text":"Nanosatisfi — San Francisco, CA - <a href=\"http://ardus.at/careers002\" rel=\"nofollow\">http:&#x2F;&#x2F;ardus.at&#x2F;careers002</a><p>FULL TIME: Embedded Software Developer<p>Can email chris@nanosatisfi.com with any questions<p>==============================<p>Looking for developers with experience in:<p><i></i> C&#x2F;C++<p><i></i> Embedded platforms: TI OMAP &amp; Sitara, ATMEL AVR &amp; ARM, Freescale, Blackfin, FPGAs or equivalent.<p><i></i> Real-Time Operating Systems - FreeRTOS, RTLinux, VxWorks, or equivalent.<p><i></i> Sensor Integration - CMOS Cameras, GPS, Radio, etc. I2C, SPI, CAN<p>==============================<p>Ideal candidates would also possess experience in one or more of the following areas:<p><i></i> System Operation — General GNU&#x2F;Linux &#x2F; Unix familiarity, scripting, networking, distributed monitoring &#x2F; logging (nagios, rsyslog, etc), configuration management (Chef &#x2F; Puppet), etc. Sysadmins must be no more than moderately grumpy.<p><i></i> Electrical Engineering — Discrete component and SMD soldering, microcontroller circuit design&#x2F;debugging, familiarity with oscilloscopes, signal generators, and other lab equipment. Wearable computing, robotics, and&#x2F;or quadcopter enthusiasts apply here.<p><i></i> RF — Familiarity with general RF theory, hardware and&#x2F;or software defined\nradios, ham and&#x2F;or satellite tracking hobbyists encouraged.<p>==============================<p>About Us<p>We are the fastest-moving space company on Earth. From back-of-the-napkin idea to in-orbit satellites in 1-year, we will eventually have over 100 satellites— upgraded regularly—in orbit at all times.<p>We are building the first ever remote-sensing platform capable of delivering unique data multiple times per hour from any point on Earth. Doing this requires solutions to some incredibly exciting challenges in the areas of spacecraft design and operation, sensor integration, radio communication, and big data analysis. From custom PCBs to a globally distributed communication network, we offer the fullest of stacks with challenges for makers, builders, and doers of all types.<p>==============================<p>Some perks:<p>We offer salary to live on, equity to retire on and health benefits in the meantime. Not to mention the perks of working in space, and a few little things to keep you smiling.<p><i></i> Competitive Salary &amp; Equity Compensation<p><i></i> Free On-site Parking for your car or bike<p><i></i> Multiple options for medical, dental and vision insurance<p><i></i> Office in SOMA nearby restaurants, food trucks, coffee<p><i></i> Flexible Hours — realistically, the company average is 50-hours per week<p><i></i> Flexible vacations + added time off around satellite integration periods<p><i></i> Stocked Kitchen with snacks and the occasional ice cream sandwich<p><i></i> If you’re invited to speak at a conference we’ll cover travel<p><i></i> The WOW FACTOR of actually working in space. Make your friends jealous.","time":1398976508,"type":"comment"}