{"by":"johnurbanik","id":7682500,"parent":7679431,"text":"Poptip (<a href=\"http://poptip.com\" rel=\"nofollow\">http:&#x2F;&#x2F;poptip.com</a> &#x2F; jobs@poptip.com) -- NYC (Gramercy&#x2F;Flatiron) -- FULL TIME -- Engineering &#x2F; Design &#x2F; Sales -- (In the process of becoming H1B friendly)<p>OPEN POSITIONS<p>--- Engineering ---<p>Engineer, Product Engineer, Streaming Data Engineer, NLP Engineer, Infrastructure Engineer, API Engineer, Mobile Engineer<p>--- Design---<p>Product Designer<p>--- Business&#x2F;Sales ---<p>Account Executive, Inside Sales Dev Manager, Account Manager<p>-<p>TL;DR: Social data, machine learning, NLP, real time &#x2F; streaming data processing. Mostly Go stack. SaaS products that Fortune 500 companies and huge organizations love and gladly pay for. More at <a href=\"https://poptip.com/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;poptip.com&#x2F;careers</a><p>-<p>Poptip is an information discovery and modern market research company focused on social conversation analysis. We focus on two products; a social polling product that has powered events like Time Person of the Year voting and a market research SaaS platform that allows brands to get deep insights on any topic by analyzing social conversation.<p>-    We have a proven revenue model (with clients like CNN, Budweiser, L&#x27;Oreal, and the NFL) and are growing rapidly.<p>-   Our stack includes Go, Node.JS, AngularJS, Redis, DynamoDB, Postgres, Kafka, CoreOS, and Vagrant, as well as some internal versions of other systems (like scalable websockets as a service).<p>-   We apply natural language processing and machine learning techniques to real-time streams of millions of social posts to wrangle actionable insights out the data.<p>Engineers:<p>We value the ability to communicate ideas clearly. You should be able to write well, speak your mind, and take feedback with humility. Engineers drive product decisions just as much as any other member of the team.<p>Designers:<p>Poptip was founded and is led by a designer. Unlike many B2B SaaS companies, an exceptional customer experience has been the heart of this company’s success since inception. As a member of the design team, you would hold a high level of responsibility by leading the development of new products, visual standards, and features.<p>Business&#x2F;Sales:<p>We have been selling our products from the beginning. Customers rely on Poptip&#x27;s suite of products on a daily basis to help drive their businesses forward. Our sales team exists to help businesses better understand consumers and maintain two-way relationships with them. We are building a world class sales team with opportunities in sales, account management, and sales development.","time":1398975782,"type":"comment"}