{"by":"mdellabitta","id":7683074,"parent":7679431,"text":"Appinions, New York<p>Software Engineer<p>Appinions is a SaaS Platform provider, helping Fortune 1000 companies like IBM, Oracle, Nissan, and Dell with Influence Marketing. Our platform uses patented natural-language processing and social network analysis technology developed at Cornell University to help companies identify and manage the people, ideas, and publications that drive their market.<p>Skills &amp; Requirements:<p>As a Full Stack Developer (Java &amp; Javascript) you will be involved in design and implementation of a range of new capabilities built on top of our influence-based data platform. You&#x27;ll work with amazing data apis and an great set of developers and researchers to produce compelling and scalable web-applications. Our senior engineers typically have at least 3 years of Java web development under their belt, but you should have a keen understanding of web application technologies both front-end and back. We currently use the Spring framework so some experience with Spring is ideal. You should have a strong grasp of common OO design patterns, familiarity with a variety of data-stores, and a passion for good API design and performance.<p>What You&#x27;ll Do:<p>Work in a team environment to build the next generation of influence-based applications\nPlay an important role in design and implementation of an important new set of internal APIs\nDevelop awesome new features front to back (using Java and JavaScript)\nWork with a team of developers and researchers ( who specialize in natural language processing, social network analysis) to create create scalable web apps with elegant, user-friendly design\nRequirements:<p>5+ years web development experience both server and client-side web-development\nAbility to architect complex applications using frameworks and APIs\nFamiliarity with Java\nExperience with client-side HTML&#x2F;CSS&#x2F;JSON&#x2F;Javascript&#x2F;JQuery&#x2F;AJAX\nExperience with server-side frameworks (Spring MVC&#x2F;REST&#x2F;Node.js)\nWorking knowledge with a variety of relational and nosql data stores (mysql, mongodb, hbase, redis)\nFamiliarity with cloud environment a plus (e.g., AWS)\nBasic unix shell skills\n* Strong user experience instincts\nPerks:<p>Work in our mid-town offices\nHealth, Dental, Equity, other benefits\nCompetitive compensation\nAdvancement opportunities<p>I&#x27;m an engineer here at Appinions, so feel free to AMA!","time":1398983719,"type":"comment"}