{"by":"lipsmack","id":7684495,"parent":7679431,"text":"London, UK - Football Radar<p>Frontend Developer<p>Football Radar is a young, profitable company which does advanced statistical analysis of football. We are looking for a Frontend Developer to help us deliver highly effective, maintainable user interfaces. You will have the opportunity to be involved in all areas of the platform, from trading dashboards to internal monitoring tools.<p>Skills and requirements:<p>The ideal candidate will be an seasoned Frontend Developer, with experience working with rich user interfaces and single-page applications. We are scaling up our business operations, and we need someone who can create powerful interfaces that help us grow.<p>We need developers with a keen understanding of browser performance and the unique constraints of rendering high volumes of data in realtime. Demonstrable experience of modular design and event-driven architecture is also highly desirable.<p>The role will include developing a clearly-defined build process, and working with various integration and functional testing frameworks to ensure that the interfaces we deliver are robust and maintainable.<p>Some of the technologies that power Football Radar:<p>* Backbone, Marionette, React, jQuery<p>* AMD (Require.js), CommonJS (Browserify&#x2F;Webpack)<p>* Grunt, Bower, NPM<p>* Node.js<p>* Mocha, Nodeunit, Istanbul, PhantomJS<p>Experience with all of these technologies is not a requirement, but a comprehensive understanding of the underlying concepts is expected.<p>Candidates should also have:<p>* At least 3 years of relevant industry experience<p>* A keen interest in usability and information architecture<p>* A strong understanding of emerging browser standards (W3C, WHATWG or otherwise)<p>* A willingness to provide support for production systems<p>* Strong communication skills<p>* The ability to work autonomously<p>About Football Radar:<p>We&#x27;ve grown rapidly and are amongst the best in the world at what we do, but we’ve retained the feel of a start-up: you manage your own time and have your say on what we do. We value team spirit and have inherited some social democracy from our Danish founders: everyone brings ideas to the table, and the best idea wins; our company structure is simple with very little bureaucracy.<p>What we offer:<p>* Competitive salary that is reviewed regularly, with an annual bonus option.<p>* Catered breakfast, lunch and dinners every day<p>* Fully subsidised private medical insurance with WPA<p>* Subsidised luxury Gym, 4 minutes from the office<p>* Great benefits package<p>* Ongoing intellectual challenge<p>* The choice of your own development kit","time":1399015797,"type":"comment"}