{"by":"eiphany06","id":7686132,"parent":7679431,"text":"INTERN&#x2F;VISA&#x2F;SUMMER CONTRACTOR\nSlice - <a href=\"https://slice.resumetracker.com/public\" rel=\"nofollow\">https:&#x2F;&#x2F;slice.resumetracker.com&#x2F;public</a> - Palo Alto, CA\nSlice, a well-funded startup in CA, is a wonderful place to work and grow as an entrepreneur, engineer, designer, data scientist, and statistics scientist.\nYou will be surrounded by brilliant, compassionate team members. This is an inspirational place to evolve as an entrepreneur and programmer, and the elite level of leadership among the founders, who are also professors at Stanford Graduate School of Business, is unparalleled. The networking and mentorship opportunities are amazing when immersed in this environment. Happy to chat.  Resumes&#x2F;Linkedin&#x2F;GitHub&#x2F;project pages&#x2F;portfolios to hannahft [at] stanfordalumni.org AND CC Sean [at] slice.com\nWe will consider candidates who need a VISA to work in California if you are able to start soon.<p><a href=\"https://slice.resumetracker.com/public/job_detail/1122\" rel=\"nofollow\">https:&#x2F;&#x2F;slice.resumetracker.com&#x2F;public&#x2F;job_detail&#x2F;1122</a><p>What&#x27;s the job:<p>We are seeking exceptional undergraduate or graduate students in computer science or related fields for a summer internship. You&#x27;ll design and develop super cool and useful features for our consumer Internet applications running in the cloud.  You&#x27;ll be working with an all-star team of folks to push out applications that will change the way people shop.<p>What are the responsibilities:<p>Design core software components and systems for our suite of Web and Mobile applications<p>Code using Java<p>Participate in design and code reviews<p>Analyze and improve efficiency, scalability, and stability of various system resources<p>Work closely with the product and design teams and other engineers to define the best user experience, with a particular eye for reliability, performance and scalability<p>What are the requirements:<p>BS or MS candidate in Computer Science, EE or related field\nProgramming experience in one or more of Java, C&#x2F;C++, Python, Javascript&#x2F;AJAX\nA solid foundation in computer science and robust software design including algorithms, data structures, multi-threaded and object oriented programming\nExcellent written and verbal communication skills\nEnthusiasm for working in a fun, dynamic startup environment\nMust be able to commit to 30-40 hours per week during the summer\nMust be able to work from our Palo Alto office\nAnything else?<p>Willing to start before the summer on a part or full-time basis (plus)\nPrevious experience at a consumer internet company (big plus!)\nYou like to shop online and you don&#x27;t mind getting reimbursed to buy more stuff!\nWho we are:<p>Founded by proven entrepreneurs out of Stanford, Slice is a consumer internet company based in downtown Palo Alto that is venture backed by Lightspeed, DCM, Eric Schmidt and other top Valley investors.<p>We&#x27;re a bright and talented team that&#x27;s chock-full of consumer internet experience with a passion for delighting our users through amazing product experiences and thoughtful customer service.<p>Oh and we LOVE to have fun -- ping pong, game on!<p>What we do:<p>Slice is solving a very big and important problem: we&#x27;re changing the way that people interact with the stuff they buy AFTER they buy it. And we&#x27;re doing this by tackling it at the source of where people get their electronic receipts: the email inbox.<p>We&#x27;re using email data to create fun and useful consumer applications and experiences. Our popular flagship app for iOS and Android (Slice - Shopping Organized) provides an easy way for consumers to manage &amp; track all of their purchases and even save money with price drop alerts.<p>Why we&#x27;re cool:<p>Well there&#x27;s what other people say:<p>We&#x27;ve been named one of 7 &quot;Startups to Watch in 2012&quot; by Inc. Magazine, and to Entrepreneur Magazine&#x27;s list of 100 Brilliant Companies.<p>We&#x27;ve also gotten tons of shoutouts from the press and media such as the NBC&#x27;s Today Show, Real Simple, CNN, and Lifehacker just to name a few.","time":1399043401,"type":"comment"}