{"by":"eiphany06","id":7690677,"parent":7679431,"text":"iOS SOFTWARE ENGINEER - INTERN&#x2F;CONTRACT, THEN FULLTIME&#x2F;HIRE - Palo Alto, CA<p>SEE LIST OF OPPORTUNITIES (FULLTIME&#x2F;INTERN): <a href=\"https://slice.resumetracker.com/public\" rel=\"nofollow\">https:&#x2F;&#x2F;slice.resumetracker.com&#x2F;public</a><p>Slice, a well-funded startup in CA, is a wonderful place to work and grow as an entrepreneur, engineer, designer, data scientist, and statistics scientist. You will be surrounded by brilliant, compassionate team members. This is an inspirational place to evolve as an entrepreneur and programmer, and the elite level of leadership among the founders, who are also professors at Stanford Graduate School of Business, is unparalleled. The networking and mentorship opportunities are amazing when immersed in this environment. Resumes&#x2F;Linkedin&#x2F;GitHub&#x2F;project pages&#x2F;portfolios to hannahft [at] stanfordalumni.org AND PLEASE CC Sean [at] slice.com. We will consider candidates who need a VISA to work in California.<p><a href=\"https://slice.resumetracker.com/public/job_detail/1003\" rel=\"nofollow\">https:&#x2F;&#x2F;slice.resumetracker.com&#x2F;public&#x2F;job_detail&#x2F;1003</a><p>Employment Type:\nContracted<p>Qualification:\nDegree or above<p>Experience:\nMid-Level<p>What&#x27;s the job:<p>We&#x27;re looking for a rockstar iOS engineer to come aboard on a short-term contract or internship basis to help with our iOS development efforts for both phone and tablet. You will be working closely with the product and design teams to define the best user experience, with a keen eye for mobile UI design and best practices for the iOS platform.<p>Note that there is a possibility that this role could morph into a full-time position, but at the very least, we&#x27;d like to offer equity as part of the contact&#x2F;internship compensation package.<p>Requirements:<p>Completion of or currently worknig towards BS or MS Computer Science or related field.\nMastery of Objective C and the iOS SDK. \nPassion for the iOS platform and applications.\n1+ year iOS application development experience.\nHave actively worked on and deployed highly rated consumer-facing iOS phone and&#x2F;or iPad apps.\nA solid foundation in computer science and robust software design including algorithms, data structures, multi-threaded and object oriented programming, design patterns.\nExperience building mobile consumer applications with an eye for clean, robust and performant code.\nComfortable with rapid iteration development methodologies and processes.\nStrong communication and documentation skills.\nPluses:<p>Background&#x2F;experience with other mobile platforms such as Android, Windows Phone.\nExperience with Java server technologies, MySQL.\nPrevious startup experience and&#x2F;or strong enthusiasm to work in a dynamic startup environment.\nBig online shopper and you don&#x27;t mind getting reimbursed to buy more stuff!\nAbility to code in the presence of flying ping-pong balls. \nWho we are:<p>Founded by proven entrepreneurs out of Stanford, Slice is a consumer internet company based in downtown Palo Alto that is venture backed by Lightspeed, DCM, Eric Schmidt and other top Valley investors.<p>We&#x27;re a bright and talented team that&#x27;s chock-full of consumer internet experience with a passion for delighting our users through amazing product experiences and thoughtful customer service.<p>Oh and we LOVE to have fun!<p>What we do:<p>Slice is solving a very big and important problem: we&#x27;re changing the way that people interact with the stuff they buy AFTER they buy it. And we&#x27;re doing this by tackling it at the source of where people get their electronic receipts: the email inbox.<p>We&#x27;re using email data to create fun and useful consumer applications and experiences. Our popular flagship app for iOS and Android provides an easy way for consumers to manage &amp; track all of their purchases and even save money with price drop alerts.<p>Why we&#x27;re cool:<p>Well our users certainly think we are (check out the reviews on the app stores). But the media love us as well!<p>We&#x27;ve been named one of 7 &quot;Startups to Watch&quot; by Inc. Magazine, and to Entrepreneur Magazine&#x27;s list of 100 Brilliant Companies.<p>We&#x27;ve also gotten tons of shoutouts from the press and media such as the NBC&#x27;s Today Show, Real Simple, CNN, and Lifehacker just to name a few.","time":1399123990,"type":"comment"}