{"by":"eiphany06","id":7691299,"parent":7679431,"text":"FULLTIME&#x2F;MANAGER HIRE- Slice - <a href=\"https://slice.resumetracker.com/public\" rel=\"nofollow\">https:&#x2F;&#x2F;slice.resumetracker.com&#x2F;public</a> - Palo Alto, CA<p>COMPLETE LIST OF OPPORTUNITIES (FULLTIME&#x2F;INTERNSHIP&#x2F;CONTRACTOR): <a href=\"https://slice.resumetracker.com/public\" rel=\"nofollow\">https:&#x2F;&#x2F;slice.resumetracker.com&#x2F;public</a><p>Slice, a well-funded startup in CA, is a wonderful place to work and grow as an entrepreneur, marketing director, business analyst, engineer, data analyst and statistics scientist. You will be surrounded by brilliant, compassionate team members. This is an inspirational place to evolve as an entrepreneur and programmer, and the elite level of leadership among the founders, who are also professors at Stanford Graduate School of Business, is unparalleled. The networking and mentorship opportunities are amazing when immersed in this environment. Happy to chat. Resumes&#x2F;Linkedin&#x2F;GitHub&#x2F;project pages&#x2F;portfolios to hannahft [at] stanfordalumni.org.  We will consider candidates who will relocate to CA or require Visa sponsorship!<p>Director of Mobile Marketing\n<a href=\"https://slice.resumetracker.com/public/job_detail/954\" rel=\"nofollow\">https:&#x2F;&#x2F;slice.resumetracker.com&#x2F;public&#x2F;job_detail&#x2F;954</a><p>Location\nPalo Alto, CA 94301, United States<p>Employment Type:\nFull Time<p>Qualification:\nDegree or above<p>Experience:\nManager<p>What&#x27;s the job:<p>We’re looking for an experienced, rock star marketer to spearhead our mobile marketing efforts and drive massive growth for our mobile products. The right person lives and breathes marketing analytics, and has proven results running mobile or online user acquisition campaigns. Typical tasks might include initiating and executing mobile marketing campaigns, assessing the ROI of marketing campaign spend, or analyzing the quality of customers we acquire from different channels.<p>What are the responsibilities:<p>Initiate and execute mobile marketing campaigns across various mobile advertising channels and partnerships\nManage relationships and operations with multiple mobile ad agencies\nIdentify and define in-app features to drive growth\nWork with product teams to ensure our products have the reporting capabilities to track marketing campaign performance\nMeasure ROI of marketing campaigns and quantify the value of mobile users\nComprehensive ownership of analysis of business and marketing metrics for mobile user acquisition and engagement\nCollaborate closely with product teams to define product marketing strategy: app store creative, viral, social, and retention features\nAggressively collect, analyze, and respond to data related to the performance of our mobile apps\nWhat are the skills &amp; requirements:<p>3-5 years of experience executing and analyzing mobile or online marketing campaigns\nDeep understanding of ROI, user profitability, user attribution, CPC, CPI\nStrong analytical skills, with a proficiency in Excel\nExperience with Android and iOS marketing, especially on Fiksu, Facebook, Millenial, etc.\nKnowledge of SQL\nBA &#x2F; BS required\nAnything else?<p>Previous experience at a consumer internet company (big plus!)\nYou like to shop online and you don&#x27;t mind getting reimbursed to buy more stuff!\nAppetite for detail\nCollaborative personality and team player\nTakes initiative and gets things done\nSelf starter, problem solver\nWho we are:<p>Founded by proven entrepreneurs out of Stanford, Slice is a consumer internet company based in downtown Palo Alto that is venture backed by Lightspeed, DCM, Eric Schmidt and other top Valley investors.<p>We&#x27;re a bright and talented team that&#x27;s chock-full of consumer internet experience with a passion for delighting our users through amazing product experiences and thoughtful customer service.<p>Oh and we LOVE to have fun!<p>What we do:<p>Slice is solving a very big and important problem: we&#x27;re changing the way that people interact with the stuff they buy AFTER they buy it. And we&#x27;re doing this by tackling it at the source of where people get their electronic receipts: the email inbox.<p>We&#x27;re using email data to create fun and useful consumer applications and experiences. Our popular flagship app for iOS and Android provides an easy way for consumers to manage &amp; track all of their purchases and even save money with price drop alerts.<p>Why we&#x27;re cool:<p>Well our users certainly think we are (check out the reviews on the app stores). But the media love us as well!<p>We&#x27;ve been named one of 7 &quot;Startups to Watch&quot; by Inc. Magazine, and to Entrepreneur Magazine&#x27;s list of 100 Brilliant Companies.<p>We&#x27;ve also gotten tons of shoutouts from the press and media such as the NBC&#x27;s Today Show, Real Simple, CNN, and Lifehacker just to name a few.","time":1399133821,"type":"comment"}