{"by":"rachellaw","id":7700607,"kids":[7701506],"parent":7679431,"text":"Interface Foundry – New York City – (Full time, Interns and H1B; developers and designers)<p>We let users browse and build their own data bubbles -- data pinned to a specific location or time, consolidating apps and other widgets into a single context-aware interface.<p>Our mission is to index the physical world, allowing people to move seamlessly from one area or timeframe to another, interacting with their environment where information (apps, widgets, connected devices, data cards, localized maps) is absorbed into personal devices securely.<p>We just closed our first round of seed&#x2F;angel financing, raised over 100K and looking to grow and scale quickly.  We have over 20,000 users, deployed worldwide everywhere from Berlin to Barcelona, Detroit to Oakland and of course, NYC. Our system is open source, open API and open hardware. We believe strongly in transparency and accountability, and have benefit-corporation status.<p>Our culture embraces diversity, we value a collaborative environment with lots of challenges that require creative solutions. We like walking-breaks, snacks and cats. We’re flexible about time as long as you get work done. We prefer direct communication, if there are any issues or things in your mind, let us know.  You’ll be joining us in our office in downtown SoHo, and there’s a lot of great food places nearby Chinatown too. All early employees get both stock options and vesting interest when they join full time, along with other possible benefits such as health insurance.<p>More information: <a href=\"http://interfacefoundry.com\" rel=\"nofollow\">http:&#x2F;&#x2F;interfacefoundry.com</a><p>Positions:<p><i>== Front-End Developer ==</i><p>Build out widgets and interactive themes for our mobile front-end for events around NYC, the data bubble builder interface for anyone to build new bubbles and a searchable map of active bubbles.<p>- Knowledge of: Angular.js, CSS3, HTML5, PhoneGap, Git<p>- Nice to have: Leaflet.js, OpenStreetMap &#x2F; automated geo-tile creation<p><i>== Back-End Engineer ==</i><p>Perfect our database architecture, automated systems for API consolidation and  communication with 3rd party connected devices, authentication &#x2F; security.<p>- Knowledge of:  Node.js, MongoDB, Express, Git<p>- Nice to have: Hadoop, Elasticsearch<p>If you’re interested, send us a note: hello@interfacefoundry.com and we will definitely get back to you!","time":1399318179,"type":"comment"}