{"by":"robvolk","id":7706622,"parent":7679431,"text":"Chicago, full-time\n<a href=\"https://charlieapp.com/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;charlieapp.com&#x2F;jobs</a><p>Full-stack Developer for Early-Stage, Funded Startup<p>We’re looking for a bad-ass developer.<p>You want to get in on the ground floor of a funded startup.\nYou’re a come up with mind-blowing solutions to complex problems.\nYou get excited over new technology and have to play with it right away.  \nYou test, refactor, and love your code.  \nYou write killer back-end code, but don’t shy away from the front-end.<p>Who are we?\nBefore any meeting, Charlie automatically researches people before you see them.  Researching people is a complex problem: we sift through, analyze, and manipulate data into powerful insights (i.e. what are they passionate about, what do you have in common?).  CNBC called us “One of the world’s most promising new companies” and SXSW selected us as an Accelerator Finalist.<p>We’ve built Charlie to research people at massive scale, using the latest Ruby on Rails stack with MongoDB, Redis, Sidekiq, and hosted in an elastic cloud farm.  We write code with agility and have a tight process where anyone on the team can deploy to production at any time, without approval.  We thoroughly test our code, though we’re not strict TDD.  We&#x27;re a small dev that loves to code, and constantly pushes, and learns from each other.<p>This is your opportunity to join an early-stage company that’s making moves.  Sound interesting?  Let us know what makes you the perfect candidate.<p>Why we’re special:\n   * Flexible working situation: hours, location\n   * Competitive salary + equity\n   * Funded startup backed by some amazing people\n   * Everyone deploys to production (fully automated, painless)\n   * We go out and do fun things (concerts, Bulls &amp; Cubs games, and occasionally ski in Colorado)<p>Requirements:\n   * Full-stack developer (heavy back-end)\n   * Ruby on Rails preferred, but you can learn.\n   * DB experience (SQL or NoSQL?)\n   * Not afraid of the front-end (HTML5, jQuery, Coffeescript, bootstrap, Sass, Slim)\n   * Test your code (Rspec, capybara, cucumber, etc)\n   * Hobbyist: Working on a side project to learn new technology?\n   * Creative problem solver\n   * Git &#x2F; Github\n   * Smart &amp; gets things done.<p>Location\n1871 co-working space\nChicago, IL<p>Apply\nInterested? Tell us why you&#x27;d make the ideal candidate. We want to hear about your current role, a side project you&#x27;ve worked on or new technology that you&#x27;ve learned, and include some relevant links.  Thanks!<p>Email jobs@charlieapp.com.","time":1399404978,"type":"comment"}