{"by":"eiphany06","id":7716319,"parent":7679431,"text":"FULLTIME, INTERNSHIP, VISA SPONSORSHIP.  PALO ALTO, CA.<p>AVAILABLE CAREER OPPORTUNITIES: \n<a href=\"https://slice.resumetracker.com/public\" rel=\"nofollow\">https:&#x2F;&#x2F;slice.resumetracker.com&#x2F;public</a><p>Slice, a well-funded startup located in downtown Palo Alto, California, is a wonderful place to work and grow as an\nentrepreneur, engineer, designer, data scientist, and statistical scientist.<p>You will be surrounded by brilliant, compassionate team members. This is an\ninspirational place to evolve as an entrepreneur and programmer, and the\nlevel of leadership among the founders, also professors at\nStanford Graduate School of Business, is outstanding.  The networking and\nmentoring opportunities and friendships are amazing in this environment. I would be delighted to conduct an informational interview. Resumes&#x2F;Linkedin&#x2F;project pages&#x2F;portfolios to\nhannahft [at] stanfordalumni.org AND Sean [at] slice.com<p>Senior Software Engineer description:  (SEE SITE FOR ALL AVAILABLE POSITIONS)<p><a href=\"https://slice.resumetracker.com/public/job_detail/222\" rel=\"nofollow\">https:&#x2F;&#x2F;slice.resumetracker.com&#x2F;public&#x2F;job_detail&#x2F;222</a><p>What&#x27;s the job:<p>We are seeking a senior server engineer to design and develop software components and systems for our high volume, distributed infrastructure backing our consumer Internet applications running in the cloud.<p>Responsibilities:<p>Design and develop core software components and systems in support of our suite of Web and Mobile applications.\nCode using Java.\nConduct design and code reviews.\nAnalyze and improve efficiency, scalability, and stability of various system resources.\nWork closely with other engineers to define elegant software solutions, with a particular eye for performance and scalability.\nRequirements:<p>BS or MS Computer Science or related field.\nA solid foundation in computer science and robust software design including distributed systems, algorithms, data structures, multi-threaded and object oriented programming.\nExpert knowledge developing and debugging in Java.\nExperience with a high traffic web applications with particular focus on performance and scale.\nExperience with cloud based code deployment such as Amazon Web Services (EC2) preferred.\nExperience with both SQL and&#x2F;or NoSQL data stores - e.g. MySQL, MongoDB, Cassandra preferred.\nExperience with information extraction, natural language processing and machine learning is a major plus.\nExperience with rapid iteration development methodologies.\nExcellent written and verbal communication skills.\nEnthusiasm for working hard and having fun in a dynamic startup environment.\nWho we are:<p>Founded by proven entrepreneurs out of Stanford, Slice is a consumer internet company based in downtown Palo Alto that is venture backed by Lightspeed, DCM, Eric Schmidt and other top Valley investors.<p>We&#x27;re a bright and talented team that&#x27;s chock-full of consumer internet experience with a passion for delighting our users through amazing product experiences and thoughtful customer service.<p>Oh and we LOVE to have fun!<p>What we do:<p>Slice is solving a very big and important problem: we&#x27;re changing the way that people interact with the stuff they buy AFTER they buy it. And we&#x27;re doing this by tackling it at the source of where people get their electronic receipts: the email inbox.<p>We&#x27;re using email data to create fun and useful consumer applications and experiences. Our popular flagship app for iOS and Android provides an easy way for consumers to manage &amp; track all of their purchases and even save money with price drop alerts.<p>Why we&#x27;re cool:<p>Well our users certainly think we are (check out the reviews on the app stores). But the media love us as well!<p>We&#x27;ve been named one of 7 &quot;Startups to Watch&quot; by Inc. Magazine, and to Entrepreneur Magazine&#x27;s list of 100 Brilliant Companies.<p>We&#x27;ve also gotten tons of shoutouts from the press and media such as the NBC&#x27;s Today Show, Real Simple, CNN, and Lifehacker just to name a few.","time":1399568536,"type":"comment"}