{"by":"mikebabineau","id":2607768,"kids":[2610231],"parent":2607052,"text":"Redwood Shores, CA (SF Bay Area) - Engineers and more<p>EA2D is hiring! We're a new, autonomous studio within EA building cross-platform social games for gamersWe recently launched our first major game, Dragon Age Legends:<p><a href=\"http://apps.facebook.com/dragonagelegends/\" rel=\"nofollow\">http://apps.facebook.com/dragonagelegends/</a><p>EA is traditionally a product company. We're leading by example to change it into a services company. Despite our size (just 30 people!) and age (very new studio), we're getting attention at the CEO-level and being touted on earnings calls alongside hundred-million dollar franchises.<p>Still, we have a lot of work to do. We need help building:<p>* New features. We still have huge features we want to bring to Dragon Age Legends (real-time, mobile, etc.)<p>* New games. Think big-name EA IP (we have access to the full EA library)<p>* An epic social gaming platform. We're building a set of social gaming services with public APIs that make it easier to develop games. Dragon Age Legends is built on this, and so are new games from other studios, both internal and external<p>We're small (30 people) and scrappy. And we're growing fast: 0-200 servers in the past 6 months. Tech stack is primarily AS3/Java backed by MongoDB, but we also use Python, JavaScript, and Ruby. We have a highly automated infrastructure running on AWS (EC2 w/ELBs and ASGs, EMR, SQS, Beanstalk, etc., plus more than a few super-secret/unreleased Amazon features). Buzzword potpourri includes Chef, node.js, Google App Engine, Hive, Graphite, Tomcat, Spring, Ivy, Hudson, GitHub, Pingdom, Loggly, PagerDuty, and continuous deployment. &#60;3 DevOps. We have a small but growing list of open source projects (see <a href=\"http://github.com/ea2d\" rel=\"nofollow\">http://github.com/ea2d</a> and <a href=\"http://eng.ea2d.com/\" rel=\"nofollow\">http://eng.ea2d.com/</a>).<p>We need platform, game, systems, and mobile engineers. We need data people and people to run day-to-day operations. We need producers, marketing, and designers. Our job listings are posted here: <a href=\"http://www.ea2d.com/jobs/\" rel=\"nofollow\">http://www.ea2d.com/jobs/</a>, but we have positions we haven't even finished writing descriptions for.<p>* Platform engineer (web services): <a href=\"http://ea2d.com/web-platform-engineer/\" rel=\"nofollow\">http://ea2d.com/web-platform-engineer/</a><p>* Systems engineer: <a href=\"http://ea2d.com/platform-systems-engineer/\" rel=\"nofollow\">http://ea2d.com/platform-systems-engineer/</a><p>* Game server engineer: <a href=\"http://ea2d.com/senior-flash-engineer/\" rel=\"nofollow\">http://ea2d.com/senior-flash-engineer/</a><p>* Flash engineer: <a href=\"http://ea2d.com/senior-flash-engineer/\" rel=\"nofollow\">http://ea2d.com/senior-flash-engineer/</a><p>* Others: <a href=\"http://ea2d.com/jobs\" rel=\"nofollow\">http://ea2d.com/jobs</a><p>* Not listed: Lead Engineer (game team), Data Engineer (build our analytics pipeline - billions of events per day!)<p>Drop me a line: mikeb@ea2d.com","time":1306943000,"type":"comment"}