{"by":"scottobot21","id":2607973,"kids":[2610054],"parent":2607052,"text":"<i>Ruby on Rails/MySQL Developer</i><p>Wowzers is an online core curriculum. Students create an avatar and are engaged in data-driven learning explorations. The cinematic experience, filled with characters and challenges, forces students to use critical and creative thinking skills to master specific content aligned to state and Common Core Standards.<p>Wowzers is data-driven, and provides analytics for instructors and administrators to view progress toward goal in each standard, by student and group, and allows instructors to view and adjust the adaptive learning plan created for each child using real-time data.<p>Wowzers is an exciting young company located in River North in downtown Chicago. Wowzers provides an informal and challenging work environment. We are seeking to change the way students learn, and encourage our team members to be creative challenge existing paradigms.<p>Wowzers provides competitive salary based on merit, and offers full benefits, including insurance and retirement.<p>For the Ruby on Rails/MxSQL Developer position we are looking for a team leader build out our existing infrastructure and create new functionalities related to student data. Work will include synthesizing student performance and developing more advanced algorithms to individualize instruction for students based on their ability level. Additional work will tackle the challenge of scaling a massive data project with hundreds of thousands of users (growing to millions in the coming months. Read more about the requirements below<p><i>Responsibilities:</i>\n* Optimizing, maintaining, and developing new features for an existing Ruby on Rails website\n* Developing e-commerce system for handling user subscriptions and in-game transactions\n* Implementing community monitoring features that report usage statistics\n* Improving scalability of back-end architecture to accommodate millions of users\n* Devising strategies to optimize network performance in scenarios where a large number of users all share a single internet connection\n* Creating web-based tools to enter/manage data\n* Integrating with other, PHP-based web apps\n* Helping with quality assurance and game testing<p><i>Requirements:</i>\n* Bachelor's Degree in Computer Science or Web Programming\n* Must be proficient in HTML, Ruby on Rails, MySQL, JavaScript, PHP\n* 1-3 years experience in professional web development\n* Must work in-house and be comfortable working in close collaboration with others<p><i>Additional Skills:</i>\n* Strong design sensibilities a plus<p>Compensation: $60-75K depending on experience and skill.<p>To apply, go to <a href=\"http://wowzers.com/about/careers-application\" rel=\"nofollow\">http://wowzers.com/about/careers-application</a>","time":1306945258,"type":"comment"}