{"by":"jtheory","id":8980221,"parent":8980047,"text":"Patients Know Best -- REMOTE ONLY.  At present we all work core hours in GMT (give or take a few hours), but please get in touch anyway if you&#x27;re elsewhere and might be able to anchor a group of developers in your part of the world.<p>We&#x27;re hiring mid-level &amp; senior developers and people with experience scaling up -- this isn&#x27;t a checklist, but we&#x27;re interested in sharding, ZeroMQ (kicking the tires now), systems monitoring (currently mostly Munin&#x2F;Perl and shell scripts), performance and load testing, continuous integration (we use Jenkins and Selenium tests), automating server builds and server hardening (we deploy to RHEL).  Aside from the challenges around scaling, we also just need people working on core features -- more on our stack below.<p>Bonus points for significant experience in healthcare (as an intelligent patient or family member counts!); ditto for experience building things from scratch (i.e., not just implementing specs you&#x27;re given, using the tools the tech lead gave you).<p><i>More about PKB</i><p>I&#x27;ve worked in a lot of different sectors since I first started writing code in the late 90s, including education, b2b supply chains, POS systems, e-commerce, banking, and anti-spam.<p>PKB has been head-and-shoulders above the rest in everything I care about.<p>We&#x27;re building something that actively, <i>directly</i>, improves the lives of people in general -- not selling more stuff, helping others sell more stuff, or making comfortable people a bit more comfortable.  If you&#x27;re interested in PKB&#x27;s growth, funding, profitability, contracts, etc., ask -- our CEO is also active on HN. I&#x27;m the CTO.<p>We&#x27;re solving interesting problems, tech-wise; each person&#x27;s clinical data is encrypted separately, and only the person plus their carers &amp; medical teams granted access can decrypt the private keys (so: I can&#x27;t decrypt your data even for tech support purposes).  On the front end, we need to make sometimes confusing medical data accessible and useful to the patient and their carers, without removing the crucial details that the professionals need to see; across a wide range of browsers and devices (though I&#x27;ll admit, supporting old IE is the kind of problem that&#x27;s hard without being interesting).  We also build apps on our REST API; these are currently based on Steroids&#x2F;PhoneGap (JavaScript at heart).<p>Our core tech stack is solid Java enterprise -- very stable but not bleeding edge; but we&#x27;ll gently dissuade you from writing the AbstractManagerFactory you consider in a moment of weakness.  Secondly, we&#x27;re in the process of tearing apart and rebuilding (I suspect we&#x27;ll permanently be in this process, honestly) -- one major benefit of our architecture becoming increasingly modular will be that we&#x27;ll be able to replace major components with whatever fits the bill.  If you&#x27;re allergic to Java, check back with us next year.<p>Finally, we&#x27;re pragmatic about work&#x2F;life balance.  I work from France, or sometimes from Malaysia, where my in-laws live.  Almost half of the developers have small children at home -- personally, I&#x27;m with my kids in the morning, sometimes at lunchtime, then late-afternoon &amp; evening (while my wife works), and I fill in a bit of extra working time around the edges as needed.  We&#x27;re collaboratively figuring out what works (e.g., how many working hours should you overlap to collaborate effectively?), and planning our lives and our work around what&#x27;s effective, not around some photocopied list of rules stapled to a cubicle wall.  One of our developers only codes part time (and occasionally takes long leaves of absence), because he&#x27;s also a theatre director.<p>Culture -- we&#x27;re fairly diverse; we live in various parts of the UK, central France, Bangalore, and Vienna; we range in age (though I don&#x27;t actually know everyone&#x27;s ages, so I can&#x27;t say exactly!).  We&#x27;re not all native English speakers -- but communication skills trump even technical skills for remote teams, so we all understand, speak and write English easily and with the confidence to interrupt if we didn&#x27;t catch something.  We collaborate, not compete -- let ideas fight it out, but we&#x27;re on the same team.  We&#x27;re not the sort of group to tell dirty jokes, or tales of how drunk we got last weekend; though we do have interesting stories to share (you can find some of mine in my HN history).<p>If we sound like a good match, get in touch: <a href=\"https://www.patientsknowbest.com/careers.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.patientsknowbest.com&#x2F;careers.html</a> (I&#x27;m also contactable directly -- see profile -- but I get a lot of email)","time":1422805082,"type":"comment"}