{"by":"experimentsin","id":8980100,"parent":8980047,"text":"TomTom – <a href=\"http://www.tomtom.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tomtom.com</a> — London, UK – Mobile &amp; Embedded Apps and DevOps roles (full time, on site, relocation available)<p>We&#x27;re TomTom&#x27;s navigation software team in London and our goal is to build great new on-the-road experiences for drivers and bikers everywhere.<p>The apps we make are built into Renault and Smart in-car systems, are available for smartphones, and form an integral part of TomTom&#x27;s expanding range of consumer devices, where hardware and software are conceived together. Just like this one, coming soon: <a href=\"http://www.tomtom.com/new-rider-400\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tomtom.com&#x2F;new-rider-400</a> - <a href=\"http://www.engadget.com/2015/01/15/turn-to-page-17-for-the-tomtom-rider/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.engadget.com&#x2F;2015&#x2F;01&#x2F;15&#x2F;turn-to-page-17-for-the-t...</a><p>The developers who join our team are valued for their ideas as well as their skills, and we try to encourage both through regular hack days, plus training or conference attendance in areas that interest them.<p>--\nRole: Mobile &amp; Embedded Apps Developer<p>Our apps feature TomTom&#x27;s signature design language and map-centric UI, optimised for our domain. Working with TomTom&#x27;s UX team, app development with us is a challenging mix of custom UI development and deep routing, guidance, traffic and search presentation smarts. If you join us you&#x27;ll be developing with Java, C++, JavaScript, Android, iOS and Qt.<p>--\nRole: DevOps for Mobile &amp; Embedded<p>Building scaleable CI infrastructure for mobile &amp; embedded app testing is hard, particularly when you add custom pre-release hardware and GB&#x27;s of map data into the mix. If you join us you&#x27;ll be working with Android and iOS SDK command line tools and device emulators, Jenkins, Git, Artifactory, Gradle, Ruby, Docker and a mix of local device farms and cloud computing services.<p>--<p>To find out more check out either <a href=\"http://tomtom.jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;tomtom.jobs</a> (search for &quot;London&quot;) or if you&#x27;re on LinkedIn <a href=\"https://www.linkedin.com/vsearch/j?keywords=tomtom+london\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;vsearch&#x2F;j?keywords=tomtom+london</a>","time":1422803557,"type":"comment"}