{"by":"bbeck","id":8980732,"parent":8980047,"text":"Main Street Hub &#x2F;&#x2F; Austin, TX &#x2F;&#x2F; email: brandon.beck@mainstreethub.com<p>We are looking for a few <i>experienced</i> software engineers to join our small but growing R&amp;D team in downtown Austin. Within engineering we are a passionate group of people who are extremely interested in building the software that helps our customers around the country thrive in their local communities. We’re a really small team (currently 9 people) so you’ll have plenty of say around how we develop software going forward.<p>We are currently in the process of modernizing our software platform to be more modular and truly data driven. Our goal is to use data to make sure that we provide the right content to the right consumer at the right time. We’re building our internal API using REST based services implemented in Java, and while our front end is currently implemented in PHP, that may change in the future. Some of the technologies that we’re using: Dropwizard, Swagger, Flyway, CodeIgniter, Phake, Guzzle, CloudFormation, Troposphere, and Ansible. All new engineers get company provided downtown parking, flexible work hours, 100% of their health insurance premiums paid for by the company, the ability to build their own work computer, and access to our kitchen with plenty of drinks and snacks. We’re looking for individuals only so please NO RECRUITERS OR AGENCIES (seriously, your emails will just go into the trash folder). In addition we’re looking for full-time employees who are already in Austin, TX or willing to relocate.<p>---<p>Founded in 2010, Main Street Hub is the CRM for Local. We offer an integrated social, web, and email marketing solution designed to help merchants get more customers and keep them coming back by spreading word of mouth, extending their customer service, managing their online reputation, and leveraging the Main Street Hub’s merchant network. Main Street Hub was recently named #73 on the Inc. 500 list (<a href=\"http://www.inc.com/profile/main-street-hub\" rel=\"nofollow\">http:&#x2F;&#x2F;www.inc.com&#x2F;profile&#x2F;main-street-hub</a>) of America’s fastest growing companies and the 2nd fastest growing company in Austin. Please see our website (<a href=\"http://www.mainstreethub.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mainstreethub.com</a>) for more information.","time":1422811155,"type":"comment"}