{"by":"jjarmoc","id":8980464,"parent":8980047,"text":"-= MATASANO SECURITY =- Chicago. New York City. Sunnyvale. Hiring Application Security Consultants\nFull-Time or Internship, work visa sponsorship available.<p>February - The shortest month of the year, and one of the coldest (maybe not so much in our Sunnyvale, CA location).  That month every year when we set aside some time to show appreciation for our loved ones through gifts, greeting cards, dinner dates, flowers, and a well considered application security posture.<p>Maybe that last one isn&#x27;t on everyone&#x27;s minds, but it is here at Matasano Security.  In many environments, while application security is desirable, it generally isn&#x27;t a primary requirement.  Applications need to perform their core purpose, whatever that may be, so they can aid business by driving revenue.  The conflicting priorities can lead developers to make poor design decisions, rush implementations, and spend less time considering attack scenarios than would be ideal.  This isn&#x27;t their fault!  It&#x27;s a function of conflicting priorities and focusing on those which are most tangible, and most measure.<p>At Matasano this balance is different.  Application security is our passion, and our goal is to fill the unmet needs our clients have to strengthen their posture.  Our singular focus on security helps us maintain an aptitude and laser guided precision that&#x27;s far above the mean.  We truly enjoy combing through code, reviewing the flow of information into and out of an application, and finding places where malicious actors can leverage vulnerabilities to their advantage.  We love our clients, but it&#x27;s not the sort of love you&#x27;ll read about on little candy hearts.  We tell them the truth about their security, not just rosy platitudes.<p>Sometimes this can mean delivering bad news when we&#x27;re able to totally compromise an application and execute our own code on its server.  Other times it means explaining that when the server asks the client to identify itself, the client can just lie.  Often it means explaining that their homegrown encryption scheme is no more unintelligible than Pig Latin.  But with this bad news comes some assistance and guidance to help them prioritize improvements and strengthen their products.<p>This sort of work requires a very particular set of skills.  A strong Application Security Consultant needs to deeply understand programming and application design.  They require a foundation in the common application vulnerabilities, exploitation techniques, and mitigations.  But more than this they need to be creative and able to maintain multiple perspectives simultaneously to find places where those perspectives are in conflict.  They need to quickly learn and teach themselves, their peers, and their clients.  Above all, they need to be able to communicate well and provide actionable advice to our clients.<p>If you want to see more about the sorts of things we do and love, here&#x27;s some resources;\n Our blog - <a href=\"http://chargen.matasano.com\" rel=\"nofollow\">http:&#x2F;&#x2F;chargen.matasano.com</a>\n The Matasano Crypto Challenges - <a href=\"http://cryptopals.com\" rel=\"nofollow\">http:&#x2F;&#x2F;cryptopals.com</a>\n Microcorruption, Embedded Security CTF - <a href=\"http://microcorruption.com\" rel=\"nofollow\">http:&#x2F;&#x2F;microcorruption.com</a><p>If you think you have what we need, or just want to learn more about us, visit <a href=\"http://matasano.com/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;matasano.com&#x2F;careers</a> or contact us via careers@matasano.com.","time":1422807846,"type":"comment"}