{"by":"fortpoint","id":8980774,"parent":8980047,"text":"Linkable Networks - <a href=\"http://www.linkablenetworks.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.linkablenetworks.com</a> - Boston, MA (office is in Fort Point Channel neighborhood)\n(<a href=\"http://careers.stackoverflow.com/company/linkable-networks\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;company&#x2F;linkable-networks</a>)<p>* Company Summary<p>Linkable Networks was founded on the premise that the disconnect between digital media and physical retail was a major gap in delivering a great experience to consumers. Since 2011, we’ve been nose-down building a scalable platform that provides brands and retailers the ability to engage, reward and incent their consumers directly and across any channel – online, mobile and in-store. We pioneered the concept of card-linked-offers and have taken it to the next level – always-on loyalty. Both our self-service and SaaS-based platforms enable the creation of actionable ads, coupons, offers, promotions, rebates and more that let you reward loyalty... not just discount a purchase. This is the future of Loyalty.<p>* Technology Stack<p>Core Stack : { Java, Spring, Sharded mySql, Terracotta, RabbitMQ }<p>Mobile : { iOS, Android }<p>* Additional Info<p>We&#x27;re wired into the three largest card networks: Visa, Mastercard and Amex.  We have a broad range of customers from grocery giant SuperValu where we&#x27;re deployed with a first of its kind card-linked SKU offer solution to FanBank where we help enable community based Loyalty programs.<p>We run an agile shop with 70 successful sprints under our belts.  Our process has been improved over the 4 years we&#x27;ve been running it so that we deliver on time and without drama.  Our engineers don&#x27;t sit in meetings they build solutions.<p>We&#x27;re looking for solid Java engineers to join our team and help us build out the next level of capabilities on our platform.<p>If this sounds interesting, please shoot me an email at coolgigs@linkablenetworks.com","time":1422811781,"type":"comment"}