{"by":"errordeveloper","id":8980823,"kids":[8981646],"parent":8980047,"text":"Core Engineer at VC-funded open-source project, Weaveworks, London<p>Weaveworks is a start-up founded by the team that created RabbitMQ and backed by one of the world’s leading tech investors. Headquartered in London, we are hiring engineers to work on our open source software product, Weave.<p>The purpose of Weave is to enable all developers, no matter what their background, to take advantage of container technologies such as Docker and build better software applications. We believe that containers will lead to much more software being built at greater speed and scale than ever before, so much so that many existing approaches will need to be reimagined.<p>We have an experienced team and welcome newcomers who want to progress fast, as well as domain experts in relevant technologies. Currently Weave is a set of network services written in Go, packaged to make distributed Docker applications much easier to construct. But we have considerable ambitions, and the space is evolving rapidly, so we especially seek developers with the right outlook and ability to adapt.<p>Ideally you have real world experience of building and running systems with a focus on resilience and uptime. You are as comfortable designing or debugging a distributed protocol as you are talking to customers building a web app or scaling a data service.<p>We hope to meet developers who share our values:<p>- Complete focus on the simplest possible user experience<p>- A real desire to innovate, and then measure success by happy customers not kudos from purists<p>- Relish being held accountable for work quality, but want to own how that work is done<p>- Want to participate in shaping the culture and technology of a fast moving company<p>- We communicate clearly and we respect everyone who uses our software<p>In short, you would be working on a highly visible and ambitious open source project with all the opportunities and responsibilities that come with that. We aim to be a market leader and want people who really feel they could be a big part of the team making that happen.<p>More info and application form at: <a href=\"http://weave.works/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;weave.works&#x2F;jobs&#x2F;</a>","time":1422812514,"type":"comment"}