{"by":"senordhuff","dead":true,"id":8981016,"parent":8980047,"text":"Alpha Theory is looking for a DBA with experience using both MS SQL Server and PostgreSQL. (REMOTE but prefer candidates near our office in Charlotte, NC)<p><a href=\"https://www.alphatheory.com/home#/dba-position\" rel=\"nofollow\">https:&#x2F;&#x2F;www.alphatheory.com&#x2F;home#&#x2F;dba-position</a><p>Alpha Theory, an award-winning leader in improving investment decision discipline and performance for some of the world&#x27;s most respected investment managers, is looking for a Senior DBA with experience in PostgreSQL and Microsoft SQL Server. Alpha Theory provides SaaS which allows investment managers to optimize their position sizes and the composition of their portfolios. We&#x27;re a small company and have worked hard to create an entrepreneurial work environment that challenges and enriches. If you&#x27;re a skilled DBA with a focus on PostgreSQL and Microsoft SQL Server who is proactive, take initiative, works well without supervision, and identifies problems and solutions and takes action before issues arise, we want to hear from you!<p>As a Senior DBA reporting to the CTO, your core responsibilities will include:<p>Keeping our existing production and development databases running optimally (and get them running optimally where they&#x27;re not currently).\nEnsuring our database environment scales in line with the rapid growth in our client base.\nMonitoring production performance and taking quick action to remedy any problems, including after business hours.\nTaking part in DR planning and testing.\nAssisting developers in optimizing queries.\nDeploying schema, index, and procedure changes across our different environments.<p>Additionally, we have a number of significant projects starting:<p>A phased migration from SQL Server 2012 Enterprise edition to PostgreSQL.\nDesign and implementation of historical data marts, including investigation of tools, system design.\nIntroduction of private database instances for each client.\nRequired:<p>Experience in monitoring&#x2F;alerting, troubleshooting and resolving database problems.\nExperience in Performance Tuning and Optimization (PTO), using native monitoring and troubleshooting tools.\nExperience with backups, restores and recovery models, particularly across geographically disparate data centers.\nKnowledge of High Availability (HA), Replication and Disaster Recovery (DR) options for MSSQL Server and PostgreSQL.\nKnowledge of indexes, index management, and statistics.\nStrong ANSI SQL, T-SQL and PL&#x2F;pgSQL skills.\nGood communication and documentation skills.<p>Desired:<p>Experience with big data platforms, tools, and technologies.\nExperience designing analytic queries for large volumes of financial time series data.\nExperience with administration and deployment of schema changes to large numbers of database instances.<p>Apply here:\n<a href=\"https://www.alphatheory.com/home#/dba-position\" rel=\"nofollow\">https:&#x2F;&#x2F;www.alphatheory.com&#x2F;home#&#x2F;dba-position</a>","time":1422815146,"type":"comment"}