{"by":"pongle","id":8981980,"kids":[8983730],"parent":8980047,"text":"Mirriad - London, UK - Full time - DevOps &#x2F; Team Lead &#x2F; Java Developer &#x2F; C++ Developer - <a href=\"http://www.mirriad.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mirriad.com&#x2F;</a><p>We are working to bring scale to embedding brands into video using automated video processing technology. We combine computer vision research with a cutting edge web platform, requiring a unique mix of talents in a small team.<p>We are looking for a number of roles to join our central London team (just behind the OXO tower).<p>DevOps &#x2F; Systems Administrator : Responsible for our world-wide network of GPU compute nodes, and our migration to AWS. Mix old-school network administrator using Arista &#x2F; Cisco hardware with awesome clusters of CUDA NVidia-enabled nodes linked with EMC Isilon storage for high-throughput video compute. Drive the adoption of deployment best-practice in the development teams, by deploying with Docker and Ansible onto AWS.<p>Team Lead : Responsible for building out our micro-services web platform in Java. Lead a highly capable team of developers to deliver product into our customers&#x27; hands. We have recently transitioned from Scrum to Kanban and are enjoying very regular deployments. Looking for experience in leading, and in Java development using TDD (as you would expect).<p>Java Developer : Join the above mentioned team and get to work on building our next generation platform. We are currently using AWS, Elastic Search, MongoDB, Spring Boot and Docker to build out our cluster of micro services. Testing and delivery should be your mantra.<p>C++ Developer : Join our video processing team, and help them deliver world-class computer vision research into our distributed ad-delivery pipeline. We use Qt, ActiveMQ, CUDA, CMake and deliver product for Linux and Windows from the same codebase.<p>Don&#x27;t hesitate to get in touch if you&#x27;re interested in joining the team.","time":1422830322,"type":"comment"}