{"by":"naftaliharris","id":8981158,"parent":8980047,"text":"Affirm - San Francisco, CA<p>Why do banks charge fees on checking accounts, an interest-free loan? Why do ACH payments like direct deposits take days to clear in an age when communication is instant? Have you ever read the fine print on a credit card?<p>At Affirm, we think the consumer finance industry is fundamentally broken. Banks today offer complicated and expensive financial products with a multitude of fees and gotchas buried deep in their fine print, a result of them losing touch with their customers and continuing to use inefficient and costly infrastructure built with technology from the 1970s.<p>We at Affirm are using modern technology to re-imagine and re-build core components of financial infrastructure to enable cheaper, friendlier and more transparent financial products that improve lives. Our first product, &quot;Buy With Affirm&quot;, enables consumers to finance large purchases and and has been integrated into over a hundred ecommerce sites.<p>We are based in downtown San Francisco; founded by Max Levchin (founding CTO PayPal), Jeff Kaditz (CDO DeNA&#x2F;ngmoco), and Nathan Gettings (founding CTO of Palantir); and have raised $45M from Khosla Ventures, Lightspeed Venture Partners, Nyca Partners, and others.<p>My team at Affirm is looking hard for data scientists, (but Affirm is also hiring software engineers, designers, PMs, and others; see the whole list at <a href=\"https://www.affirm.com/careers/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.affirm.com&#x2F;careers&#x2F;</a>).<p>RESPONSIBILITIES<p>- Build production fraud and credit machine learning models. Your models will decide who we lend to in real time.<p>- Conduct ad-hoc data analyses. Your analyses will decide what policies we adopt, where we expand our business, and who our partners will be.<p>REQUIREMENTS<p>- Deep understanding of and experience with machine learning and data analysis.<p>- Strong programming ability.<p>BONUS<p>- Expert-level Python ability.<p>- Advanced statistics knowledge.<p>- Experience with fraud or underwriting.<p>Apply at <a href=\"https://www.affirm.com/careers/data-scientist/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.affirm.com&#x2F;careers&#x2F;data-scientist&#x2F;</a> or email us at careers@affirm.com.<p>FULL-TIME, INTERN, VISA, LOCAL, RELOCATION, NO REMOTE","time":1422817109,"type":"comment"}