{"by":"capkutay","id":8981068,"parent":8980047,"text":"WebAction - Downtown Palo Alto, CA. Local only<p><a href=\"http://webaction.com\" rel=\"nofollow\">http:&#x2F;&#x2F;webaction.com</a><p>Hiring Lead Front-End Developers, UI&#x2F;UX designers, Web Developers, and Big Data Platform Developers (java).<p>WebAction is a real-time big data platform that bridges the gap between users and terabytes&#x2F;petabytes of diverse, fast moving, and physically disparate data with a simple, SQL interface and state-of-the-art visual app designer.\nWe do this by offering high-speed acquisition of over 50 types of data sources with pre-built adapters, distributed stream processing and caching, and real-time querying of stored data in one platform. As a result, our customers rapidly create real-time, mission critical data-driven solutions that would normally take months to years of development effort with a mish-mash of multiple paid products or development-intensive open source libraries.<p>Founded by a team of Silicon Valley veterans with proven track records (CEO of WebLogic&#x2F;GoldenGate Software, executive team from GoldenGate software), WebAction is backed by some of the most respected names in Silicon Valley. We&#x27;re also well funded (recently raised $11m Series B by a private equity firm with a $15 billion fund).<p>We offer a competitive salary, excellent benefits package, generous equity for the right candidates. Our office is also a short walk from some great restaurants and coffee spots on University Avenue in Downtown Palo Alto.<p>For the Lead Front-End Developer Position:<p>-Turn mockups and wireframes into functional, fluid web components<p>-Implementing beautiful and robust dashboards using d3.js or other js&#x2F;HTML5 charting libraries<p>-Building re-usable dashboard-development frameworks<p>-Creating user interface and web apps for various industry applications like ATM monitoring, predictive fraud detection, and data center monitoring<p>Requirements:<p>-Strong knowledge of Javascript, CSS, HTML, and jQuery<p>-Enthusiasm for working in a startup environment<p>Nice to haves<p>-Experience with Backbone.js, angular.js or other front-end MV* frameworks<p>-An interest in the type of scalable systems you hear about at Google, Facebook, Twitter, etc.<p>-You’re interested in telling stories and revealing anomalies through data visualization<p>For the Platform Engineering position, we ask that you have experience writing clean code in Java and have a strong desire and skills to work on a scalable, highly optimized data management infrastructure. We ask that you have the following skills:<p>-Large-scale distributed systems<p>-Highly available, highly scalable architectures, Hadoop (MapReduce &#x2F; Pig &#x2F; Zookeeper)<p>- Data Serialization (Avro &#x2F; Thrift &#x2F; Protocol Buffers)<p>- Experience with HBase or Cassandra or Elasticsearch<p>-Real-time messaging (0MQ &#x2F; Kestrel &#x2F; Kafka or similar), \nReal-time event processing, Continuous Queries<p>For the Web Developer position, you should be well versed in HTML&#x2F;CSS&#x2F;jQuery. You should be able to work with designers to create visual components that maintain the integrity of the design while achieving fluid performance in the browser.<p>If you&#x27;re interested, shoot us an e-mail at jobs@webaction.com","time":1422815850,"type":"comment"}