{"by":"jdelic","id":8981457,"parent":8980047,"text":"LaterPay in Munich, Germany is hiring in Europe or elsewhere (REMOTE work is possible and daily routine in our company)<p>LaterPay is building a HTTPS&#x2F;JSON&#x2F;REST API-driven MicroPayment provider. We&#x27;re VC-financed and are currently a small team of 16 people, working in the EU.<p>We are searching for operations engineers and developers. Your progress at Laterpay will be evaluated based on fulfilling your duties, quality of work and great communication. In a distributed working environment - communication is the absolute key to success, so as a distributed company with employees all over the world, we require you to speak and write English fluently and we would like you to have the legal right to work in the EU. That can be worked around, but it makes things easier.<p>Things we&#x27;re interested in for all of these positions:<p>• Open Source contributions.<p>• Ability to work independently with minimal direction.<p>• Knowledge of Git and ability to integrate with deployment strategies. Knowing Git Flow is also a plus.<p>• Be an awesome person or have awesome person skills :). We are actively looking to diversivy our team.<p>• Solid understanding of networking and security concepts.<p>• University or post-secondary degree is an asset.<p>If you&#x27;re interested in any of the roles described below, please write to jobs@laterpay.net.<p>=== Python Developer ================<p>Joining our team of Python developers you will work with Django, gunicorn, Django-Rest-Framework, Celery and Cassandra&#x2F;Riak, PostgreSQL, Redis and multiple REST backend services that we connect to.<p>Skills we&#x27;re looking for:<p>• Experience with the technologies mentioned above.<p>• A good understanding of lightweight services.<p>• An interest in scalable architectures<p>• A good understanding of parallel processing architectures<p>• Having some general knowledge about accounting can&#x27;t hurt :)<p>=== Front-end developer ===================<p>Working on our front-end entails working with JavaScript based application infrastructure. We are looking to roll out a React based single-page JavaScript application as the base of our new front-end. This will need to be optimized for different screen sizes and use cases and many different languages and more.<p>Skills we&#x27;re looking for:\n• Experience with React\n• Experience with single-page apps on different devices\n• Good CSS skills\n• A good understanding of automated testing frameworks<p>=== Operations Engineer ===================<p>After joining the operations team at Laterpay, you will often work independently to help take our current automated infrastructure to the cloud. Your responsibilities would involve a very proactive approach to successfully planning, building and maintaining our platform into the future. ( <a href=\"http://dilbert.com/strip/2011-01-07\" rel=\"nofollow\">http:&#x2F;&#x2F;dilbert.com&#x2F;strip&#x2F;2011-01-07</a> )<p>Here at Laterpay we believe that work is about doing something you enjoy and that it should be self motivating :). This is a hands-on position where you will lead by example, overlook project and architecture decisions and help others build the next big thing.<p>You will implement best practises in security, manage operations and implement seamless upgrades with the team.<p>Skills we&#x27;re looking for:<p>• Demonstrated previous responsibility for maintaining high-availability systems<p>• Experience writing Puppet manifests and deploying them in a masterless and mastered environment<p>• Demonstrated use of AWS EC2, S3, RDS, VPC and related services<p>• Know-how of Service Discovery tools such as Consul<p>• A penchant for multitasking when needed<p>• Experience with optimizing a kernel, web server and implementing caching.<p>• Capacity and forecast planning<p>• Deep knowledge of SELinux<p>• An interest in or experience with Docker&#x2F;LXC<p>• Good understanding of 12factor apps<p>Qualifications that are a plus:<p>• 5+ years building or managing scalable production infrastructure<p>• 5+ years using or administering Linux-based systems<p>• 1+ years using Amazon AWS in production<p>• 1+ years history with configuration management tools (puppet)<p>PS: You might have seen another posting from us in October 2014. Unfortunately we weren&#x27;t able to continue that hiring round, because of a big influx of customers. If you applied back then and didn&#x27;t get a reply, feel free to write again. We&#x27;re very sorry about that.","time":1422821672,"type":"comment"}