{"by":"alexthornton","id":8981417,"parent":8980047,"text":"Locus Energy: <a href=\"http://locusenergy.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;locusenergy.com&#x2F;</a><p>San Francisco, CA<p>About us: We’re dedicated to the proliferation of sustainable energy solutions. To that end, we build software to monitor, analyze and manage the performance of tens of thousands of solar power systems. We’re a mature startup with a close-knit team that is greater than the sum of its parts. Our organization provides some structure while still leaving plenty of opportunities to make your mark. We’re not perfect but constantly improving. We value folks who offer a new perspective and play nicely with others.<p>About you: You’re passionate about sustainable energy and want to play a part of pushing our society in that direction. Nothing would excite you more than wedding your engineering prowess with your dreams of clean, green energy. You write a failing test before fixing a bug. You are thoughtful, curious and ask questions when you don’t understand. You take ownership of your responsibilities and see them through to the entire development lifecycle from design to maintenance.<p>Perks:<p>- Conveniently located in downtown SF, a few minutes&#x27; walk from Montgomery St station<p>- Relaxed work atmosphere. Flexible working hours and work from home policies.<p>- Health insurance, 401k<p>- Fruit, snacks. Bagels and lunch each provided 1x a week.<p>- A spacious new office complete with a living room couch, big screen TV, PS3 and darts.<p>To apply, please contact hr_tech@locusenergy.com<p>===========================================================<p>Senior Front End Engineer<p>Responsibilities:<p>- Design and build dynamic end-user interfaces (including data visualization), using Javascript, CSS &amp; HTML<p>- Be a key part of the software development process, designing scalable front end systems, and working together with an existing development team<p>- Provide input on emerging software technologies that the company could incorporate into the overall plan<p>Skills:<p>- Expertise in JavaScript, HTML5, CSS3, and general web technologies<p>- Expert in client-side JavaScript frameworks, especially Ember<p>- Experience with RESTful APIs<p>- Knowledge of current W3C standards<p>- Having a github or bitbucket account available for review is a plus<p>- Nice to have<p>-- Experience working with server-side technologies (e.g., Spring MVC, Django)<p>-- JavaScript unit testing experience<p>-- Knowledge of JavaScript engine internals and&#x2F;or performance tuning<p>-- Experience with SASS or LESS<p>-- UI&#x2F;UX design and experience<p>===========================================================<p>Senior Backend Engineer<p>Responsibilities:<p>- Design and build infrastructure software to manage and process energy data and support front-end interfaces<p>- Be a key part of the software development process, designing scalable systems, designing&#x2F;testing security measures, and working together with an existing development team<p>- Provide input on emerging software technologies that the company could incorporate into the overall plan<p>Skills:<p>- Solid development skills, particularly related to Java, Scala, Python and&#x2F;or SQL<p>- Experience working on high-availability, large-scale data systems<p>- Proven deep expertise in a java or scala library (e.g., author, framework committer, etc.) a plus<p>- Having a github or bitbucket account available for review is a plus<p>- Experience with RESTful APIs<p>===========================================================<p>Solar Data Engineer &#x2F; Data Scientist<p>Responsibilities:<p>- Develop new solar analysis algorithms and visualizations using R<p>- Become a subject matter expert with respect to solar energy production<p>- Conduct independent and team investigation into analysis problems, and develop automated analytic solutions<p>Skills:<p>- Graduate-level engineering or statistics degree<p>- Experience writing code in an environment with source control and code reviews<p>- Excellent communication skills<p>- Nice to have expertise<p>-- Experience mining big data sets<p>-- Understanding of electric power concepts<p>-- Experience working with solar power<p>-- Smart-meter or smart-grid experience<p>-- Experience writing R code and SQL queries<p>To apply, please contact hr_tech@locusenergy.com","time":1422821063,"type":"comment"}