{"by":"jspiral","id":8982499,"parent":8980047,"text":"Welocalize | Los Angeles, CA (Santa Monica) | Lead Developer<p>We help Google, Harley Davidson, PayPal, Expedia, John Deere, Blackboard, Marriott, Cisco, and many more demanding brands get to market around the world by providing a global localization workforce.<p>----------------------------------------<p>About the project<p>----------------------------------------<p>We already have an automated supply chain and internal project and accounting systems. we now want to build:<p>- predictive models to estimate the output quality and delivery date of a task, at every stage of execution<p>- a work assignment system to decide which worker in our pool should be assigned each incoming task<p>- tools that use NLP, machine learning, and signal analysis to analyze incoming content and improve the signal for our predictions<p>- web applications(s) to help our supply chain management team better analyze the worker pool, run training campaigns, discover at-risk tasks earlier, and generally benefit from the smart stuff we&#x27;re doing<p>We&#x27;re starting a new team in Santa Monica to focus on this. Starting with two developers and a data scientist (plus some extra support), we&#x27;ll build an MVP and pilot it in production with some of our largest clients.<p>----------------------------------------<p>Who we&#x27;re looking for<p>----------------------------------------<p>Looking for an experienced senior developer who has built complex production web applications.<p>Skills needed:\n - Able to take the lead on making design decisions, setting standards in a team, and resolving issues<p>- Able to learn new programming languages<p>- Able to assess the merits of frameworks and 3rd party systems<p>- Basic knowledge of html &#x2F; css &#x2F; javascript (e.g. to build simple admin screens)<p>- Know enough linux and AWS to set up servers and clusters<p>- Willing to help steer the product direction<p>Nice to have:<p>- knowledge of Rails or Django (so we can reference the design of these frameworks when discussing how to set things up)<p>----------------------------------------<p>What we offer<p>----------------------------------------<p>This is a chance to build systems from scratch in whatever technologies we choose, while gaining data science and machine learning chops.<p>We are a stable, profitable company, and will not be asking for death marches.<p>We have 401k match, health insurance, and other typical benefits. The environment will be flexible and informal.<p>----------------------------------------<p>Tech stack<p>----------------------------------------<p>I&#x27;m thinking we should consider using python as our main backend language, since many of the toolkits on the data science side use it. But we&#x27;re going to have a heterogeneous environment regardless. I&#x27;d be fine with using Go, Scala, Rust, Elixir, or some other hot language for some of our stack if it helps interest the right person.<p>If you have any interest in this, please email me directly: doug.knoll@welocalize.com","time":1422844398,"type":"comment"}