{"by":"ChrisFilo","id":8983052,"parent":8980047,"text":"Stanford University - Stanford, CA, USA - Full time - Full Stack developer - VISA<p>Stanford University is looking for full-stack engineers to help grow a web platform for sharing and analysing scientific data - OpenfMRI.org. You’ll be working closely with Stanford scientists to push forward our vision of open and reproducible research. We’re looking for passionate and open minded individuals with advanced Python coding skills and experience with the Django framework to join our enthusiastic and friendly team.\nYou should be comfortable working within the entire development stack from building and configuring servers and services, through to implementing user interactions and design. Every day at Stanford will present learning opportunities with the smartest minds in the world, where your comfort zone will be continually challenged. Your work will have direct influence on availability of neuroimaging data which will lead to better understanding on how the brain works and how to treat neurological disorders.<p>Stanford University is an equal employment opportunity and affirmative action employer and is committed to recruiting and hiring qualified women, minorities, protected veterans and individuals with disabilities.<p>We welcome application from non-US residents (we can help with obtaining a VISA).<p>Responsibilities:\n- Build and maintain a high-performance &amp; scalable web platform\n- Develop solutions for handling and curating big datasets\n- Write front-end code using HTML5, CSS, JavaScript, and the Django template engine\n- Proactively look for ways to improve performance, simplify interactions, and make the platform better\n- Collaborate closely on a shared vision with Stanford research staff and the wider open source community<p>Qualifications:\n- Disciplined approach to testing, quality assurance, and delivery\n- Solid understanding of the full web technology stack\n- Extensive experience with web infrastructure\n- Strong command of web standards, CSS-based design\n- Expert Python programming skills\n- Deep knowledge of the Django framework<p>Minimum Skills:\n- B.S. or higher in Computer science, or equivalent\n- Detail-oriented with uncompromisingly high standards\n- Understanding of CS concepts such as: common data structures and algorithms, profiling&#x2F;optimization\n- Good understanding of OS concepts &amp; internals with Linux&#x2F;Unix&#x2F;BSD, and practical knowledge of shell scripting\n- Good communication skills and high degree of responsibility for the delivered code<p>Additional skills:\n- Past contributions to open source projects\n- Experience with analysing spatio-temporal data\n- Experience with semantic web technologies<p>If you are interested please apply here: <a href=\"https://stanford.taleo.net/careersection/jobdetail.ftl?job=65554\" rel=\"nofollow\">https:&#x2F;&#x2F;stanford.taleo.net&#x2F;careersection&#x2F;jobdetail.ftl?job=6...</a>","time":1422860806,"type":"comment"}