{"by":"joshuakarjala","id":8983627,"parent":8980047,"text":"<a href=\"http://sonofatailor.com\" rel=\"nofollow\">http:&#x2F;&#x2F;sonofatailor.com</a><p>Son of a Tailor is the world’s first online T-shirt tailor. We have recently received our first large investment and are experiencing great international growth and interest from the most influential international lifestyle media. Exciting days lay ahead.<p>Son of a Tailor’s vision is simple but ambitious: to be the best T-shirt maker in the world. We want to achieve this by making T-Shirts that are made to our customer’s specific measurements, one by one.<p>We launched our current web shop Oct 2014 and it has been well received by customers and media. But our ambitions stretch much further.<p>We are not like traditional clothing companies, and we are not aiming to be. In the spirit of a truly personal relationship with the end user, our business does not rely on mass production to achieve profit. It relies instead on the personal connection and continuing relationship customers have with our product. A connection that we want to establish by making something unique for them.<p>Your greatest responsibility as our CTO, will be to deliver a world class user experience to our customers and enable us to stand out as a truly unique brand. You will also take the lead on designing and building a solid operational foundation which will enable Son of a Tailor to continue it’s growth. Your daily work will be in close co-operation with the rest of the leadership team.<p><i>Responsibilities</i><p>- Deliver a world class user experience to our customers<p>- Take the lead on developing a strong technical framework and foundation<p>- A key player in ramping up and building our tech team<p><i>REQUIREMENTS</i><p>- Experience with building high quality webshops<p>- Strong understanding of what a commercial brand needs for high quality user experience<p>- Ability to produce first class work at all ends of the stack<p>- Experience in setting up analytics that deliver actionable insights about customer flow, product portfolio, pricing etc.<p>- A desire to innovate within your field and challenge the status quo<p>- Experience with creating new online concepts from the ground\nInterest in branding and lifestyle products<p><i>apply here</i><p><a href=\"http://son-of-a-tailor-1.workable.com/jobs/36576\" rel=\"nofollow\">http:&#x2F;&#x2F;son-of-a-tailor-1.workable.com&#x2F;jobs&#x2F;36576</a>","time":1422875080,"type":"comment"}