{"by":"OneHouse","id":8983274,"kids":[9007886,9007887],"parent":8980047,"text":"OneHouse - Hong Kong - Full Time - Full Stack Developers (expert at Ruby on Rails)<p>OneHouse is an innovative and user-focused real estate marketplace in Hong Kong, and expanding to Asia cities, provided by EC Property (HK) Limited.<p>With its epoch-making user experience, owners, buyers, tenants and real estate agents would have a totally new and unimaginable way to find your home, as reflected in its slogan - Experience Your Way Home (搵出新體驗).<p>Differentiated from other property websites which are swamped with fake or unavailable listings and information initiated by real estate agents in order to lure customers, OneHouse offers a comprehensive two-pronged approach, combining online and offline solutions to effectively solve the problem and ensure the authenticity of information.<p>Driving to equip consumers with easy and handy tools in the process of property transaction to realise real estate agent professionalisation and individualisation, we help them to build up their profile, portfolios and track records with first class marketing tools and latest software to manage and enhance their business.<p>We are the member company of the Incu-App Programme of Hong Kong Science Park and have offices both in Science Park and Causeway Bay. We are currently building a diligent, creative and energetic team of designers and developers to be part of our company. If you want to work in a challenging environment with a talented team, and tackle exciting and awesome projects with rewarding remuneration, we invite you to apply.<p>Full Stack Developers<p>What we are looking for: \nA full-stack developer expert at Ruby on Rails, a minimalist and a pragmatist who like to write clean code.\nA technologist who could design, deploy and scale real-world Rails apps.\nA programmer who have a solid understanding of object oriented design and design patterns.\nA thinker who consider testing to be an integral part of the coding workflow.\nA talent who follow best practices (testing, continuous integration, refactoring, consistent code standards).\nA guru who are well familiar with our developer community (open source, tech meetups, etc).","time":1422866818,"type":"comment"}