{"by":"G228","id":8983234,"kids":[8985258],"parent":8980047,"text":"REMOTE. Software Engineer positions working in Haskell development with FP Complete.<p>Depending on your current jurisdiction, this will either be a full-time contractor position, or an employee position. This is a telecommute position: you can work from home or wherever you choose, with little or no travel. Location in North America preferred; but you will work with colleagues who are both on North American and European hours.<p>FP Complete is looking to hire several engineers to join our Haskell development team, both to build great new core products and to work with our clients.<p>Activities:\n- distribute existing and new code over large clusters\n- code parallelization and performance tuning,\n- interface with foreign math and scientific libraries,\n- relentlessly refactor for composability, testability and clarity, \n- identify performance bottlenecks and debug known issues,\n- implementing unit tests, integration tests, acceptance tests,\n- write clear and concise documentation.<p>Skills:\n- strong experience writing process driven application code in Haskell.\n- experience building reusable components&#x2F;packages&#x2F;libraries and demonstrated ability to write well structured and well documented code,\n- ability to evolve and refactor large code bases,\n- experience working under test driven methodologies,\n- ability to interact with a distributed development team, and to communicate clearly on issues, in bug reports and emails.<p>These further skills are a plus:\n- Bachelor’s or Master’s degree in computer science or mathematics,\n- experience developing products in a regulated environment (avionics&#x2F;medical&#x2F;finance).\n- experience building scalable server&#x2F;Web applications,\n(web) UI design and implementation experience,\n- an understanding of the implementation of GHC’s multithreaded runtime, experience as an architect and&#x2F;or a creator of technical specs.<p>If you’d like to be part of our team please send a resume or CV to jobs+dev@fpcomplete.com. Any existing work - either a running website or an open source codebase - which you can include as links is greatly appreciated.<p>Full job listing here: <a href=\"https://www.fpcomplete.com/blog/2015/01/hiring-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fpcomplete.com&#x2F;blog&#x2F;2015&#x2F;01&#x2F;hiring-software-engi...</a>","time":1422865800,"type":"comment"}