{"by":"sophiestrap","id":8984315,"parent":8980047,"text":"Cincinnati, Ohio | Mobile Developer\nStrap\n<a href=\"https://angel.co/strap/jobs/39502-mobile-developer-cincinnati\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;strap&#x2F;jobs&#x2F;39502-mobile-developer-cincinnat...</a>\nDescription:<p>Apply to Strap\nStrap Jobs\nMobile Developer - Cincinnati at Strap\nApply to Strap\n Share<p>DESCRIPTION\nStrap is looking for a Lead Mobile Developer to join our growing team in Cincinnati, Ohio’s historic Over-The-Rhine neighborhood. The mobile developer has 5+ years of experience with native and hybrid development on both Android and iOS. You will be responsible for successful execution of all of the developer facing Strap SDKs for both mobile and wearable platforms. Day-to-day, you will work closely with the CTO to ensure that your team is on track to meet the goals of the sprint. A high degree of comfort with both Java and Objective-C is required. The expectation is that you are the resident expert in all things mobile related. Experience with one or more wearable platforms (Android Wear, Google Glass, Pebble, Tizen) is strongly preferred. Ideally, you&#x27;ve built and documented API&#x27;s and shipped products that are built for developers.\nAt Strap, we follow a fairly rigorous agile development process. You are expected to communicate your progress “stand-up” style daily while maintaining your work in feature branches with frequent commits. The goal is not to add meaningless processes to your plate; rather, we believe that communication and transparency are two extremely important factors in a successful development team.\nAll developers are expected to also be evangelists for Strap, so you’ll spend 10-15% of your week (NTE 6 hours) being extroverted in some form. Examples include blogging, spending time on Stack Overflow answering questions, or contributing to open source projects. These activities may or may not be directly related to content marketing, but being in the community as a representative of Strap helps our street cred tremendously.\nYou may be asked to travel periodically for conferences, hackathons, or other professional engagements. Travel is not expected to exceed 10% annually.<p>SKILLS\nCommunity Evangelism, Android, iOS Development, Developer Tools, Google Glass, Tizen, SDK, Pebble, Android Wear","time":1422888106,"type":"comment"}