{"by":"andreroman55","id":8985306,"parent":8980047,"text":"Cognitive Medical Systems - San Diego, CA\nwww.cognitivemedicalsystems.com<p>QA Engineer:<p>Must be legally authorized to work for any employer in the United States without sponsorship.<p>Quality Assurance Engineer Duties:<p>•\tIdentify, create and execute functional test case scenarios&#x2F;suites that fully satisfy requirements\n•\tDesign, develop and execute functional test cases that ensure the software meets the intended requirements and quality standards\n•\tLeverage agile testing framework, design and codes functional test cases and scenarios pertaining to various components of the application that ensures the software meets the intended requirements that meets all established quality standards specified in test plan\n•\tLead in defining acceptance criteria for user stories\n•\tWork closely with Product Owners to understand product specifics and to create corresponding test plan, quality standards, and strategies for the project\n•\tReview test scenarios for completeness\n•\tParticipate in improving test processes, propose new ideas on how to improve customer satisfaction and quality of product\n•\tDocument and classify defects in a defect tracking tool\n•\tEnsure that all best practices and enterprise standards are followed\n•\tSpecial projects as assigned<p>Requirements:<p>•\tBachelors degree\n•\t5+ years’ software testing experience including test automation and&#x2F;or infrastructure development, test planning, test case design, test methodologies\n•\tApplicants may be subject to a government security investigation and must meet eligibility requirements for access to classified information\n•\tExperience with Java testing tools (e.g. JUnit, TestNG)\n•\tExperience with JavaScript testing tools (e.g. Selenium&#x2F;WebDriver, Cucumber, Gherkin, Ruby)\n•\tSpock Framework\n•\tExperience with a Java IDE (e.g. Eclipse, NetBeans…)\n•\tExperience testing VA VistA applications is desired\n•\tExperience testing web based applications for 508 compliance\n•\tAbility to understand functional&#x2F;technical specifications<p>Desired:<p>•\tHealthcare experience\n•\tExperience with SureFire and Failsafe Maven plugins\n•\tExperience with OS X and Linux scripting is desired<p>As an emerging concept-engineering company, Cognitive Medical Systems is making its mark in both the software and healthcare communities in San Diego and the United States. This local and national recognition has increased our growth potential and we are welcoming talented individuals to join our team. We need new team members who can help us reach our goal of improving the quality of healthcare that produces impactful Clinical Decision Support systems. Our high quality engineering solutions are positively impacting legacy healthcare systems and integrating them with contemporary technologies so that patients and physicians alike are presented with the best healthcare delivery options available. Cognitive needs individuals with the right skill and knowledge set to help us continue our growth and mission of positively impacting the world of healthcare.\nWe offer a competitive compensation &#x2F; benefits package and the opportunity to earn equity through incentive stock options.<p>Please send resume to careers AT cognitivemedicine.com with Quality Assurance Engineer in the subject line.<p>Cognitive Medical Systems is an Equal Employment Opportunity (EEO) employer and welcomes all qualified applicants. Applicants will receive fair and impartial consideration without regard to race, sex, color, religion, national origin, age, disability, veteran status, genetic data, or religion or other legally protected.","time":1422897727,"type":"comment"}