{"by":"erydo","id":8986386,"parent":8980047,"text":"Preo Mobile Ordering - New York, NY - Front End or Full Stack Engineer - Full-Time<p><a href=\"https://getpreo.com\" rel=\"nofollow\">https:&#x2F;&#x2F;getpreo.com</a><p>Preo has built the most advanced mobile ordering app and venue integration in the world: Order and pay for food and drinks from your phone, get an alert when it&#x27;s ready, and never deal with a tab again. You never have to flag down the bartender at club or the hotdog guy at the game.<p>We&#x27;re starting to work with some Large-with-a-capital-L partners to expand, and we want you to be a part of that.<p>Join a small but incredibly talented team doing native iOS and Android development, web interfaces, server-side integration, and developing and producing our own electronics and hardware. Yep, you read the last part right. Our product is freaking cool and works like a dream.<p>The engineers you&#x27;ll be joining used to make military drones (if you&#x27;ve seen The Interview, our code&#x27;s on that). This weekend the whole team took a break and made a 48-hour iPhone and Android game just for fun: Look for &quot;Space Dozer: Moon Plow&quot; in the app stores soon ;)<p>Our apps are native (Objective-C, Swift, Java). Our backend is primarily python (with Flask, Postgres, AWS, etc.). Our API is RESTful. We use git and GitHub religiously; we contribute upstream. Our web interfaces are simple right now (HTML&#x2F;CSS&#x2F;JavaScript + jQuery) but are going to focus more on those soon: want to help? Have you used Angular&#x2F;Ember&#x2F;REACT&#x2F;…?<p>We would love either an incredibly talented generalist who, like us, can jump in and get things done (and done right) in a myriad of domains; or an enthusiastic front-end developer who <i>loves</i> making native and web applications work well. You&#x27;ll be working with world-class designers and you&#x27;ll be working on a product that changes how you and others do real things in real life. Seriously, it&#x27;s rewarding to go somewhere and get to use your own product; especially this one.<p>We prefer on-site (Manhattan) at least part of the time. You can find more info in our listings on AngelList etc.<p>Reach me directly at robert+hn@getpreo.com and check out our website[0], an app walkthrough[1], and a video from a recent convention[2]<p>Robert (CTO+Co-Founder)\nPreo<p>[0] <a href=\"https://getpreo.com\" rel=\"nofollow\">https:&#x2F;&#x2F;getpreo.com</a><p>[1] <a href=\"https://vimeo.com/preo/user-experience\" rel=\"nofollow\">https:&#x2F;&#x2F;vimeo.com&#x2F;preo&#x2F;user-experience</a><p>[2] <a href=\"https://vimeo.com/preo/bizbash-2014\" rel=\"nofollow\">https:&#x2F;&#x2F;vimeo.com&#x2F;preo&#x2F;bizbash-2014</a>","time":1422906230,"type":"comment"}