{"by":"greattypo","id":8987247,"parent":8980047,"text":"Clever (YC S12) is hiring full stack engineers in San Francisco to help improve K-12 education<p>At Clever, we’re building a distributed platform for educational software.  Our API helps developers get their educational applications in front of millions of students, and it helps schools manage all their apps while keeping their students’ data secure - for free.<p>We’ve also experienced incredible growth: after only two years of existence, we’re moving data for 13 million students, and we’re in 1 in 5 schools in America (over 30,000 schools).  We’ve just raised a $30M Series B, and we’re ready to expand even more rapidly.<p>Where you fit in:\nWe’re looking for full stack engineers: developers who are willing to work across the stack and have some kind of specialty, whether that’s product design, DevOps, databases, or system programming.  Right now we’re a team of 47 people (20 engineers), and we work mostly in Node (Coffeescript), Go and Python.<p>Other stuff we like:<p>-Tech talks. Every other Tuesday, we do “Clever Talks” during lunch where one of us will give a presentation on anything he&#x2F;she’s interested in. Recent talks have covered exoplanets, neuroscience, the history of hip-hop, hacking big-company customer service interactions, and what’s wrong with American high school history education.<p>-Bughouse chess. We play pretty frequently, although not always with Magnus Carlsen: <a href=\"http://screencast.com/t/xD7umWfo\" rel=\"nofollow\">http:&#x2F;&#x2F;screencast.com&#x2F;t&#x2F;xD7umWfo</a><p>-Picking up new skills. We offer unlimited Amazon credits for learning.<p>Check us out: <a href=\"https://clever.com/about/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;clever.com&#x2F;about&#x2F;jobs</a><p>At Clever, we want to work with the best people - applicants of all backgrounds and beliefs are welcome to come improve education with us.  We&#x27;re committed to making our office a safe and comfortable environment for all employees.","time":1422913703,"type":"comment"}