{"by":"mkopinsky","id":8988080,"parent":8980047,"text":"Way to Health, University of Pennsylvania - Philadelphia, PA<p>Chronic illness and the decisions people make and act upon – from their activity level to taking medications or smoking – drive the vast majority of the $3 Trillion in US healthcare costs. Our team has achieved breakthrough results in changing the behaviors that determine health outcomes, such as doubling adherence to medications that keep people healthy and out of the hospital, and establishing new insights into patient engagement.<p>These results were enabled by the Way To Health platform, a unique technology asset now poised to move beyond research into broader clinical applications. The role we’re looking to fill is critical to expanding our impact. We need someone who can not only work with our team of internationally recognized thought leaders to identify and implement functionality and designs making interventions more effective, but also has the ability to evolve Way to Health into a scalable clinical platform that can be deployed efficiently in larger populations. The Way to Health developer role offers the opportunity to make a meaningful difference in patients’ lives and their health outcomes.<p>This role also affords the right candidate a great deal of autonomy in both how you do your work and in crafting a vision for the technology. We’re looking for team members who love problem solving and finding better ways to get things done.<p>Specific responsibilities include:\n* Collaborating with faculty to translate cutting edge research protocols into functionality for patient engagement and behavior change\n* Developing new features for individual interventions and for the platform\n* Working with the development team to iteratively determine the best way to meet project goals in a timely, robust and scalable manner\n* Crafting architectural approaches to drive down the cost of feature development and deployment\n* Designing new methods of information delivery and display for increased patient comprehension and response\n* Diagnosing reported issues, identifying the source of problems, determining the best path to resolution and implementing fixes\n* Evolving and supporting QA processes, writing automated unit and functional tests for new features, documenting work clearly, and finding ways to continuously improve quality\n* Participating in an agile development process (we use a modified version of Scrum)\n* Working with infrastructure providers to plan for future needs and ensure timely, efficient and reliable delivery<p>Older tech stack is symfony&#x2F;PHP&#x2F;mysql, but we&#x27;re migrating more and more to our node&#x2F;mongo stack.<p>More info and application at <a href=\"https://careers.peopleclick.com/careerscp/client_pennmedicine/external/jobDetails.do?functionName=getJobDetail&amp;jobPostId=34141&amp;localeCode=en-us\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.peopleclick.com&#x2F;careerscp&#x2F;client_pennmedicin...</a><p>Feel free to email me at myHNusername at waytohealth.org with questions.","time":1422922771,"type":"comment"}