{"by":"kedargj","id":8990870,"parent":8980047,"text":"Dolby Labs - Sunnyvale, Full time (Embedded Software Engineer)<p>Dolby Laboratories creates technologies that enhance the entertainment experience.<p>We are looking for Embedded Systems Software Engineers in the Advanced Imaging Group at Dolby.  On this team you will revolutionize how people create, deliver, and enjoy entertainment worldwide on PCs, gaming consoles and mobile devices. To do that, we need the absolute best talent, including insatiably curious engineers and scientists.<p>At Dolby, science meets art, and high tech means more than computer code. As a member of the Dolby team, you’ll see and hear the results of your work everywhere, from movie theaters to smartphones. We continue to revolutionize how people create, deliver, and enjoy entertainment worldwide. To do that, we need the absolute best talent. We’re big enough to give you all the resources you need, and small enough so you can make a real difference and earn recognition for your work. We offer a collegial culture, challenging projects, and excellent compensation and benefits.<p>The qualified candidate will develop novel image&#x2F;video processing and video compression technology that enables the next generation of Dolby technologies.<p>The role will involve:<p><pre><code>  - Developing software that enables the next generation video technologies created by Dolby.\n  - Working closely with Research group to develop proof of concept platforms, SDKs, plug-ins for external products, etc.\n  - Engage in software development, mapping complex processing power intensive algorithms to existing  decoder platforms, writing test procedures, interacting with customers, etc.\n  - Analyzing break through video concepts developed by research and provide feedback to research on the specifications and other technical documentation.\n  - Comprehension of reference code from research team with in-depth understanding of each module.\n  - Analyzing and understanding the system architecture of the TV SoCs, gaming consoles, STB architectures, etc. supplied by partner companies and create high level design to map the Dolby technologies on their products.\n</code></pre>\nApplication Details:<p>Apply by sending your resume to dolby@gapjumpers.me or apply at <a href=\"https://www.gapjumpers.me/questions/dolby-laboratories/qs-195/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gapjumpers.me&#x2F;questions&#x2F;dolby-laboratories&#x2F;qs-19...</a><p>We are committed to having a meritocratic and transparent hiring process.<p>In order to proceed to the next stage of the interview process, we want to make sure that you are genuinely excited about Dolby and are able to solve the types of challenges we face.<p>So, every applicant will be given an equal opportunity to prove themselves to the engineering team at Dolby in an interview.","time":1422977466,"type":"comment"}