{"by":"Crosslend","id":8991017,"parent":8980047,"text":"FinTech Startup still in the stealth mode -- Berlin -- Fulltime Senior Backend Developer (m&#x2F;f)<p>Your opportunity: \n-We are a Berlin-based, FinTech start-up. For the time being, we are in stealth mode. You will learn about us once we start talking. \n-Team of more than 20 professionals from more than 10 nationalities, our working language is English; Operating in 4 european markets; \n-Entrepreneurial working experience in a fast moving international environment; \n-Beautiful office in the heart of Berlin at Hackescher Markt.<p>You will get the opportunity to work in an innovative, high-speed and exciting start-up in the heart of Berlin with a young and international team. You will have the chance to interact with the CTO, CEO, CMO, the Internal and External Development team, Product Managers and the Head of Operations in order to build and integrate Saas&#x2F;Cloud based Customer Care solutions.<p>Your Role: \n-Reporting to the CTO the duties and responsibilities of the Senior Backend Developer that include: \n-Co-working with other software developers, business analysts, software architects and IT professionals to implement inhouse CRM solutions; \n-Developing and maintaining a platform roadmap; \n-Customizing the system in order to meet the business needs of the company; \n-Integrating existing systems and services into the CRM architecture; \n-Assisting with deployment and provisioning activities.<p>Your profile: \nRequirements: \n-Symfony2 (2 yrs+) \n-Sonata \n-SQL and NoSQL design \n-Git \n-Testing, phpunit and BDD \n-Services integration \n-Some Sys Admin skills (ideally AWS) for deployment \n-Code Quality \n-Willing to have a platinum medal in sensio insights \n-English fluent, German is a plus<p>Sounds like you? Send your updated CV to fintechjob@gmail.com . \nThis position is available immediately.<p>If you have any questions, please do not hesitate to contact us.","time":1422978854,"type":"comment"}