{"by":"sanke93","id":8992580,"parent":8980047,"text":"Dentboard - Princeton, New Jersey - Full-time - Project Manager&#x2F;Product Designer<p>Dentboard (www.dentboard.com) is redefining the way dental providers use data to make everyday decisions. A customer-centric company, we’re chock full of awesome people who are passionate about our product and the doctors who use it. We are Dentist founded and led and have raised 1.2M in seed funding so far<p>Culture<p>At Dentboard, you’ll create and ship software everyday that is fundamentally changing the way the dental industry operates. Engineers at Dentboard own the product that they build completely and wear multiple hats during the development process. And thus, you should be able to empathize both with users and the rest of your team. This means considering both how our users will use your software and how your peers will use your code.<p>We are currently looking for a a ProjectManager&#x2F;Product Designer. He&#x2F;She will work with the CEO and business development teams to convert market data into a product idea for each release. As a Designer, this role requires converting that product idea into designs for the tech team to work with. As a Project Manager, the role will also require working with the technical team to decide resource allocation to complete each version of the product.<p>Responsibilities:<p>-Act as Product Manager in an autonomous team responsible for product<p>-Coordinate with Business Development and CEO regarding market data and user experiences<p>-Coordinate with Business Development and CEO to generate ideas for product versions.<p>-Transform the previously mentioned ideas for product versions into meaningful designs and mock-ups.<p>-Coordinate with the technical team regarding the implementation of each version and the designs.<p>-Stay 2+ weeks ahead of the technical team with designs.\n-Help work with team for designing user tests.<p>-Own, prioritize, and communicate the short, medium, and long term initiatives based on the KPIs used to evaluate each version of the product.<p>Requirements:<p>-2+ years product management experience in technology.<p>-2+ years Design experience in digital media&#x2F;technology (preferable).<p>-Self-motivated and autonomous.<p>-Great communication skills.<p>-Strong opinions regarding product development philosophy and customer development best practices.<p>Wants:<p>-Knowledge of front-end programming (javascript, angular.js, css, etc.)<p>-Knowledge of backend programming (python), but not necessarily experience with programming.<p>-Demonstrated passion and knowledge of healthcare industry and trends.<p>If you are interested, lets chat: sanket@dentboard.com","time":1422991102,"type":"comment"}