{"by":"courtewing","id":8993975,"parent":8980047,"text":"Senior Frontend Engineer - REMOTE (UTC to UTC-8), San Francisco, Portland, Dublin<p>We&#x27;re one of the oldest PaaS&#x27;s out there, with support for PHP&#x2F;Ruby&#x2F;node.js on AWS. As a Frontend Engineer, you&#x27;ll be working on our brand new UI - a single-page angular.js app.<p>The UI is served up by a lightweight node.js server that proxies to our core ruby api. We unit test with jasmine, and run our end-to-end tests in protractor. Through our &quot;eybot&quot; on slackhq, we deploy green CI builds to production multiple times a day.<p>The frontend engineering team at Engine Yard consists of 3 UI designers and 4 engineers (including myself). We&#x27;re spread out across 8 timezones (Dublin through San Francisco), so experience working in a distributed team is key.<p>You will:<p><pre><code>    * Write modern JavaScript for modern browsers\n    * Have a significant influence on the UI architecture\n    * Work with smart people every day\n    * Be an integral part of a new era in an established startup\n    </code></pre>\nYou might:<p><pre><code>    * Rewrite our trial experience so it doesn&#x27;t suck as much\n    * Build support for customers to deploy docker containers\n    * Convert the UI to CommonJS modules via browserify\n    * Create near-realtime visualizations for server monitoring\n    * Integrate 6to5 into our build system so we can use ES6\n    * Learn to homebrew, or at least talk about how you want to\n</code></pre>\nYou&#x27;ll get:<p><pre><code>    * Competitive salary\n    * Full medical, dental and vision benefits\n    * 25 paid days off per year (15 PTO, 2 floating, 8 holidays)\n    * 401(k)\n    * We take care of your phone bill\n    * Paid travel to conferences\n    * Top of the line Macbook Pro\n</code></pre>\nMust haves (seriously, these are essential filters):<p><pre><code>    * A string of successful projects and&#x2F;or positions in your wake\n    * Significant experience building complex client-side applications in\n      JavaScript, preferably with angular.js\n    * Experience working in a distributed team\n    * An impulse to write tests for everything you build, sometimes before you\n      build it\n    * A fantastic sense of sarcasm\n    * Ability to travel occasionally (at least once or twice a year)\n    * Somewhere between UTC and UTC-8\n</code></pre>\nGreat to have:<p><pre><code>    * Somewhere between UTC-5 and UTC-8\n    * Thorough understanding of git\n    * Experience building REST apis\n    * Experience with multiple languages (and an understanding of their tradeoffs)\n    * Experience with agile development\n    * Previously worked at a startup\n</code></pre>\nIf you&#x27;re interested and meet all the &quot;must haves&quot;, shoot me an email at cewing@engineyard.com","time":1423002792,"type":"comment"}