{"by":"Crosslend","id":8996221,"parent":8980047,"text":"FinTech Startup still in the stealth mode -- Berlin -- Fulltime -- CRM Developer (m&#x2F;f)<p>Your opportunity:<p>-We are a Berlin-based, FinTech start-up. For the time being, we are in stealth mode. You will learn about us once we start talking.<p>-Team of more than 20 professionals from more than 10 nationalities, our working language is English;<p>-Operating in 4 european markets;<p>-Entrepreneurial working experience in a fast moving international environment;<p>-Beautiful office in the heart of Berlin at Hackescher Markt.<p>You will get the opportunity to work in an innovative, high-speed and exciting start-up in the heart of Berlin with a young and international team.<p>You will have the chance to interact with the CTO, CEO, CMO, the Internal and External Development team, Product Managers and the Head of Operations in order to build and integrate Saas&#x2F;Cloud based Customer Care solutions.<p>Your role:<p>-Reporting to the CTO the duties and responsibilities of the CRM Solutions Developer that include:<p>-Co-working with other software developers, business analysts, software architects and IT professionals to implement inhouse CRM solutions;<p>-Developing and maintaining a platform roadmap;<p>-Customizing the system in order to meet the business needs of the company;<p>-Integrating existing systems and services into the CRM architecture;<p>-Assisting with deployment and provisioning activities.<p>Your profile:<p>Minimum Requirements:<p>-5+ years’ experience with software development in particular around Symfony2 and the sonata-project universe;<p>-Graduated in Computer Science or a related discipline or with a respective experience.<p>-Core-Competencies Requirements:<p>-Demonstrated proficiency in customizing and creating CRM entities;<p>-Demonstrated proficiency in understanding and implementing business workflows and processes;<p>-Demonstrated proficiency in integrating SDKs, third party providers and APIs;<p>-Experience with source control management systems and continuous integration&#x2F;deployment environments;<p>-Internally motivated, able to work proficiently both independently and in a team environment;<p>-Experience working on an agile development team;<p>-Have the chance to work in a company with 12 in the Joel Test.<p>Sounds like you? Send your updated CV to fintechjob@gmail.com .<p>This position is available immediately.<p>If you have any questions, please do not hesitate to contact us.","time":1423047637,"type":"comment"}