{"by":"saintlukas","id":9005736,"parent":8980047,"text":"Berklee Online, REMOTE POSSIBLE\nonline.berklee.edu \nPHP, JS, Ember or other modern JS frameworks. Strong SQL<p>Official Boilerplate Words:\nBerklee Online is the online extension school of Berklee College of Music, the world’s premier institution for the study of contemporary music for over sixty-five years.  Berklee Online is taking a leadership role in educating the next generation of producers, performers, and entrepreneurs in the evolving music industry, and as such, jobs at Berklee Online are fast-paced, collaborative, and have the feel and agility of a startup, but operate under the umbrella of an established, world-renowned educational institution.<p>Jobby stuff:\nCoding and deploying feature enhancements and bug fixes to a variety of applications including, but not limited to:\nThe online learning environment for our students\nCourse and content management systems\nInternal legacy business support systems<p>Support of integration work across various systems.\nMaintaining and improving existing technology.\nIdentifying third-party solutions when appropriate.\nWorking with internal customers from various departments to identify needs and participate in requirements definition and project planning.\nStaying current with web and mobile technology<p>Required Skills\nFamiliarity with Object Oriented Programming concepts\nFamiliarity with MVC concepts\nHTML, CSS, and Javascript fundamentals\nSource control (we use Git)\nRequired Experience<p>2-4 years PHP\n2-4 years SQL<p>Apply here, also email me, Luke Stevens: lstevens@berklee.edu. <a href=\"https://berklee.silkroad.com/epostings/index.cfm?fuseaction=app.jobinfo&amp;id=23&amp;jobid=598&amp;company_id=16215&amp;version=1&amp;source=ONLINE&amp;JobOwner=992479&amp;level=levelid1&amp;levelid1=36350&amp;parent=Berklee%20Online&amp;startflag=2\" rel=\"nofollow\">https:&#x2F;&#x2F;berklee.silkroad.com&#x2F;epostings&#x2F;index.cfm?fuseaction=...</a>","time":1423167610,"type":"comment"}