{"by":"laszlocph","id":9017856,"parent":8980047,"text":"COPENHAGEN, DENMARK EUROPE - SENIOR FRONTEND ENGINEER<p>Falcon Social is a Software-as-a-Service provider in the Social Media Management space. We provide a unified approach for marketers, customer service specialists and hr personnel of big international brands to manage their social media presence. That means plenty of challenging engineering tasks, complex UIs to simplify and data, loads of data.<p>We are looking for senior members for our engineering team. You are joining an ambitious team of experts who keep pushing the limit in product delivery and experiment furiously, while striving for technical excellence.<p>We are agile, organized ourselves into cross-functional, autonomous teams, focusing on one product with a clear mission. We intend to be flat, with everyone equal and with each member&#x27;s role respected. Day-to-day you will work together with people of different trades: frontend, backend engineers, ui&#x2F;ux designers, cloud operation engineers, and product owners.<p>We are a maturing startup with an engineering headcount of 20. We are not small anymore, and still growing rapidly. Working at a startup is the most rewarding choice what one can make, but it requires a certain personality as well. That being said, we value open people who take initiative more than lone rockstars.<p>Falcon Social’s frontend is a single page web application built with AngularJs, Require.js, Bower, Grunt, D3.js \non top of a REST flavored HTTP+JSON api served by a lighthweight Java8 backend running on DropWizzard, PostgreSQL, ElasticSearch, AWS, Apache Spark and Python.<p>Extensive experience with a modern MVC Javascript framework (Ember, Angular, Knockout) is a must for this position.<p>AS A SENIOR MEMBER OF THE TEAM, YOU<p>deliver high quality solutions<p>act as a sparring partner to various members of the team<p>constantly share and debate best practices with your peers\ntake initiative<p>know when to speak up, know when is time for crunching<p>perhaps able to lead a group of engineers<p>perhaps enjoy mentoring<p>AS A FRONTEND ENGINEER, YOU<p>will be involved in building the rich user interface that hundreds of global client teams work with every day<p>would be responsible for developing high quality UI, using the Falcon Platform&#x27;s apis<p>will be creating engaging data visualizations and tools for our clients, planning, and structuring great UX across the platform<p>WHAT WE CAN OFFER<p>Open and informal work environment with more than 30 different nationalities(<a href=\"https://www.youtube.com/watch?v=_e2Kd8HuXEU\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=_e2Kd8HuXEU</a>)<p>High level of responsibility, newest technologies, room for experimentation<p>Working at a central location in Copenhagen (the home of the best craft beer and bicycle lanes in Europe, also the most liveable city on the planet: <a href=\"https://www.google.dk/?gws_rd=cr,ssl&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;ei=jdm7VK_bE4XgywPN_IGADQ#q=the+most+liveable+city+copenhagen\" rel=\"nofollow\">https:&#x2F;&#x2F;www.google.dk&#x2F;?gws_rd=cr,ssl&amp;amp;amp;amp;amp;amp;amp...</a>)<p>5 weeks paid vacation<p>Yearly personal conference budget<p>Healthy lunch and drinks<p>Healthy and not so healthy snacks. We take our candy seriously!<p>Choose your own gear<p>A phone of your choice with subscription and internet for your home<p>Smoke machines in different shape and size. Look what we&#x27;ve built for the Øredev conference at Malmo: <a href=\"https://fogit.falconsocial.com\" rel=\"nofollow\">https:&#x2F;&#x2F;fogit.falconsocial.com</a><p>Friday bars<p>Of course, a foosball table","time":1423417596,"type":"comment"}