{"by":"breno","id":12017046,"parent":12016568,"text":"Scrapinghub | <a href=\"http:&#x2F;&#x2F;scrapinghub.com\" rel=\"nofollow\">http:&#x2F;&#x2F;scrapinghub.com</a> | 100% remote (all timezones!)<p>Scrapinghub Ltd. is looking for a Senior Designer, QA Engineer, Support Engineer and more: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;scrapinghub\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;scrapinghub</a><p>Quick summary of the open positions:<p>- Senior Designer: you’ll be in charge of everything related to UX and graphics for our entire suite of platform products.<p>- QA Engineer: you will estimate, plan, and coordinate testing activities to ensure product quality for all components of the Scrapinghub platform<p>- Support Engineer: you will provide customer support across all our platforms, working closely with development, sales and other technical teams  to ensure our customers are receiving the best service possible.<p>We&#x27;re a fully distributed company with 130 engineers and staff. Based around open source, we maintain Scrapy, Portia, Webstruct, Frontera, and other tools made for crawling and scraping massive web datasets– everyone at SH helps makes these projects grow, and we offer to pay you to work on open source if you have the right skills (though everyone inside the company is encouraged to contribute).<p>You&#x27;ll have the chance to work on projects that harvest and transfer datasets of thousands of millions of records, as well as build some of the systems that will deliver data to current Fortune 500 companies and the startups that are building great products on top of our stack.<p>We have a very engineering-driven culture (two engineer-founders) and a great place to work if you&#x27;re self-directed, curious, and interested in working in open source environments. More on Open Source at Scrapinghub: <a href=\"http:&#x2F;&#x2F;scrapinghub.com&#x2F;opensource&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;scrapinghub.com&#x2F;opensource&#x2F;</a>.<p>We&#x27;ve been growing a lot during the past two years and we&#x27;re looking for great additions to our team, wherever you&#x27;re located! Positions are full-time and include 20 days of paid vacations per year, your local country holidays, a hardware allowance, and an online services program for professional growth (Online courses, screencasts, books and more).","time":1467387846,"type":"comment"}