{"by":"ajoynt","id":12018503,"parent":12016568,"text":"Backend Engineer: DENVER ONSITE $89,542k-$150,314k and equity (based on experience)<p>What is n.io?\nn.io is a software company that believes there should be seamless connectivity between any device, any system and any signal — unrestricted in volume, real-time and intelligent. Our world is moving closer and closer to a day when every device will need to communicate securely and effectively; the n.io platform empowers that vision. We are a revenue-generating startup with a growing team of passionate and creative people.<p>Recent White Paper about n.io: <a href=\"http:&#x2F;&#x2F;harborresearch.com&#x2F;the-future-of-smart-connected-systems-and-information-automation&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;harborresearch.com&#x2F;the-future-of-smart-connected-syst...</a><p>The Opportunity\nDo you build software tools to help your current team operate more effectively? Do you love reading about and experimenting with the latest technology products and trends? If so, then n.io is the place for you. The ideal developer candidate has a passion for programming in general, rather than a specific language. As a back end developer, you will write code for the core n.io platform as well as the open-source blocks that connect to it. Be prepared to quickly iterate new concepts, hack on interesting technologies, and work with other teams to improve our current product.<p>Skills Needed\nExperience using Python in a production or professional environment\nExperience with git, GitHub, and version control standard practices\nA commitment to writing clean, commented, and test-driven code\nA general understanding of the different layers of the software stack and how they interact with one another\nThe ability to communicate effectively about technical concepts — this includes describing and discussing technical issues with a non-technical audience<p>For more information, or to apply, email our Very Special Agent Andrew Joynt at ajoynt (at)n(dot)io","time":1467397482,"type":"comment"}