{"by":"makmanalp","id":12019209,"kids":[12028726],"parent":12016568,"text":"Center for Intl Development at Harvard | Product Manager, Frontend Engineer | FULLTIME ONSITE Cambridge, MA (near Boston)<p>The Growth Lab (at the Center for International Development) is a research team that works to solve the issues of poverty in developing countries and focuses on the question, “Why do some countries grow while others don’t?” We are building a team of four&#x2F;five people within the Growth Lab creating web based data visualization tools, largely funded by governments (past examples include Mexico, Colombia, Peru). We’re aiming for one designer, two frontend engineers, perhaps one more person to do backend work - though we&#x27;re trying to prevent everyone from getting too siloed, and trying to hire people who are T-shaped: specializing at one sort of thing, but curious about related areas. We work alongside a larger team of researchers with diverse backgrounds.<p>---<p>One of the more recent sites we worked on: <a href=\"http:&#x2F;&#x2F;www.datlascolombia.com&#x2F;#&#x2F;?locale=en-col\" rel=\"nofollow\">http:&#x2F;&#x2F;www.datlascolombia.com&#x2F;#&#x2F;?locale=en-col</a><p>One of our older sites, focusing on international trade data: <a href=\"http:&#x2F;&#x2F;atlas.cid.harvard.edu&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;atlas.cid.harvard.edu&#x2F;</a><p>Our head researcher, talking about our ideas: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=2FeugaLv5Bo\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=2FeugaLv5Bo</a><p>A neat webgl project one of our interns did: <a href=\"http:&#x2F;&#x2F;globe.cid.harvard.edu&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;globe.cid.harvard.edu&#x2F;</a><p>---<p>Regarding the frontend engineer: see this older post: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=11815253\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=11815253</a> . We&#x27;re looking for folks experienced in building web apps with complex user interactions, and experience with building single page apps (the &quot;frontend backend&quot;) is strongly preferred.<p>Regarding the product manager, see this gist (this comment ended up being too long to post!) <a href=\"https:&#x2F;&#x2F;gist.github.com&#x2F;makmanalp&#x2F;bb7fb0cf50e3a44c2d1321a08e71c3db\" rel=\"nofollow\">https:&#x2F;&#x2F;gist.github.com&#x2F;makmanalp&#x2F;bb7fb0cf50e3a44c2d1321a08e...</a><p>---<p>To get in touch, use the link above or contact Andrea Hayes (andrea underscore hayes at hks dot harvard dot edu), preferably with work samples you&#x27;re proud of!","time":1467403026,"type":"comment"}