{"by":"clay_to_n","id":12018012,"parent":12016568,"text":"Stasis Labs | Los Angeles | Onsite or Remote | <a href=\"https:&#x2F;&#x2F;stasislabs.com\" rel=\"nofollow\">https:&#x2F;&#x2F;stasislabs.com</a><p>Stasis Labs is hiring a web engineer to help us improve the quality of medical care through smarter patient monitoring. We are working on a hard problem, and aim to make a sizable impact through technology. We build a connected vitals monitoring system for patients who are not currently monitored, and are launching our first product this year to Indian hospitals. We just graduated from the first class of the Techstars Healthcare Accelerator, in Partnership witch Cedars-Sinai.<p>We are seeking someone with experience in full-stack web development, dev-ops, server management, and web application deployment. We want you to own our web deployment process, and write great full-stack web code in an environment where security and data integrity are critical.<p>Our software stack includes C++ running on our device, an Android application for doctors, and a web application (node.js backend, React frontend). We&#x27;re using both Bluetooth Low Energy and wi-fi. Our cloud backend is an important part of our product.<p>You will primarily be on the web side (backend, frontend, and infrastructure), but you will be exposed to and helping integrate our Android app and medical device as well.<p>You will have a great deal of autonomy and be responsible for crafting the culture, technology and processes of our company. We&#x27;re a small team and are looking for someone who can learn quickly and become competent in multiple parts of the tech stack. We hope the idea of working with a variety of technologies excites you. Startup experience is a plus.<p>We are just beginning, and are striving to build an inclusive and positive company culture.<p>+ Requirements:<p>---- Experience with node.js<p>---- Experience building single page applications in JavaScript<p>+ Preferred:<p>---- Experience with React<p>---- Experience running highly reliable cloud servers on AWS or similar IaaS provider<p>---- Experience building web-connected Android applications<p>---- Experience working at a startup<p>To apply, please email a resume and cover letter (in the email body is fine) to software@stasislabs.com","time":1467393966,"type":"comment"}