{"by":"dban","id":12017309,"parent":12016568,"text":"Authorea | <a href=\"https:&#x2F;&#x2F;www.authorea.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.authorea.com&#x2F;</a> | Full time | Onsite | New York, NY (Flatiron)<p>Authorea is building GitHub + Google Docs for researchers. We were spun out of CERN by a group of astrophysicists who were frustrated with the cumbersome process of collaborating on scientific research. Our team is very small, but our tool is already being used at all 100 of the top 100 (Leiden Ranking) research universities. We also just raised a substantial seed round with brand-name VCs.<p>All positions require a passion for startups and for Open Science! More info at: <a href=\"https:&#x2F;&#x2F;www.authorea.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.authorea.com&#x2F;jobs</a><p>Positions (Abridged):<p>* WEB DESIGNER We’re looking for someone to help shape the look and feel of our product, i.e., make us look good. Really good. Great taste, great design skills, and an eye for web graphic design. Someone who can tell a story through design. Proven web design skills, knowledge of CSS and JS, and experience designing and building interfaces informed by user testing.<p>* UX&#x2F;UI ENGINEER - Authorea has a robust backend but it did not receive all the love it deserves on the front end. We&#x27;re looking for an engineer with strong design skills. Someone who will be able to understand the nitty gritty details of the Rails back end but who will spend most of their time on the Javascript&#x2F;CSS front end. In particular, we are looking for someone who will study and understand Authorea users and improve the platform&#x27;s user onboarding, experience, interfaces and interaction.<p>* GROWTH ENGINEER - Authorea is looking for a software engineer who can design, test, and implement customer acquisition and retention strategies. The role requires substantial technical expertise to implement innovative search marketing, search engine optimization, notification, and web analytics frameworks. This person would implement Authorea’s acquisition and retention programs. This position therefore requires familiarity with business and marketing objectives as well as experience building scalable acquisition and retention systems.<p>Drop us a line if you see something of interest! hi [at] authorea [dot] com<p>(Also, we&#x27;re always hiring interns!)","time":1467389394,"type":"comment"}