{"by":"rymohr","id":12018672,"kids":[12030076],"parent":12016568,"text":"Kumu | Honolulu, HI | REMOTE | Software engineer &#x2F; javascript developer<p>Kumu is a web-based data viz platform that helps people understand complex relationships, mostly through network, systems, and stakeholder maps. We’ve spent the past four years refining Kumu’s visualization platform and we’re embarking on our next phase: developing a suite of tools and products to simplify the process of creating maps (through surveys, custom forms, and integrations with other platforms) and making it easier to collaborate on maps remotely (through integrated discussions, branching&#x2F;forking, and version control).<p>We’re currently working with some of the world’s top organizations including The Omidyar Group, Gates Foundation, Hewlett Foundation, USAID, Stanford ChangeLabs, Democracy Fund, World Bank, Humanity United and more.<p><pre><code>    - Full-time position (remote or join team on Oahu)\n    - Salary $60-80k\n    - Equity 1-2%\n    - Small team with recurring subscription revenue over $100k &#x2F; year\n    - Flexible hours with a fun mission-driven team \n    - Stack: react, rails, webgl, webpack&#x2F;babel, aws, git&#x2F;github, slack, hangouts, IE11+\n    - Bonus points for experience with: graphs&#x2F;networks, couchdb, elasticsearch, redis, d3\n</code></pre>\nOn a day-to-day basis you’ll primarily be working with Ryan (@rymohr) and will be involved throughout the entire development process: from the initial brainstorm to flush out the basic architecture all the way to the final stages of testing and release. We like to move fast and ship often, and we try to break work into weekly deliverables to keep everyone’s expectations and progress in check. We do a quick hangout at the beginning of each week to revisit everyone’s immediate priorities.<p>Please send an email to careers@kumu.io if you’re interested or know somebody we can reach out to who might be. Thanks!<p><a href=\"https:&#x2F;&#x2F;kumu.io&#x2F;manifesto\" rel=\"nofollow\">https:&#x2F;&#x2F;kumu.io&#x2F;manifesto</a><p><a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;rymohr\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;rymohr</a>","time":1467398675,"type":"comment"}