{"by":"johnrball","dead":true,"id":12017355,"parent":12016568,"text":"Spreemo| Senior Data Scientist | Full-Time | NYC<p>As a Senior Data Scientist at Spreemo, you will work with a growing multidisciplinary team of talented Data Scientists, Statisticians, Healthcare Economists&#x2F;Epidemiologists, and Big Data Technology Experts. Together, you will create new and improved methods for assessing and predicting the quality of care delivered by healthcare providers and determining the impact that care quality has on overall patient outcomes and cost. In addition, you will develop related analytics tools for the payers, providers, and patients who use Spreemo’s platform to facilitate and coordinate delivery of care. You will have the opportunity to work with unique healthcare datasets that cover all phases of care delivery (referral, diagnosis, therapy, and outcome&#x2F;follow-up) from the perspective of all key stakeholders (patients, providers, payers).\nYour responsibilities will include helping to further build and extend the data analytics environment at Spreemo. You will be implementing data pipelines for ETL, data integration, and data exploration. You will develop regression and machine learning models for classification and prediction. Your responsibilities will also include helping to shape Spreemo’s data analytics strategy by identifying new opportunities and helping to lead and mentor junior members of the analytics team.<p>Qualifications: PhD or Master’s degree from elite institution in relevant technical discipline 5+ year’s work experience as a Data Scientist Experience with regression and machine learning models for classification and prediction Experience with methods for feature selection, dimension reduction, and quantifying goodness of fit Experience implementing data pipelines for ETL, data cleaning, and data integration Experience with R and&#x2F;or Python Experience with SQL and NoSQL databases Experience with unstructured data and NLP Experience with Hadoop, Spark, and related big data analytics tools Experience working with healthcare data<p>About Spreemo:\nSpreemo, a high-growth, venture-backed company headquartered in NY, is on a mission to improve patient outcomes through high-quality care. By establishing broadly accepted quality metrics for physicians and providing transparency of cost over a collaborative platform enabling end-to-end care management, Spreemo is doing just that. Today, the focus is on radiology and other diagnostic tests for occupational injuries – Spreemo connects patients with a nationwide network of over 4,000 diagnostic providers. At the same time, through its Quality Research Institute, Spreemo engages in innovative clinical research to help define best practice, establish a currency of quality, and understand implications for patient outcomes. Spreemo’s vision is to apply the lessons learned in radiology to other areas of medicine with the long-term aim of enabling true collaboration of high quality providers to deliver improved outcomes and reduced costs for America’s most pervasive injuries and illnesses.\n<a href=\"http:&#x2F;&#x2F;spreemo.com&#x2F;careers&#x2F;senior-data-scientist&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;spreemo.com&#x2F;careers&#x2F;senior-data-scientist&#x2F;</a>\nIf you’re interested in joining the team at Spreemo, please send a cover letter along with your resume to analytics@spreemo.com or John.ball@spreemo.com","time":1467389678,"type":"comment"}