{"by":"bittersweet","id":12016980,"kids":[12018824],"parent":12016568,"text":"Springest | Amsterdam, ONSITE | Full-time | VISA<p>Springest is a rapidly growing international marketplace for learning. From online trainings to university courseware,<p>Springest helps you find, compare, and book whatever you need to reach your personal and professional learning goals.\nWe are looking for a senior developer to join our product team. We use Holacracy which in short means we have no managers and you are in control of what you do. You help build and shape the product.<p>Stack: our main app is built on Rails with Postgresql, Elasticsearch, Redis and more. Next to this we have a lot of smaller services and internal tools where we use whatever tool is best for the job but we have Golang and Elixir&#x2F;Phoenix in production.<p>Springeteers are a happy bunch, and learning is very important here. Next to internal workshops, we regularly host meetups in the Ruby and DevOps spaces, most recently we hosted Elixir Amsterdam. We also organise monthly in-company hackdays where we work on creative ideas and new technologies that are not on our regular roadmap. Some hackday projects have grown out to become part of our core business. If you come up with a great idea you&#x27;re excited about, you can run with it and see how far it can go. Read more about that here: <a href=\"https:&#x2F;&#x2F;medium.com&#x2F;@springestdev&#x2F;how-to-run-an-all-company-hackathon-ad9c85b4420f\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;@springestdev&#x2F;how-to-run-an-all-company-h...</a><p>VISA: We can and have hired from outside the EU so we can help you get set up here in Amsterdam.\nEvery employee gets a 1000 Euro budget per year which you can use to go to conferences, buy books etc to develop yourself. We are an English speaking company but some of us have also used it to learn Dutch.<p>Interview process: When hiring we like to talk in person or on the phone to get to know you, after which we do a 1-2 day trial to get a feel for your working style. This also helps you get a better impression of our team, our working environment, and the Holacratic process.<p>* Learn more about Springest: <a href=\"http:&#x2F;&#x2F;about.springest.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;about.springest.com&#x2F;</a> and <a href=\"http:&#x2F;&#x2F;over.springest.nl&#x2F;werken-bij-springest&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;over.springest.nl&#x2F;werken-bij-springest&#x2F;</a> (Dutch)\n* About Holacracy: <a href=\"http:&#x2F;&#x2F;about.springest.com&#x2F;holacracy&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;about.springest.com&#x2F;holacracy&#x2F;</a>\n* What it&#x27;s like to work at Springest: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=zNBgkhkPK14\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=zNBgkhkPK14</a>\n* More about the vacancy: <a href=\"http:&#x2F;&#x2F;devblog.springest.com&#x2F;vacancy-senior-ruby-on-rails-developer-in-amsterdam\" rel=\"nofollow\">http:&#x2F;&#x2F;devblog.springest.com&#x2F;vacancy-senior-ruby-on-rails-de...</a><p>If you have any questions or want to apply, contact mark@springest.com","time":1467387538,"type":"comment"}