{"by":"cyngn-recruit","id":12018837,"parent":12016568,"text":"CYANOGEN | Seattle, WA and Palo Alto, CA | On-site Only | Relocation Assistance | Full Time | Visa (transfer only)<p>Cyanogen Inc was founded to make our popular open source CyanogenMod project accessible to a broader consumer base worldwide in the form of Cyanogen OS, a mobile OS built on Android that is known for its revolutionary personalization features, intuitive interface, speed, improved battery life, and enhanced security.<p>Here are some of our open positions:<p>1) Director of Software Development: drive strategy, architecture, and implementation for our Services Team responsible for the large-scale platforms supporting a diverse range of mobile services.<p>2) Android Software Engineer [mid and Senior level]: You’ll contribute work that is fundamental to the Cyanogen experience by adding features to the Android frameworks, exposing them to apps, and allowing for deeper, richer experiences for our community to utilize. You’ll need extensive experience developing complex Android applications and exceptional OO design and development skills.<p>3) Software Engineer - Back-end [mid and Senior level]: Build the scalable, distributed systems that power our mass-market mobile services accessed by 50M+ users. You’ll need hands-on experience with large-scale, distributed platforms, such as AWS, and excellent OO development skills. These services are being developed with Java NIO and open source frameworks like Vert.x and Netty<p>4) DevOps Engineer: Part of the Services Team mentioned above. You&#x27;ll help to troubleshoot and identify solutions to production scalability problems. You&#x27;ll need to be strong with AWS&#x2F;EC2 and have good experience with deployment automation.<p>5) Sr. Technical Program Manager: You&#x27;ll lead engineering execution for our most strategic products. You’ll collaborate with teams across the company including product, engineering, and marketing. Your oversight and ownership will be enormous -- from silicon to cloud, bringing awesome new partner devices, apps, and services to market.<p>6) Principal Security Expert: From the lowest levels of the OS to the application stack to the cloud services and updaters that power Cyanogen’s unique Android operations you&#x27;ll drive security processes, tools, and policy and report on these efforts to executives and the CEO. You’ll work closely with all parts of the engineering organization to ensure leading-edge security across everything we build and ship. You will need to dig deeply, evaluate threats, and resolve them.<p>Cyanogen is a well-funded startup with offices in Seattle and Palo Alto. We announced our MOD Platform at MWC this year and are creating new mobile experiences that weren&#x27;t previously possible.<p>More info here: <a href=\"http:&#x2F;&#x2F;venturebeat.com&#x2F;2016&#x2F;02&#x2F;22&#x2F;cyanogen-launches-mod-platform-to-give-developers-google-like-access-to-android-os\" rel=\"nofollow\">http:&#x2F;&#x2F;venturebeat.com&#x2F;2016&#x2F;02&#x2F;22&#x2F;cyanogen-launches-mod-plat...</a><p>Hands-on Demo: <a href=\"http:&#x2F;&#x2F;www.theverge.com&#x2F;2016&#x2F;2&#x2F;22&#x2F;11092050&#x2F;cyanogen-microsoft-android-apps-integration\" rel=\"nofollow\">http:&#x2F;&#x2F;www.theverge.com&#x2F;2016&#x2F;2&#x2F;22&#x2F;11092050&#x2F;cyanogen-microsof...</a><p>Check us out at <a href=\"http:&#x2F;&#x2F;cyngn.com\" rel=\"nofollow\">http:&#x2F;&#x2F;cyngn.com</a> and view all of our open positions here: <a href=\"http:&#x2F;&#x2F;goo.gl&#x2F;pThdov\" rel=\"nofollow\">http:&#x2F;&#x2F;goo.gl&#x2F;pThdov</a>, or email us at recruiting AT cyngn DOT com with questions.","time":1467399871,"type":"comment"}