{"by":"natelyman","id":12020335,"kids":[12020550],"parent":12016568,"text":"Fanatics | Sr Software Engineer - Cloud Platform | San Mateo CA or Boulder CO | Full-Time | ONSITE or Remote<p>Fanatics is looking for several Sr Software Engineers to join our Cloud Engineering team. We are in the beginning phases of building all new platforms to support the growth of our business. Most of our new platforms will be deployed to AWS and we have formed a Cloud Engineering team to build expertise in AWS.<p>If you are a talented software engineer with AWS experience we&#x27;d love to talk to you. If you&#x27;re a talented software engineer that doesn&#x27;t have AWS experience, we&#x27;d still love to talk to you. We&#x27;re open to sending the right candidates to training at AWS in Seattle.<p>Just in case you haven&#x27;t heard of Fanatics, I&#x27;ll give you the short version. We are the #1 Licensed Sports Retailer online. We have our own sites (Fanatics.com, FansEdge.com) but we also power most major sports leagues commerce sites (NFL Shop, NBA Store, NHL Shop, MLB Shop, NASCAR, MLS, etc...). We aren&#x27;t just their commerce partner, we handle everything from inventory&#x2F;warehouse, customer service, and marketing.<p>These positions are located in San Mateo CA at our all new Bay Area HQ. We are willing to have these positions be remote for the right candidate.<p>If you&#x27;re a sports fan you&#x27;ll love Fanatics, even if you&#x27;re not a sports fan the technology problems we&#x27;re solving will keep you more than engaged.<p>Job Description: <a href=\"https:&#x2F;&#x2F;chp.tbe.taleo.net&#x2F;chp03&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?org=FANA&amp;cws=1&amp;rid=1094\" rel=\"nofollow\">https:&#x2F;&#x2F;chp.tbe.taleo.net&#x2F;chp03&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?...</a><p>If you&#x27;re interested email me at nlyman at fanatics.com<p>Technologies:\nAWS (CloudFormation, EC2, ECS, RDS, S3, Lambda, you get the picture)\nPython (Standalone applications and Serverless)\nNodeJS (Standalone applications and Serverless)\nHashicorp tools such as Consul and Vault","time":1467414396,"type":"comment"}