{"by":"currycoder","id":12024093,"parent":12016568,"text":"Gamer Network | Brighton, UK | Python Web Developer (mainly back-end) | <a href=\"http:&#x2F;&#x2F;www.gamer-network.net&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.gamer-network.net&#x2F;</a> | Full-Time | ONSITE<p>We are looking for talented Python developers at all skill levels to grow our in-house development team. We are building a bespoke, scalable content platform as the backbone of our award winning editorial offerings. The platform will deal with 100s of millions of pageviews per month and run our industry leading editorial sites, including; Eurogamer.net, Gamesindustry.biz, USGamer.net and many more.<p>We’re looking for developers who are passionate about Python and excited about working in a fast moving games media company. We’re offering the opportunity to shape our editorial offerings in a very relaxed, friendly environment. The company is highly cross-functional; developers work closely with editorial, commercial and events teams. Gamer Network runs EGX - the largest consumer games event in the UK - and all members of the development team have the opportunity to go along to help out.\nSome things about our culture:\n* Friday at Four - weekly wind-down with beers in the office\n* Work-from-cafe&#x2F;home if you need a break from the office\n* Help run EGX (if you want to!)\n* Standing desks on request!\n* Get an idea, prototype it, pitch it!<p>Your ideal stack (you don’t need all of these things!):\n* Python (virtualenv, python3)\n* Django\n* MySQL, PostgreSQL, ElasticSearch\n* Scalable web stack: Redis, Varnish, Celery, Messaging&#x2F;Queueing, Restful APIs\n* Git&#x2F;Github&#x2F;Gitlab\n* Any devops (Ansible, Linux) is a bonus<p>Hiring Process: Get in touch with your CV, we&#x27;ll review and schedule a quick phone interview. If you&#x27;re a good fit we&#x27;ll get you to come to our office, meet the team and we&#x27;ll move from there.<p>Contact: careers@gamer-network.net","time":1467500233,"type":"comment"}