{"by":"tomjacobs","id":12020475,"parent":12016568,"text":"HomeShare | San Francisco | Full-time | On-site<p>We&#x27;re making San Francisco a great place to live again.<p>YC says make something people want. People really want to be able to afford to live in the city. We can&#x27;t build housing fast enough, so we&#x27;re hacking it.<p>We&#x27;re converting the city; we take apartments where the rent is well above what people can afford, and convert them so that the space is better used, and this brings down the rent to $1,200&#x2F;month in SoMa. By offering this unique price point for city living, customers love it, and we share in their savings.<p>Long term, we aim to be the interface for your living situation, bringing down the underlying cost of housing, while holding no inventory. We&#x27;re starting out as a &quot;full stack living situation&quot; company, and moving towards being your trusted interface layer for where you live. \n<a href=\"https:&#x2F;&#x2F;techcrunch.com&#x2F;2015&#x2F;03&#x2F;03&#x2F;in-the-age-of-disintermediation-the-battle-is-all-for-the-customer-interface&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;techcrunch.com&#x2F;2015&#x2F;03&#x2F;03&#x2F;in-the-age-of-disintermedi...</a><p>We&#x27;re looking for an ambitious developer to help launch this early-stage venture, and work in the trenches with an experienced founding team. The founders have launched and run several companies before. Though we are bootstrapped, we&#x27;re processing over $1M &#x2F; year in annualized transaction volume, and we&#x27;re up to nearly 100 customers living in our apartments. For the hungry individual, this is a crash course on how to found and launch a new venture. At the heart of our service is the ability to introduce compatible housemates to one another. That&#x27;s where you come in; building our automated matching system.<p>This is part front-end web dev, back-end web dev, growth engineer, and part data scientist.<p>Our current stack: Rails, Docker, AWS, jQuery, Bootstrap, Email.<p>Apply: tom@thehomeshare.com<p><a href=\"https:&#x2F;&#x2F;www.thehomeshare.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thehomeshare.com</a><p>More about us:\n<a href=\"https:&#x2F;&#x2F;blog.thehomeshare.com&#x2F;san-francisco-is-an-expensive-place-to-live-d4da86de7967\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.thehomeshare.com&#x2F;san-francisco-is-an-expensive-...</a>\n<a href=\"https:&#x2F;&#x2F;medium.com&#x2F;@TomPJacobs&#x2F;50a2fc65bdd8\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;@TomPJacobs&#x2F;50a2fc65bdd8</a>","time":1467416296,"type":"comment"}