{"by":"spyros","id":12021304,"parent":12016568,"text":"Neota Logic | New York, NY | ONSITE | FULL-TIME Software Developers: Dev&#x2F;Ops, Sr. Java Developer, Sr. Web Developer<p>Neota Logic is the producer of an Artificial Intelligence software platform that consists of a Hybrid Reasoning engine, a comprehensive front-end templating system (most of it is web) and a desktop tool for VRAD of Expert Systems. Our system allows subject matter experts to automate their expertise and judgment at internet scale and delivered in an operationally useful form – as applications embedded in business systems or consulted interactively in a browser. We transform expertise into action. We enable our clients to create innovative services that can help reduce risks, reduce costs and improve business decisions.<p>We are a small team of engineers and expanding to include a Dev&#x2F;Ops engineer and two front-end developers (one for our Java desktop tool and one for our Web stack). We are looking for experienced folks, who can share their ideas and knowledge and help us scale and expand our no-code platform for creating intelligent, &quot;expert system&quot; applications. Our stack includes Java and Swing for the VRAD desktop application, Scala&#x2F;Play&#x2F;Javascript for the web front-end and lots of python for our deployment (AWS) infrastructure.<p>Dev&#x2F;Ops:\n- 2-3 years experience in AWS, Networking and Database architecture and management\n- experience administering linux systems\n- security-oriented mindset\n- strong knowledge of at least one of Python, Ruby or Perl (python preferred)\n- A bachelor&#x27;s degree in Computer Science is required (anything more is of course a plus)<p>Sr. Java Developer (swing):\n- At least 5 years experience building production applications with Java and Swing\n- JavaFX and Javascript (in particular jQuery) is a strong plus\n- A bachelor&#x27;s degree in Computer Science is required (masters or doctorate is a strong plus)<p>Sr. Web Developer:\n- At least 5 years experience (3 if you have a masters degree) in Javascript (in particular jQuery), HTML5, CSS3, Less and Ajax\n- Experience in designing and implementing responsive web applications and working with complex data structures\n- Exposure to Scala (or interest in learning about it) is a plus\n- A bachelor&#x27;s degree in Computer Science is required (masters is a strong plus)<p>If you are someone who has strong CS fundamentals, is passionate about what they do, work well in a team as well as individually and want to make a difference at their workplace, drop us a line with your cover letter and resume at: hr@neotalogic.com. For more information about these (and other) positions, visit our careers page (<a href=\"http:&#x2F;&#x2F;www.neotalogic.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.neotalogic.com&#x2F;careers&#x2F;</a>).","time":1467431472,"type":"comment"}