{"by":"SnowflakeSF","id":12033396,"parent":12016568,"text":"Snowflake Computing | San Mateo, CA | Software Engineer | Full-time | ONSITE<p>Snowflake is reinventing the data warehouse, enabling companies to bring together all users, all data, and all workloads in a single elastic cloud service. We are a team of professionals with a mission to safely store, transform, and analyze business data, making it easy for all companies to quickly gain insight from their information.<p>We’re hiring talented Software Engineers to join us! This position will work directly with our engineering team to evolve our elastic, large scale, high-performance computing environment. We need smart engineers who can pick up and understand complex technical areas quickly--and are enthusiastic about building new technologies! This role has the potential to work in a variety of product areas.<p>Responsibilities:\n - Design and develop features, understand customer requirements and meet business goals.\n - Build high quality and highly reliable software to meet the needs to the largest customers\n - Analyze and improve the performance, scalability, and high availability of large scale distributed systems and the query processing engine.<p>We are looking for someone with:\n - 1+ years industry experience creating commercial software products\n - Fluency in Java, C++ or Javascript preferred.\n - Excellent computer science fundamentals and problem solving skills\n - Excellent programming skills and ability to work in Linux environment\n - Bachelor’s degree or foreign equivalent in Computer Science, Software Engineering or related field\n - Able to work on-site in our downtown San Mateo office<p>You can apply for this position at - <a href=\"https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?cj=onV72fwb&amp;s=email\" rel=\"nofollow\">https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?cj=onV72fwb&amp;s=email</a><p>We have other engineering positions open as well - <a href=\"http:&#x2F;&#x2F;www.snowflake.net&#x2F;about&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.snowflake.net&#x2F;about&#x2F;careers&#x2F;</a><p>Questions? Please email emily.gerhard@snowflake.net","time":1467672165,"type":"comment"}