{"by":"ewa","id":12030994,"parent":12016568,"text":"Intercom | Dublin, Ireland | SUPPORT ENGINEER | Full Time | ONSITE<p>Do you have a strong need to understand how and why things work the way they do? Are you acutely aware of customer experience and upset when a company you’re dealing with lets you down?<p>If you have some engineering or web development experience and want to be a part of creating truly exceptional customer experiences then the Customer Support team at Intercom is right for you.<p>Intercom supports over 12k businesses ranging from bootstrapped startups to large enterprise corporations. Our Support Engineers partner with our customers to tackle the challenging technical issues they face in innovative ways. In this role, you will be directly responsible for helping people integrate Intercom into their products, diagnose and report problems they have, and serve as the bridge between our customers and our product teams.<p>[We use Intercom to support Intercom customers](<a href=\"https:&#x2F;&#x2F;blog.intercom.io&#x2F;intercom-customer-support&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.intercom.io&#x2F;intercom-customer-support&#x2F;</a>), so whether you’re just starting out in your career or want to get a deeper understanding of fundamental customer motivations and how those are applied to building an ambitious, world-class product, this role provides that great opportunity.<p>Our way of providing support is based on the [principles of continuity and trust](<a href=\"https:&#x2F;&#x2F;blog.intercom.io&#x2F;rebuilding-support-around-continuity-trust&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.intercom.io&#x2F;rebuilding-support-around-continuit...</a>) and our style of communication is personal, friendly and fun. We engage in dynamic conversations with our customers and are big fans of visual communication (think emojis, stickers, GIFs) - we believe that [visual support is human support](<a href=\"https:&#x2F;&#x2F;blog.intercom.io&#x2F;visual-media-customer-support&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.intercom.io&#x2F;visual-media-customer-support&#x2F;</a>)!<p>More info on requirements here: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;mud3e1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;mud3e1</a><p>Our process consists of email test, phone interview and onsite interview in our Dublin office.<p>Cheers,\nEwa\n<a href=\"https:&#x2F;&#x2F;www.intercom.io&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.intercom.io&#x2F;careers</a>","time":1467642849,"type":"comment"}