{"by":"naelmusleh","id":12088797,"parent":12016568,"text":"Senior Full Stack Software Engineer | Chalk Talk Solutions | Boston, MA | ONSITE | Full Time | <a href=\"https:&#x2F;&#x2F;chalktalk.academy\" rel=\"nofollow\">https:&#x2F;&#x2F;chalktalk.academy</a><p>Chalk Talk’s unique platform for curriculum design and adaptive assessment improves curricular outcomes while improving test scores. As the creator of the world’s first set of curricula that caters to the needs and abilities of both American and international students for SAT, SAT II, IB, IGCSE, and Common Core exams, Chalk Talk brings affordable, high-quality test prep, curriculum design tools, and college advising services to high schools across the world. By identifying each student’s strengths and targeting their weaknesses within curricula, Chalk Talk lets students know exactly where they are and exactly where they need to go.\nPosition Overview:<p>Chalk Talk is looking for an experienced software engineer to join our team and build the future of K-12 Education. You will design and build new technology for Chalk Talk&#x27;s education platform.<p>REQUIRED: - 2-5 years of experience with dynamic development languages like Python or Ruby. - Track record of successfully building end-to-end products. - Demonstrated teamwork experience. - Experience with full stack web development including HTML, CSS, Javascript, and back ends like Django&#x2F;Rails and Python&#x2F;Ruby. - Experience with modern web technologies such as D3, Bootstrap, AngularJS. - Demonstrated skills in building service based architectures. - Committed to documentation of best practices in various layers of the stack. - get-shit-done attitude.<p>OTHER DETAILS: - This is a full-time position starting in June 2016. - Health and dental benefits. - Flexible work times and vacations. - We are a funded startup company located in the heart of Boston.<p>If you are interested, you can either check out our open positions at <a href=\"https:&#x2F;&#x2F;chalktalk.academy&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;chalktalk.academy&#x2F;careers</a> or email us at apply@chalktalk.academy. Please include the position in the subject.","time":1468436965,"type":"comment"}