{"by":"driedyam","id":3652997,"parent":3652041,"text":"Are you looking for a chance to do agile development? Do you want to immerse yourself in extreme programming using test driven development? Then Social Chorus is for you.<p>Halogen Media Group merged with YouCast Corp. to collaborate in forming a powerhouse of technology, Social Chorus (<a href=\"http://socialchorus.com\" rel=\"nofollow\">http://socialchorus.com</a>), that measures social reach through paid and earned media through influencer distribution. Our technology stack is up to date with current standards.<p>On to our development practices. We are on Rails 3.1.1 with deployment on Heroku and test driving EVERYTHING with Rspec, Jasmine, and Selenium. We are running Jenkins on our Amazon EC2 cloud for our continuous integration tests and firing it off on every push to Github. Every Monday we have an internal planning meeting that includes the dev team along with our project manager to go over upcoming features, stories that need discussion, and story estimation. Why stories? To manage the project and all the components that drive its development we use Pivotal Tracker, the collaborative, lightweight agile project management tool, brought to you by the experts in agile software development. Mornings start with stand-ups to go over the previous day's work, work for the current day, or any blockers anybody might have. Pair programming and green tests make the day fly by with the gratification of clean code without broken windows. Our analytics module runs in the cloud, hitting nginx, aggregating all data into our sharded MongoDB database. Like to map/reduce over extremely large data sets? Sweet.<p>Perks. Our development is fueled by a fully stocked kitchen and beer bashes at least once a month. Team dinners, ski/snowboard trips, lunchtime crosswords, Giants games, are some of the enjoyable company sponsored events. Halloween and Christmas parties also keep us busy as the holidays get closer. On top of that, we have competitive salaries and a semi-annual bonus plan.<p>Currently we are boot-strapping with Pivotal Labs at their office at 875 Howard St. Upon the end of our engagement with them, which tentatively concludes at the end February, we are moving back to our home base located in SOMA, China Basin, right next to AT&#38;T Park to join the rest of the team. Come join our team and show off your Ruby on Rails chops!<p>Responsibilities<p>* Test Drive everything<p>* Push out awesome code<p>* Pair well with each other<p>* Constantly stay up to date with technology<p>Experience<p>* Ruby on Rails<p>* RSpec<p>* CSS<p>* JavaScript<p>* Database Architecture<p>* Heroku is a plus<p>Skills<p>* Ruby on Rails<p>* RSpec<p>* CSS<p>* JavaScript<p>* Database Architecture<p>* MongoDB is a plus<p>* NGINX is a plus<p>* Amazon EC2 is a plus<p>Education<p>* BS Computer Science or equivalent<p>Please contact jobs@socialchorus.com ATTN:chris","time":1330622330,"type":"comment"}