{"by":"dogas","id":3652496,"parent":3652041,"text":"Seattle/Philly/Remote<p>Web Operations Engineer (DevOps) at PipelineDeals (<a href=\"http://www.pipelinedeals.com\" rel=\"nofollow\">http://www.pipelinedeals.com</a>)<p>PipelineDeals LLC is looking for a\nfull-time Operations Engineer to join our team. You will be managing all services running at PipelineDeals.com, from developer testbeds to the very product our thousands of customers use. We need an individual to help build and maintain the supporting infrastructure for the services and to be responsible for running a superior service for our customers.  Ideally, you'd be located either in Seattle or the Philadelphia area, but remotes are also welcome to apply.<p>About us:<p>PipelineDeals is a web-based CRM platform specializing in getting sales teams organized.  We're 6 years old, boostrapped, profitable, and proud.  We built the company from the ground up with no external investments other than our own, and we are our own bosses.  Now we have tens of thousands of customers in nearly 100 countries.  You would be the 11th person to join our growing team!<p>Environment:<p>We believe strongly in metrics, testing, continuous integration, and working fluidly and harmoniously with our engineering and product teams. Everything we write is designed for simplicity and maintainability. We take security very, very seriously.  All our code runs in the cloud (AWS).<p>Skills and Requirements:<p>You should have:<p>- Advanced experience in systems administration, packaging and installer technologies.<p>- Experience with Amazon EC2 and the AWS stack (we use fun stuff like S3, ELB, ElastiCache, EBS, IAM).<p>- Experience with Chef, Puppet or another configuration management system (we use Chef).<p>- Experience administering MySQL and InnoDB deployments.<p>- Firm grasp of TCP/IP networking.<p>- Strong written and verbal communication skills.<p>- Excellent organizational skills.<p>- Strong analytical and troubleshooting skills, under pressure.<p>- Have opinions on the right way to do things, and are comfortable sharing them, respectfully.<p>It would be great if you have any of the following:<p>- Experience developing and documenting plans, policies and procedures in support of IT security, disaster recovery, and business continuity planning.<p>- Experience deploying and running build and test automation tools (we use Buildbot, Cucumber and Jasmime).<p>- Knowledge of web application server configuration (Nginx and Unicorn).<p>- Familiar with source control systems such as Git.<p>If interested, please email Grant at grant@pipelinedeals.com.","time":1330616379,"type":"comment"}