{"by":"dogas","id":3652546,"parent":3652041,"text":"Seattle/Philly/Remote<p>Join the team of happy hackers at PipelineDeals! We’re looking for a talented Rails developer in the Seattle or Philly area (remote work ok, for the right type of individual)<p>About us:<p>PipelineDeals is a web-based CRM platform specializing in getting sales teams organized. We're 6 years old, boostrapped, profitable, and proud. We built the company from the ground up with no external investments other than our own, and we are our own bosses. Now we have tens of thousands of customers in nearly 100 countries. You would be the 11th person to join our growing team!<p>Perks:<p>- Join a tightly-knit small team of very talented coders to help drive the product.<p>- We are very progressive with the technology we use. Chef, kiji-ruby, authlogic, Backbone.js, Coffeescript. We implement the things we find promising, and encourage all developers to help bring ideas to the table. Let your voice be heard and your opinion be respected!<p>- Our team is very test- and spec-driven. We typically use a peer-review model to ensure that none of us are going off the deep end with a solution. We are striving towards continuous deployment. We have our CI server run our test suite upon each push to the remote repo. We measure almost everything.<p>- You are encouraged to contribute to open source, and we have open source Fridays!<p>- Relish in the fact that the projects you will be working on will be used directly by thousands of our customers worldwide!<p>- Reimbursement for conferences or meetups you would like to attend, books you want to buy, screencasts you want to watch.<p>- Great benefits package, a competitive salary, and lots of room for growth. Our goal is to ensure you are comfortable so you will be productive.<p>Requirements:<p>- Must have at least a year of experience working directly with ruby, either with a company, or via open source. Past contributions to open source projects, or maintaining your own, are looked very highly upon.<p>- At least a year’s experience working with Rails, either your own or at a previous company.<p>- Experience with jQuery, Backbone.js, Coffeescript\n- Solid familiarity with git or other distributed version control system.<p>- Enough SQL to understand what rails is doing in the backend.<p>- A good sense of humor is a strict requirement. Company culture is very important to us, and we are absolutely NOT a bunch of straight-laced, profit-driven, cubicle-sitting curmudgeons.<p>- Remote work OK, but it is highly preferable if you are located around the Philadelphia or Seattle area. You will be expected to be at the office sometimes. We do get lonely.<p>Check out the site, play with the demo. <a href=\"http://www.pipelinedeals.com\" rel=\"nofollow\">http://www.pipelinedeals.com</a><p>Interested? Email a link to your Github account (or resume) to Grant Ammons at grant@pipelinedeals.com. We look forward to hearing from you!","time":1330616976,"type":"comment"}