{"by":"200902","id":3652360,"kids":[3652456],"parent":3652041,"text":"Cyrus Innovation - New York, NY or Boston, MA<p>Ruby Developer (Full Time)<p>Cyrus Innovation is a profitable and growing Agile software development company that was founded in 2003. With offices in Boston and New York City, we provide on-site XP teams to start-up and enterprise level companies and create custom web based applications on the back end side. As we continue to grow in both locations, we are looking for people who are equally passionate about Agile and programming to join our great team!<p>What we offer:\n- Great pay and benefits (health, dental, vision, 401(k))\n- Generous vacation, sick time policy, and 1 month of paid time off for professional development\n- No / minimal travel\n- The opportunity to have a real voice in critical design decisions\n- 40 hour work weeks for great work/life balance<p>You will enjoy:\n- Working with a true XP team (TDD, pair programming, continuous integration, daily stand-ups)\n- Working alongside bright and analytical developers\n- Working with the latest technology (Ruby on Rails, Scala, Node.js, MongoDB)\n- Collaborating on all stages of software development from design to implementation<p>What we’re looking for:\n- Experience working with Ruby or Java (3 years or more) and some exposure to Agile methodologies\n- Team oriented work demeanor\n- The desire to learn from and mentor fellow employees\n- The ability to adapt to various cultures and environments\n- A true demonstrable passion for coding<p>At Cyrus, we strive to continuously enhance our day-to-day methods that keep us at the top of our game and help everyone improve on what they already do so well. We care more about your desire for clean code than your years of experience. We are looking for creative individuals to join our community who value team work and strive to work with a company that values quality software as much as you. Our commitment to our employees is unparalleled and we invite you to join our team.<p>To apply for a position please send a resume to Marc Rosenberg at mrosenberg@cyrusinnovation.com","time":1330614767,"type":"comment"}