{"by":"vsprabhakara1","id":3653343,"parent":3652041,"text":"SF / Bay Area, FULL-TIME &#38; INTERN<p>beRecruited.com (<a href=\"http://berecruited.com\" rel=\"nofollow\">http://berecruited.com</a>) is disrupting the high school to college athletic recruiting market.  We connect high school students to college coaches across the country, helping students earn scholarships.  We're the largest company in the space, with room still to grow.<p>We're 3 YC founders, we've got over 1 mm registered users, revenue via our freemium service, and plenty of funding from relevant investors.  We're relaunching the site in just a few weeks, and this is a chance to get on board and drive meaningful product development and influence what we do next.<p>We're a small team of 5 looking to add another full-stack RoR developer.<p>Definitely get in touch if you: \n* Combine a strong overall computer science background with a passion for web development, particularly Ruby on Rails\n* You're equally at home writing complex SQL queries, architecting scalable rails services, and building beautiful html/css/javascript interfaces\n* You've demonstrated your abilities writing top-quality web or open source software\n* You have a strong product sense and excellent technical judgement.<p>Here's some recent articles about how we're improving people's lives every day.\n*  <a href=\"http://www.utsandiego.com/news/2012/jan/30/help-for-reaching-the-next-level/\" rel=\"nofollow\">http://www.utsandiego.com/news/2012/jan/30/help-for-reaching...</a>\n*  <a href=\"http://www.nydailynews.com/sports/high_school/2011/09/22/2011-09-22_site_helps_make_matches_between_athletes_coaches.html\" rel=\"nofollow\">http://www.nydailynews.com/sports/high_school/2011/09/22/201...</a>\n*  <a href=\"https://news.ycombinator.com/item?id=3540289\" rel=\"nofollow\">https://news.ycombinator.com/item?id=3540289</a><p>More detail here:  <a href=\"http://howto.berecruited.com/pages/jobs\" rel=\"nofollow\">http://howto.berecruited.com/pages/jobs</a>\nOr email us directly and mention you're from HN: jobs@berecruited.com","time":1330626651,"type":"comment"}