{"by":"bkudria","id":3654071,"kids":[3654316],"parent":3652041,"text":"Yammer is hiring engineers in SF and London, and a bunch of other non-engineering positions in London/NYC/AUS/elsewhere. Full jobs listing at <a href=\"https://www.yammer.com/jobs\" rel=\"nofollow\">https://www.yammer.com/jobs</a><p>Yammer is basically a social network for the enterprise, but Yammer isn't just where you <i>talk</i> about work, it's increasingly where you <i>do</i> work.<p>Large corporations are really inefficient and hierarchical and Dilbert-y, and we build software that treats every employee as an empowered human being. We have a success-story video on our site from Supervalu, a large retail store chain in the US, and their CTO tells a story about how Yammer <i>literally</i> changed the way they do business. In the old world, store managers would report their intelligence up the managerial chain, the upper management would try to synthesize everything, and 3 months later a \"report\" would be issued that told everyone how to best try to do their jobs. After Yammer, store managers would just talk to each other over Yammer, learn directly what was successful and what wasn't, and as a side effect, let the upper management gain invaluable visibility into day-to-day operations. When we say Yammer \"breaks down silos\" and \"enables horizontal communication\", this is what we mean. Sure, Yammer is just like Facebook, but we're so much more than that. Corporations don't share cat pictures, they turn into efficient business machines.<p>Supervalu testimonial video: <a href=\"https://www.yammer.com/customers\" rel=\"nofollow\">https://www.yammer.com/customers</a>\nIn fact, Supervalu isn't the only company that has changed the way they work due to Yammer. We have tons of examples at that link. Yammer is used by 85% of the Fortune 500.<p>Yammer is expanding. We just raised an 85MM round, reflecting a valuation that puts on right up there in the enterprise software space. We're growing quickly and we need strong capable solid engineers to help us. We have an excellent technical platform but we need to scale more. This is where you come in. We're looking for engineers of all stripes, be it Ruby/Rails, JS/Node, Java/Scala, Obj-C/iOS/Android, or other. Again, full list at <a href=\"https://www.yammer.com/jobs\" rel=\"nofollow\">https://www.yammer.com/jobs</a><p>If you're remotely interested in solving real engineering problems at scale, for a serious application, I urge you to get in touch. My email is bkudria@yammer-inc.com, and you can ask me any questions about Yammer that you'd like.","time":1330636401,"type":"comment"}