{"by":"kathyaalberts","id":3654255,"parent":3652041,"text":"Tout in San Francisco, CA is the leading network for real-time video status updates (Touts)<p>Tout is breaking new ground by combining social networking with the power of video to deliver a revolutionary experience for users, celebrities, and brands. We are changing how people interact, delivering a rich social sharing experience in full color, sound, and motion.<p>Tout is a precocious toddler in Internet years, less than a year old but cruising toward proficiency in Big Data and massive video delivery, and playing in the sandbox with big celebs and brands. Our favorite toys are Ruby on Rails, Node.js and the Amazon cloud, though we're already very good at sharing.<p>We are definitely the only startup with its entire history captured in a series of fifteen second videos.\nOur eminently accessible office is in startup central down here in South Beach/SOMA, where we are in the midst of a noisy playground of other unruly startups and have access to an ever-changing variety of lunch trucks.<p>We have a Ron Jones original on the wall, beer in the fridge, and top shelf tequila within a hundred yards. We have ping pong. Duh. We have a kitchen that makes it so you don't have to have one of your own. We have all of these things. But we don't have you.<p>DevOps Engineer<p>We’re seeking a highly motivated DevOps engineer who will manage server and application infrastructure on the AWS platform, including developing tools for configuration management, code deployment, continuous integration, automated testing and monitoring. You will need strong skills in implementing and managing high availability, mission critical infrastructure, and should be a dedicated problem solver who can multi-task and prioritize tasks in a fast-paced and demanding environment.<p>The ideal candidate will have experience in both system engineering /administration and software development, with a focus on building back-end systems like monitoring, automation and management tools.<p>Responsibilities<p>• Build and maintain tools that will help us test, deploy, measure, monitor and scale our applications and infrastructure\n• Oversee and perform server and application deployment including release management\n• Help to continuously improve our processes and tools to ensure the best possible experience for our users, from availability to performance and reliability\n• Monitor and maintain our systems, including being part of a 12x7 on-call rotation and escalation path  \n• Collaborate with other engineers to to optimize application and infrastructure for performance, reliability, failover, and scale<p>Minimum Candidate Qualifications\n• 3+ years of experience supporting a real-time, 24x7 production web environment. 3+ years of Linux administration experience.\n• Strong written and verbal communication skills; ability to organize and prioritize tasks.\n• Proficiency with one or more scripting languages: shell, Perl, Python, Ruby, or equivalent.\n• Experience with NoSQL systems (MongoDB, Cassandra, Riak, CouchDB, etc.)\n• Comfortable in a start-up environment where innovation and change are the norm.\n• Experience using configuration management systems (Chef, Puppet, CFEngine, etc.)\nAdditional Candidate Qualifications\n• BA/BS in Engineering or Computer Science highly preferred, other degrees considered when accompanied by appropriate technical aptitude\n• Experience using and managing Node.js, and Ruby on Rails\n• Experience with version control systems such as git\n• Experience with cloud based deployments.  Production experience with AWS systems is a big plus\n• Experience with the design and deployment of large-scale infrastructure projects a big plus<p>Please email resumes to: katherine@tout.com.","time":1330639068,"type":"comment"}