{"by":"lt_kije","id":3658128,"parent":3652041,"text":"Madison, WI, USA - Linux Operator (fulltime, no remote)<p>I'm leaving my awesome job in the University of Wisconsin Department of Physics at the end of this month and I want you to take over.<p>Our group operates a large (&#62;=1PB disk, &#62;=2500 cores) analysis facility that physicists from Wisconsin and around the world use to search for the Higgs boson (we're part of the CMS collaboration at the LHC). We work with peers at universities across the US and Europe to provide dozens of PB and millions of hours of computing each day. We write programs, share our code, optimize systems, distribute computing and occasionally rack hardware.<p>We like Python, Perl, Mercurial, shell tricks, SSH, Jabber, Ganglia, Apache and Nginx, Varnish and Squid, Scientific Linux (it's like Centos), APIS, (more) metrics, (fewer) alerts, CFEngine, Hadoop, Condor, KVM and libvirt, AFS and FUSE. We're reflexively open:<p><pre><code>    http://hg.hep.wisc.edu/\n    http://ganglia.hep.wisc.edu/ganglia\n</code></pre>\nYou don't need to have worked with many or any of the above, but you're excited about learning (or teaching us why your way works better). You're familiar with running a Linux system and wonder what breaks when you run hundreds of them. Repetitive tasks irritate you; open-ended problems pique your interest. You look forward to learning from colleagues with deep knowledge of C and systems programming; distributed computing; statistics and data analysis; and Indian food. You've been looking for a job where you're free to choose the right tech for the problem at hand and you itch to justify the choice empirically. Most of all, you're curious.<p>The position hasn't yet been officially listed, but I'd love to talk to you. Please feel free to email me at wcmaier@hep.wisc.edu or grab me on IRC (lt_kije on freenode). If you're a student, we'll take you on as a student hourly until you graduate. Otherwise, the university only likes to hire people with a BS/BA.","time":1330718782,"type":"comment"}