{"by":"jtmcmc","id":3664636,"parent":3652041,"text":"Menlo Park / Bay Area, CA<p>We are Badgeville a fast growing exciting startup that is about allowing websites to better engage with their users through among other things gamification! We use rails on the backend and have both a javascript and REST API.<p>See an article in NYTimes about us and one of our partners samsung <a href=\"http://www.nytimes.com/2012/02/05/business/employers-and-brands-use-gaming-to-gauge-engagement.html?_r=1\" rel=\"nofollow\">http://www.nytimes.com/2012/02/05/business/employers-and-bra...</a> and a recent tech crunch article on us <a href=\"http://techcrunch.com/2012/01/10/badgeville-proves-gamification-is-here-to-stay-as-recyclebank-others-buy-in/\" rel=\"nofollow\">http://techcrunch.com/2012/01/10/badgeville-proves-gamificat...</a><p>We are looking for a number of jobs you can see the list: <a href=\"http://badgeville.jobscore.com/list\" rel=\"nofollow\">http://badgeville.jobscore.com/list</a><p>In particular we are looking for \nTechnical Support Engineers - Act in a customer facing role, helping to assist clients integrate Badgeville's javascript and REST APIs with their websites. Programming experience in at least one language is required with knowledge of javascript a big plus.<p>and<p>Technical Account Managers - You will own a client's technical implementation of the Badgeville platform, architecting an appropriate solution. You will be in charge of both educating the client, developing relationships with the customer development teams and working with our producers to build the most successful possible implementation of our product.<p>See the full job description for Technical Account Managers at <a href=\"http://badgeville.jobscore.com/jobs/badgeville/technical-account-manager/d0LsT4oVOr4BiceJe4bk1X\" rel=\"nofollow\">http://badgeville.jobscore.com/jobs/badgeville/technical-acc...</a><p>Feel free to email me at justin@badgeville.com if you have any questions about what we do, any of the jobs listed or what color you should dye your hair.","time":1330905047,"type":"comment"}