{"by":"rdmirza","id":3674149,"parent":3652041,"text":"Position: Interactive/graphic designer<p>We’re looking for an exceptional Interactive / Graphic Designer with a strong design portfolio to join our San Francisco development team. We take on very ambitious projects, and we need a daring visionary, excited to conceive new possibilities, re-imagine what doesn’t work, and improve what’s been successful.<p>The Designer will work together with the creative, tech and strategy teams designing cutting-edge user interfaces for web, mobile apps, software &#38; applications. This position will also be deeply involved in branding work for both client &#38; internal projects.<p>We are looking for a strong creative who’s passionate about design and eager to create experiences that inspire interaction and conversation. We’re growing fast and are seeking a contributor who‘s excited for an entrepreneurial adventure and is looking to make an immediate impact.<p>We're looking for:<p>* A minimum of 3 years of relevant studio / agency experience. Experience working within varied design teams (Web / App/ UX / ID) a plus.<p>* Formal education in graphic design; a bachelor’s degree (or beyond) is preferred.<p>* Fluent with Adobe CS, including Illustrator, Photoshop, and InDesign. CSS/Javascript and HTML skills are a definite plus.<p>* Experience in user interface design and usability<p>Bonus points:<p>* Significant experience with mobile apps (iOS, Android, or WebOS)<p>* Experience with branding &#38; graphic chart projects<p>* Experience in creating wireframes and flow through<p>About us:\nfaberNovel helps large organizations think and act like startups. We combine technology, design and emerging trends to invent new products, services, and experiences. Founded in 2003, faberNovel has grown into a team of 70 passionate business, design and technology experts based in Paris, San Francisco, New York and Moscow. From conception to realization, we make things happen.<p>To apply, send your resume &#38; portfolio to: larapagnier@fabernovel.com","time":1331091417,"type":"comment"}