{"by":"conorgil145","id":9303870,"kids":[9305670],"parent":9303396,"text":"Virtru | Washington, DC or REMOTE | Fulltime | Javascript fullstack, Android, iOS, .NET<p>== Who we are ==<p><a href=\"https:&#x2F;&#x2F;virtru.com&#x2F;how-it-works\" rel=\"nofollow\">https:&#x2F;&#x2F;virtru.com&#x2F;how-it-works</a><p>Everyone has a right to keep their digital content private and secure. We founded Virtru because we believe that exercising that right should be easy and convenient.<p>Virtru allows you to send end-to-end encrypted email using your existing email address and existing email provider with the flip of a switch.<p>We have browser extensions for Chrome&#x2F;Firefox, apps for  iPhone and Android, and a plugin for Outlook desktop.\nOur full time team of ~20 is currently 50% engineers. We value automated testing, readable&#x2F;maintainable code, documentation, and code reviews. We run in 2 week sprints and dedicate about 20% of total capacity to things the dev team thinks are important (technical debt, refactoring, exploring a new technology, etc), while the rest goes to feature development and addressing bugs.<p>We are well capitalized with investments from Bessemer Venture Partners [0] and private investors.<p>== Current positions ==<p>We are currently hiring full stack NodeJS&#x2F;Javascript developers to support our front and backends and a .NET developer to support our Outlook desktop plugin.<p>I work on the backend, so I can provide some details on that role. Our client facing API services are built on Express.js. We currently run in the AWS cloud and are looking for someone with experience deploying&#x2F;maintaining services&#x2F;infrastructure who can also help add new functionality to the application layer.<p>We are  working on building out an automated and immutable infrastructure using Packer, Ansible, Terraform&#x2F;CloudFormation, and other tools. If that sounds exciting, we’d love to hear from you!<p>Some things we play with on the backend: NodeJS, ExpressJS, PassportJS, AWS (EC2, SQS, S3, IAM), CouchDB, Packer, Ansible, ELK stack (Elasticsearch, Logstash, Kibana), HAProxy 1.5, PagerDuty.<p>== Get in touch ==<p>If you care about privacy and are interested in creating security products at a company which thinks that user experience is a first class citizen, please get in touch! Send a secure email (using Virtru!) to feedback@virtru.com with subject “HN who is hiring response” and tell us what interests you about Virtru. It would be great if you can provide some sample code that we can check out (github, bitbucket, etc), but is not a requirement.<p>If you have any questions, I’ll monitor this thread and&#x2F;or you can email me directly (email in profile).\n[0] <a href=\"http:&#x2F;&#x2F;www.bvp.com&#x2F;portfolio&#x2F;virtru\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bvp.com&#x2F;portfolio&#x2F;virtru</a>","time":1427898839,"type":"comment"}