{"by":"rskinner","dead":true,"id":9303692,"parent":9303396,"text":"Signpost  |  New York, NY<p>We build cloud-based marketing software that gives local businesses the power to effortlessly build and manage customer relationships.<p>Signpost is a software-as-a-service platform that gives local businesses the power to effortlessly build and manage customer relationships - a crucial ingredient for success that’s traditionally been beyond their reach. Our technology automatically builds customer profiles and then uses this data to drive new customer conversion and promote loyalty, reviews, and referrals from existing customers. We empower local businesses by delivering measurable results while saving valuable time.<p>Named one of America&#x27;s Most Promising Companies by Forbes, Signpost is backed by Spark Capital, Google Ventures, OpenView Venture Partners, Scout Ventures and a group of angel investors including Jason Calacanis, Thomas Lehrman, and Jack Herrick. The company is headquartered in New York City with locations in Austin and Denver. We&#x27;re looking for smart, passionate leaders to join our team and have real ownership and impact from day one.<p>Open Positions:<p>Senior Product Manager (NYC) - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;jsq3kt\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;jsq3kt</a><p>Product Marketing Manager (NYC) - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;mfr74e\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;mfr74e</a><p>National Sales Executive (NYC) - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;p2qakr\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;p2qakr</a><p>Sales Representative (NYC) - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;t2gad3\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;t2gad3</a><p>Sales Representative (DEN) - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;ry7lfn\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;ry7lfn</a><p>Sales Representative (ATX) - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;b305du\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;b305du</a>","time":1427897719,"type":"comment"}