{"by":"CiaranR","id":9303551,"parent":9303396,"text":"London, UK - Various Engineering Positions - Full Time<p>Swoon Editions is about getting beautifully crafted furniture from the workshop floor straight to your door at an exceptional price. We cut out expensive retail overheads without ever compromising on quality. We are building a leading direct to consumer online sales app with a data platform for trend analysis, demand prediction and logistics optimization.<p>We are fairly unique in the Ecommerce world as everything we do is data driven. We test all assumptions from web page layouts to button colours, from the physical products we launch to the finish of the material.<p>We&#x27;re a small and passionate group of people based in the old Southwark Playhouse in London, with a growing team here and abroad overseeing our workshop partnerships. We&#x27;re are hiring smart people for all positions across engineering.<p>We also have some great benefits:\n* Unlimited Holidays\n* The best hardware Mac or PC\n* Free Company Gym\n* Regular Team Lunches, Drinks and more\n* Fully stocked kitchen and drinks fridge\n* Amazing Company Culture\n* Just a little too much trust<p><i></i>Backend Software Engineer<i></i> -  You should have a track record of solving difficult engineering problems across all parts of the business. You should be as at home performing regressions across complex cohort models as building and designing APIs for our front end team. We spend the majority of our time working in both Python and PHP and developing APIs so prior experience would be great but we will also consider candidates with all strong programming backgrounds that want a new challenge.  - <a href=\"http:&#x2F;&#x2F;swoon.workable.com&#x2F;jobs&#x2F;32947\" rel=\"nofollow\">http:&#x2F;&#x2F;swoon.workable.com&#x2F;jobs&#x2F;32947</a><p><i></i>Full Stack PHP Engineer<i></i> -  You should have a track record of solving problems across all parts of the development stack, from debugging JS in the browser to full “OOP SOA API Design”. We spend the majority of our time working in PHP with Magento and its APIs so prior experience would be great but we will also consider candidates with all strong programming backgrounds that want a new challenge. - <a href=\"http:&#x2F;&#x2F;swoon.workable.com&#x2F;jobs&#x2F;32943\" rel=\"nofollow\">http:&#x2F;&#x2F;swoon.workable.com&#x2F;jobs&#x2F;32943</a><p><i></i>Frontend Software Engineer<i></i> - You should have a track record of solving frontend problems, from creative concepts to polished code, particularly for consumer projects. This role will be responsible for evolving the experience of our online store. You&#x27;ll be collaborating with analysts, developers and marketers to devise and develop new features,  and tests as we roll out an ambitious roadmap. - <a href=\"http:&#x2F;&#x2F;swoon.workable.com&#x2F;jobs&#x2F;32948\" rel=\"nofollow\">http:&#x2F;&#x2F;swoon.workable.com&#x2F;jobs&#x2F;32948</a><p><i></i>QA Engineer<i></i> - We’re looking for a Web App Test Engineer to join our team in London. You should have a track record of  end-to-end testing and quality assurance. This testing will be predominantly manual to start and moving to automation as our team grows and we hone our requirements. Our website is the face our our brand, so this role has the potential to have a big impact on our business.  - <a href=\"http:&#x2F;&#x2F;swoon.workable.com&#x2F;jobs&#x2F;32952\" rel=\"nofollow\">http:&#x2F;&#x2F;swoon.workable.com&#x2F;jobs&#x2F;32952</a><p>If you have questions, you can email me Ciaran the CTO on - ciaran@swooneditions.com","time":1427896715,"type":"comment"}