{"by":"jjarmoc","id":9303835,"kids":[9322151,9304706,9307311],"parent":9303396,"text":"~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~<p>MATASANO SECURITY - Chicago. New York City. Sunnyvale.<p>Application Security Consultant<p>Full-Time, work visa sponsorship available<p>~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~<p>What excites you and ignites your muse?<p>When I was a child I&#x27;d often get in trouble for &#x27;breaking&#x27; things.  Teachers, parents, and other authority figures didn&#x27;t understand what motivated this behavior, but with the benefit of hindsight I now do.  I wasn&#x27;t breaking things at all, I was exploring them.  I was learning how they worked by taking them apart and seeing them laid bare.  Sometimes, I&#x27;d manage to put them back together and occasionally they&#x27;d even work!<p>Once, when I was about twelve or thirteen, I took apart a mechanical bedside alarm clock, laid all the gears out organized by size and was promptly grounded for &#x27;destroying&#x27; it.  While serving my punishment, I went to work re-assembling it, with one small change.  What had previously been a cheap cardboard clock face was replaced with a piece of translucent contact-paper, with numbers careful stenciled in their proper places.  I loved that clock.  Every morning I&#x27;d wake up, see it, and glance deep into its inner workings.  That visual reminder that I&#x27;d been curious and unlocked its secrets was how I started mornings throughout my formative years.<p>Somewhere along the line, I lost track of where that clock ended up.  It may be gone, but the spirit it demonstrates remains one of my strongest motivators.  I&#x27;ve found no better outlet for this drive to understand the inner workings of things than software security assessment.<p>At Matasano, we treat our client&#x27;s applications like I did that clock.  We take them apart, examine them piece by piece, and arrive at an understanding of what makes them tick.  Only after arriving at this can we find and exploit vulnerabilities.  We slap a clear face on those applications, with the numbers carefully identifying any discovered flaws.  We take them apart and &#x27;break&#x27; them, not to be destructive, but to be constructive through understanding them.  Thankfully, we don&#x27;t even end up grounded. :)<p>There&#x27;s no area of computing that draws on as many skills, but programming, debugging, protocol analysis, reverse engineering, systems administration, network engineering and cryptographic analysis  aren&#x27;t what make great AppSec consultants.  You need to find what motivates you. For me, being tasked with quickly developing a deep understanding of unfamiliar applications plays right into the mindset that led me to explore that clock.<p>So, again I&#x27;ll ask, what excites you?<p>Learn about our hiring process at <a href=\"http:&#x2F;&#x2F;www.matasano.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.matasano.com&#x2F;careers</a> or contact us at careers@matasano.com<p>Get a taste for some of what we do at <a href=\"http:&#x2F;&#x2F;www.microcorruption.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.microcorruption.com</a> and <a href=\"http:&#x2F;&#x2F;www.cryptopals.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.cryptopals.com</a><p>Check out our blog at <a href=\"http:&#x2F;&#x2F;chargen.matasano.com\" rel=\"nofollow\">http:&#x2F;&#x2F;chargen.matasano.com</a><p>~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~","time":1427898615,"type":"comment"}