{"by":"showtimes","id":9304888,"parent":9303396,"text":"Find &amp; Form -- Boston, MA -- Full Time -- <a href=\"http:&#x2F;&#x2F;www.findandform.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.findandform.com</a><p>We are seeking a passionate in-house, mid-level Ruby on Rails developer that has shipped APIs that support mobile applications, specifically iOS products. Ideally you have worked with a range of industries and understand certain pitfalls and best practices. This position requires managing a team that consist of front-end, back-end, &amp; QA specialists. You will not be coding all day. You will be communicating with clients, designers, product managers, and strategists as well as creating awesome products.<p>WHAT YOU&#x27;LL BE DOING<p>You will work directly with the founding members of Find &amp; Form as well as an amazing team of 8 creating unique products using the latest in mobile technology and helping to grow our expanding development team. Our clients range from early stage seed startups to trusted industry leaders so there is no shortage of challenges. You will be working with emerging technologies such as iBeacon communication, mobile commerce &amp; mobile payments, and location based systems.<p>WHAT WE&#x27;RE LOOKING FOR<p>+ 3+ years of Ruby on Rails experience\n+ 1+ years in development management or team lead\n+ A strong understanding of git and gitflow practices\n+ Open to trying new tools and technology\n+ Heroku &amp; AWS experience  \n+ RESTful API architecture \n+ Passion for open-sourcing technology<p>BENEFITS<p>+ Competitive salary\n+ New Macbook Air &amp; display monitor \n+ IRA plan with company match\n+ Health and dental insurance premiums for full time employees \n+ 3 weeks of personal paid time off and 2 weeks of company time off per year\n+ Allowance for conferences, books, and other educational resources \n+ MBTA pass reimbursement\n+ Gym membership<p>Reach out to me personally: darion@findandform.com &#x2F;&#x2F; \nMore information about the position and who we are: <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1BhnPn8\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1BhnPn8</a>","time":1427906451,"type":"comment"}