{"by":"trumbitta2","id":9304186,"parent":9303396,"text":"Inpeco - Science and Technology Park of Sardinia, Building 8, Pula (CA), Italy<p>Hello, I&#x27;m a frontend developer ad Inpeco ( <a href=\"http:&#x2F;&#x2F;www.inpeco.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.inpeco.com&#x2F;</a> ). We currently have a couple openings.<p>If interested, you can send your CV and &#x2F; or LinkedIn profile to my boss at riccardo.triunfo@inpeco.com<p>== Frontend Software Engineer ==<p>You will be responsible of UX design and implementation for the healthcare devices built by Inpeco. You should have high attention to detail, strong teamwork, and be willing to learn new technologies.<p>Requirements: <p><pre><code>  - You have a deep knowledge of HTML5, CSS3, Ajax and JavaScript\n  - You have good experience in developing mobile responsive applications, either from scratch or using front-end frameworks\n  - You have gained at least three years of relevant and demonstrable work experience\n  - You have good understanding of data structures and algorithms\n  - You are passionate and eager to learn new programming languages and technologies\n  - You have good experience with distributed VCS and bug tracking tools\n  - You have experience with software testing\n  - You have good knowledge of English language\n  - You are capable of writing good technical documentation\n</code></pre>\nDesiderata:<p>Experience with Bootstrap and AngularJS. Proficient with SASS and LESS. Experience in automated UI testing and knowledge of the most used testing frameworks. Experience in developing UX for clinical applications and you already have a deep knowledge of the related regulations.<p>Responsibilities:  <p>Design, develop and deploy applications across a variety of devices and OS environments. Code primarily using Javascript and integrate RESTful JSON API. Work with frameworks like Bootstrap, AngularJS, JQuery, Three.js. Work in an agile environment collaborating with the team using scrum&#x2F;kanban methodologies. Be proactive in collaborating with the other colleagues.","time":1427900673,"type":"comment"}