{"by":"radnor","id":9304098,"parent":9303396,"text":"Geocaching.com - Seattle, WA (Fremont) - Junior Sysadmin, Mobile Developer, Software Developer<p><a href=\"http:&#x2F;&#x2F;www.geocaching.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.geocaching.com&#x2F;jobs&#x2F;</a><p>We are the global headquarters for the game of Geocaching. Our apps and Geocaching.com website allow a global community of millions of people to join in a real-world treasure hunt.<p>Our mission (and yours should you choose to accept it) is to inspire and enable discovery, exploration and adventure. Basically, everyone’s job here is to enable millions of people to have fun outside.<p>Junior Sysadmin - (<a href=\"http:&#x2F;&#x2F;www.geocaching.com&#x2F;jobs&#x2F;?gnk=job&amp;gni=8a8725d04bbefa8e014bdc9c1cdc6f17#currentOpenings\" rel=\"nofollow\">http:&#x2F;&#x2F;www.geocaching.com&#x2F;jobs&#x2F;?gnk=job&amp;gni=8a8725d04bbefa8e...</a>)\nYour primary responsibility will be to provide the first line of support for Geocaching team members, which you can expect to represent around 30-40% of your workflow. This includes provisioning workstations for employees, conducting technology orientation sessions with new employees, managing printers and conference room equipment, and fielding miscellaneous support requests. The remainder of your job duties will focus on systems infrastructure projects. You’ll work alongside the other IT team members to help build and support our unique production and office infrastructure. This includes deployment, configuration, administration, and maintenance of windows and linux web&#x2F;application servers, network and storage devices, databases, monitoring systems, backup systems, vmware environment, etc.<p>Mobile Developer - (<a href=\"http:&#x2F;&#x2F;www.geocaching.com&#x2F;jobs&#x2F;?gnk=job&amp;gni=8a8725d04bde832c014be62377ef2aaa#currentOpenings\" rel=\"nofollow\">http:&#x2F;&#x2F;www.geocaching.com&#x2F;jobs&#x2F;?gnk=job&amp;gni=8a8725d04bde832c...</a>)\nWe are seeking a skilled Mobile Developer to join the team that creates and maintains the suite of Geocaching apps for iPhone, Android, and Windows Phone. The team is currently using Swift to reimagine the way Geocaching is played on the iPhone. We’re seeking a developer who can quickly join in, come up-to-speed on the project and contribute to a growing team.<p>Software Developer - (<a href=\"http:&#x2F;&#x2F;www.geocaching.com&#x2F;jobs&#x2F;?gnk=job&amp;gni=8a3218144a328e95014a3a7e7cd86e6f#currentOpenings\" rel=\"nofollow\">http:&#x2F;&#x2F;www.geocaching.com&#x2F;jobs&#x2F;?gnk=job&amp;gni=8a3218144a328e95...</a>)\nAs a contributing member of our developer team, you will:\n* Develop highly scalable and maintainable services and UI components\n* Write code that is fully supportive of modern unit and integration test patterns\n* Solve complex technical problems in a collaborative environment, providing guidance to others as appropriate\n* Follow an agile software development methodology using Scrum or Kanban\n* Adhere to the architectural design and patterns established by the team\n* Understand how implementation decisions impact IT and performance on our infrastructure\n* Interact with key stakeholders at all levels\n* Proactively propose new technologies and&#x2F;or practices\n* Defend your area during NERF wars","time":1427900209,"type":"comment"}