{"by":"kraln_","id":9304397,"parent":9303396,"text":"Head of Product KIWI.KI GmbH Berlin, Germany -- Full time, (m&#x2F;w)<p>DESCRIPTION\nAs the Head of Product (m&#x2F;f, full time), you will develop awesome products and add your extensive B2C experience into our KIWI-“DNA”. You will work as part of our executive team to drive and implement the vision and roadmap for all products at KIWI.KI. Specifically, you will:\n•\tAdd your extensive B2C experience into our KIWI-“DNA”. \n•\tBe responsible for developing and defining our user profiles, stories, and products \n•\tHave the final word on decisions regarding user experience, features, and design \n•\tLead execution (scope, requirements definition and delivery) of top strategic products \n•\tDevelop and oversee the implementation of processes, and policies \n•\tDefine and prioritize the product development roadmap, with a strong product portfolio management analytical approach \n•\tDevelop budget for specified business unit&#x2F;product line and be accountable for delivering against business goals&#x2F;objectives \n•\tWork cross-functionally with all business groups to understand emerging customer and business trends that require enhancements or new product features to be developed \n•\tOversee and direct the work of a high performing team of product managers. \n•\tDevelop and mentor staff through communication, training and development<p>QUALIFICATIONS\nExperience with hardware products is an advantage but not required. You are a skilled Senior Product Manager with experiences in the area of product logic, strategy as well as UX design.\nOur engineering team speaks English, so competency in English is required. German is an advantage but not required.<p>WHAT TO EXPECT\nYou will work with a young international team of 30 really cool people – all experts in what they do and all eager to build the best products in the world. We achieved a lot and now we need you to create an even better product experience for our customers.\nYou will lead a team of initially 5--UX, Designers, Product managers, and frontend developers.<p>PRODUCT\nKIWI.KI provides secure, hands-free access for large multi-tenant buildings. Consumers enjoy the safe, simple, and convenient comfort of just walking through their doors with our transponder “Ki” in their pocket or our mobile app. Service providers – like post or waste management companies – gain work efficiencies.","time":1427902530,"type":"comment"}