{"by":"colindean","id":9304600,"kids":[9304601],"parent":9303396,"text":"IBM Watson in Pittsburgh has eight open positions as of this posting. This is for full time and IBM will do visas for qualified candidates. Our internships are largely closed, more on that in the reply.<p>I’m a software engineer and former consultant on the Watson Explorer connectivity team.<p><a href=\"http:&#x2F;&#x2F;ibm.biz&#x2F;watson-pgh-jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;ibm.biz&#x2F;watson-pgh-jobs</a><p>* Software Engineer\n* Quality Engineer\n* Quality Engineer\n* Senior Quality Engineer\n* Support Engineer\n* UI Developer\n* Design Team Manager\n* Technical Product Manager<p>We’re looking for folks versed in Java, Scala, and the Ruby on Rails stack. We do things like TDD, real actual pair programming†, kanban, agile-ish planning (IBM Design Thinking, not some convoluted buzzword bullshit), automated builds, “use the right tool for the job even if it’s not an IBM product”, and daily stand ups that, for the most part, never run past 15 minutes.<p>We have award-winning engineers, writers, and speakers in our office. One of IBM Design’s principals is located here, too. A few of our staff are on conference organizing committees for Steel City Ruby, DevOps Days, SATURN, etc.  Almost half of our desks are standing desks in our open space office plan (where sitting is fine, too!) with a roof deck in the middle of a bustling, multicultural business district.<p>We like to have fun, too, having regular board game lunches and evenings, hosting meetup events, weekly communal lunch cooked by one or more of our fantastic cooks, and managers that are incredibly full-of-clue and treat us like the adults we all are.<p>We try to keep our interview process as bullshit-free as possible. If we think you look good on paper, we’ll reach out for a phone chat and give you the details on a pretty open-ended code test, where you’ll implement a simple library. If we like your solution, then we’ll invite you for a live culture fit and technical interview, in-person if you’re near or remote if not. This process has given us a ridiculously low turnover.<p>You can read more in the many &#x2F;r&#x2F;pittsburghjobs posts I’ve made throughout the years both as IBM and as Vivísimo, the startup that IBM acquired in 2012:<p><a href=\"https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;pittsburghjobs&#x2F;comments&#x2F;2xq5o9&#x2F;ibm_watson_wants_you_squirrel_hill_office_looking&#x2F;cp2d3ir\" rel=\"nofollow\">https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;pittsburghjobs&#x2F;comments&#x2F;2xq5o9&#x2F;ibm_...</a><p>† no, really. We shoot for 50%-75% pairing, otherwise known as “pair when it makes sense”.","time":1427904085,"type":"comment"}