{"by":"Uber_Tech","id":9305928,"parent":9303396,"text":"Uber - Frontend, Backend, or Full stack - San Francisco - Full-time - Visa welcomed<p>As a member of our product engineering team, you&#x27;ll have a direct impact on the customer experience for both riders and drivers. Our team is responsible for Uber’s core business logic, which includes maintaining our product configuration in 200+ cities around the world, handling and storing thousands of payment transactions per second, developing intelligent fraud prevention strategies that scale, and ensuring that push and SMS notifications are sent in a timely manner.<p>Skills\n------<p>Fast learner. We’re looking for software engineers who thrive on learning new technologies and don’t believe in one-size-fits-all solutions. You have advanced knowledge of at least one scripting language (e.g. Python or JavaScript) and knowledge of or eagerness to learn: MySQL, PostgreSQL, Redis, Kafka, and ElasticSearch.<p>Fearlessness. You think a working proof-of-concept is the best way to make a point.<p>Versatility. In addition to having an intimate knowledge of the whole web stack, you understand how all the pieces fit together (front-end, database, network layer, etc.) and how they impact the performance of your application.<p>Strong architecture chops. You know how to build highly scalable, robust, and fault-tolerant services that support our unique rate-of-growth requirements.<p>Passion. You feel ownership over everything you ship; you&#x27;d never call code &quot;released&quot; until you’re confident it’s correct. You pride yourself on efficient monitoring, strong documentation, and proper test coverage.<p>A team player. You believe that you can achieve more on a team — that the whole is greater than the sum of its parts. You rely on others&#x27; candid feedback for continuous improvement.<p>Design and business acumen. You understand requirements beyond the written word. Whether you’re working on an API used by other developers, an internal tool consumed by our operation teams, or a feature used by millions of customers, your attention to details leads to a delightful user experience.<p>How to apply?\n-------------<p>Backend: <a href=\"https:&#x2F;&#x2F;www.uber.com&#x2F;jobs&#x2F;4810\" rel=\"nofollow\">https:&#x2F;&#x2F;www.uber.com&#x2F;jobs&#x2F;4810</a>\nFrontend: <a href=\"https:&#x2F;&#x2F;www.uber.com&#x2F;jobs&#x2F;4811\" rel=\"nofollow\">https:&#x2F;&#x2F;www.uber.com&#x2F;jobs&#x2F;4811</a>\nFull stack: <a href=\"https:&#x2F;&#x2F;www.uber.com&#x2F;jobs&#x2F;4767\" rel=\"nofollow\">https:&#x2F;&#x2F;www.uber.com&#x2F;jobs&#x2F;4767</a>","time":1427914477,"type":"comment"}