{"by":"experimentsin","id":9305356,"parent":9303396,"text":"TomTom – <a href=\"http:&#x2F;&#x2F;www.tomtom.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tomtom.com</a> — London, UK – Mobile &amp; Embedded Apps and DevOps roles (full time, on site, relocation available)<p>We&#x27;re TomTom&#x27;s navigation software team in London and we create the best on-the-road experiences for drivers and bikers everywhere.<p>The apps we make are built into Renault and Smart in-car systems, available for smartphones, and at the heart of TomTom&#x27;s expanding range of consumer devices where hardware and software are conceived together. Like the just-released TomTom Rider made specially for bikers: <a href=\"http:&#x2F;&#x2F;tomtom.com&#x2F;en_gb&#x2F;drive&#x2F;motorcycle&#x2F;index.html\" rel=\"nofollow\">http:&#x2F;&#x2F;tomtom.com&#x2F;en_gb&#x2F;drive&#x2F;motorcycle&#x2F;index.html</a><p>Developers who join our expert team are valued for their ideas as well as their skills, and we encourage both through regular hack days, plus training or conference attendance in areas that interest them.<p>-- Role: Mobile &amp; Embedded Apps Developer<p>Our apps feature TomTom&#x27;s signature design language and map-centric UI, optimised for use on the road. Working with TomTom&#x27;s UX team, app development with us is a challenging mix of custom UI development and deep routing, guidance, traffic and search presentation smarts. If you join us you&#x27;ll be developing with Java, C++, JavaScript, Android, iOS and Qt.<p>-- Role: DevOps for Mobile &amp; Embedded<p>Building scaleable CI infrastructure for mobile &amp; embedded app testing is hard, particularly when you add custom pre-release hardware and gigabytes of map data into the mix. If you join us you&#x27;ll be working with Android and iOS SDK command line tools and device emulators, Jenkins, Git, Nexus, Gradle, Ruby, Docker and a mix of local device farms and cloud computing services.<p>-- To find out more check out either <a href=\"http:&#x2F;&#x2F;tomtom.jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;tomtom.jobs</a> (search for &quot;London&quot;) or if you&#x27;re on LinkedIn <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;vsearch&#x2F;j?keywords=tomtom+london\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;vsearch&#x2F;j?keywords=tomtom+london</a>","time":1427910030,"type":"comment"}