{"by":"jfischl","id":9305182,"parent":9303396,"text":"Remind - <a href=\"https:&#x2F;&#x2F;remind.com\" rel=\"nofollow\">https:&#x2F;&#x2F;remind.com</a>  - SOMA, San Francisco, CA - All Engineering roles.<p>Remind is hiring JavaScript, iOS, Backend, Full Stack, Data Engineers &amp; Data Scientists in our SOMA-based San Francisco office. We&#x27;re on a mission to improve K-12 education in our lifetime. Want to help? Check out our jobs page - <a href=\"https:&#x2F;&#x2F;www.remind.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.remind.com&#x2F;careers</a>.<p>FAQs:\n- 23M users, 150M messages&#x2F;month &amp; 23 engineers, raised $59M \n- we’re the WhatsApp of education: a messaging app for teachers, students, and parents. No phone numbers are ever exchanged, no conversations are ever deleted. And because everyone has a phone (we do SMS too), students and parents get more involved. One teacher said his homework completion rates jumped from 75% to about 99%. That makes us super happy.\n- tech: architecture consists of many small microservices built with Ruby, Node.js and Go, running on top of Heroku and AWS behind a public RESTful API - <a href=\"http:&#x2F;&#x2F;api.remind.com\" rel=\"nofollow\">http:&#x2F;&#x2F;api.remind.com</a>. We use Postgres, DynamoDB and Redis heavily, with a massive job queue backed by Sidekiq and RabbitMQ. Frontend clients include a native iOS &amp; Android app as well as a full AngularJS single page app - in process of moving to React and ES6. \n- iOS app has 4.5 rating. The reviews should explain our impact - <a href=\"https:&#x2F;&#x2F;itunes.apple.com&#x2F;us&#x2F;app&#x2F;remind-safe-classroom-communication&#x2F;id522826277\" rel=\"nofollow\">https:&#x2F;&#x2F;itunes.apple.com&#x2F;us&#x2F;app&#x2F;remind-safe-classroom-commun...</a><p>Perks:\n- competitive salary and equity\n- lots of opportunities to connect with teachers and other end users\n- open vacation policy  \n- catered meals\n- stocked kitchen and fridge\n- health and fitness reimbursement\n- transit and parking benefit\n- trips to technical conferences  \n- monthly Hack Days\n- foosball table, couches, 20-foot loft ceilings w&#x2F;lots of light  \n- 100% health premium coverage for you and your dependents","time":1427908607,"type":"comment"}