{"by":"cwhiton","id":9305556,"parent":9303396,"text":"Senior UX Designer @ PicMonkey Inc &#x2F;&#x2F; Local in Seattle, WA &#x2F;&#x2F; jobs.design@picmonkey.com<p>Senior UX Designer\nYour wild-eyed obsession is our good fortune. Yes, we will embrace your left brain and right brain superiority, your impossible knack for making complex things simple, and your clean, modern aesthetic. No, we will not make fun of you for needing things to be functionally and visually beautiful, or for your meticulous attention to detail. Because we know that all of the above is what it takes to be an amazing UX designer at PicMonkey.<p>So, come. Join a supportive, collaborative team as we design web and mobile experiences for a killer brand. You’ll work on a variety of projects, from fun, small features to big-impact projects. You’ll explore new ways to help people wield technology for self expression. And best of all, you’ll have fun. Because that is a thing we do.<p>Responsibilities:<p>Work with multidisciplinary team to define project goals and requirements<p>Define user interaction, navigational hierarchies and workflow models for product features<p>Develop new conceptual models and design systems or work within existing ones<p>Imagine new ways people can use PicMonkey and continue to improve the experience<p>Work collaboratively with engineers and designers to iterate ideas and implement features<p>Effectively communicate and manage UX projects from vision to release<p>Create thorough UI specification documentation and high quality visual assets<p>Skills and qualifications:<p>BA or MA in interaction design, communication design, product design, HCI, or equivalent<p>7+ years industry experience in consumer web, mobile or software design<p>An online portfolio demonstrating strong creative skills, rock solid interaction design skills, the ability to generate compelling ideas and a thorough understanding of design process<p>A resume that shows you&#x27;ve driven large or complex features through the product development lifecycle<p>Proactive and strategic problem-solving and project management skills<p>Communication style that focuses on collaboration and consensus building","time":1427911542,"type":"comment"}