{"by":"durand7","id":9305632,"parent":9303396,"text":"Software Developer<p>Reports To: Vice President of Engineering<p>Start Date: Immediate&#x2F; Full-time<p>Location: Los Angeles, CA<p>www.nationbuilder.com<p>Compensation: Commensurate with experience, stock options and excellent benefits package<p>As a software developer, the world is full of opportunity. Every week there’s another social network, lean startup, marketplace or API opening up.  Only rarely, however, does the opportunity come along to build something truly important - a genre-defining new product that is already changing people’s lives.<p>NationBuilder is an online Community Organizing System built by a world-class team dedicated to empowering a new generation of leaders and creators with the tools they need to create a new world.<p>We’re currently hiring great software developers to join our team in Los Angeles.  We will relocate folks, so if you’ve ever wanted to live in LA, this is probably the best opportunity you’ll get. (And if you never considered living in LA we’ll convince you that it’s the greatest city to live in.)<p>You:<p>-are always interested in learning new things.<p>-get excited when you have the chance to pair.<p>-practice test-driven development and judicious refactoring.<p>-enjoy being responsive to customer feedback.<p>-are a pragmatic problem solver, knowing how to find the middle ground between “perfect, but takes forever to code” and “fixes it now, but nobody will ever be able to understand what I did”<p>-work well in small teams with a clear mission.<p>-have the insight to know whats important and the dedication to get it done.<p>Skills required:\nWe use Ruby, Rails, PostgreSQL, MongoDB, Redis, HTML&#x2F;CSS&#x2F;SCSS, and Javascript (JQuery, Handlebars.js, Underscore.js, etc).<p>APPLY at <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;nationbuilder&#x2F;7bfa5b81-ae69-46c7-94d6-93c54fd459c8&#x2F;apply\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;nationbuilder&#x2F;7bfa5b81-ae69-46c7-94d6-...</a>","time":1427912117,"type":"comment"}