{"by":"stevewepay","id":9305704,"parent":9303396,"text":"WePay (YC09) - Palo Alto&#x2F;Redwood City - Full-Time - Only current US work authorizations<p>Company Description<p>WePay is a fast-growing payments company that has built its API specifically for platform businesses like marketplaces, crowdfunding sites and small business software. Through this API, WePay allows platforms to easily offer payments to their buyers and sellers. WePay uniquely offers platforms a customized user experience while shielding them from fraud risk.<p>Job Description<p>We are looking for great software engineers to join our rapidly expanding team. Our transaction volume has more than tripled year-over-year and we’re rapidly outgrowing our existing tech stack.<p>We’re working to rebuild our application on top of a brand new service-oriented architecture and need your help. Do you love programming, take pride in the quality of your code, and are awesome at ping pong?<p>We’re working with real money so writing efficient, maintainable and well tested code is a must. We believe that great coders can adapt to whatever programming language they need to, whether it’s Java, Python, PHP, Javascript, C++, Scala, Ruby, or whatever it is that’s hot this week.<p>Qualifications<p>Be able to take complete ownership over a bug, feature, or entire project and drive it to completion. We have to trust that each of our team members can work independently because we hate micro-managing.\nBe open-minded, flexible, and have a pragmatic approach to solving problems. The payments industry can be baffling at times, so we value people who can persevere and continue to make progress with a positive attitude.<p>One or more of the following skills would be awesome:<p><pre><code>  *Front-end expertise including: HTML5, JavaScript, CSS, AngularJS\n  *Back-end expertise with RDBMS and NOSQL databases, messaging and queuing systems, batch and scheduled tasks\n  *Restful API design and implementation\n  *Building highly available and distributed systems \n  *Big Data experience including Hadoop, Storm, Kafka, etc.\n  *Machine Learning and Modeling\n  *Experience in Risk and Fraud Detection \n  *Experience in payments and PCI compliance \n  *Expertise in Security \n  *Leadership experience\n  *Prior open source experience, we love open source!</code></pre>","time":1427912679,"type":"comment"}