{"by":"jonbischke","id":9305221,"parent":9303396,"text":"Entelo - San Francisco (SOMA), CA - Full-time - <a href=\"http:&#x2F;&#x2F;www.entelo.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.entelo.com&#x2F;</a><p>Entelo&#x27;s mission is to help organizations build great teams by allowing them to search for talented people regardless of where they represent themselves on the web. We index hundreds of millions of social profiles and provide a powerful search tool that predicts which candidates are more likely to look for new opportunities and provide collaborative tools to help recruiters and hiring managers recruit more efficiently. Sales and Marketing departments have had a plethora of tools to help them over the years, but recruiting&#x2F;HR has notoriously been behind- we&#x27;re seeking to change that by providing solutions to improve both efficiency and efficacy to recruiters.<p>We&#x27;re helping 200+ companies with their hiring needs including fast-growth companies such as Facebook, Quora, Github and Lyft. We&#x27;ve been huge fans of Hacker News as the community has been great to learn from and four of our recent engineering hires came through Hacker News threads!<p>Our Tech Stack: Ruby, Scala, Rails, AWS, MySQL, Mongo, Redis, Elasticsearch, Redshift and Docker<p>We care deeply about professional growth and have an annual $1k allowance for all employees to spend on their own professional development (courses, conferences, coaching, etc.). Additionally, we&#x27;re located in Soma near BART and CalTrain and have a number of perks including health&#x2F;dental&#x2F;vision and heavily subsidized gym membership.<p>We&#x27;re looking for sharp, collaborative engineers for a variety of roles including:<p>-Sr. Backend Engineer&#x2F;Architect: Ideally looking for someone that can own our backend stack in regards to crawling, parsing and normalization of the hundreds of millions of profiles we index. We use a combination of Scala&#x2F;Mongo&#x2F;Haskell for our backend today, but are open to other technologies including Golang. ElasticSearch experience is also a huge plus.<p>-Data Engineer: We&#x27;re looking for our first Data Engineer to be our first dedicated data-team hire. Ideally this person has experience with data warehousing, data mining and building out data pipelines and has experience with storage (MySQL, MongoDB, Redis), search technologies (elasticsearch, solr or lucene)and stuff in the MapReduce family (Hadoop, HFS, etc.)<p>-DevOps Engineer: Looking for our first DevOps engineer as DevOps is currently handled by committee. We are looking for someone that comes from more of a development background as opposed to operations as we&#x27;re an AWS shop and currently use Docker.<p>-Full-Stack Rubyists. Experience with ElasticSearch is a huge plus.<p>Check out more at <a href=\"https:&#x2F;&#x2F;www.entelo.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.entelo.com&#x2F;careers</a><p>I&#x27;m the founder and you can email me directly at jon at entelo dot com if you&#x27;re interested in working with us at Entelo.","time":1427908996,"type":"comment"}