{"by":"olegp","id":9306478,"parent":9303396,"text":"Omniata - <a href=\"http:&#x2F;&#x2F;omniata.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;omniata.com&#x2F;careers&#x2F;</a> - San Francisco, Helsinki - Full Stack Engineer - Full time, visa<p>Omniata enables the entire digital organization - marketers, product managers and data scientists - to run their business based on data. It creates an integrated view of consumers across devices, providing tools to optimize the user experience in real-time. Omniata integrates analytics, CRM, engagement and A&#x2F;B testing platforms into a single all encompassing solution.<p>We are looking for a talented full stack engineer to help us take our service to the next level and change how our customers view their business critical data. As such, we hope you have keen interest in big data, data visualization &amp; building modern web interfaces and REST APIs.<p>You will work alongside product managers, business analysts, designers and other engineers to spec up and implement the customer facing parts of our service. This will involve writing code for both browser and server, which interfaces with our back end event data store.<p>As a full stack engineer you will be responsible for creating the front end of Omniata&#x27;s service that allows our customers to make the most of their data. You’ll need to have the ability to quickly go from a set of wireframes and requirements to a working web app while taking customer needs and changing priorities into account. So, a web agency background would be beneficial for this position.<p>Knowledge of HTML, CSS and JavaScript is required. Familiarity with AngularJS is a plus. Experience with any server side web stack such as:  Node, Rails as well as any Python or PHP framework is also assumed. No extensive database knowledge is needed, however some experience with configuring servers and DevOps tools would be a bonus.<p>To apply, drop a one line email with a link to your LinkedIn or GitHub profile to careers-sf@omniata.com","time":1427918844,"type":"comment"}