{"by":"drone","id":9306607,"parent":9303396,"text":"UI Developer &amp;&amp; Backend Developer &#x2F; MacroFab, Inc. &#x2F; Houston, TX Full-time<p>==== About MacroFab<p>MacroFab is making it easier, faster, and less expensive for makers and creators to get their designs to market through cloud-enabled electronics manufacturing and automated operations services. Our goal is to make it possible for any maker or product designer to get their product to market quickly and easily.<p>Fully interactive and automatic production tools for electronic products, with direct control over all just-in-time manufacturing and fulfillment tasks through the web and via APIs. MacroFab is the electronics manufacturing service that gives makers and entrepreneurs a completely transparent, elastic, and manageable outsourcing capability.<p>===== Why Work with Us?<p>We’re creating the next generation of manufacturing services, one which is powered not by cheap labor, but by intelligent software and beautiful machines. We’re creating a service that has all of the capabilities we needed when we had a small products company. We’re makers, developers, and entrepreneurs who are working to enable other makers, developers, and entrepreneurs. We are all about building things: machines, software, and communities. If you like the challenge of tackling difficult problems, and if you want to help inventors and makers get from idea to product fast while saving them money and time, then we’d love to have you on our team.<p>====== About You (UI Developer)<p>As a UI Developer at MacroFab, you’ll be responsible for creating rich, interactive user interfaces using Ractive that enable our customers to quickly and easily take full control over our manufacturing capabilities and verify the final results. You’ll work with a highly-decoupled MVP architecture using Ractive, Mojolicious, Perl, ElasticSearch, memcached, MySQL, RabbitMQ, and AWS. The user interfaces you build will interact with CAD data from customers and allow them to explore their products before they are manufactured, and manage ongoing production of complete products through all of their different phases.<p>====== About You (Backend Developer)<p>As a Backend Developer at MacroFab, you’ll be responsible for creating stable, performant APIs and control systems to run our network of manufacturing equipment, 3D printers, and warehousing systems. You’ll build great software to work with machines large and small, both purchased and built in-house. If you like, you can help design and write the core software for those machines too. You’ll build great, reliable APIs in Mojolicious, and solve complex task management in Python, C++, Erlang, or whatever language you believe will be able to solve the problem most effectively. Of course, to fit in with our existing tech stack, you’ll have working knowledge of (Or, will be able to pick it up fast!) RabbitMQ, Elasticsearch, memcached, MySQL, and AWS APIs.<p>You always build software using best industry practices and have kept your knowledge of security and performance concerns up-to-date. You’ll be part of a small team, and will have the autonomy you need to express your creativity in all of the ways you want.<p>======= Get in Touch!<p>Send your resume and some examples of your work to jobs@macrofab.net","time":1427920100,"type":"comment"}