{"by":"joell","id":9306194,"parent":9303396,"text":"Achievers - <a href=\"http:&#x2F;&#x2F;www.achievers.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.achievers.com&#x2F;</a> - Toronto (Liberty Village), Fulltime<p>BI&#x2F;ETL Developer: <a href=\"http:&#x2F;&#x2F;hire.jobvite.com&#x2F;m?3Pk5ahwa\" rel=\"nofollow\">http:&#x2F;&#x2F;hire.jobvite.com&#x2F;m?3Pk5ahwa</a><p><pre><code>    - 6-8 years of ETL development experience with an ETL tool such as: Informatica, DataStage, Ablnitio, or MS SSIS\n    - 6-8 years of experience developing reports with a BI tool such as MicroStrategy, Cognos, Business Objects, Birst, Tableau, etc. (tabular, dashboards, mobile, or visualization)\n    - 4-6 years of SQL experience\n    - Experience with relational databases (MySQL and Postgres preferred)\n    - Experience with dimensional modeling (dimensions, facts, star and snowflake schemas)\n    - Understanding of OLTP and OLAP , including their differences\n    - Understanding of data warehousing and ETL-specific concepts (landing, staging, lookups, aggregates, batches, transformations, DQ, SCDs, archiving, surrogates, ragged hierarchies, etc.)\n    - Ability to unit-test data (different from testing applications)\n    - Knowledge of performance and tuning techniques for data warehouses\n    - Experience gathering and documenting requirements\n    - B.S. or higher in Computer Science\n</code></pre>\nSoftware Test Developer: <a href=\"http:&#x2F;&#x2F;hire.jobvite.com&#x2F;m?3Sj5ahwc\" rel=\"nofollow\">http:&#x2F;&#x2F;hire.jobvite.com&#x2F;m?3Sj5ahwc</a><p><pre><code>    - 1-5 years of experience with: HTML, PHP, CSS, Javascript&#x2F;JQuery\n    - Experience in both software development and testing environments\n    - Web &amp; Mobile Automation experience is a plus\n    - Familiarity with Selenium Web-Driver, Appium and Jenkins is a plus\n    - Co-op experience an asset\n    - Recent graduate from University or College with a degree in Computer Science or equivalent</code></pre>","time":1427916693,"type":"comment"}