{"by":"pdwittig","id":9306720,"parent":9303396,"text":"Full-Stack Engineer at Breeze - <a href=\"http:&#x2F;&#x2F;www.joinbreeze.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.joinbreeze.com</a><p>COMPENSATION\n$80K – $150K Salary\n0.1% – 0.5% Equity<p>ABOUT YOU<p>* 1-3 years of software development at a high-growth technology company<p>* BS or MS in Computer Science or equivalent hacking experience<p>* A passion for delivering great user experiences and working through complex problems<p>* Strong experience with Ruby on Rails (ideal candidate)<p>* Ideally experience with major Javascript framework such as: Ember, AngularJS<p>* Preferred proficiency with relational databases, comfortable dabbling in both front-end and back-end tasks. Building out analytics infrastructure. Not afraid to work on design and UX<p>THE ROLE<p>* This is a pivotal moment for Breeze’s product and engineering culture. Help us expand to all 60 US cities that Uber, Lyft, and other on-demand services have a presence in<p>* Lay out the vision for our technology platform and execute on that vision. If you love building web  products from scratch, this role is perfect for you<p>* Collaborate directly with co-founders to plan, execute and measure the success of all of Breeze’s product and engineering objectives across web and mobile<p>* Interview and hire engineering candidates<p>* Develop a productive and positive engineering culture<p>THE PERKS<p>* Daily catered food and lunches from Caviar<p>* Lounge with sofas, ping pong, foosball, pool and arcades<p>* Open vacation policy – take time off as needed on your own schedule<p>* Team outings such as the infamous Breezeball (Foosball + Beer) Fridays while rocking a pair of Chubbies team shorts.<p>* Headquarters conveniently located in the atrium of the Zynga building 3 blocks from the Caltrain station with free shuttles for the building during commuter hours.<p>* Bose headphones<p>Apply here: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;breeze&#x2F;jobs&#x2F;37210-full-stack-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;breeze&#x2F;jobs&#x2F;37210-full-stack-engineer</a>","time":1427920934,"type":"comment"}