{"by":"spogbiper","id":9307110,"parent":9303396,"text":"Terabyte Technologies - <a href=\"http:&#x2F;&#x2F;terabytetech.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;terabytetech.com&#x2F;</a> - West Palm Beach, FL - General IT wizards able to support various small&#x2F;medium business clients<p>(not my company, owned by a friend who I consider a pretty good guy.  below is the text of their help wanted ad.  in case it doesn&#x27;t make things clear, these positions involve doing all kinds of IT work for companies too small to have their own IT department, or supplementing small IT departments as needed for the larger clients.  You interact with a lot of different people and often in somewhat stressful situations.. some clients only call when something is broken.  You must be somewhat local to WPB.. Ft. Lauderdale, PSL, etc)<p>We are looking for smart, reliable and hardworking people who are looking for a place to shine. People who think outside of the box and know what good customer service is all about. We are looking for people who are looking to make a place for themselves and who are always looking up. People who don&#x27;t job hop and are looking for a permanent place to plant their feet. If this sounds like you then we may have a place for you.<p>What you&#x27;ll need to do: This position will require you to wear a lot of different hats: - You will need to go onsite to take care of our clients and their various computer&#x2F;server needs. (you must have valid DL and a reliable car)\nRemote support for our clients is a daily occurrence so you must be able to walk our clients through their issues remotely.<p>You will be working with server disasters and un-routine computer issues so you must have solid problem solving skills and be able to work well under pressure.\nYou will need to be able to translate geek. Know how to explain what the problems are in a way that our clients can understand and then find solutions that will save them time and money. (must have people skills and work well with others)<p>This is a dress casual work place. Long sleeve dress shirt, slacks and dress shoes are required.\nThese are just some of the things that are required to fill this position but we are looking for people who are ready to jump in when needed and who are always looking to learn something new.<p>What you&#x27;ll need to know:\nExperience is key!\nMust be a Windows wizard. Many of our clients run Windows workstations against Windows servers. The ability to intelligently navigate a variety of hardware and software issues is a must. Mac&#x2F;Linux skills a plus.\nTo be able to think outside the box. Problems in this industry have more than one solution. You need to have the ability to find that solution quickly and efficiently and with a cool and level head.\nBe a multitasker. We work in a fast-paced, action-packed environment. If you can&#x27;t multitask your head may explode.<p>Apply by sending your resume via email to info@terabytetech.com. Please note why you are different and why we should interview you.","time":1427924292,"type":"comment"}