{"by":"jph00","id":9307017,"parent":9303396,"text":"Company: Enlitic <a href=\"http:&#x2F;&#x2F;www.enlitic.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.enlitic.com&#x2F;</a> Location: San Francisco REMOTE is fine if you&#x27;re happy to visit regularly<p>If you have world-class machine learning, math, programming, stats, or physics skills, and want to use them to positively impact a billion people, please read this. We believe that what we&#x27;re working on is the biggest financial and social impact opportunity in the world today.\nEnlitic uses recent advances in machine learning to make medical diagnostics faster, more accurate, and more accessible. Founded by Kaggle&#x27;s past president and chief scientist (that&#x27;s me!), its mission is to provide the tools that allow physicians to fully utilize the vast stores of medical data collected today, regardless of what form they are in - such as medical images, doctors&#x27; notes, and structured lab tests. To realize this vision, we are building on state-of-the-art deep learning algorithms and partnering with top research hospitals and medical device manufacturers. We&#x27;ve raised $5m funding and have a small team of 10 applied machine learning experts.<p>If you&#x27;re interested in playing with cool hardware and data, we&#x27;re a great place to come. We use a cluster of hundreds of Tesla K80 GPUs, and have many millions of medical images - some single images are over 10GB in size. Many are 3d, which makes for some really interesting engineering challenges.<p>We use a wide range of tools and languages, including AngularJS, React, ES6 &#x2F; Coffeescript, Python (Theano, Pandas&#x2F;Numpy&#x2F;etc, Flask), and C++ (Caffe). We have regular journal club talks (mainly recent deep learning papers), and a good mix of research and applied work.\nOur day to day work covers a lot of cancer detection and treatment planning, as well as a wide range of other high impact medical issues - the consistent underlying theme is using a data-driven approach to improving patient outcomes. There are particularly big opportunities (both financial and social impact) in the developing world.<p>We&#x27;re working with many of the top academics in the medical diagnostics field, and are partnering with some of the top hospitals around the country and around the world.\nWe are looking for people that have an in depth understanding of linear algebra, convex optimization, algorithm design, and software engineering, to join us as data scientists, full stack and frontend engineers, and dev ops engineers. No medical or life sciences background is necessary. Python, C++, and CUDA experience is helpful - but the proven ability to learn quickly is more important. We&#x27;re also looking for MD&#x2F;PhDs with physics or comp sci backgrounds to help us brings the worlds of medicine and machine learning together.\nIn addition, we’re looking for a senior business development person, as well as a product manager and UX designer.<p>Have a look at our team to see whether you think you might be a good fit <a href=\"http:&#x2F;&#x2F;www.enlitic.com&#x2F;team.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.enlitic.com&#x2F;team.html</a> . We&#x27;re interested in building a diverse team, so if you don&#x27;t fit the standard Bay Area &quot;ninja rock star programmer&quot; mold - great!\nFor more background on the company and technology, see my TED.com talk here <a href=\"http:&#x2F;&#x2F;www.ted.com&#x2F;talks&#x2F;jeremy_howard_the_wonderful_and_ter..\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ted.com&#x2F;talks&#x2F;jeremy_howard_the_wonderful_and_ter...</a>. . For more information about careers and how to apply, see <a href=\"http:&#x2F;&#x2F;www.enlitic.com&#x2F;careers.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.enlitic.com&#x2F;careers.html</a> or <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;enlitic&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;enlitic&#x2F;</a>. If you&#x27;re not sure whether you have the right skills or background, just shoot us an email anyway and we can figure that out together...","time":1427923478,"type":"comment"}