{"by":"joelm","id":9308232,"parent":9303396,"text":"Bigleaf Networks, Portland OR - Lead Software Engineer<p>Bigleaf provides internet redundancy and optimization, keeping businesses connected to their internet-based applications by leveraging diverse ISP connections.<p>Our proprietary platform uses Software-Defined-Networking technologies to provide seamless failover and dynamic application prioritization. We have a reliable and high-performance service offering that’s been proven regionally and is in the midst of nationwide expansion. We’re looking for a lead software engineer to join our team to help make that a success.<p>Here&#x27;s a summary of what you&#x27;ll be doing:<p>• Software Projects: You’ll be responsible for driving the development of new systems, features, and bug-fixes; coordinating people and resources to ensure projects are done excellently and on-time.<p>• High-availability software design, development and deployment: Our customers purchase our service to improve their network reliability and performance. In this role you’ll carefully brainstorm, design, build, and deploy systems that are fault-tolerant, efficient, fail gracefully, and solve problems in creative ways.<p>• Troubleshooting: Our software has to run efficiently, and our network has to run almost flawlessly. You’ll spend time diagnosing problems in code and with Linux system integration, testing code updates, and helping with network operations, all to ensure our customer’s don’t have to think about their internet (because it always works).<p>• Linux Systems Development: We run a software-based network that relies extensively on Linux. You will help ensure that these systems are designed and implemented in a scalable and reliable manner, with appropriate security measures in place.<p>Bigleaf is a well-funded fast-growing startup, so your day-to-day tasks will vary a bit and morph over time. You’ll be an early team member, so you’ll have the chance to help shape company culture and make a huge difference. We plan to extensively promote from within, so you’ll have the opportunity to shape and grow your career over time.<p>If this sounds of interest, feel free to check out this page for a bit more info: <a href=\"http:&#x2F;&#x2F;www.bigleaf.net&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bigleaf.net&#x2F;careers&#x2F;</a> and contact me at joelm@bigleaf.net.<p>Joel Mulkey, Founder and CEO","time":1427939681,"type":"comment"}