{"by":"dat888","id":9308056,"kids":[9308735,9375006],"parent":9303396,"text":"<i></i>* ShareThis in Palo Alto is HIRING! <i></i>*<p>ShareThis is an incredible social sharing data start-up backed by Blue Chip, T-Venture, DFJ - who also funded huge successes like Tesla, Twitter, Skype, Box and much more - DFJ.com. Our entrepreneurial and passionate leaders and team have top backgrounds from Harvard, Berkeley, Columbia, Google, Amazon, PayPal &amp; numerous successful start-ups.<p>Over half the Fortune 500 already use our comprehensive and innovative Insight Analytics, Research and Data Tools for branding and advertising. We have great engineering challenges and an exciting product roadmap for 2015! We collect terabytes of data daily for us to use on our current and evolving stack: Java, Javascript, PHP, Python, HTML5, CSS, Kafka, Hadoop, AeroSpike, LAMP, Cassandra, AWS. We make social data actionable thru the use of machine learning and low latency distributed systems.<p>We&#x27;ve won numerous industry awards due to our phenomenal growth including the prestigious Forbes America’s Most Promising Companies list.  We just moved into our new modern Palo Alto office and beautiful campus (with scenic water fountains surrounded by over a dozen palm trees) - Google Nest Labs and Bosch Research are our neighbors. Did I mention the catered lunches, ping pong, foosball, gourmet coffee machines, beverages, snacks and fresh fruits? You get the idea of why people looove being here.<p>We collect terabytes of data daily for us to use on our current and evolving stack: Java, Javascript, PHP, Python, HTML5, CSS, Kafka, Hadoop, AeroSpike, LAMP, Cassandra, AWS. We make social data actionable thru the use of machine learning and low latency distributed systems.<p>Check out some of our challenges we&#x27;re solving on our engineering blog: <a href=\"http:&#x2F;&#x2F;engineering.sharethis.com\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.sharethis.com</a><p>Watch a video about our culture and how our business works (and lots more!) at <a href=\"http:&#x2F;&#x2F;ShareThis.com&#x2F;rocketship\" rel=\"nofollow\">http:&#x2F;&#x2F;ShareThis.com&#x2F;rocketship</a><p>We are growing fast - getting more and more users every day. We really believe in &quot;Move fast, fail fast, learn fast, iterate fast”. We&#x27;ve built infrastructure to enable this value, like continuous deployment. The position best fits someone that likes to get their brains around the &quot;big picture&quot; planning and direction as well as love being a hands-on code contributor. ShareThis promotes sharing of interesting content among users connected by a social and shared interests graph.<p>RESPONSIBILITIES<p>▪ Contribute to the design, architecture and development of terabyte scale real-time and batch architectures\n▪ Participate in hack-a-thons, code reviews and architecture discussion\n▪ Metrics driven approach to improving performance (uptime&#x2F;response times&#x2F;scalability) and quality of our applications<p>QUALIFICATIONS<p>▪ Some experience developing end-to-end API applications and&#x2F;or big data pipelines\n▪ Passion for creating quality, data driven applications \n▪ Show off your Tech IQ! Send us your blogs, Stack Overflow answers, stuff on GitHublet&#x27;s, projects, code or hacks you want to share or blogs, tweets, or forums you follow regularly<p>We offer great perks, cool office, catered lunches.<p>INTERESTED? email: dat@sharethis.com<p>* No Remote, H1B transfers OK, Unpaid Internships Available, No Recruiters please.","time":1427936398,"type":"comment"}