{"by":"helenatdisqus","id":9318288,"parent":9303396,"text":"Disqus&#x27; mission is to make it easy for people to get into discussions about the things they love -- or are just curious about. We&#x27;re building out the advertising side of our business, and we&#x27;re actively hiring the following roles, many of which will focus on our growing ads space, for our downtown San Francisco office:<p>DevOps Engineer: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;blk8cr\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;blk8cr</a>\nDisqus is found on millions of sites and receives over a billion pageviews a month. Our 3-person DevOps team builds the foundation for everything we do, and we&#x27;re looking for a 4th person to join. You have 5+ years of experience with Linux and server hardware, and can also work with our development engineers because you know Python and Javascript (or are interested in learning).<p>Sr. Infrastructure Engineer, Advertising: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;1m56i3\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;1m56i3</a>\nInfrastructure Engineer, Advertising: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;ug402s\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;ug402s</a>\nWe&#x27;re looking for two people to build the backend infrastructure for our growing suite of ads products. You have 2-5 years of prior experience building infrastructure (or 5-10, for our senior role) -- bonus if any of that prior experience was with advertising infrastructure.<p>UI Engineer, Advertising: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;eivf80\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;eivf80</a>\nThis role will focus on implementing designs for our Advertising product development team. You have a solid grasp of HTML and CSS, a good eye for design, and a desire to learn and grow within a comprehensive code review culture.<p>Data Analyst, Advertising: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;jkenh5\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;jkenh5</a>\nWe&#x27;re looking for someone with 2-5 years of prior experience to join our 2-person Data Analytics team. This role is great for someone who likes talking with data, since you won&#x27;t just pull reports on behalf of other teams -- you&#x27;ll evangelize the stories behind your data at all levels of the company.","time":1428092913,"type":"comment"}