{"by":"theyCallMeSwift","id":16493404,"parent":16492994,"text":"Major League Hacking (MLH) | Sample Application Developers &amp; Technical Curriculum Developers | Remote, NYC | Contract<p>Do you spend your free time making cool applications to learn about new technologies? Do you write tutorials to teach your friends and audience about something cool you&#x27;ve learned? Major League Hacking wants to pay you to do exactly that.<p>MLH&#x27;s Localhost program creates workshops to introduce developers to cutting edge technologies and to inspire the next generation of hackers. We are building a team of rockstar sample application developers and technical curriculum developers to create the sample applications and tutorials that participants learn from and build off of in these workshops. Everything we create is open source so this is a great opportunity to learn new technologies, add a ton of experience to your portfolio and resume, and have a lot of fun!<p>To get a feel for the kind of application &amp; content we create, check out this simple Snake game that integrates in-app purchases via Shopify to teach participants the basics of GraphQL.  <a href=\"https:&#x2F;&#x2F;github.com&#x2F;MLH&#x2F;mlh-localhost-shopify-graphql\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;MLH&#x2F;mlh-localhost-shopify-graphql</a><p>SKILLS: Ideally Python, HTML, CSS, and JavaScript but a wide variety of technical skill sets are applicable. Technical writing with an approachable tone is key for the Technical Curriculum Developer role.<p>COMPANY: Major League Hacking&#x27;s (MLH) mission is to empower hackers. Each year over 100,000 young technologists and innovators around the world attend MLH events and join our community. Our events provide a self-driven environment where community members learn from each other outside the confines of traditional academia. The MLH team grew out of this movement and is dedicated to making it accessible to the entire world.<p>APPLY:<p>* <a href=\"https:&#x2F;&#x2F;careers.mlh.io&#x2F;jobs&#x2F;localhost&#x2F;sample-application-developer\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.mlh.io&#x2F;jobs&#x2F;localhost&#x2F;sample-application-dev...</a>\n * <a href=\"https:&#x2F;&#x2F;careers.mlh.io&#x2F;jobs&#x2F;localhost&#x2F;technical-curriculum-developer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.mlh.io&#x2F;jobs&#x2F;localhost&#x2F;technical-curriculum-d...</a>","time":1519921960,"type":"comment"}