{"by":"I-M-S","id":16495287,"parent":16492994,"text":"Seed Interactive | Toronto | Onsite, Full time | Salary | www.seedinteractive.co<p>SEED is an digital agency creating mobile apps, VR&#x2F;AR interactive experiences, and we are just about to release our first Nintendo Switch game. Which is to say we do fun and interesting stuff.<p>We are now looking for a senior Unity and C# developer to join us. Our team is still small - you&#x27;d be employee no. 10. What this means is that we still operate in WYSIWYG mode - the correlation between your actions in the workplace and the outcome is clear and discernible. The role comes with a wide range of tasks, high degree of responsibility, and an ample amount of freedom.<p>A bit about you. You probably earned some kind of diploma in computer science or a game-related field (unless you’re a self-taught savant). Afterwards you’ve meticulously honed your craft in various established organizations for half a dozen of years or so. In addition to great products, over time you’ve also built your set of soft skills. You can not only solve problems but also communicate your solutions to others. You may have been exposed to stuff like office politics and ladder climbing, and rightfully decided you want nothing to do with it. You prefer to disseminate knowledge rather than gossip. And somehow - almost miraculously - deep inside you still feel the fire to write clean code, make smart game design decisions, and lead younger team members with a smile.<p>Basically we want you know your shit, get shit done, and not be a shit to others. It’s a tall order, for sure, but you’ll get to work with people who exude those qualities as well.<p>This is a full-time salaried position in Toronto. (Un)fortunately we don’t have a legal team so we can’t help you with getting a visa - you need to be able to work in Canada for this one. Send your resume to ivan@seedinteractive.co (n.b. we are big believers in one page CVs) and write a few sentences why are you the best person for the job so we know that you care (and could judge your persuasion skills and spelling).<p>TL;DR: Unity &amp; C# senior dev lead who’s also a jolly good chap","time":1519932494,"type":"comment"}