{"by":"johnumbaugh","id":16495151,"parent":16492994,"text":"CareEvolution | Technical Communicator | Ann Arbor, MI | ONSITE, REMOTE, VISA, <a href=\"https:&#x2F;&#x2F;www.careevolution.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.careevolution.com&#x2F;</a><p>What we do actually matters.<p>It&#x27;s estimated that 250,000 people die in America annually because of medical errors. That makes it the #3 cause of death, just behind heart disease and cancer (goo.gl&#x2F;zntNUd). This is a major societal catastrophe - and it needs to be fixed. Part of the solution is the long-overdue modernization of our nation&#x27;s health IT infrastructure. This is CareEvolution&#x27;s mission - to create better patient outcomes by modernizing - and connecting - our health IT systems.<p>We&#x27;re looking for someone to fill a technical communicator role to manage building and maintaining our internal and external documentation, to write journal articles, to do some wiki management, to produce video tutorials etc.  A high degree of technical expertise is required, as are excellent writing and communication skills and a background in health IT.  This role also likely entails managing customer questions and requests as it relates to documentation - and executing on them. The ideal candidate will have expertise in at least some of the following: HTML, XML, basic Git, basic graphic design, basic SQL, understanding and using REST and other web services, basic video editing and production.  We don&#x27;t expect all of those skills... it&#x27;s just that we&#x27;re not sure how best to communicate what we need to communicate - that&#x27;s why we&#x27;re looking for someone.<p>We&#x27;re a small team - still under 100 people (and all technical!) - but our platform manages health data for over 130 million people.<p>Check out our company page on <a href=\"https:&#x2F;&#x2F;stackoverflow.com&#x2F;jobs&#x2F;companies&#x2F;careevolution\" rel=\"nofollow\">https:&#x2F;&#x2F;stackoverflow.com&#x2F;jobs&#x2F;companies&#x2F;careevolution</a><p>Visit our website at <a href=\"https:&#x2F;&#x2F;www.careevolution.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.careevolution.com&#x2F;</a><p>Submit resumes (PDF please!) to resume@careevolution.com .<p>Note: this job is open to US Residents only. Foreign nationals CAN apply, but only if you live within the US.","time":1519931675,"type":"comment"}