{"by":"the_stc","id":16494654,"kids":[16495745,16501922,16494869],"parent":16492994,"text":"<a href=\"https:&#x2F;&#x2F;PinkDate.is\" rel=\"nofollow\">https:&#x2F;&#x2F;PinkDate.is</a> | Extrajurisdictional | REMOTE | Monero Security Analyst &amp; Engineer | Contract Work<p>PinkDate is an extrajurisdictional company that will dramatically improve the escorting [sex work] industry. We depend on privacy and anonymity tech, including Monero [XMR]. Monero has lofty goals and powerful privacy claims that fall short in actual operation.<p>As an example: All network communications are unencrypted which allows a passive adversary to easily de-anonymize many transactions. Instead: Monero should be encrypted and easily integrate with Tor to hide user activity.<p>Contract 1: We desire an engineer to contribute to the Monero open source project. This includes adding encryption between nodes, reducing wallet metadata leakage, and integrating Tor into both the client [easy] and the node software [more challenging].<p>Contract 2: We need someone to write a simulator and improve blockchain explorer tools to determine how well Monero&#x27;s privacy claims truly hold up. To-date there is no public research on fundamental aspect of Monero. We want to be able to have answers to the questions of how private a user becomes when using Monero. How often must a user send money to themselves [churn] to effectively hide among X users? We want to make proposals to change the Monero network parameters to improve privacy and have the evidence to make the case.<p>All work will be published openly and you can take the credit with a note that PinkDate is the sponsor. You should be comfortable engaging with community and defending design decisions and research.<p>Note: PinkDate is an extrajurisdictional company and pays contractors in cryptocurrencies as a transfer mechanism. We price contracts in USD.<p>If you like the idea of working on an underground project: We often have contracts or positions available in legal, security, [counter]intelligence, devops and general software engineering. Drop me a line: brad@pinkdate.is","time":1519928869,"type":"comment"}