{"by":"igammarays","id":16493273,"kids":[16502798],"parent":16492994,"text":"Flute Mail | Toronto | REMOTE OK (US&#x2F;UK&#x2F;Canada only) | Full-time | Full Stack Web Engineer | 15% equity + stipend<p>At Flute our team of 2 engineers has built a new kind of email API which I think will disrupt a multi-billion $ industry (think SendGrid&#x2F;Mailgun&#x2F;Postmark and other transactional APIs). We decouple your email API from from your servers or providers in a load-balanced, failover-native, hot-swappable fashion with full-text Elasticsearch for your data. See flutemail.com<p>We are very, very new: our website literally went live this week. Still haven’t launched publicly, and the app is buggy (though we have a few customers on our waiting list). However, the company is profitable, due to my previous consulting contracts.<p>My CTO is leaving to join Google in a couple months, so I need a new CTO&#x2F;product-engineer to help me deploy and grow this thing.  I’m a full stack dev myself and the founder, with strong product management experience.<p>I’m looking for someone who deeply understands the value of our core idea and is committed to joining a startup in the early stages for significant equity + a small stipend to cover living expenses. I’m a slow, methodical, code-reviewing engineer who loves to create issues and design UI&#x2F;UX mockups, while you’re the hackathon-move-fast-and-break-things engineer who enjoys crashing through a list of issues, and is excited to learn anything. Be prepared to do everything from DevOps to frontend hotfixes. I prefer that you have real big-company experience (since I don’t).<p>Stack: NodeJS, Angular 4, Elasticsearch, RabbitMQ, Python integration testing<p>How to apply: Send me an email (see HN profile) and tell me why you think you might be a fit for this role. I’ll ignore the email if it’s only a resume, please write a bit to explain to me why you want to join a ridiculously early stage startup.<p>Isa Hassen | Founder &amp; CEO\nFlute Systems, Inc.","time":1519921418,"type":"comment"}