{"by":"TDMLB101","id":16493662,"parent":16492994,"text":"BAMTech Media | New York, NY | Software Engineer AND Technical Project Manager|| ONSITE or REMOTE, Full time<p>Join our team and help us drive the cord-cutting revolution! BAMTech isn’t just about streaming Baseball – we also manage HBO Now, Eurosport, NHL, MLS, Twitter NFL, Fox Sports Go, WWE, and several other content providers. You would be helping a team whose services act as the linchpin for video playback, handling new challenges of scale and speed in a rapidly growing industry. The company is aggressively expanding to meet increased demand, and you would be getting in on the ground floor of this new opportunity.<p>Engineers: You would help the team create new designs to meet our scaling demands, utilize cloud infrastructure providers with AWS EC2, ECS, S3, Dynamo, Kinesis, Lambda, and several others, and help the team introduce new processes to scale. If you like tinkering with new technologies, have experience with high scale systems, or simply want to gain exposure to new tools, this team is a great fit. You’d be helping the team embrace microservices architecture with an emphasis on non-blocking, highly concurrent programming. Experience with Scala&#x2F;Play&#x2F;Akka is highly preferred, but not a requirement. With strong CS fundamentals and an entrepreneurial attitude, you’d be an asset to our team.<p>Technical Project Managers: You&#x27;ll be the turbocharger for the team helping to accelerate development, clear obstacles, design the team&#x27;s roadmap, interface with external stakeholders, and scope new projects. Desired qualities include: Development experience or related CS degree; Experience roadmapping, setting milestones, and creating project plans; Flexibility on process and tools, embracing Agile but constantly seeking developer feedback to adapt processes to best suit the team’s style; Hands-on attitude with capacity to design project plans and implementation plans as well as facilitate and participate in testing; Guard&#x2F;Protect developer time by absorbing inbound randomization to the team; Tenacity to drive a project to completion; Great communication skills with ability to coordinate with engineers and non-engineers; Highly effective at driving productive meetings, staying on agenda and on time; Interest in learning about and owning the subject Domain.<p>PM me to apply.<p>Read more here: <a href=\"https:&#x2F;&#x2F;www.bamtechmedia.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bamtechmedia.com&#x2F;</a>","time":1519923288,"type":"comment"}