{"by":"mattbee","id":16494572,"parent":16492994,"text":"Bytemark | <a href=\"https:&#x2F;&#x2F;www.bytemark.co.uk&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bytemark.co.uk&#x2F;</a> | York, UK | Onsite&#x2F;Remote | Full-time | Platform Engineer | £32000-£40000<p>We&#x27;re looking for a Linux expert to maintain our cloud hosting systems and raise the bar for our internal deployment systems. You&#x27;ll be keen on measurement, monitoring and reliability, and want to be a creative member of a new &amp; growing team within our company.<p>You&#x27;ll be a Linux pro and use your expertise to maintain both our internal &amp; customer-facing systems and help bring our monitoring &amp; deployment infrastructure up-to-date. You&#x27;ll help an expanding team of engineers deploy software quicker and ensure our thousands of customers get the highest reliability for all their online services across Bytemark&#x27;s two UK data centres.<p>Your work here would depend on your skills and experience, but may include:<p>* working to break down risks and operational requirements;<p>* installing, configuring and reasoning about Linux, database and cluster systems;<p>* setting operational standards through documentation &amp; automation;<p>* analysing and replacing legacy monitoring and deployment systems (some going back 10 years);<p>* planning more ambitious redeployments and gathering requirements from engineers &amp; support staff.<p>If you&#x27;re keen to get involved in the new department of a growing company or bring modern system administration experience to a mature hosting company, we want you to apply.<p>More details &amp; application form: <a href=\"https:&#x2F;&#x2F;careers.bytemark.co.uk&#x2F;positions&#x2F;14\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.bytemark.co.uk&#x2F;positions&#x2F;14</a><p>More about our anonymous recruitment process: <a href=\"https:&#x2F;&#x2F;careers.bytemark.co.uk&#x2F;full-process\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.bytemark.co.uk&#x2F;full-process</a><p>ALSO:<p>We&#x27;re also looking for a Product Owner (£36000-42000), if you&#x27;re good at breaking down features for engineers and bringing stakeholders together.  It&#x27;s exciting to be the one prioritising all the features coming together for the cloud hosting platform but I&#x27;ve been doing it a few months and I&#x27;m ready to hire someone to take it off me :)  More details and application form here:<p><a href=\"https:&#x2F;&#x2F;careers.bytemark.co.uk&#x2F;positions&#x2F;15\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.bytemark.co.uk&#x2F;positions&#x2F;15</a><p>I&#x27;m Bytemark&#x27;s Managing Director, ask me anything!  (fwiw I&#x27;d be your manager for the Product Owner position, but not the Platform Engineer)","time":1519928273,"type":"comment"}