{"by":"neofyte","id":16494249,"parent":16492994,"text":"IDEO | Creative Technologist to Full-stack Developer | Palo Alto, CA | Onsite, Full Time<p>IDEO Palo Alto is in search of a Software Designer who will leverage an understanding of software to design and deliver innovative solutions that address core user needs. We count on Software Designers to inspire teams of the possibilities enabled by software, computing, and programmatic thinking, providing unorthodox ways to push design. They first-hand enact our mission of humanizing technology: starting from first principles to ask the right questions, of people, technology, and systems.<p>One or more below could be your focus areas:<p>- Physical&#x2F;Digital. You’re a Creative Technologist who works with software and hardware to create connected installations, experiences, and augmented objects. Your skills may include electrical engineering, micro-controllers, sensors, creative coding, or robotics.<p>- Emergent Interactions. You’re a pioneering Software-meets-Interaction Designer who works with emergent edge technology to explore new interactions at the frontier of what’s possible. You’ve dabbled, but have focus in a specialization ranging from computer vision, to chatbots, to augmented&#x2F;mixed reality, to blockchain.<p>- Digital Product. You’re a rare user-centered Engineer&#x2F;Designer&#x2F;Unicorn. You bring strong front-end skills with full stack potential to craft product, aligning user needs and client objectives. You understand web or device-native development, along with the iterative agile dev process, and how to position products for scale and impact. You have a secret crush on business design.<p>- Digital Immersion. You’re an Illusion Technologist, crafting intangibles like “feeling,” via code. You guide people across the uncanny valley by working with software to create immersive experiences, games, or interactive narratives. You can reach deep into the inner nature of physics and computer graphics, and apply that to 2D&#x2F;3D or VR, with tools like Unity.<p>- Computational Design. You’re a Generative Technologist. A pattern recognizer. A problem classifier. You works with algorithms or simulations to crack challenges that humans alone can’t compute. Your toolkit of tactics may include procedural design, machine learning, or neural networks.<p>As a Software Designer in Palo Alto, we provide the opportunity for you to: - Participate in the full design process, from talking with users to identifying potential opportunities, to delivering a great software product. - Solve problems in a broad set of domains, ranging from health, consumer technology, and mobility. - Explore and develop concepts with emerging technologies, such as new user interaction technologies, computer vision, or machine learning.<p>Want to know more about this role? Please visit <a href=\"https:&#x2F;&#x2F;www.ideo.com&#x2F;jobs&#x2F;software&#x2F;palo-alto&#x2F;974920&#x2F;software\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ideo.com&#x2F;jobs&#x2F;software&#x2F;palo-alto&#x2F;974920&#x2F;software</a>","time":1519926245,"type":"comment"}