{"by":"jconley","id":16493519,"parent":16492994,"text":"Redwood City, CA | Full time | ONSITE | <a href=\"http:&#x2F;&#x2F;brava.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;brava.com&#x2F;careers</a><p>Brava is stealth, so you won&#x27;t find much on us. We&#x27;re very close to launch. All candidates that come onsite for interviews will receive product demos. We are a team of about 65 people consisting of chefs, scientists, engineers, designers, and everything in-between. It&#x27;s certainly the most diverse set of skills on a product development team I&#x27;ve had the pleasure to work with.<p>We’re an IoT company focused on elevating and simplifying the in-home food experience. Our team consists of IoT and consumer hardware rockstars who have shipped products like the August Lock, Kindle and iPhone, as well as product, marketing and business trailblazers who have led multiple companies to high-profile exits.<p>We have an open and transparent culture, get shit done attitude, and free lunch. Oh, and random acts of kindness (food samples) throughout the day coming out of our test kitchen.<p>There are a number of openings. On the engineering side we have a need for:<p>Build and Release Engineer [0] - We&#x27;re already running a half dozen Jenkins slaves and nearly 100 jobs. We build a custom Linux system for our device, iOS, web, and various tools in-between. Work with all of our product teams to maintain a seamless build&#x2F;test&#x2F;release process.<p>Embedded Systems Support Engineer IoT [1] - We are ramping up our customer care and triage teams in preparation for launch. This role is an integral part of a team consisting of customer care professionals as well as electrical and software support engineers.<p>Software Engineer Mobile &#x2F; Full Stack [2] - Jack of all trades? Like to be involved in all aspects of a software product? We are looking for someone to join our mobile project that can also build the API&#x27;s they need on the back end. Our team is made up of all full-stack engineers that are highly flexible and work across a range of technologies.<p>And in marketing:<p>Growth Marketing Manager [3] - Be at the heart of our online marketing efforts. Work with the creative and product teams and own every step of our funnel. Run A&#x2F;B tests, ad tests, user segmentation, re-engagement&#x2F;re-marketing, and more.<p>Love food and tech? Any of this sound good? Ping me. jd+jobs@bravahome.com<p>Check out our careers page for more info.<p>[0] <a href=\"http:&#x2F;&#x2F;www.brava.com&#x2F;build-release-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;www.brava.com&#x2F;build-release-engineer</a><p>[1] <a href=\"http:&#x2F;&#x2F;www.brava.com&#x2F;embedded-systems-support-engineer-internet-of-things\" rel=\"nofollow\">http:&#x2F;&#x2F;www.brava.com&#x2F;embedded-systems-support-engineer-inter...</a><p>[2] <a href=\"http:&#x2F;&#x2F;www.brava.com&#x2F;software-engineer-mobile-full-stack\" rel=\"nofollow\">http:&#x2F;&#x2F;www.brava.com&#x2F;software-engineer-mobile-full-stack</a><p>[3] <a href=\"http:&#x2F;&#x2F;bravahome.com&#x2F;growth-marketing-manager&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;bravahome.com&#x2F;growth-marketing-manager&#x2F;</a>","time":1519922536,"type":"comment"}