{"by":"solresol","id":16499789,"kids":[16500117],"parent":16492994,"text":"Daisee (www.daisee.com) | Software Engineer, Devops, Data Scientists | Sydney, Australia or Melbourne, Australia | Full-time, ONSITE, no visa but vague chance of REMOTE for someone brilliant<p>Daisee makes software for call centre operators to transcribe calls, and then do various kinds of analysis on the call text (e.g. whether the caller was expecting a call back, general sentiment of the call, predictors of a successful or unsuccessful call). We also help call centres offload voice volume on to chat. We also do predictive modelling for demand (not just in call centres: retail as well).<p>We are a well-funded startup with a long runway to support our current 20 staff. We&#x27;re making large $$$$ sales into enterprises most weeks. We have mature management (two ex-googlers are on the management team, including the former Australian general manager; the rest of the executive team have held senior roles across the banks, successful startups and a variety of other major corporations). You get the stability and mature culture of a large corporate job, but the interesting work and dynamic environment of a startup.<p>We have a team of data scientists already; I&#x27;m looking to hire one more, preferably with skills in computer vision.<p>I am looking to hire around 3-5 software developers to take on various projects. There are existing projects in Python, but we are seriously considering switching to Go or Haskell for the bulk of future development. (If you are only interested in a Haskell role, or only interested in a Go role, just mention it in your resume.)<p>What I would like from a software developer is a lot of experience of working with data scientists and&#x2F;or some machine learning skills yourself. Having taken projects through to production and supporting them there is also valuable.<p>The call centre application is the most important one, so experience with NLP, Twilio and call centre software (e.g. Genesys) will get you to the top of the resume pile. On the other hand, if you are happen to have some knowledge around point-of-sale systems, forecasting, stock and warehousing systems and so on, that will get you to the top of the resume pile for the demand modelling part.<p>I also need some devops folks: in particular, we have a platform that helps speed data science projects through the cycle from jupyter notebook -&gt; software development -&gt; in production system; I&#x27;m looking to hire someone who can own that product and provide insight into what production problems could be avoided by baking things into code at an earlier stage in development.<p><a href=\"https:&#x2F;&#x2F;www.workable.com&#x2F;j&#x2F;2A144554F9\" rel=\"nofollow\">https:&#x2F;&#x2F;www.workable.com&#x2F;j&#x2F;2A144554F9</a>  or contact careers@daisee.com and mention that you saw this post on HN.","time":1519976034,"type":"comment"}