{"by":"energysavvy","id":16498137,"parent":16492994,"text":"EnergySavvy | Seattle | Full-Time | Onsite<p>EnergySavvy is a Seattle-based startup with the mission of reducing energy usage by helping utilities provide a smarter, more personalized customer experience. We&#x27;re looking for an operations engineer.<p>Who are you?<p>You have a strong understanding of cloud computing solutions. You are a strong engineer who thinks of infrastructure as code (or even better, as config). You love the idea of building immutable infrastructure and fault-tolerant systems. You think of servers as cattle, not pets. You know what cloud vendor goodies are worth using, while still keeping an eye towards avoiding vendor lock-in. While you understand the need for monitoring and alerting, you dream of building self-healing systems. You believe in collaboration, acting as a force multiplier, and making the right tradeoffs. And you have been looking for an opportunity to join a company where you can use your powers for good.<p>What would make you a good fit:<p><i>5+ years of experience as DevOps &#x2F; Site Reliability Engineer &#x2F; Operations Engineer using </i>Linux systems<p><i>Familiarity with building and managing AWS (EC2, EBS, S3, etc.) or another cloud provider<p></i>Familiarity with Docker and container orchestration technology like Kubernetes<p><i>Experience with monitoring and alerting systems<p></i>Experience running and managing persistent data stores like PostgreSQL and Elasticsearch<p><i>Experience with configuration management software such as Ansible<p></i>Strong collaboration skills—experience working directly on a team with software developers, and also working with product management, data science teams, etc.<p><i>Familiarity with trunk-based development and continuous delivery<p></i>Ability to secure Linux systems, stay on top of updates, and run penetration tests<p><i>Good at dealing with ambiguity<p></i>Experience with on-call rotation<p>If you are interested, please send your resume to christine@energysavvy.com.","time":1519954394,"type":"comment"}