{"by":"fabian_minodes","id":16493757,"parent":16492994,"text":"MiNODES (<a href=\"https:&#x2F;&#x2F;www.minodes.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.minodes.com&#x2F;</a>) | Berlin, Germany (ONSITE) | full-time | Visa | Data Scientists &amp; Software Engineers<p>MiNODES is a young high-growth technology business fundamentally transforming the way brick and mortar retailers engage with their customers. Headquartered in Berlin, we provide global retailers with innovative SaaS solutions on a mission to enhance the consumers&#x27; shopping experience and give brick and mortar retailers an edge over their online competitors in an increasingly digitized world. Our dynamic and ambitious team combines expertise from top players in retail, VCs, internet and tech startups. You will enjoy having high impact in a company with tremendous growth potential, giving you unparalleled opportunities for growing personally and professionally.<p>For MiNODES micro analytics, we have thousands of our sensors installed in our customers&#x27; retail stores around the world. For MiNODES macro analytics, we consume terabytes of anonymized mobile network events. Our tech stack consists of mainly Python and Scala (Spark) for data analysis and processing, and Cassandra and Postgres for data storage.<p>We work, learn and develop while having lots of fun on the way. We&#x27;re also happy to help with visa and relocation where necessary. We are looking for a wide range of people to join our team:<p>Data Scientist: <a href=\"https:&#x2F;&#x2F;minodes-jobs.personio.de&#x2F;job&#x2F;53552\" rel=\"nofollow\">https:&#x2F;&#x2F;minodes-jobs.personio.de&#x2F;job&#x2F;53552</a><p>(Junior) Machine Learning Engineer: <a href=\"https:&#x2F;&#x2F;minodes-jobs.personio.de&#x2F;job&#x2F;53549\" rel=\"nofollow\">https:&#x2F;&#x2F;minodes-jobs.personio.de&#x2F;job&#x2F;53549</a><p>Backend Developer: <a href=\"https:&#x2F;&#x2F;minodes-jobs.personio.de&#x2F;job&#x2F;6481\" rel=\"nofollow\">https:&#x2F;&#x2F;minodes-jobs.personio.de&#x2F;job&#x2F;6481</a><p>No recruiters please.","time":1519923740,"type":"comment"}