{"by":"mshahRCS","id":16499503,"parent":16492994,"text":"Royal Circuits | Full-Stack Dev | New York (NYC) &amp; Hollister, CA (Bay Area) | Full-Time | ONSITE | <a href=\"https:&#x2F;&#x2F;www.RoyalPCB.io\" rel=\"nofollow\">https:&#x2F;&#x2F;www.RoyalPCB.io</a><p>We&#x27;re a printed circuit board manufacturer that specializes in quick turn prototype orders. We&#x27;re one of Silicon Valley&#x27;s best kept secrets – we manufacture printed circuit boards (PCB’s) for thousands of customers nation-wide, including engineers at some of the world&#x27;s biggest tech companies.<p>We’re building up a team of engineers at our internal startup, dubbed “Factory of the Future”, to completely revolutionize the electronics manufacturing industry. We’re looking for a full-stack web developer to work on custom web-apps that enhance and streamline the PCB manufacturing process. You&#x27;ll be involved in developing tools that get orders through production as seamlessly as possible, with the opportunity to drive interesting projects involving automation, data visualization, and machine&#x2F;3rd party integration. These include developing 3rd party integrations for use with popular CAD and CAM packages, optimizing our factory processes to get real-time feedback to and from jobs on the floor, and offering real-time feedback on the manufacturability of a customer’s design the instant design files are uploaded.<p>Our stack is built around React, GraphQL, Python, Django, Postgres.<p>We&#x27;re happy to offer excellent benefits and competitive salaries, flex hours, and the opportunity to work remotely. Our main office is in Hollister, CA, just south of San Jose, and we&#x27;re working on building up this team in NYC.<p>I’m Director of Special Projects here at Royal, and a former electrical engineer at companies like Tesla and Taser. If you’re interested in joining our team and genuinely changing the electronics manufacturing industry, send your resume to me (Mihir) at jobs@royalcircuits.com and we’ll get back to you right away!","time":1519971316,"type":"comment"}