{"by":"Shatnerz","id":16493546,"parent":16492994,"text":"StreetShares | Software Engineer | Washington, DC (Reston, VA) | Full-time, onsite | <a href=\"https:&#x2F;&#x2F;streetshares.com\" rel=\"nofollow\">https:&#x2F;&#x2F;streetshares.com</a> | $80k-$125k and equity<p>The company: Streetshares is a veteran focused startup, striving to bring small businesses and investors together. We provide loans, lines of credit, and other financial products to small business owners while offering investors a chance to support like-minded businesses. The company was founded by two veterans of the US and South African air force.<p>The team: The engineering team is currently small (6 people) but diverse, including a US Marine Corps veteran and teammates with backgrounds in (building) architecture, communications, physics, music, and computer science. We even have someone from Wisconsin. We recently secured additional funding ($23 million, <a href=\"https:&#x2F;&#x2F;www.nasdaq.com&#x2F;article&#x2F;streetshares-a-small-business-loan-provider-for-military-veterans-is-ready-to-scale-cm923623\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nasdaq.com&#x2F;article&#x2F;streetshares-a-small-business...</a>) and are looking to greatly expand the team.<p>The position: We are seeking software engineers of all levels to contribute to the development of our online platform. You will work in a fast-paced environment and should expect to contribute significantly to the future of our system. The ideal candidate is comfortable being an intricate part of a small team, can engage across functional areas, and can deliver reliable, testable, and maintainable code. We are seeking both frontend and backend developers.<p>Contact: To apply, email me your resume at andrew@streetshares.com. Also, if you have any questions or concerns, feel free to email me as well. I won&#x27;t reply to generic emails, spam, or recruiters.<p>We are hiring a designer too, but I am less involved so you can apply at <a href=\"https:&#x2F;&#x2F;streetshares.workable.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;streetshares.workable.com&#x2F;</a> or <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;streetshares&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;streetshares&#x2F;</a>. It won&#x27;t hurt to mention HackerNews and maybe my name.","time":1519922680,"type":"comment"}