{"by":"blasdel","id":16494806,"kids":[16573846,16573850],"parent":16492994,"text":"Amazon Web Services (AWS) | Systems Development Engineer | Seattle, WA | Onsite, Relocation | Full-time<p>EC2 Foundational Technologies is the core of the cloud. We own operating systems, hypervisors, plus system integration and the launch and maintenance of compute platforms for all of EC2. We power innovation across Amazon and the tech world - from startups through the Fortune 500.<p>Join the team that brings it all together. Work on cutting edge hardware (before anyone else) with a team of industry leading hardware and software engineers across the full EC2 stack — firmware, hypervisor, operating system, data and control planes. If you have a passion for technology and innovation, join the team at the core of the cloud.<p>The software services have unprecedented scale and availability requirements. You will lead the software development of large-scale distributed software systems; in Go, Python and other languages using open source and Amazon proprietary technologies. This includes software applications dealing with configuration, modeling, workflows, large scale simulation, automation, fault tolerance, capacity planning, disaster recovery and prevention. You will also work on improving operations and managing the performance and availability of our large scale system.<p>--<p>We&#x27;re especially looking for what we call SysDEs and others might call SRE or DevOps, but we also have a team of more pure SDEs doing greenfield work.<p>We&#x27;re also looking for a Senior TPM (Technical Program Manager) who will be able to work with multiple internal and external partner teams to define and drive projects that span the entire life cycle of EC2 instances from inception to maintenance and retirement. The successful candidate must have exceptional customer focus, problem solving skills, strong business judgment, and demonstrated experience managing cross-functional teams — and exposure to cloud infrastructure services is strongly desired.<p>My email contact is my HN username @amazon.com","time":1519929704,"type":"comment"}