{"by":"bchhor","id":16497760,"parent":16492994,"text":"Oxeon | Product Designer, Sr Product Manager, Director of Business Strategy, and Executive Recruiting Associate | San Mateo, CA Onsite only | <a href=\"https:&#x2F;&#x2F;www.oxeonpartners.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.oxeonpartners.com</a><p>OXEON PARTNERS: Part venture capital, part management consulting, and part new company incubation, Oxeon builds and scales companies in healthcare. Oxeon conceives, designs and validates new business concepts to then create and launch new healthcare technology and services companies, either in partnership with a strategic partner (e.g. large health systems) or as an independent de novo company. Our team is small, moves quickly and works with our network of the nation’s leading healthcare executives to source innovative ideas, hone them into compelling new businesses. Example companies we&#x27;ve built&#x2F;scaled: Cityblock, Flatiron Health, Bright Health, Neurotrack, Empiric Health, Risalto, Genome Medical, Syapse, Cota, Omada Health, Landmark health, Quartet, and many more.<p>PRODUCT DESIGNER: Oxeon is looking for experienced hybrid product designers to help create beautiful and highly functional products for our clients and their users. As a product designer at Oxeon, you’ll be part of the entire project lifecycle from start to finish, for both new startups and established healthcare institutions. Expectations include contributions to all aspects of the design process including research, wireframing&#x2F;prototyping, and visual design.<p>SR PRODUCT MANAGER: Oxeon is looking for an innovative, entrepreneurial, and UX-focused product leader with a demonstrable pedigree of delivering business-impacting products built with best-in-class design. In this role, you will be part product lead, part entrepreneur-in-residence, and part management consultant - working alongside incredible cross-functional colleagues to build and scale companies across the healthcare landscape.<p>DIRECTOR, BUSINESS STRATEGY:  You will manage a small team through the validation and business plan process, presenting your findings with internal and external stakeholders, and then shaping the product and technology roadmap, driving the sale of anchor clients, fundraising, and early team build-out. As our startups begin to take shape, our you will be charged with owning all startup operations and early success.<p>ASSOCIATE, EXECUTIVE SEARCH: Oxeon’s Invested Search practice recruits the senior leadership teams to fast-growing, transformational companies in the healthcare industry. We work exclusively in healthcare technology and services, conducting over 100 searches per year across all key functional executive roles. Our partners range from de novo and early venture-backed through Private Equity growth stage as well as For Profit&#x2F;Public and Not For Profit companies.<p>Contact: hiring@oxeonpartners.com","time":1519950778,"type":"comment"}