{"by":"chrisburrc","id":16501575,"parent":16492994,"text":"Algrano | Ruby on Rails Full Stack Developer | Full-time | Remote<p>[Full job description here: <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2FL19G1\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2FL19G1</a>]<p>Play a part in the digital revolution of global coffee trading. Contribute to a product that allows coffee growers to sell their goods directly to roasters. Create applications to simplify logistic and increase transparency in the supply chain. This is a full-time remote position within a Central-European time zone. Head-office is in Zurich, Switzerland and multiple in-person-meetings per year are required.<p>YOUR TASKS: Contributing to the development of algrano platform and our operation system; Gathering and refining requirements and follow them through to production; Contributing to the direction of our technical environment and development processes; Rapidly iterating as we push ahead with new development while maintaining and improving the current systems<p>YOUR PROFILE: 3+ years of professional software development experience (with at least two years RoR)\nExperience with Javascript and CSS; A focus on details including automated tests and documenting your code; Experience in debugging, optimising web applications for speed and scale; An agile mindset and the ability to adapt to changing priorities and requirements; Pride in your work and a desire to contribute to a small team of dedicated and talented people; Solid communication skills in English and a sense of humor; An understanding of what we’re doing (and why) and a passion to get involved<p>WHO: algrano is a Swiss tech startup that changes the global trade of coffee. Using technology, algrano has set an ambitious goal to revolutionise the centuries old coffee trade industry and make it more transparent. Through the algrano online platform, coffee growers promote and sell their coffees straight to roasters in Europe. Awarded at its launch in 2015 as the best innovation by European Coffee Association, algrano counts more than 1’000 growers and roasters using algrano from all over the world.<p>To apply, please email christian@algrano.com with your CV and a Cover Letter.","time":1520001186,"type":"comment"}