{"by":"dantonelli","id":16502616,"parent":16492994,"text":"Adaptly is looking for experienced Clojure software engineers: awesome developers that have a passion for well-tested, clean code; and the energy and maturity to inspire a team and create amazing stuff.<p>Our in-house built systems are distributed and run at scale, and so efficiency and testing are incredibly important. We use a combination of Clojure and Ruby to run a large data processing and reporting infrastructure that integrates with multiple third-party APIs. Postgres and Redis are utilized as first level persistence and caching layers.<p>As a team, we like to try out new ideas and tools to discover the best solutions for our problem set. This means we’re using some of our language’s best tools, like core.async and transducers, in our production code. Looking for people ready to explore new frameworks or libraries that will help us solve the issues at hand.\nRoles &amp; Responsibilities:\nHands on design, development, and testing of ads management platform.\nTesting at the unit, functional, and integration level.\nWorking on legacy code as well as green field development.\nRequirements:\nStrong problem-solving and debugging skills.\n2+ years of relevant (Clojure) back-end development experience.\nDatabase query optimizations and database tuning\nFlexible and willing to do a broad variety of engineering tasks.\nExperience consuming APIs with a JVM language.\nUnderstanding of data structures, algorithms, multi-threading, functional and object-oriented programming and distributed systems.\nBonus Points:\nStrong experience with Java and experience performance tuning the JVM.\nExperience with parallelism&#x2F;concurrency\nExperience working with data-pipelines and big-data (Hadoop&#x2F;Spark)\nExperience with front end web development (HTML&#x2F;CSS&#x2F;JavaScript etc.)\nFor each new employee, we provide guidance, mentoring, encouragement to excel, and top-shelf equipment as well as QA and DevOps support. Our managers will provide you with valuable direction and, together with our team leads, will guide you in your work by delivering meaningful feedback at all points along the way.<p>You can expect to have direct responsibility for complex tasks and engage in research assignments. You will be working alongside motivated, driven, and smart professionals that recognize and appreciate smart work and personal initiative.<p>We offer a casual, team-oriented work environment, a comprehensive compensation package with short and long-term performance incentives, multiple benefit plans, the opportunity to participate in the firm’s many activities, and the chance to continuously grow and adapt in your career path.","time":1520006694,"type":"comment"}