{"by":"jrbapna","id":16503094,"parent":16492994,"text":"Trove Apps | Lead Developer | ATLANTA, GA OR REMOTE | North America timezone<p>We’re a small team building SaaS products across various platforms. Our team of 11 is distributed in North America, Europe, and Asia.<p>I’m the founder. I bootstrapped Trove to just under 1M ARR in 14 months. We’re positioned for solid growth over the next few years, and I’m looking for a highly skilled lead engineer who can take over all of our development efforts as well as allow me to focus on the other aspects of the business.<p>A couple of things I’m looking for in a candidate (in no particular order):<p><pre><code>    - the ability to multitask in a very fast paced environment.\n\n    - highly skilled on both the frontend and backend. our stack is React + Rails.\n\n    - solid fundamental understanding of how quality software is built, and best practices. \n\n    - an understanding of UI&#x2F;UX, and a keen “eye” for design.  this is difficult to gauge, but its very important that we’re on a similar wavelength.\n\n    - The ability to put development efforts in the context of business and customer needs. must be able to distinguish between what is “fun” and what’s “mission critical”. this is harder than it sounds.. emotions have a way of clouding judgement.\n\n    - Fast speed and a high level of output. you should be able to deliver at least 2-3x faster than most. I work extremely fast so I expect as much from our lead engineer. I value execution much more than perfection.\n</code></pre>\nSalary range: 90-120k USD with possibility of significant equity after 6 months. The equity offer will be significantly higher than those offered by VC funded startups or a comparable ARR company with our growth trajectory. I understand the key role you&#x27;ll play in our growth, and am looking for someone who will be in it for the long-haul.<p>If you’re interested, reach out via email: jrbapna@gmail.com.","time":1520009021,"type":"comment"}