{"by":"kcrossncc","id":16504128,"parent":16492994,"text":"NCC Group (formerly Matasano Security, iSEC Partners, and Intrepidus Group) - Atlanta, Austin, Boston, Chicago, Houston, New York, San Francisco, Seattle, and Sunnyvale, CA<p>They say March &quot;comes in like a lion, out like a lamb.&quot; I have no idea how that relates to job hunting, but since you&#x27;re here, you&#x27;re obviously well on your way already. Well done. Why not continue taking a few minutes out of your Ides of March, Pi Day, or St. Patrick&#x27;s Day and consider a role with NCC Group! Why NCC? Cutting-edge research, continuous learning &amp; training, and contributing on interesting client engagements. The elusive triple threat.<p>NCC Group is currently looking for passionate security minds to join our merry crew!<p>What do we do exactly? Penetration testing, security analysis, DFIR, and cutting-edge research into current technologies and attacks (breaking things). You spend most of your day thinking about security systems and how they can break. You get to be creative and have a lot of freedom to be clever while learning new technologies at a very fast pace. Engagements are usually 2-4 weeks long and in a year you will be exposed to 15-20 products and technology stacks. Your work will typically initiate person-months of security improvements in products millions of people use. You will have access to senior engineers&#x2F;architects and your findings&#x2F;ideas will be heard by senior decision makers. You will have enormous impact in making the software people use safer!<p>All of our consultants are also security researchers, with dedicated research time. Not too shabby!<p>We are looking to add new colleagues in all of our office locations, and are looking to add folks specifically in the Houston market should you have interest.<p>We are also seeking senior DFIR leaders and DFIR-focused Engagement Managers in our New York and Bay Area offices!<p>We are looking to add several members to our Risk Management &amp; Governance group, as well, all around the country.<p>If you want to learn more about us and our open positions check out our:<p>Blog - <a href=\"https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;blog&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;blog&#x2F;</a><p>Cryptopals - <a href=\"http:&#x2F;&#x2F;cryptopals.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;cryptopals.com&#x2F;</a><p>Microcorruption - <a href=\"http:&#x2F;&#x2F;microcorruption.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;microcorruption.com&#x2F;</a><p>If you&#x27;re ready to apply, contact us at: <a href=\"https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;about-us&#x2F;careers&#x2F;current-vacancies&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;about-us&#x2F;careers&#x2F;current-vacan...</a> or reach out directly at na-cv@nccgroup.trust.<p>We&#x27;d love to hear from you! Consider joining NCC Group!","time":1520014121,"type":"comment"}