{"by":"ramnes","id":16500230,"kids":[16506169,16524310],"parent":16492994,"text":"numberly | Software Engineer | Paris, France | FULL-TIME | VISA | ONSITE<p>At numberly, we help our customers collect, analyze and leverage their data across all marketing channels. To do this, we are more than 100 engineers (a quarter of numberly) divided into teams with a human dimension, where we make sure that each one develops a positive influence and can be autonomous. Our sustained growth pushes us to constantly challenge our technical and organizational choices.<p>Due to our wide range of interconnected products, our technical issues are very varied and often complex. Our daily missions are to process thousands of queries per second, distributed around the world, operate multiple petabytes databases (Big Data™), automate our entire bare-metal infrastructure, and build tomorrow&#x27;s digital marketing interfaces.<p>Our ideal candidate profile:<p>• Significant IT culture and technical curiosity<p>• Thorough knowledge in at least one back-end and&#x2F;or front-end stack<p>• Interest in databases, the world of open-source, and&#x2F;or DevOps culture<p>• Good communicator, able to popularize work, defend ideas but also listen to others<p>• Willingness to progress and to help others progress, technically (meetups, internal training) and humanly<p>• Good experience using Python and&#x2F;or Javascript is a plus<p>• Daily use of Linux is very preferable but not required<p>• Professional English (our teams are international)<p>Today, I&#x27;m particularly looking for a proficient Front-End Software Engineer to join my team and help us build our new projects on our new Vue.js stack, as well as moving our aging Angular interfaces to shiny Vue.js micro front-ends.<p>Feel free to reach me out for any question or application: ramnes@numberly.com &#x2F; ramnes (irc.freenode.net)<p>More informations on <a href=\"https:&#x2F;&#x2F;www.numberly.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.numberly.com</a><p>PS: we don&#x27;t do &quot;whiteboard&quot; interviews.","time":1519983812,"type":"comment"}