{"by":"RedBalloonSec","id":16525782,"parent":16492994,"text":"Red Balloon Security | New York, NY | Full time and Interns | Onsite | Visa welcome | redballoonsecurity.com<p>About Us:\nRed Balloon Security is a venture backed startup cyber security company headquartered in New York City. Our mission is to provide embedded device manufacturers with strong host-based firmware security. We believe all embedded devices require strong protections against malware and intrusions, and seek to provide these protections to our customers.<p>Our key markets include enterprise equipment, automotive, aviation, unified communications, SCADA, Internet-of-Things, network infrastructure and more. There is a vast universe of vulnerable embedded devices deployed around the world that need security.<p>We have created a means to inject our Symbiote host-based security technology onto any device, regardless of CPU type, regardless of functionality, regardless of operating system and without changing the performance and functionality of the device. We do not require access to customer source code, nor do we require manufacturers to change their product design to accommodate our security solution.<p>Red Balloon Security offers a full benefits package, 401k, a generous vacation policy, and paid health and dental plans. The company is located in Midtown West in New York City. We are an Equal Opportunity Employer of minorities, women, protected veterans, and individuals with disabilities.<p>Open Positions:<p>Security Researcher &#x2F; Security Software Engineer \nPython Engineer\nBusiness Intelligence Analyst\nSoftware Engineer in Test<p>Security Intern\nBusiness Intelligence Intern<p>More detailed job descriptions: <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;search&#x2F;?f_C=3243031\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;search&#x2F;?f_C=3243031</a>\nTo apply, email jobs@redballoonsecurity.com. Make sure to include what job you are looking for in the subject line!","time":1520294806,"type":"comment"}