{"by":"jwalkerSED","id":16530562,"parent":16492994,"text":"Applied Research Associates, Inc.| Software Engineers &amp; Developers | Raleigh, NC | onsite |<p>Applied Research Associates, Inc. is an employee-owned international research and engineering company recognized for providing technically superior solutions to complex and challenging problems in the physical sciences. We need help supporting our growing team of engineers and scientists. Here’s some background. Our company is growing very rapidly and we have a lot of projects that require someone with a very particular skill set and attitude. We are employee-owned and every single one of our employees is an asset! We also value our clients and the service we provide to them so we need someone who has an entrepreneurial spirit and a desire to take on very challenging and complex issues of national importance.<p>We are seeking a wide range of developers and engineers to support the various projects we work on and help the company grow. The positions are available in our Raleigh, NC office as well as many other offices like Fort Bragg, Langley, Virginia, etc.! Some of the opportunities available now include:<p><pre><code>    * Machine Learning A.I. Software Engineer\n    * Staff Engineer&#x2F;Scientist\n    * Software Engineer\n    * Software Developer\n    * Computer Vision Research Engineer\n    * Senior C++ Developer\n    * Weapons Effects Modeling &amp; Simulation Engineer\n    * C++ or Java Developer\n    * Enterprise Simulation Developer\n    * Algorithm Engineer\n    * Full Stack Web Developer\n</code></pre>\nTo learn more about who we are and how we change the world, please check out our website: <a href=\"http:&#x2F;&#x2F;www.ara.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ara.com</a><p>To apply please visit: <a href=\"https:&#x2F;&#x2F;recruiting.ultipro.com&#x2F;APP1010ARAI&#x2F;JobBoard&#x2F;07442cec-d18e-4589-ab15-8342edc29af7&#x2F;?q=&amp;o=postedDateDesc\" rel=\"nofollow\">https:&#x2F;&#x2F;recruiting.ultipro.com&#x2F;APP1010ARAI&#x2F;JobBoard&#x2F;07442cec...</a>","time":1520359000,"type":"comment"}