{"by":"bpicolo","id":16530000,"parent":16492994,"text":"Tegus | Lead Full Stack Engineer | Chicago, IL | onsite | $115k - 135k, .5%-2% equity | <a href=\"https:&#x2F;&#x2F;tegus.co\" rel=\"nofollow\">https:&#x2F;&#x2F;tegus.co</a><p>Tegus is fast-growing, funded startup building an investment information platform that improves investment decisions \nby connecting investors with the most relevant industry and category experts. We provide access to comprehensive company profiles built around a \ndatabase of expert-advisor call transcripts, enabling investors to intelligently search, highlight, comment, and share transcripts from customers, \nformer executives, competitors, partners, and more.<p>As an early lead engineering hire, you&#x27;ll have significant opportunity to influence\nproduct and architectural direction for a product with passionate (and paying!) customers, and \nplay a crucial role in other business processes (like hiring). (You&#x27;ll also likely avoid first name email envy!)<p>Current Stack: Rails, Vue&#x2F;Typescript, Postgres&#x2F;Redis, Gitlab, AWS (elastic beanstalk), + a sneaky java microservice<p>The ideal candidate:<p><pre><code>    * Revels in work up and down the stack - backend&#x2F;frontend with a minor in data and devops\n    * Considers security a second nature - familiar with e.g. OWASP and AWS security architecture (IAMs, VPCs, SGs...)\n    * Is experienced with a variety of modern development tools - MVC frameworks, JS frameworks, CI&#x2F;CD, RDBMS, you name it\n    * Has experience with search tooling (like ES)\n    * Has 4-5 years of industry experience, with prior experience in an engineering leadership position\n    * Enjoys mentoring other engineers in ways that the mentored engineers also tend to enjoy\n    * Loves to tinker with new technology, but insists on choosing the best tool for the job rather than the hippest tool\n    * Has an eye for design - can tell our homepage leaves something to be desired\n    * Looking to thrive in a fast-paced startup environment\n</code></pre>\nTo apply &#x2F; for more information email ben@&lt;ourdomain&gt; or see our job listing:\n<a href=\"https:&#x2F;&#x2F;angel.co&#x2F;tegus-1&#x2F;jobs&#x2F;250635-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;tegus-1&#x2F;jobs&#x2F;250635-software-engineer</a>","time":1520355099,"type":"comment"}