{"by":"sunjain","id":16541612,"parent":16492994,"text":"Core Digital | Play Vista, Los Angeles CA | Linux System Engineer | ONSITE\nCore Digital Media is a top 10 advertiser across display, paid search, mobile and social marketing. \nWe are looking for an experienced Systems Engineer to join our DevOps group. This person should have strong Linux background.<p>Responsibilities:\n- Administer server hardware, Linux operating system and selected system applications.\n- Serves as primary or secondary point of contact for various components of the Linux system.\n- Respond to any service outage that affects the availability of the production website.<p>Skills we are looking for\n- Installing, Configuring and Securing RHEL, Centos, Fedora<p>- Setting up IDS (host &amp;  network IDS, network IDS), Securing OS, Web Servers and Java containers<p>- Encryption&#x2F;Security Appliance Administration<p>- Ability to program in any language is must (Shell&#x2F;Python&#x2F;Perl&#x2F;Ruby)<p>- Setting up and supporting virtualization (cloning, DRS, HA)<p>- Big IP LTM, DNS BIND<p>- Automation experience (Puppet&#x2F;Ansible&#x2F;Chef ), configuration management experience and Git<p>- Knowledge&#x2F;experience of SSL certificate management<p>- 24&#x2F;7 on-call rotation experience<p>Nice to Have:\n- Setting up EC2, S3 and VPC on AWS manually and programmatically using Cloudformation&#x2F;Terraform<p>- Configuring and supporting Splunk for search and security<p>- Storage Administration experience with VNX, ZFS &amp; NFS<p>- Container Cluster setup and configuration (Docker&#x2F;Kunbernetes)<p>- Networking Experience (Setting up tunnels, firewall and router&#x2F;switches)<p>- Middleware experience with JBoss&#x2F;Wildfly, embedded server (Tocmat&#x2F;Jetty) architecture<p>Requirements:\n- Bachelor&#x27;s Degree in Computer Science or related field preferred.<p>If interested, please forward your updated resume to the hiring manager sjain@coredigital.com to get you setup for an interview. More info <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;coredigitalmedia&#x2F;8631e69c-172e-462f-83a9-236e18dd03d2\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;coredigitalmedia&#x2F;8631e69c-172e-462f-83...</a>","time":1520473475,"type":"comment"}