{"by":"dmarby","id":16583552,"parent":16492994,"text":"Mullvad | Gothenburg, Sweden | FULL-TIME | ONSITE or REMOTE | Backend Developer<p>Mullvad is a VPN service that helps keep internet users’ online activity, identity, and location private. We are a team fully dedicated to our goal - making internet censorship and surveillance ineffective.<p>We are looking for an experienced back-end developer to advance Mullvad’s back-end services, You will be part of a small team working together to improve existing services, as well as develop new ones.<p>Requirements<p><pre><code>    * You have a few years’ experience in developing, designing the architecture for, and deploying back-end services\n    * You are comfortable using the right tools for the job and open to learning new skills when necessary\n    * You have run and deployed services on Linux-based systems and know your way around a terminal\n    * You are fluent in English\n</code></pre>\nNice but not necessary<p><pre><code>    * experience with running services on bare-metal infrastructure is a bonus\n    * extensive experience in developing services in Python, Rust, or Go\n    * familiarity with using Qubes OS\n    * experience with Docker and Kubernetes\n    * experience in using configuration management such as Ansible or Saltstack\n    * interest in building systems with a heavy focus on security and privacy\n    * experience with low-level performance testing\n</code></pre>\nBenefits<p>We believe in having a life outside of work. That’s why we offer<p><pre><code>    * flexible working hours\n    * 25 days of annual paid vacation\n    * 300 EUR annually in allowance toward wellness-related activities (friskvårdsbidrag)\n    * the possibility of working remotely for extended periods of time</code></pre>\nWe also offer opportunities for growth. Aside from company-initiated opportunities for attending various national and international conferences, you will also have the option to attend one of your choosing per year. In addition, we’ll pay for any reading material that you feel contributes to your professional development.<p>If you’re interested in joining our team, send us an email at jobs@mullvad.net by 15 June 2018.<p>More information and job listings can be found at <a href=\"https:&#x2F;&#x2F;mullvad.net&#x2F;blog&#x2F;tag&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;mullvad.net&#x2F;blog&#x2F;tag&#x2F;jobs&#x2F;</a>","time":1521021988,"type":"comment"}