{"by":"musawirali","id":19058250,"parent":19055166,"text":"Jerry.AI (YC S&#x27;17) | Senior Software Engineers + Data Engineer | Toronto and Montreal | ONSITE &amp; REMOTE | Full Time | Canada Visa<p>Think insurance shopping is painful and time-consuming? We thought so too. That is why we&#x27;re building Jerry.AI to bring a modern user experience to a world that hasn&#x27;t seen much innovation since its inception. By leveraging technology and data, with a strong emphasis on user experience, we want to take insurance off your todo list. Starting with insurance, Jerry.AI aims to be your personal financial assistant who is constantly working in the background for your financial success.<p>We are looking for exceptional engineering talent to join our team in our offices in Canada or as a remote member. The ideal candidate will have strong CS fundamentals, intimate familiarity with the web development ecosystem, and a passion for producing stable, scalable and maintainable code.<p>We are backed by Y Combinator, SV Angel, Funders Club, and many other prominent Silicon Valley Investors. Jerry.AI is founded by serial entrepreneurs who previously built and scaled YourMechanic (&quot;Uber for car repair,&quot; the nation&#x27;s largest on-demand car repair site).<p>SW stack: Modern JS (ES6+), Node, GraphQL, React + React Native, AWS&#x2F;Kubernetes infra.\nData stack: Python, AWS Kinesis, AWS Glue ETL (PySpark), AWS Redshift, Metabase (BI).<p>On-site engineer &#x2F; developer positions (Toronto or Montreal): <a href=\"https:&#x2F;&#x2F;jerry.workable.com&#x2F;j&#x2F;089F60DE31\" rel=\"nofollow\">https:&#x2F;&#x2F;jerry.workable.com&#x2F;j&#x2F;089F60DE31</a><p>Remote engineer &#x2F; developer positions: <a href=\"https:&#x2F;&#x2F;jerry.workable.com&#x2F;j&#x2F;0B4F2938C1\" rel=\"nofollow\">https:&#x2F;&#x2F;jerry.workable.com&#x2F;j&#x2F;0B4F2938C1</a><p>On-site data engineer &#x2F; data science position: <a href=\"https:&#x2F;&#x2F;www.workable.com&#x2F;j&#x2F;4D5AD1B537\" rel=\"nofollow\">https:&#x2F;&#x2F;www.workable.com&#x2F;j&#x2F;4D5AD1B537</a>","time":1549053206,"type":"comment"}