{"by":"qth10","id":19056724,"parent":19055166,"text":"Thanx | SF, DEN, Remote | Principal Engineer | Full-time | <a href=\"https:&#x2F;&#x2F;www.thanx.com&#x2F;careers&#x2F;job&#x2F;1466586&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thanx.com&#x2F;careers&#x2F;job&#x2F;1466586&#x2F;</a><p>Americans spend more than $5 trillion on restaurants, retail, and services each year. Nearly 90% of those transactions happen in a real-world store. Data is king and online it powers personalized customer experiences and product recommendations. Offline, however, it’s still 1999. Brands are blind to their customers, causing them to spend more and more money on “megaphone” marketing with the same message to everyone. The result is an ever-increasing wave of generic spam that makes it hard for consumers to build deeper, data-driven relationships with their favorite brands. No wonder brick-and-mortar stores are being left behind.\nIn a nutshell, Thanx ingests data, provides insights, enables actions to drive growth in the business. As a platform, Thanx is a horizontally-scalable, reliable, high-throughput, low-latency system.\nThink of us as Salesforce meets Google Adwords for offline retail. Thanx is backed by some of the best investors in the world — Sequoia Capital, Icon Ventures, and Andy Rachleff (CEO Wealthfront, cofounder Benchmark Capital), to name a few.<p>Thanx Engineering\nYes, we have an app you can download. But that represents no more than 5% of our codebase. The power of Thanx is massively scalable data pipelines, microservices that power four 9s uptime, intelligent purchase normalization, and matching algorithms  — we don’t show that stuff off publicly.<p>Here’s more on who we are:\n • Team: early engineers at AWS, Cloudera, Climate, Zenefits, Okta. Experience from startups and successful product companies like Google, Facebook, Intuit, Disney. This is an elite Eng team, period.\n • Growth: 10x YOY data growth; $100M+ delivered to merchants; 200% team growth; modern, rapidly-evolving platform.\n • Tech: scalable, reliable, high-throughput, low-latency backend systems; beautiful, performant, responsive UIs; user-friendly mobile apps.\n • Culture: data-driven decision-making, risk-taking, no hierarchy, collaboration &amp; shared responsibility, testing, and continuous improvement. As a remote-friendly team, we have flexible work hours. We work and play hard. Be warned! when it comes to Mario Kart, we are super competitive!","time":1549044793,"type":"comment"}