{"by":"skrebbel","id":19058342,"parent":19055166,"text":"TalkJS (<a href=\"https:&#x2F;&#x2F;talkjs.com\" rel=\"nofollow\">https:&#x2F;&#x2F;talkjs.com</a>) | Eindhoven (the Netherlands) | REMOTE (Europe&#x2F;Africa only)<p>TalkJS is the chat platform for platforms. We help online marketplaces and communities build great user-to-user communication. Working at TalkJS is fun because you get to make software that is used by other software engineers and that significantly impacts the experience of the users of our customers. Currently we&#x27;re looking for:<p>SENIOR FULL-STACK DEVELOPER<p>Our product is directly used by other developers, so there&#x27;s deep API design work involved. We want to be faster at shipping new features and making existing features better, which is where you come in. Additionally, we&#x27;re facing some big scaling challenges. Because of all this, we&#x27;re looking for an experienced programmer who wants to help get TalkJS to the next level. Our stack consists of Elixir, PostgreSQL, React and TypeScript, but it&#x27;s acceptable if you don&#x27;t know all of these as long as you know many others.<p>We expect you to be fluent in at least 2 programming languages, and to have demonstrably deep experience with either Single-Page Web Applications, or relational databases, and at least some experience in both.<p>EXPERIENCED MOBILE DEVELOPER<p>We&#x27;re about to significantly up our game on iOS and Android. Developer productivity is a core selling point in our TalkJS, so we&#x27;re looking for someone who thinks they&#x27;d be good at designing the best mobile chat API ever made.<p>We expect you to have extensive experience on both iOS and Android, so that you&#x27;re able to not just build a usable SDK, but a <i>delightful</i> SDK on both platforms that meshes well with each platform&#x27;s idioms and conventions.<p>TECHNICAL SALESPERSON &#x2F; VP OF SALES<p>Demand for TalkJS is quickly increasing and we&#x27;re looking for help with (mostly inbound) sales. Our customers are entrepreneurs, product managers and engineers who ask highly technical questions. This means that some experience with software products is required. Ideally you can code a little bit.<p>You&#x27;re able to quickly build mutual trust, you&#x27;re great in (video) calls, and you never let a lead out of your sight. You&#x27;re able to formulate questions and answers to technical matters precisely and unambiguously so that our dev team can help you close deals. You love software products and you&#x27;d love to work with product people all day (both at TalkJS and at our customers).<p>We&#x27;re growing quickly and this is our first commercial hire. You&#x27;re interested and able build out and lead the sales team as the company grows.<p>ABOUT YOU<p>Our team is small and highly proactive, and we expect the same from you. If you need to be told what to do all the time, don&#x27;t apply. If you want to be the smartest person in a (chat) room full of interns, don&#x27;t apply. If you want to move fast with an experienced team, get in touch.<p>Apply by sending an email to hey@talkjs.com. (no recruiters or agencies please)","time":1549053607,"type":"comment"}