{"by":"JoeTrayio","id":19055268,"parent":19055166,"text":"Tray.io | London | System &#x2F; Backend &#x2F; JS &#x2F; Test Engineers | Full-time | Onsite | <a href=\"https:&#x2F;&#x2F;tray.io\" rel=\"nofollow\">https:&#x2F;&#x2F;tray.io</a><p>We&#x27;re creating a general purpose automation platform to open up the possibilities of serverless architecture, by allowing anyone, through our intuitive visual workflow builder, to connect their entire cloud stack. No dev resources required.<p>We’re a well-funded startup with a team in San Francisco and 30+ in our London Engineering HQ. Having increased our revenue by 4.5x in 2018 we’re growing fast and looking for top engineers to join our squad teams. We’re small and dynamic, open to new ideas and the work you do now will have a big impact on shaping how we grow, fine-tune our highly performant multi-billion transaction platform for years to come.<p>There’s an app out there for everything but most cloud software services are distinctively difficult to use together, and doing so is very labour intensive. With our cutting-edge platform, processes that took hours, or even days, can now happen in seconds.<p>Customers like Reddit, GitHub, Lyft &amp; IBM are already reinventing how they work through Tray. Help us usher in the era of automation.<p>Current open roles:<p>- Systems Software Engineer <a href=\"https:&#x2F;&#x2F;tray-io.workable.com&#x2F;j&#x2F;A989E2788E\" rel=\"nofollow\">https:&#x2F;&#x2F;tray-io.workable.com&#x2F;j&#x2F;A989E2788E</a><p>- Senior Backend Engineer <a href=\"https:&#x2F;&#x2F;tray-io.workable.com&#x2F;j&#x2F;50E49D5631\" rel=\"nofollow\">https:&#x2F;&#x2F;tray-io.workable.com&#x2F;j&#x2F;50E49D5631</a><p>- Junior Javascript Engineer <a href=\"https:&#x2F;&#x2F;tray-io.workable.com&#x2F;j&#x2F;ECA9DB9833\" rel=\"nofollow\">https:&#x2F;&#x2F;tray-io.workable.com&#x2F;j&#x2F;ECA9DB9833</a><p>- Test Engineer (SDET) <a href=\"https:&#x2F;&#x2F;tray-io.workable.com&#x2F;j&#x2F;B966DEFE9F\" rel=\"nofollow\">https:&#x2F;&#x2F;tray-io.workable.com&#x2F;j&#x2F;B966DEFE9F</a><p>Tech stack: Scala, Go, GraphQL, ReactJS, TypeScript, JavaScript, PostgreSQL, Redis, ElasticSearch, Cassandra, DynamoDB, AWS SQS, AWS Kinesis, Docker, Terraform, AWS Lambda, Serverless Framework, Jenkins, Grafana, Prometheus, AWS &amp; Linux.<p>Apply: <a href=\"https:&#x2F;&#x2F;tray.io&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;tray.io&#x2F;jobs</a> or get in touch with me: joe@tray.io","time":1549037316,"type":"comment"}