{"by":"59243","id":19056256,"parent":19055166,"text":"Expensify | Full-Stack, PHP, Java, C++, iOS, Android, and&#x2F;or Infrastructure Engineer | San Francisco, Portland, Michigan, London | REMOTE, VISA welcome | Full-time | we.are.expensify.com | $135K+<p>Expensify is the most widely used expense management system in the world, with millions of users and more customers than the rest of the industry combined, processing billions of real dollars annually. And this year, we&#x27;ve overdone ourselves, because as you might have heard, we&#x27;re doing a Super Bowl commercial. Crazy, right? That&#x27;s not even the best part. We&#x27;ve made the world&#x27;s first music video you can expense. Check out <a href=\"https:&#x2F;&#x2F;www.expensifythis.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.expensifythis.com</a> to enter the Expensify This contest and watch the full music video.<p>We have ~130 employees, are self-managed (no VC control), are extremely profitable, and are working to buy back all shares to become 100% employee owned, intending to create liquidity through internal buyback programs and eventual dividends. As an equal member of the team:<p><pre><code>  - Your voice will carry weight on day one.\n  - Your responsibilities will increase quickly and without limit, as there is virtually no formal management structure to constrain your growth.\n  - You will work on every part of the codebase, without being constrained to any team, layer, or platform.\n  - You will receive a fair, proactive raise bi-annually, without you needing to ask.  \n  - You will have the option (not required) to travel with the team domestically and internationally multiple times a year -- spouses and kids welcome (and paid for).  \n  - You will be provided the best equipment, a personal mentor committed to your success, tools to encourage a healthy work&#x2F;life balance, and a workplace that is safe, respectful, collaborative, and inspiring.\n  - You will be truly welcome regardless of age, race, gender, orientation, or other affiliation.\n</code></pre>\nSome of the cool things we&#x27;re working on:<p><pre><code>  - Concierge, a “supervised learning” AI-powered customer support platform\n  - BedrockDB.com, an open-source, blockchain-based SQL database atop SQLite\n  - SmartScan, an OCR&#x2F;human receipt transcription service\n  - Next day ACH processing many millions of dollars daily\n  - Scaling realtime search across 30 days (16TB) of system logs\n  - Cutting edge web&#x2F;mobile technologies and so much more!\n</code></pre>\nWe are very proud of the team we have built, and would love to have you join our large extended family around the world.  We are happy to sponsor visas and greencards as needed.  All we ask in return is that you get shit done, without ruining it for everyone else: <a href=\"https:&#x2F;&#x2F;blog.expensify.com&#x2F;2016&#x2F;06&#x2F;03&#x2F;rule-1-get-shit-done&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.expensify.com&#x2F;2016&#x2F;06&#x2F;03&#x2F;rule-1-get-shit-done&#x2F;</a>  To apply, just email answers to the following questions to jobs@expensify.com (no resume needed):<p><pre><code>  [1] What&#x27;s the URL of your website? If you don&#x27;t have one, why not?\n  [2] Tell us about what it is you do (programming, systems engineering, sales, etc.), when you started, and what you&#x27;ve done between then and now.\n  [3] What do you want to do with the rest of your life, and how is Expensify a step toward your long-term goals?\n  [4] How did you hear about us? A job posting? Chalk on a sidewalk? From a friend? Let us know where you saw this opening.\n</code></pre>\nPlease visit <a href=\"https:&#x2F;&#x2F;we.are.expensify.com\" rel=\"nofollow\">https:&#x2F;&#x2F;we.are.expensify.com</a>, and we can’t wait to meet you soon!","time":1549042431,"type":"comment"}