{"by":"jdleesmiller","id":19057398,"parent":19055166,"text":"Overleaf (<a href=\"https:&#x2F;&#x2F;www.overleaf.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.overleaf.com</a>) | REMOTE | Product Manager, Engineering Manager + more<p>Overleaf builds modern collaborative authoring tools for scientists — like Google Docs for Science. We have over three million registered users from around the world. Our primary product is an online, real time collaborative editor for papers, theses, technical reports and other documents written in the LaTeX markup language.<p>1. Product Manager: We&#x27;re looking for a product owner who is passionate about science and academic writing, as well as building great products. You&#x27;ll represent our authors in the engineering team, work with our UX team to develop and test product hypotheses, and work on setting and communicating our product roadmap. Please apply via <a href=\"https:&#x2F;&#x2F;overleaf.workable.com&#x2F;j&#x2F;24F061DCBF\" rel=\"nofollow\">https:&#x2F;&#x2F;overleaf.workable.com&#x2F;j&#x2F;24F061DCBF</a>.<p>2. Engineering Manager: We&#x27;re looking for an experienced engineering manager to join our 17-strong engineering team. You&#x27;ll shape development process, career and professional development, internal communications and technical direction for a talented and dedicated team as we continue to grow. Please apply via <a href=\"https:&#x2F;&#x2F;overleaf.workable.com&#x2F;j&#x2F;BAEE877503\" rel=\"nofollow\">https:&#x2F;&#x2F;overleaf.workable.com&#x2F;j&#x2F;BAEE877503</a>.<p>Some reasons you&#x27;d enjoy working with us:<p>- Around 80% of our codebase is open-source and we’re big fans of Free Software.<p>- Remote is a first class citizen, all founders and employees work remotely. We get everyone together in London every few months for valuable face to face time.<p>- Working hours can be flexible to your needs. Core hours 2pm-5pm UK time.<p>- We’re agile (with a lowercase a). We test thoroughly (unit and acceptance), we have a CI build process, a full staging environment to play with, and we automate as much as possible.<p>We&#x27;re also hiring a Marketing Director and multiple Sales Managers. Please see <a href=\"https:&#x2F;&#x2F;www.overleaf.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.overleaf.com&#x2F;jobs</a> for more information and how to apply.","time":1549048286,"type":"comment"}