{"by":"gambitresearch","id":19055255,"parent":19055166,"text":"Gambit Research Ltd (<a href=\"http:&#x2F;&#x2F;gambitresearch.com\" rel=\"nofollow\">http:&#x2F;&#x2F;gambitresearch.com</a>) | London, UK | ONSITE | £40-85k + Bonus + Benefits + Totally Flexible Working Hours + Personal Training Budget<p>At Gambit Research we specialise in creating and managing an automated betting service, via research, statistical analysis and the use of complex algorithms. We ingest and organise terabytes of market and event data from more than fifty sources and make the data available to our strategy teams via internal APIs. We care deeply about speed, accuracy and availability.<p>Our flagship product, MollyBet, presents the odds offered by many of the world’s largest bookmakers and betting exchanges, and enables clients to bet with multiple operators with a single mouse-click or API request. Molly is generally regarded as the best product in its class.<p>We’re always looking for clever, pragmatic, and autonomous individuals to join our team - individuals like you. We have a unique culture, where hierarchy and fancy job titles don’t matter. Instead our team is given the freedom to choose their own tools, work on projects they actually find interesting, and have totally flexible working hours. The technologies our team typically works with includes: Python, Erlang, JavaScript and C++.  We also use Linux, Docker, Kubernetes, Ansible, C, Java, Haskell, Julia, Go, ReactJS, Django, PostgreSQL, Redis, Apache Spark, Apache Kafka, RabbitMQ, Celery, Elasticsearch, Logstash, Kibana, Graphite, Sentry, Git, and GitLab.<p>We’re currently recruiting for:<p>- Python developers (all levels)<p>- Erlang developers<p>- JavaScript React developers<p>- Linux infrastructure engineer &#x2F; Sysadmin &#x2F; SRE &#x2F; DevOps engineer<p>- Junior Product Analyst<p>If you&#x27;re interested, pop your CV over to us at careers@gambitresearch.com, or have a go at our online challenge: <a href=\"https:&#x2F;&#x2F;www.gambitresearch.com&#x2F;quiz&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gambitresearch.com&#x2F;quiz&#x2F;</a>","time":1549037259,"type":"comment"}