{"by":"gsa_jobs","id":19055544,"parent":19055166,"text":"Gower St Analytics | Senior Software Engineer, Data Scientist, Business Development Co-Ordinator | London, UK | REMOTE (UK Applicants only)<p>Gower Street Analytics is a well-funded growing startup doing predictive analytics and data science in the movie business. We have contracts with major movie studios that are household names, and we’ve just closed a Series A level funding round.<p>Our stack includes: Clojure, ClojureScript, Python, R, JavaScript, Postgres, CouchDB, Docker, RabbitMQ, AWS, Terraform<p>These are 100% remote positions based anywhere in the UK, but you’re welcome to work from the London office part of the time should you choose to. We spend a lot of time pairing remotely using tmux, and are big on coaching and collaboration in general.<p>In return you&#x27;ll get:<p>- Over London market salaries for on-site roles, even though we’re fully remote. We also contribute 2% of your salary to a pension.<p>- Knowledge about exactly how your salary is calculated through our transparent compensation ladder, and what you need to do to progress.<p>- Choose your own working environment - you aren’t forced to work in a noisy open plan office.<p>- Go to one “big” and one “small” technical conference each year. There will also be opportunities to go to film industry conferences from time to time, in places like Barcelona, Las Vegas, Miami and Hong Kong.<p>- Get Wednesday afternoons to work on self-directed projects, individually or in groups, with the aim of personal improvement and innovation of new products.<p>For full job descriptions check out :<p><a href=\"https:&#x2F;&#x2F;gower.st&#x2F;blog&#x2F;2018&#x2F;we-are-hiring-senior-developers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;gower.st&#x2F;blog&#x2F;2018&#x2F;we-are-hiring-senior-developers&#x2F;</a><p><a href=\"https:&#x2F;&#x2F;gower.st&#x2F;blog&#x2F;2018&#x2F;we-are-hiring-data-scientists&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;gower.st&#x2F;blog&#x2F;2018&#x2F;we-are-hiring-data-scientists&#x2F;</a><p><a href=\"https:&#x2F;&#x2F;gower.st&#x2F;blog&#x2F;2019&#x2F;we-are-hiring-a-business-development-co-ordinator&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;gower.st&#x2F;blog&#x2F;2019&#x2F;we-are-hiring-a-business-developm...</a><p>Or to apply send your CV and a cover letter to techjobs+hn@gower.st","time":1549038739,"type":"comment"}