{"by":"lgas","id":19058193,"parent":19055166,"text":"Interos Solutions, Inc. | Full Stack Sr. Software Engineer (Haskell) | Full-Time | ONSITE | Arlington, VA<p>Interos Solutions, Inc. is a fast-growing venture backed company with an AI-driven SaaS application that delivers our commercial and government customers unique insight into their ever-changing business ecosystems.  The core of our platform is the compilation, analysis and visualization of dynamically changing big data collected across open source, proprietary and public data sources.  By continuously analyzing our “real-time” data stream we provide our customers with unique insights into their business relations, supply chains and other third-party activities.  To accelerate the growth of our application, we are putting together a team of Haskell engineers, data analysts, data scientists, UI&#x2F;UX professionals and product managers.  We are committed to building a world class product organization that leverages tools like Haskell and latest machine learning techniques to achieve outsized results as individuals and as a team.<p>We have offices in Arlington, VA and Menlo Park, CA.<p>Summary<p>You will design, code, implement and maintain both front-end and back-end technologies. As one of our first Full-stack Engineers, you will have room to shape your work and have an outsized impact on our product and our culture. You will work across our tech stack to develop our enterprise-grade application, help institute effective processes for ensuring our products have quality code and minimal defects, collaborate with our VP of engineering, founder and our customers on product features, and more. We&#x27;re looking for engineers who relish solving the hard-technical and analytics challenges and diving into the subtle details that make products amazing.  Being part of and leading an innovative engineering team, you&#x27;ll need solid hands-on experience in Haskell as well as web technologies (HTML&#x2F;CSS&#x2F;JS, REST, JSON&#x2F;XML) and databases (Relational and NoSQL).  Experience with machine learning, big data and cloud infrastructure are a plus.<p>I&#x27;m having trouble fitting our ad into the size of a HN comment but you can see the rest of the details (and apply!) here: <a href=\"https:&#x2F;&#x2F;interos.applicantpro.com&#x2F;jobs&#x2F;986650-306376.html\" rel=\"nofollow\">https:&#x2F;&#x2F;interos.applicantpro.com&#x2F;jobs&#x2F;986650-306376.html</a>","time":1549052899,"type":"comment"}