{"by":"mebassett","id":19057272,"parent":19055166,"text":"Proda | Senior Full stack engineers | London | Full-time | ONSITE | 50-85k + equity doe.<p>Proda is an investor-backed, data-mining startup for the commercial real estate industry; we&#x27;re making data entry jobs less painful. Our clients have been beta testing our application and the feedback&#x27;s been incredible: <a href=\"https:&#x2F;&#x2F;bdaily.co.uk&#x2F;articles&#x2F;2018&#x2F;11&#x2F;01&#x2F;proptech-startup-pa...\" rel=\"nofollow\">https:&#x2F;&#x2F;bdaily.co.uk&#x2F;articles&#x2F;2018&#x2F;11&#x2F;01&#x2F;proptech-startup-pa...</a>.<p>What about the team? We have a high emphasis on continual learning. If you&#x27;re not learning something new on the job its time for a new one. Our tech stack reflects this; Haskell and Elm are the main languages. We don&#x27;t mind if its your first exposure to either. We&#x27;re not afraid of experimenting or making mistakes. The most important quality of anyone on our team is their ability to learn and teach. Our sales pipeline is miles ahead of our development and we&#x27;re looking to grow the team to deliver more feature our customers. Since we&#x27;re still young, working with us means you have a lot of influence in shaping the culture and direction of the company. You&#x27;ll also a chance to grow your skill set faster than somewhere else.<p>What about The product? We&#x27;re building a data mining tool that can explicitly learn a relational data model based on sample inputs. It radically improves data entry and data cleaning for financial analysts. Customers have loved our demos and we&#x27;re understandably coy in our public descriptions.<p>This is for someone who:<p>* is comfortable in functional programming, especially Haskell &amp; Elm; and * is experienced shipping complex web software to production; and * has an eagerness to learn and willingness to share knowledge.<p>A Typical Day looks like:<p>* Start off writing a feature that requires elm-ports. These can be tricky, so you pair with another developer who has shipped such code before.<p>* After lunch you&#x27;re requested to review a Pull Request that fixes a bug you accidentally introduced a couple weeks back. There&#x27;s no blame, instead some discussion about how our tests and review process could have caught this earlier.<p>* The afternoon is spent with the Product guys around a whiteboard. You&#x27;re helping them sketch out architecture for a complex new data-auditing feature that we&#x27;ll need to deliver a couple of sprints down the line.<p>We&#x27;re far more interested in your capacity to learn then the arcana of specific tech tools, but our platform is largely composed of:<p><pre><code>  - Haskell\n  - Elm\n  - PostgreSQL\n  - Python &#x2F; scikit-learn\n  - AWS\n  - Automated Testing and CI&#x2F;CD.\n  \n</code></pre>\nContact us at <a href=\"https:&#x2F;&#x2F;proda.ai\" rel=\"nofollow\">https:&#x2F;&#x2F;proda.ai</a> or check my profile","time":1549047572,"type":"comment"}