{"by":"smadenian","id":19058499,"parent":19055166,"text":"Albert | NLP&#x2F;Data Science | Full Time | On-Site: Culver City (Los Angeles)<p>Albert is a new type of financial service that uses powerful technology to automate your finances, with a team of human experts to guide you. Our geniuses find savings you&#x27;re missing, identify bills you&#x27;re overpaying, help you pay down debt faster, save automatically for you, and much more. Text Albert a financial question, and we&#x27;ll not only offer guidance but help you make it happen.<p>We&#x27;re pushing the edge of the field: using a proprietary data set to transform the way people understand and make financial decisions. You&#x27;ll experiment with and optimize our framework for the algorithms we use, and then help put those things into production. You&#x27;ll work with machine learning techniques and a variety of natural language processing methods and systems. You&#x27;ll rocket everything forward: from our dynamic NLP chatbots to our classification engine that powers our support software.<p>Areas of expertise:\n* Data: Tackling the challenges of collecting and understanding unstructured data, like conversations.\n* Automation: You are inclined to automate everything.\n* Shipping: Delivering great products that you&#x27;re proud of on a regular basis.\n* Collaboration: We bring the best out of each other. We&#x27;re looking for people who will bring the best out of all of us.<p>Keywords: AI, NLP, Machine Learning, Python<p>Link to position: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;meetalbert&#x2F;9cc2f8b6-5fe5-42f2-91c4-96ae47c9891b\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;meetalbert&#x2F;9cc2f8b6-5fe5-42f2-91c4-96a...</a><p>All available positions found at: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;meetalbert&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;meetalbert&#x2F;</a><p>Other roles: Senior Backend Engineer (Python&#x2F;Django), iOS Engineer (swift), Android Engineer (Kotlin), Senior Front End Engineer (React)","time":1549054556,"type":"comment"}