{"by":"maxnov","id":19055237,"parent":19055166,"text":"Lateral | Berlin, Germany | Onsite | Full-time | <a href=\"https:&#x2F;&#x2F;lateral.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;lateral.io&#x2F;</a><p>Lateral builds tools to help large companies find the information they need. We provide a modular machine learning platform that can be adapted to a variety of workflows, ranging from finding matching documents in the construction sector to drafting business proposals based on prior work. We have a real focus on UX and design and strive to create the best experience for the users of our tools.<p>DevOps Engineer | You would be working to package and ship our code in a repeatable maintainable way. You would also maintain and optimise our infrastructure (running on Google Cloud) and our CI&#x2F;build server workflows. You would have a key role in decisions made and an influence over our strategy.\nMore: <a href=\"http:&#x2F;&#x2F;de.indeed.com&#x2F;job&#x2F;devops-engineer-fc6d9138f520f3c9\" rel=\"nofollow\">http:&#x2F;&#x2F;de.indeed.com&#x2F;job&#x2F;devops-engineer-fc6d9138f520f3c9</a><p>Senior Software Engineer | You would be able to start with a project specification, plan out a solution and co-ordinate a small team to build it out to production. You would have influence to decide the outlook of our development process. You would be managing other developers and using your expertise to design sensible and efficient applications that are delivered on time.\nMore: <a href=\"http:&#x2F;&#x2F;de.indeed.com&#x2F;job&#x2F;senior-software-engineer-44e62709bc6defcc\" rel=\"nofollow\">http:&#x2F;&#x2F;de.indeed.com&#x2F;job&#x2F;senior-software-engineer-44e62709bc...</a><p>Front-end Engineer | Work with back-end developers and the UX&#x2F;Design department in order to take a design and turn it into a functioning web-application. Ideally you can work with or without frameworks and can keep up to speed with the rapidly evolving world of front-end dev and tooling. 4+ years experience.\nMore: <a href=\"https:&#x2F;&#x2F;de.indeed.com&#x2F;Job&#x2F;front-end-engineer-d664586c15f67885\" rel=\"nofollow\">https:&#x2F;&#x2F;de.indeed.com&#x2F;Job&#x2F;front-end-engineer-d664586c15f6788...</a><p>We offer competitive pay, a great atmosphere, autonomy and responsibility, work in the heart of Berlin, help with relocation.<p>Lateral is committed to creating a diverse environment and would encourage people from all backgrounds to apply for this role.<p>We look forward to hearing from you :) Just send me an email: max[at]lateral.io","time":1549037184,"type":"comment"}