{"by":"mkong1","id":19056589,"parent":19055166,"text":"GiveCampus (YC S15) | full stack (Rails) and front-end (React) engineers, product managers | Full Time | DC, SF | On-site | <a href=\"https:&#x2F;&#x2F;www.givecampus.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.givecampus.com&#x2F;careers</a><p>GiveCampus builds fundraising software for colleges, universities, and K-12 schools. The company is 4 years old, profitable, and serves more than 600 schools, including 30 of the Top 50-ranked colleges in the United States. We&#x27;re backed by Y Combinator and YC&#x27;s CEO listed us among the 20 YC companies that he expects to be a household name by 2020 (<a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=13896296\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=13896296</a>). You can read a bit more about what we do in The Washington Post (<a href=\"https:&#x2F;&#x2F;www.washingtonpost.com&#x2F;news&#x2F;grade-point&#x2F;wp&#x2F;2016&#x2F;04&#x2F;19&#x2F;colleges-are-going-online-to-crowdsource-donations-and-theyre-raising-millions\" rel=\"nofollow\">https:&#x2F;&#x2F;www.washingtonpost.com&#x2F;news&#x2F;grade-point&#x2F;wp&#x2F;2016&#x2F;04&#x2F;1...</a>).<p>For engineering, we&#x27;re looking for both full-stack (Ruby on Rails, Postgres) and front-end engineers with at least 2 years of professional experience. Our current team was previously with Facebook, Amazon, and Intel. We&#x27;re looking for people who like having ownership of the product, and can own the process from idea to development to deployment and maintenance.<p>For product, we&#x27;re looking for someone to drive innovation and execute product initiatives across the company, working closely with the CTO and engineering team. We want someone who will take ownership over the ideation, technical development, launch, and measurement of success.<p>We&#x27;re still a small team, so if you&#x27;re looking to join a fast-growing startup and have an immediate impact, please reach out to careers@givecampus.com with a bit about why you&#x27;re passionate about education, and a project you&#x27;ve working on that you&#x27;re particularly proud of.","time":1549044085,"type":"comment"}