{"by":"mechpaul","id":19056342,"parent":19055166,"text":"Company - Microsoft<p>Position - Security Researchers (more on reverse engineering than development) and Security Engineers (more development than reverse engineering)<p>Location - Redmond, WA<p>Positions - <a href=\"https:&#x2F;&#x2F;careers.microsoft.com&#x2F;us&#x2F;en&#x2F;search-results?rt=professional&amp;keywords=%23WDATPEPPRes\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.microsoft.com&#x2F;us&#x2F;en&#x2F;search-results?rt=profes...</a><p>We are the Windows Defender Team and we have many open positions for you to apply to.<p>INTRODUCTION:\nAre you interested in radically improving the computer security? Do you want to work on cutting edge malware analysis systems? Are you committed to helping Microsoft customers keep their computer’s secure and combating evolving malware threats? We are searching for a strong self-driven Security Researcher for Mac OS Security Research Team. Our Research team is a global team of antimalware researchers, advanced threat hunters, and agile malware responders at the forefront of protecting Microsoft customers from computer security threats. We are an industry leading threat research lab that responds to customer issues with malware and use cutting edge antimalware techniques to help keep our customers safe. If you are a technically strong antimalware researcher who is passionate about having huge impact in the security industry, we would love to talk to you!<p><i></i>We accept junior candidates, so please do not let the titles or years of experience requirement dissuade you.<i></i> Send us your resume anyway.<p>If you have ANY of the following skills, we&#x27;d like to talk to you. Again, not looking for all skills in one candidate - any of them!<p>- Development skills with C, C++, C#, and scripting languages (PowerShell, Python)<p>- BS in Computer Science or equivalent<p>- Experience with automatic classification and clustering solutions<p>- Mac OS operating system internals<p>- Mac development skills<p>- Familiarity with debuggers, disassemblers, network protocols, file formats, sandboxes, hardware&#x2F;firmware internals<p>- Proficiency with SQL, big data and machine learning, and statistical algorithms<p>How to apply? - Contact me directly with your CV - paambros@microsoft.com . Please mention HN in your subject line.<p>Citizenship&#x2F;visa&#x2F;security clearance? - No security clearance required.<p>ONSITE","time":1549042916,"type":"comment"}