{"by":"icey","id":19058815,"parent":19055166,"text":"Instabase | Machine Learning Engineer | San Francisco, NYC, Boston, Bangalore | on-site | full-time<p>Founded in 2015, Instabase is a cross-cloud operating system with a powerful suite of data processing applications.  We have taken $23M Series A funding from Andreessen Horowitz, Greylock, and NEA, and we have strong customer and revenue growth. Instabase is used in universities (Stanford, Columbia) and large financial institutions in Asia and the US, both as a platform for collaboration and a tool to automate human-intensive workflows. We&#x27;re an engineering driven company, scaling rapidly driven by customer demand.<p>We take the latest techniques from research labs around the world, evaluate them against each other, and adapt them into products for use in industry. Living at at that edge of research and production is the “secret ingredient” that powers many of our capabilities as a platform.<p>We are hiring engineers across our stack. We look for people who have a bias toward action, who enjoy finding patterns amid chaos, and who are capable of driving a project from whiteboard sketches to completion.<p>Specific roles we&#x27;d love to talk to you about:<p>- Frontend Engineer - Machine Intelligence Apps (<a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;b742155c2\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;b742155c2</a>)<p>- Software Engineer  (<a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;6e1a9d042\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;6e1a9d042</a>)<p>- Software Engineer - Computer Vision (<a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;41981d182\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;41981d182</a>)<p>- Software Engineer - Natural Language Processing (NLP)  (<a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;afdd0a1d2\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;afdd0a1d2</a>)<p>- SRE &#x2F; DevOps Engineer (<a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;2638298a2\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;2638298a2</a>)<p>You can contact us directly at careers@instabase.com, or you&#x27;re welcome to reach out to me privately to answer any questions (my email is in my profile)","time":1549056443,"type":"comment"}