{"by":"justacodefan","id":19067385,"parent":19055166,"text":"Betterment | <a href=\"https:&#x2F;&#x2F;betterment.com\" rel=\"nofollow\">https:&#x2F;&#x2F;betterment.com</a> | New York, NY | Onsite (NYC or Philadelphia) or REMOTE (US based and for &gt;= senior roles only at this time)<p>Our mission is to empower people to do what’s best for their money. We built Betterment, and are continuing to better it, because we want to help our customers live better and spend their time doing what makes them happy.<p>We’re here to disrupt finance in a big way. The people who already know how to do that don’t exist. We’re hiring for learners and adapters—people who can help us make financial services the way it ought to be.<p>We&#x27;re a fiduciary, which means we act in your best interests. We&#x27;re not incentivized to recommend certain funds, and we don&#x27;t have our own investment products to sell. That means we&#x27;ll do what we believe is right for you, always.<p>Recommended reading to have a good understanding of us as a company, what we do, how and what we value:<p><a href=\"https:&#x2F;&#x2F;www.betterment.com&#x2F;TheBettermentWay\" rel=\"nofollow\">https:&#x2F;&#x2F;www.betterment.com&#x2F;TheBettermentWay</a><p><a href=\"https:&#x2F;&#x2F;www.betterment.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.betterment.com&#x2F;careers&#x2F;</a><p>Looking to fill various roles:<p>- Staff Software Engineer - Front End<p>- Software Engineer - Backend, Full Stack<p>- Lead Mobile Software Engineer - Android, iOS<p>- Mobile Software Engineer - Android, iOS<p>- Software Engineer - Site Reliability<p>- Product Manager - Mobile Customer Experience<p>- Senior Product Manager - Customer Experience<p>We use Ruby on Rails, Java 8 (11 coming soon :), Scala, Python, Golang, AWS, Kubernetes and whatever else we deem fit for the problem we&#x27;re solving. The engineering org deeply values mentorship, learning and cross team initiatives.<p>Please reach out to me directly at andre@betterment.com or apply directly at <a href=\"https:&#x2F;&#x2F;www.betterment.com&#x2F;careers&#x2F;current-openings&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.betterment.com&#x2F;careers&#x2F;current-openings&#x2F;</a> (please mention HN Feb 2019).<p>Happy to answer any questions via email, I will respond to every one of you.","time":1549160586,"type":"comment"}