{"by":"tylerlubeck","id":19060742,"parent":19055166,"text":"SurveyMonkey | Senior SRE | San Mateo, CA | Fulltime | Onsite<p>We&#x27;re hiring a Senior SRE to work on our Transit team. The Transit team is responsible for the infrastructure relating to the transit of data - this includes caching, messaging, queueing, and application routing (nginx). We&#x27;re slowly transitioning to be more of a &quot;tier one&quot; team, which means that we&#x27;ll be responsible for those systems and more - service discovery, site performance, and more.<p>We&#x27;re looking for someone to help us maintain these systems and, possibly more importantly, determine the right path for an AWS migration. One of my favorite parts of this job is that we get to work incredibly closely with engineering teams to help them choose the right tools for the job, and then help them implement their use cases around those tools. Our ideal applicant doesn&#x27;t necessarily have experience with any of these tools, but they do have general ops and&#x2F;or application engineering experience and are willing and excited to learn the other side. Ideally you&#x27;re also excited to mentor - a big component of this job is working with engineering teams and helping them build with the infrastructure in mind.<p>I find the best way to explain our team is to share some of the problems we&#x27;ve been working on:<p># Redis Performance\nFor legacy reasons, we&#x27;re running multiple instances of redis on a single VM. They&#x27;ve recently started clobbering each other in competition for disk i&#x2F;o. We&#x27;ve been working on various projects to migrate to new hardware, split the multiple instances to different VMs, and reduce or remove the usage of redis entirely.<p># Site Routing\nAs we move more services to AWS, we&#x27;ve had some complications with how we route web requests. How can we ensure the same routing expectations are met in AWS as they are in our on-prem datacenter without massively increasing our operational burden, and having multiple different systems performing the same task in different datacenters?<p># Network Traffic Reduction\nOr, as we&#x27;ve taken to calling it, &quot;the service call diet&quot;. This is primarily manifesting as a change in how we make use of our caching systems (other than redis). Some of our services make hundreds of calls to memcache for a single request. This means that any sort of network latency can be magnified 100x over. We&#x27;ve been working with engineering teams to provide caching best practices and to build out a new internal caching library to simplify and abstract our caching infrastructure.<p>If this sounds like something you&#x27;d be interested in, please email me at tylerl@surveymonkey.com. Come help us build this team!","time":1549076477,"type":"comment"}