{"by":"Tj_at_Skillz","id":19067897,"parent":19055166,"text":"Skillz: eSports for Everyone | <a href=\"https:&#x2F;&#x2F;skillz.com\" rel=\"nofollow\">https:&#x2F;&#x2F;skillz.com</a> | San Francisco, CA | Leadership to Entry-level | Onsite Only<p>We believe our platform is the future of competitive multiplayer, and we are doing everything in our power to make that future a reality! As Skillz has grown, drastically, so has the breadth of our platform and SDK, providing a one-stop shop to easily add a full social competitive multiplayer experience to any mobile game with just a few simple integration steps. From social features to real-time gameplay support, Skillz focuses on bringing power, security, and customization to our developer partners, all while exciting and engaging their players in astounding numbers.<p>In 2017 Skillz won the Inc. 5000, and was named the #1 fastest growing privately held company in the entire US by Inc. Magazine. We then went on to be named a next billion-dollar start-up by Forbes in 2018. To give you an idea of how fast we’re scaling, in 2017 our top 10 players had won ~$2.7 million, but in 2018, our top 10 players, 7 of which were women, won over $8 million.<p><a href=\"https:&#x2F;&#x2F;venturebeat.com&#x2F;2019&#x2F;01&#x2F;31&#x2F;skillz-top-10-mobile-esports-players-won-8-million-in-2018&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;venturebeat.com&#x2F;2019&#x2F;01&#x2F;31&#x2F;skillz-top-10-mobile-espo...</a><p>Hiring for many different roles, but here are highlights:<p>• Director of Engineering - Data<p>• Engineering Manager - Back-end<p>• Lead Mobile SDK Engineer - Android, iOS<p>• Senior Technical Recruiter<p>Random assortment of technologies we interact with that you might find interesting:<p>Java (Of course!), React Native, Ruby On Rails, AWS, RTMP, XMPP, rUDP, C++, Objective-C, Elixir, Erlang, Immutable Cloud Infrastructure, et al.<p>Personally, I’m looking for an experienced mobile engineer who’s interested in leading, and helping build, a new mobile team here at Skillz! If you fit that description, you can email me directly at tfallon@skillz.com, because I would love to tell you more!<p>See here to apply, and for a more exhaustive list of all of our roles: <a href=\"https:&#x2F;&#x2F;www.skillz.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.skillz.com&#x2F;careers&#x2F;</a>","time":1549168889,"type":"comment"}