{"by":"MicrosoftLew","id":19065300,"kids":[19135894],"parent":19055166,"text":"Microsoft | Senior Software Engineer | Redmond, WA | Onsite | FTE<p>Do you want to be part of a world-class security team that’s researching and developing advanced security tools that will enable Microsoft’s engineering teams to build the most secure products and services possible? Or, maybe you want to be a part of the Digital Crimes Unit (DCU) within Microsoft’s Corporate, External and Legal Affairs group (CELA), which is responsible for some of the most exciting projects that are centered around protecting people online.<p>Either way, we would love to hear from you! Microsoft is looking for curious Software Engineers who want to push their development skills to the next level. We are working together to build software that is literally changing the world, line by line. Come take a journey with us as we empower every person and every organization on the planet to achieve more!<p>&gt;&gt; Senior Software Engineer, Customer Security &amp; Trust: <a href=\"https:&#x2F;&#x2F;careers.microsoft.com&#x2F;us&#x2F;en&#x2F;job&#x2F;468311&#x2F;Senior-Software-Engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.microsoft.com&#x2F;us&#x2F;en&#x2F;job&#x2F;468311&#x2F;Senior-Softwa...</a><p>&gt;&gt; Senior Software Engineer, Digital Crimes Unit: <a href=\"https:&#x2F;&#x2F;careers.microsoft.com&#x2F;us&#x2F;en&#x2F;job&#x2F;543115&#x2F;Senior-Software-Engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.microsoft.com&#x2F;us&#x2F;en&#x2F;job&#x2F;543115&#x2F;Senior-Softwa...</a><p>Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.  We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.","time":1549137600,"type":"comment"}