{"by":"zeppelin_inc","id":19061577,"parent":19055166,"text":"Zeppelin | Tokyo, Japan | Senior Backend Engineer | Full-time | ONSITE | VISA-sponsor<p>Do you like memes? Do you like playing with numbers and theory-crafting or playing with content ranking and economy? We have a vision in which we empower everyone to communicate through memes, not just by creating or sharing memes but becoming a part of it.<p>At the heart of this product is our cognitive systems which solves problems like video content recommendation, video deduplication, visual understanding, and natural language generation.<p>You&#x27;ll be part of the &quot;Feelit&quot; (name not final!!1!) product team and will help build our server-less and micro-services backend systems using sql, ruby, nodejs, and python. You will help scale and maintain our infrastructure on AWS.<p>We&#x27;re laid back (I mean come on, we&#x27;re making a video app for memes) and fun to work with. Although its a stress free and creative work environment we take our features and product releases seriously. Other benefits include flexible working hours, remote working days, extended Japanese holidays, and stock options.<p>You&#x27;ll work out of our HQ in Harajuku, the center of pop-culture in Japan. Your colleagues are engineers from all over the world: Japan, Australia, China, India, Mexico, United Kingdom, and the United States of America (point is we&#x27;re very diverse; gotta catch &#x27;em all).<p>You can chill with our engineers and growth hackers on discord:\n<a href=\"https:&#x2F;&#x2F;discord.gg&#x2F;PnT7pYw\" rel=\"nofollow\">https:&#x2F;&#x2F;discord.gg&#x2F;PnT7pYw</a> or joins us in &#x2F;r&#x2F;memeeconomy discord server <a href=\"https:&#x2F;&#x2F;discord.gg&#x2F;9k23tK9\" rel=\"nofollow\">https:&#x2F;&#x2F;discord.gg&#x2F;9k23tK9</a> (Look for users with Feelit Dev)<p>For more information and other positions check our parent company&#x27;s website <a href=\"https:&#x2F;&#x2F;www.zeppelin.co.jp&#x2F;join&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.zeppelin.co.jp&#x2F;join&#x2F;</a>","time":1549090444,"type":"comment"}