{"by":"cjsaenz","id":19079873,"parent":19055166,"text":"clearstreet.io | New York, New York | Backend Engineer, Frontend Engineer, Lead Product Engineer | ONSITE |<p>At Clear Street, we are modernizing every aspect of institutional finance, archaic industry segments left behind in the fintech revolution of the last decade. We’re using our background in building cutting-edge systems and combining it with our in-depth knowledge of the business’s inner workings. Our result is clear; we&#x27;re creating elegant and robust user experiences while simplifying and optimizing their workflows. We connect our users with the modern technologies already interfacing with every other facet of their trading business.<p>We&#x27;re looking to hire: \n-Backend Engineers (Work closely with our engineering team, using a wide range of technologies to build services, simple API interfaces, and custom tools.) \n<a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;clearstreet&#x2F;jobs&#x2F;1495020\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;clearstreet&#x2F;jobs&#x2F;1495020</a>\n<a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;clearstreet&#x2F;jobs&#x2F;1495033\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;clearstreet&#x2F;jobs&#x2F;1495033</a><p>-Frontend Engineers (Design and implement new UI&#x2F;UX features, while working closely with a passionate and collaborative team of engineers.) \n<a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;clearstreet&#x2F;jobs&#x2F;1495025\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;clearstreet&#x2F;jobs&#x2F;1495025</a><p>-Lead Product Engineer (Lead the design and implementation of our UI&#x2F;UX, while working closely with a passionate and collaborative team of engineers.) \n<a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;clearstreet&#x2F;jobs&#x2F;1495034\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;clearstreet&#x2F;jobs&#x2F;1495034</a><p>-More roles on the website (Operations Data Analyst, Operations Engineer)\n<a href=\"https:&#x2F;&#x2F;clearstreet.io&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;clearstreet.io&#x2F;careers</a><p>Tech Stack: - Golang, JS, React&#x2F;Redux, Python, Kafka, Kubernetes, Docker, Terraform, microservice architecture, etc.<p>If you are interested in reaching out and exploring any other options please email careers@clearstreet.io","time":1549309212,"type":"comment"}