{"by":"anasibi1","id":19078980,"parent":19055166,"text":"Hazel Analytics | Full-Stack&#x2F;Front-End Software Engineer | Seattle, WA | ONSITE | $100K - $160K + 0.05% - 1% equity (DOE) | <a href=\"https:&#x2F;&#x2F;hazelanalytics.com\" rel=\"nofollow\">https:&#x2F;&#x2F;hazelanalytics.com</a><p>Hazel Analytics pair the largest food safety inspection database with powerful analytics tools and solutions for Fortune 500s and leading organizations in the restaurant, financial services, government, and education industries. With nearly half of the top 100 food retail chains as customers, we do our part to help keep millions of people safe when eating out every day. Customers include Amazon, Cheesecake Factory, Target, Starbucks, and Subway to name a few.<p>For fun, check out this project we recently did with ESPN: <a href=\"http:&#x2F;&#x2F;www.espn.com&#x2F;espn&#x2F;feature&#x2F;story&#x2F;_&#x2F;id&#x2F;25316231&#x2F;health-inspection-reports-find-critical-violations-nfl-nhl-nba-mlb-stadiums-2018-espn-lines\" rel=\"nofollow\">http:&#x2F;&#x2F;www.espn.com&#x2F;espn&#x2F;feature&#x2F;story&#x2F;_&#x2F;id&#x2F;25316231&#x2F;health-...</a><p>Hazel is also the proud recipient of multiple food safety innovation awards: Food Marketing Institute (2018) and Jack in the Box (2016).<p>We are profitable and privately-held (i.e. no VC investors), which means your equity is worth something from day one, and you’ll be able to make a direct impact on the company&#x27;s strategy and execution.<p>We&#x27;re currently seeking experienced full-stack or front-end software engineers to continue growing our engineering team. Our tech stack is predominantly Python (Flask), JavaScript (transitioning from Angular 1 to React), and PostgreSQL, with Docker and Google Cloud featuring in our infrastructure. The team operates in an agile manner, keeping processes to a minimum and enabling engineers to stay focused on their work. We&#x27;re especially interested in people who are eager to mentor junior engineers and who have past experience in data science, a devops focus, React&#x2F;Redux experience, or UI&#x2F;UX skills.<p>Apply here:<p>Full-stack: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;hazelanalytics&#x2F;7c4ae7ec-ed3f-45cf-b2e9..\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;hazelanalytics&#x2F;7c4ae7ec-ed3f-45cf-b2e9...</a>.<p>Front-end: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;hazelanalytics&#x2F;d2df0869-51e3-4e92-9136..\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;hazelanalytics&#x2F;d2df0869-51e3-4e92-9136...</a>.","time":1549304361,"type":"comment"}