{"by":"esalgadojr","id":19078261,"parent":19055166,"text":"Xandr AppNexus&#x2F;Senior UI Software Engineer, AppNexus Programmable Platform\n<a href=\"https:&#x2F;&#x2F;www.appnexus.com&#x2F;careers&#x2F;open-roles?postid=aSUzTR16Ix4\" rel=\"nofollow\">https:&#x2F;&#x2F;www.appnexus.com&#x2F;careers&#x2F;open-roles?postid=aSUzTR16I...</a><p>About the team:ONSITE NY or Portland OR<p>The AppNexus Programmable Platform is the most customizable DSP in the ad tech ecosystem. It empowers sophisticated programmatic media buyers to achieve unique business objectives – without the need to write code.  You can find more information about this product here. The UI team for AppNexus’ Programmable Platform is looking for an engineer who enjoys building complex, data heavy front-end systems. If you are looking to make an impact, and if you are looking for a friendly team – come meet us.  Our goal is to make demand analysis as easy as possible for our customers and perfect the trader user experience.<p>About the job:<p>• Design, develop and maintain fast and reliable customer facing solutions\n• Lead architecture discussions, make and drive technical decisions\n• Collaborate with a global cross-functional team with diverse technology backgrounds\n• Work closely with other engineering teams\n• Participate in all stages of the software development life cycle: from design and development, to deployment and maintenance\n• Share your knowledge, guide and mentor other engineers<p>About your skills:<p>• At least 5+ years of experience in software engineering building web applications\n• Strong knowledge of and an interest in JavaScript and experience with JavaScript frameworks such as Angular.js, React, Node.js\n• Thorough understanding and work experience in any back-end language, such as Java, PHP\n• Demonstrated skill in designing and architecting large interdependent systems\n• Strong database skills\n• Knowledge of computer science fundamentals: Object-Oriented and&#x2F;or Functional programming, design and asynchronous and event-driven development\n• Experience writing unit and integration tests\n• Ability to work independently and make use of your time effectively","time":1549300832,"type":"comment"}