{"by":"hackily","id":19108037,"kids":[19120043],"parent":19055166,"text":"CapitalOne | Software Engineer, Senior Software Engineer, and above! | McLean, VA, DC Area | ONSITE | Full-Time<p>At Capital One, we’re building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.<p>Guided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.<p>Full Stack Software Engineer-Angular&#x2F;Typescript&#x2F;Javascript<p>I&#x27;m an engineer looking for people to join my team - we&#x27;re looking to expand a lot this year!<p>Our current major tech push right now is to finish migrating our AngularJS frontend fully to Angular component by component using Angular Elements.<p>My talented coworker published an overview article on our Angular Elements approach a few weeks ago, please give it a read if you&#x27;d like!\n<a href=\"https:&#x2F;&#x2F;medium.com&#x2F;capital-one-tech&#x2F;capital-one-is-using-angular-elements-to-upgrade-from-angularjs-to-angular-42f38ef7f5fd\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;capital-one-tech&#x2F;capital-one-is-using-ang...</a><p>Experience: Ideally, you have at least 2 years of professional programming experience.<p>We have positions open for Software Engineers, Senior Software Engineers, and Manager level Software engineers.<p>If my team (frontend) doesn&#x27;t sound like a fit, there&#x27;s plenty of other open positions!<p>We&#x27;d love to have you join us! Please reach out to me at neil.wang@capitalone.com","time":1549569796,"type":"comment"}