{"by":"ouriel_1","id":19106465,"parent":19055166,"text":"WinIt | Software Engineer | Flatiron, NYC | ONSITE | Full-time | Visa Available | $75k-$115k &amp; Equity | Healthcare &amp; Benefits |  <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;winit-app&#x2F;jobs&#x2F;68416-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;winit-app&#x2F;jobs&#x2F;68416-software-engineer</a><p>About Us: \nWinIt is the industry leader helping drivers fight their parking &amp; traffic tickets.\nOur long term goal is to become a one-stop solution to assist drivers with their automotive related challenges. This includes helping drivers finding the best price on auto insurance, leasing &amp; financing options, mechanics etc.\nWe&#x27;ve bootstrapped the company and have dismissed over $10 million worth of fines.<p>Our team: \nWe are a small development team with members who take on multiple roles across the stack. We strive to always be improving our process and code bases, to use the correct tools for the tasks at hand, and to help grow our collective skills.<p>Your Role: \nWe’re looking for a full-stack engineer driven to solve challenging problems with a clean and maintainable approach. You will write modular, high-quality code while actively contributing to peer code reviews.\nYou are an intelligent, passionate, and innovative developer that can formulate new ideas and execute them within an existing development environment. Ideally, you enjoy a hands on approach in determining how you and the team can develop technology to meet the company’s business needs.<p>Skills: \nWe’re seeking developers with full stack skills and experience.\nOur primary web application is written in Angular, however, we consider ourselves to be a React team. We’re developing new projects in React, and are actively transitioning our web app to React as well.\nWe use Node.js on the backend, with MongoDB as the datastore for our primary products. We appreciate developers with an array of backend skills, but experience using Node in a backend environment is a must.\nMobile experience is a plus, but we are not hiring strictly mobile devs at this time. Our applications are native Android and iOS applications, written in Java and Swift&#x2F;ObjC respectively.<p>Experience: \nIdeally you have previous startup experience, writing production level code, or experience deploying your own projects to a userbase.","time":1549558684,"type":"comment"}