{"by":"3Shape","id":19142188,"parent":19055166,"text":"3Shape| C# developer, Cloud, 3D algorithms, Machine learning | Cph, Denmark | Full-time | Onsite<p>3Shape creates 3D scanning and CAD&#x2F;CAM software solutions. Innovative technology that enable dental professionals to treat more people, more effectively and with improved care. In 3Shape, we believe in team autonomy and you will find a highly dynamic, informal work environment, skilled and passionate colleagues that will daily challenge and support you and that are looking forward to being challenged back. Together, we are going to build the future of digital dentistry and we’ll have fun in doing so!<p>We are hiring:<p>An experienced Software Developer for 3D Application Development who will join a skilled and motivated team, currently building next generation software for orthodontic treatments. The new application will allow faster, more automated and more predictable treatment of patients, it will help orthodontists to digitalize their workflows, enabling them to offer better and cheaper treatments, ultimately improving patient care. Young and international, the team is passionate about, and regularly work with, a wide range of technologies, from deep learning to realistic shaders, and it strives, through continuous improvements, to honor best-practices of agile software development processes: <a href=\"https:&#x2F;&#x2F;3shape.easycruit.com&#x2F;vacancy&#x2F;2236843&#x2F;111446\" rel=\"nofollow\">https:&#x2F;&#x2F;3shape.easycruit.com&#x2F;vacancy&#x2F;2236843&#x2F;111446</a><p>A Senior software developer for Cloud Solutions who will take part in continuous adaption of our architecture and provide sparring with other developers. You will join a team of highly skilled colleagues using agile development processes, developing using the latest technologies. You can take the lead of complex tasks involving many stakeholders. You naturally investigate and promote good design practices and architecture principles. You develop applications, tools, services, automated infrastructure setup and automated test, tools, web services and databases, using a.o. C#&#x2F;.NET, GIT, PowerShell, SQL and Azure, and if needed are not afraid of dissecting legacy Delphi code for inspiration when writing new C# code: <a href=\"https:&#x2F;&#x2F;3shape.easycruit.com&#x2F;vacancy&#x2F;2239829&#x2F;111446\" rel=\"nofollow\">https:&#x2F;&#x2F;3shape.easycruit.com&#x2F;vacancy&#x2F;2239829&#x2F;111446</a><p>An ambitious software developer with experience with Deep Learning theory and application. The dental field of Orthodontics is rapidly being revolutionized these years, and 3Shape has been a major player for several years – but to keep pushing the limits of our Orthodontic products, we are exploring Deep Learning methods for analyzing large amounts of medical (dentistry) data – pushing a field which traditionally has looked at 2D images to 3D scan data. We are now looking to expand our existing software teams working with Orthodontic 3D software with resources focusing on integrating Deep Learning technologies into our new and existing products: <a href=\"https:&#x2F;&#x2F;3shape.easycruit.com&#x2F;vacancy&#x2F;2226301&#x2F;111446\" rel=\"nofollow\">https:&#x2F;&#x2F;3shape.easycruit.com&#x2F;vacancy&#x2F;2226301&#x2F;111446</a><p>Get to know more about our Engineering team: <a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;Y0Pd1YNtcgw\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;Y0Pd1YNtcgw</a><p>And meet Jesper Lomborg Manigoff, Vice President for R&amp;D Software Development, who explains how curiosity drives our development: <a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;R6d_s9NrLG4\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;R6d_s9NrLG4</a>","time":1549963877,"type":"comment"}