{"by":"goldcaddy77","id":19150737,"parent":19055166,"text":"Indigo Agriculture | Senior GraphQL API Engineer, Senior React Engineer | Boston, MA | ONSITE | Full-time |<p>Our mission is to improve farmer profitability while pulling chemicals out of our food supply and making healthier food in the process.  You can read about Indigo&#x27;s mission here: <a href=\"https:&#x2F;&#x2F;www.indigoag.com&#x2F;about\" rel=\"nofollow\">https:&#x2F;&#x2F;www.indigoag.com&#x2F;about</a><p>More specifically for these roles: my team is building a Marketplace (<a href=\"https:&#x2F;&#x2F;www.indigoag.com&#x2F;indigo-marketplace\" rel=\"nofollow\">https:&#x2F;&#x2F;www.indigoag.com&#x2F;indigo-marketplace</a>) where farmers can sell their crops direct to buyers without having to go through a middle-man, who historically takes a good part of the profits and disincentivizes the farmer from producing high-quality, sustainable crops since they all get mixed together.  In Indigo&#x27;s Marketplace, farmers that product premium crops (Non-gmo, Organic, low toxins) get a premium price.  We&#x27;re essentially building a market like the Nasdaq, but with many more dimensions (different crops, quality, selling windows), with heavy geographic components (buyers and sellers need to be close) and a bunch of different pricing options (hedging, futures, etc...), so there is no shortage of fun, complex problems to solve.<p>We use React, TypeScript and Apollo (GraphQL) on the front end and Node, TypeScript and GraphQL on the back end.  The combination of TypeScript on both the front and back ends and GraphQL in the middle allows us to be type-safe from the DB all the way to the web page where the data is bound.  We&#x27;re been GraphQL since day one and are huge fans.<p>Please reach out to me directly at dcaddigan@indigoag.com or apply directly via the links below.  If you apply directly, write a note saying you&#x27;re coming from Hacker News.<p>* Senior GraphQL API Engineer - <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;indigo&#x2F;jobs&#x2F;659135\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;indigo&#x2F;jobs&#x2F;659135</a><p>* Senior React Engineer - <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;indigo&#x2F;jobs&#x2F;666210\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;indigo&#x2F;jobs&#x2F;666210</a><p>Also note that we have some remote contractors and our processes are set up to handle full-time remote folks, we just haven&#x27;t pulled the trigger on the right person yet.  If you&#x27;d need to be remote full-time and think you&#x27;re a great match for the position, please reach out!","time":1550036433,"type":"comment"}