{"by":"Nervetattoo","id":19160974,"parent":19055166,"text":"Task Analytics | Fullstack engineer (JavaScript), Product designer &#x2F; UX Engineer | New York &#x2F; Norway | REMOTE, FULL TIME<p>Task Analytics delivers actionable, human insights that help create, shape and impact your customers online experience.\nTask Analytics captures and analyzes customer intent to establish and align strategies across any organization. The culmination of years of research in top task methodology and user testing, our platform is trusted by leading brands and digital agencies to deliver a non-invasive engagement tool that helps discover the why behind the metrics being measured by traditional web analytics tools.<p>We are a fully remote team but we also have office space in New York (US) and Oslo (Norway).\nWe offer competitive salary and a highly flexible work arrangement tailored to fit your life.<p>You:<p>* Have intermediate (Designer) or expert (Engineer) JavaScript knowledge<p>* Know your field and have a habit of keeping up to date<p>* Personally think UX matters and can align with a users perspective<p>* Will work hands on on product in a tight knit team<p>* Have a track record of shipping<p>* Are self-motivated and a proactive team player<p>Some core parts of our stack includes: NodeJS, React &amp; friends, ArangoDB.<p>Note that due to timezone overlap constraints we can only hire in Eastern USA and Europe at this stage.<p>Please read actual job postings for more information:<p>- <a href=\"https:&#x2F;&#x2F;weworkremotely.com&#x2F;remote-jobs&#x2F;task-analytics-full-stack-software-engineer-javascript\" rel=\"nofollow\">https:&#x2F;&#x2F;weworkremotely.com&#x2F;remote-jobs&#x2F;task-analytics-full-s...</a><p>- <a href=\"https:&#x2F;&#x2F;weworkremotely.com&#x2F;remote-jobs&#x2F;task-analytics-product-designer-ux-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;weworkremotely.com&#x2F;remote-jobs&#x2F;task-analytics-produc...</a><p>You can apply at <a href=\"https:&#x2F;&#x2F;weworkremotely.com&#x2F;company&#x2F;task-analytics\" rel=\"nofollow\">https:&#x2F;&#x2F;weworkremotely.com&#x2F;company&#x2F;task-analytics</a> or email jobs@taskanalytics.com","time":1550141537,"type":"comment"}