{"by":"jobi","id":4323727,"parent":4323597,"text":"Boston MA, INTERN or REMOTE, full time<p>Android developer<p>The Woven team is looking for talented people to join our Copley Square-based team. We’re the company that brought you the litl webbook, an Internet computer for the home that’s been hailed as a “design miracle” by Fast Company, “truly new” by John Gruber, and “bold” and “refreshing” by Walt Mossberg.<p>With the launch of Woven, our photo viewing app, we’re increasingly focused on helping people enjoy their treasured photo collections through smart and simple mobile apps, desktop software, and supporting services. More information about Woven is available at its website, woventheapp.com.<p>As an Android developer at litl, you will build upon our Android app for Woven. You will be bringing a wide set of new features, working closely with our design, backend and QA teams. While initially working on Android, you will have opportunities to explore other areas, such as iOS or backend development.<p>While our headquarters are in Boston, we have developers from various parts of the world. Working remotely is common practice at litl.<p>Skill and requirements<p>. Proven record as an excellent Android developer, ideally a few applications in the Google Play store.<p>. Strong emphasis on code quality and maintainability. Code samples are most welcome.<p>. Experience with git strongly desired.<p>. Experience interfacing with web services is desirable.<p>. Experience with other platforms appreciated.<p>. Experience working in a small team of developers with strict code review policies is appreciated.<p>About litl<p>We're a small computer company with big ideas. Located in Boston, we also have people in London, Brazil, the Greek Isles...you get the idea. Our 60 person team consists of software developers, hardware engineers, industrial designers, user experience experts, graphic designers, evangelists, logistics gurus, and top-notch customer support. An unlikely mix, perhaps, but what we have in common is passion for creating compelling user experiences. Our four-year pursuit has been continually fueled by enthusiasm and excitement about our diverse set of projects. The results are always simple, useful and delightful.<p><a href=\"http://woventheapp.com/careers/\" rel=\"nofollow\">http://woventheapp.com/careers/</a><p>jobs@litl.com","time":1343837479,"type":"comment"}