{"by":"caetie","id":4323818,"parent":4323597,"text":"Akvo Foundation is hiring a Java developer to join the team for one of our core software products, Akvo FLOW. FLOW (Field Level Operations Watch) is an open source platform to collect, manage, analyse and display geographically-referenced monitoring and evaluation data.<p>Looking for a full-time developer, and you can work remotely. To apply for this position, send your resume and a brief cover note to caetie@akvo.org.<p>We have some fun and hard problems to solve -- how can we maintain and extend a complex tool with a lot of moving parts (a mobile app, a web platform, map displays) while keeping it simple and enjoyable for people to use? Double down when they need to be able to use it in areas of the world with low or scarce web and mobile connectivity. How do we make the data users collect satisfying and easy to work with? Can we build web and mobile apps that can flex from an $80 off-the-shelf Android device, to a tablet, to a desktop computer? And finally, can we build FLOW to become the go-to tool for international monitoring and evaluation?<p>This is what we are looking for in a developer:<p>• You are a smart, creative and experienced Java developer who wants to learn and improve a new and complex software platform end-to-end.\n• You are an independent, self-motivated worker who can also be a strong team member.\n• You can see the big picture but attend diligently to the small details that make software work.\n• You enjoy and value communicating your work to your team and your users.<p>Akvo is a small non-profit foundation with a big mission. We create open source web and mobile software, and build networks of skilled partners that can change the way development aid is allocated and reported. This is important, because it improves the way projects are implemented in some of the poorest parts of the world, making them more effective, efficient, sustainable and visible.<p>Core skills required:\n• Java\n• Web frameworks, such as Spring\n• Google App Engine\n• Strong database and SQL skills with knowledge of NoSQL databases\n• Google Web Toolkit and Ext JS\n• JavaScript/HTML/CSS/Ajax<p>Major plus skills:\n• Experience developing native Android apps or other mobile phone apps (our mobile app is Android)\n• Google Enterprise Technologies (Google Apps, Google Maps, Google Search) and Amazon Web Services\n• JDO and other persistence technologies\n• GIS software and libraries such as GeoTools\n• Unit testing in Java and agile development\n• Some combination of Python, Ruby, Django, Git, Lettuce, Robotium, Calabash<p>Our team is close knit, despite being distributed. We take the people and team factors very seriously, both our colleagues and our partners using our software (we call them partners and not clients). This also means that we take work-life balance and the importance of having fun very seriously. The fact that most of our developers telecommute means that you can maintain a flexible schedule and work environment to suit your needs.<p>You would work from home and expect to spend a lot of time on Skype connecting with your colleagues. It may also be possible for you to work close to colleagues in our Amsterdam, Helsinki, Stockholm or Washington DC hubs. You write and speak fluent English, and you are based in a UTC-5 to UTC+2 timezone (East Coast United States to Eastern Europe).<p>To apply for this position, send your resume and a brief cover note to caetie@akvo.org.","time":1343838195,"type":"comment"}