{"by":"phillytom","id":4323762,"parent":4323597,"text":"Monetate - (Philly suburb) Conshohocken, PA / No remote, but we will help you relocate.<p>Monetate is a SAAS provider to internet marketers. We do real-time DOM modification to our clients’ sites to put the right experience in front of their users.  We’re looking for engineers who want to do highly visible work on great brands and solve tough problems with great coworkers.<p>About us:<p>* We were founded in 2008 and are funded by First Round and OpenView (amongst others)<p>* We pay market comp<p>* Respect - it's our core value. We have a great team and we work well together. Our vacation policy is the same as Netflix (we don't have one).  Our technical teams have full authority over (and responsibility for) the problems they work on.<p>What we're looking for:<p>* We use primarily JS and Python as well as all sorts of other open source tools - Google Closure, Hadoop, Mahout, Solr - but we're open to people with any background<p>* Problem solvers who like to code - we take things apart, figure out how they work, then build software to solve problems<p>* People who like to ship - we're focused on building and shipping great products - if you like to see your work in production quickly you'll see it here<p>* People who like hard challenges - we have great problems across our products - data, UX, 3rd party JS, high volume / low latency APIs - we have no shortage of deep problems to work on<p>We're looking for people not positions.  We have people who have joined the team with no background in our primary languages and people from non-traditional backgrounds.<p>Check out our blog at <a href=\"http://engineering.monetate.com/\" rel=\"nofollow\">http://engineering.monetate.com/</a> and see more about our open jobs at <a href=\"http://monetate.com/jobs/\" rel=\"nofollow\">http://monetate.com/jobs/</a><p>We've hired great people from HN in the past.<p>Please feel free to email me with any questions or to apply - tjanofsky monetate com","time":1343837712,"type":"comment"}