{"by":"brandontreb","id":4323870,"parent":4323597,"text":"ELC is Hiring Senior JavaScript Developer (Portland, OR (or Telecommute))\n<a href=\"http://portland.craigslist.org/mlt/eng/3175762781.html\" rel=\"nofollow\">http://portland.craigslist.org/mlt/eng/3175762781.html</a><p>Where do you fit in?\nYou will be joining a team of experienced front-end developers working on a wide variety of projects, both web and mobile. You will likely be hopping from project to project on a regular basis, depending on which team has the greatest need of your knowledge at any given moment. You will work closely with designers and developers to build usable and compelling interfaces. You will have many opportunities to try new things and work on the cutting edge of what's possible.<p>Who do we need?\nWe need someone who lives and breathes JavaScript. Our team has some experience, but we're looking for someone who writes their own plugins and relishes the challenge of writing a solution from scratch. We want someone who can help teach the rest of the team, and encourage best practices. We recognize that JS is an increasingly central component of the types of web and mobile apps we build, and we're looking for someone who can help take us to the next level.<p>Who are we?\nWe're not just another boring agency building brochure sites. We're a growing development shop who specializes in building compelling and usable apps using Ruby on Rails, iOS, and Android. We practice agile development, which means you'll be working closely with the client, designers, and developers at every stage, not just being handed comps and a deadline. We reward hard work and believe strongly in a sustainable work/life balance.<p>Benefits\n401(K), PTO, Medical/Dental Plans, Health Savings Account. Company outings. Conferences and book budget. Creative work environment with beer-bust Fridays, game room and fully stocked kitchen onsite.<p>If you think you're the right person for the job, send your resume and examples of your work (ideally your github repo) to jobs@elctech.com","time":1343838554,"type":"comment"}