{"by":"knowtheory","id":4323741,"kids":[4324249,4336998],"parent":4323597,"text":"Location: Columbia, Missouri (or Remote)<p><i>Who we are</i><p>DocumentCloud (<a href=\"http://www.documentcloud.org/home\" rel=\"nofollow\">http://www.documentcloud.org/home</a> ) is a web based platform allowing journalists to upload, analyze, annotate, and publish primary source documents. We want give journalists the tools to show their audience their source material, not just tell them about it. In addition to the newsrooms worldwide who use DocumentCloud, our open source software projects (see: <a href=\"http://github.com/documentcloud\" rel=\"nofollow\">http://github.com/documentcloud</a> ), such as Backbone.js, Underscore.js, Docsplit, and Jammit, are relied upon by companies such as LinkedIn, Walmart, Foursquare and more. DocumentCloud is run by Investigative Reporters &#38; Editors (<a href=\"http://ire.org\" rel=\"nofollow\">http://ire.org</a> ).<p><i>What DocumentCloud is building</i><p>- DocumentCloud is growing fast, and we’re looking to accelerate that pace by expanding our tools into other languages beyond English. In the next year we’ll adapt our platform to accommodate multi-language OCR, search indexing, and entity extraction tools.<p>- DocumentCloud always looks for new ways to present documents and engage readers. We are extending DocumentCloud’s document viewer and annotation tools so that readers can make their own comments and notes on documents.<p><i>Who we're looking for:</i><p>DocumentCloud is looking for a developer with some combination of the following skills: Experience with Ruby and JavaScript; API driven web applications; working on and fostering FOSS; user-centered products; Experience the JVM toolchain; linux administration on Platform as a Service providers such as AWS.<p>Things we like and hope you like too!<p>Literate programming; Extracting libraries from app code; Polyglot programming; Web standards; Journalists; Natural Language Processing<p>You can email us at jobs@documentcloud.org","time":1343837567,"type":"comment"}