{"by":"cdolan92","dead":true,"id":4323850,"parent":4323597,"text":"<p><pre><code>  /---------------------------------\\\n    Lead Software Engineer - Startup\n  \\---------------------------------/\n</code></pre>\nLocation: Pittsburgh, PA | Philadelphia, PA<p>Sequoia Waste Solutions (<a href=\"http://www.sequoiawaste.com\" rel=\"nofollow\">http://www.sequoiawaste.com</a>)<p>We want to find an emerging technical developer who can contribute to a venture-backed, self-sustaining startup; someone who can sling code with the best of them but wants broader scope and wants to make an impact — a really big impact.<p>You: ambitious, technical, and adept at managing both the technology and the puzzle pieces behind it. You’ll work with the company leadership on a regular basis, and help refine and expand the company roadmap. Also, be ready to hone your inner air-hockey self.<p>You’ll play a big part in creating and executing the company’s engineering and product roadmaps as well. Just as important, you’ll help define the engineering culture of the company and help us change the world by making waste more efficient. How often do you get to do that?<p>Compensation:<p>We pay competitive salaries, and have bonuses for hitting and beating deadlines. Your compensation will largely be dependent upon experience and skill set. Perhaps most importantly, we offer you the opportunity to gain experience and the chance to substantially change the world by properly merging the waste services industry with cutting-edge technology. Ours is a culture of creating quality products and delivering exceptional service while we disrupt an aging industry model. If you fit that mold, please apply through Careers 2.0, or visit our website and contact us.<p>Perks:<p>• Quiet working conditions<p>• Competitive Benefits<p>• Suburban Office location (escape city taxes!)<p>• Weekly company ‘get togethers’ and events<p>• Everyone has a solid Cherry desk, Aeron Chair, and 2011/2012 iMacs /w maxed specs, etc.<p>• Full access to a techie’s playground (Our sister company is a full fledged SAS-70 data center for the Pittsburgh/Northeast areas)<p>Skills &#38; Requirements<p>Requirements &#38; Qualifications:<p>A solid engineer with proven experience, preferably in PHP and/or Ruby\nSome experience with: MySQL, SQL Server, JavaScript, Windows Server\nHave extensive experience with web services\nResourceful, practical and critical thinker.\nBe thorough, have good attention to detail, and display a high level of accuracy\nHigh stress tolerance\nGood team player and fast learner\nSelf-motivated and organized.\nGood communication skills, able to bring forward a vision or opinion.\nA good sense of humor\nBonus: Previous involvement (or outright failure!) at a startup\nWe would like you to be enthusiastic about working here. If this were just a job, we would work for the government. We are willing to accept constructive criticism and make changes, we expect you to do the same. We anticipate that you would be eager to fill a critical and respected role in a startup packed with dedicated and driven people.  We hire people who finish what they start and who are looking for new challenges. Tell us why you would flourish here.<p>About Sequoia Waste Solutions<p>Sequoia is a Pittsburgh based startup, that is redefining how waste and recycling is handled in the corporate enviornment. Every day, businesses overpay on their waste hauling, due to drastic inefficies in the industry. At Sequoia, we collect, analyze, and present data in a manner that helps us create client-specific plans that reduce trash headed for landfills, and increase recycling. We are closing in on our first year of operation, and are always looking for new and exciting ways to handle and report the awesome data we're collecting. With your help, we'll redesign the waste industry, and reduce the amount of trash heading to landfills. We call it \"saving the world, one line of code at a time\"!<p>Apply via Careers 2.0 :: <a href=\"http://careers.stackoverflow.com/employer/jobs/29162/listing\" rel=\"nofollow\">http://careers.stackoverflow.com/employer/jobs/29162/listing</a>","time":1343838430,"type":"comment"}