{"by":"jobi","id":4323765,"parent":4323597,"text":"Boston, New England or East Coast - full time<p>Python Web Services/Backend Developer<p>About the Company<p>TalentDrive is the industry’s most trusted provider of everything “resume sourcing”. Whether you are a Human Resource Technology provider looking to expand your product offering or a recruiter in need of a better process for online sourcing, TalentDrive has the answer. From innovative new hiring practices to tried-and-true online search functions, TalentDrive offers a solution to fit your needs.<p>TalentDrive is the creator of two leading recruitment solutions: Talent Platform Exchange (or TPX) fills positions fast by connecting employers and agency recruiters directly through their ATS.  TalentFilter streamlines the online search process, aggregating resumes from multiple sources into one location.<p>Job Description<p>Under general supervision of the Development Lead, the Web Services / Backend Developer will join a distributed team to implement a large scale multi-tenant B2B Web Service.<p>The Web Services / Backend Developer will be responsible for:<p>Collaborating with designers, testers and product owners to gather requirements and drive project<p>Producing and documenting high quality, testable and scalable code<p>Contributing code to all areas of the product, including but not limited to:<p>. Data modeling tradeoffs in MongoDB schemas<p>. Address the challenges of performing 3rd party service integrations<p>. Consume SOAP and REST Web APIs to push data back to the clients<p>. Machine learning and document classification/scoring<p>Requirements<p>. High proficiency in Python, particularly Web Service micro-frameworks<p>. Knowledge of NoSQL databases such as MongoDB<p>. High level of familiarity with Distributed Version Control (Git)<p>. Self-motivated and strongly oriented to problem solving with emphasis on root-cause analysis and quick resolution of issues<p>. Five or more years work related experience and B.S. in Computer Science or Information Systems required<p>. Experience working with Agile development practices<p>. Experience with or interest in machine learning and document classification problems a plus.<p>Contact Info:<p>Web:  www.talentdrive.com<p>Location: Boston, New England or East Coast","time":1343837743,"type":"comment"}