{"by":"edawerd","id":4324620,"kids":[4330993],"parent":4323597,"text":"We're Revolutionizing Payroll<p>San Francisco, CA - Rails and Backbone Engineers<p>Full Time &#38; Internships | Open to Covering Relocation Costs<p>Well-funded YC W12 start-up looking for Rails | Backbone engineers<p>About us: We're a team of second time entrepreneurs, tackling the massive payroll market. If solving a real pain point for millions of people gets you excited (plus the chance to build a significant, meaningful company), we'd love to speak with you. We have big ambitions and the resources to make long term bets. Our team is made up of Stanford engineering alums who have had two prior exits. We're hungry to build something truly great and we're in this for the long haul. We're well-funded by some of the best CEOs and investors in Silicon Valley and we're looking for like-minded engineers to join us.<p>Skills: Some technologies we use include -- Rails | Backbone.js | MySQL | jQuery | Coffeescript. If these technologies excite you and you want to work on a product that has the potential to transform an industry, we'd love the chance to share our vision with you. We employ a test driven development process and pair part of the time.<p>There's a ton of work to be done, and you'll be a core member of our team as we grow the company. You'll receive a highly competitive salary, a sizable equity stake, and we'll geek you out with your dream work equipment. Other perks include a housing stipend if you live near the office, three meals a day, company retreats, gym/sports club stipend, and more -- including copious espressos brewed by one of our co-founders. Our office is one block from South Park in SoMa, San Francisco.<p>Above all, we're looking for individuals who are yearning to do the best work of their lives. You'll be amply rewarded for the work you do.<p>If you're interested, send us a note at jobs [at] zenpayroll [dot] com and include your LinkedIn, GitHub, and/or any project pages.<p>P.S. We posted to Hacker News month ago and hired an amazing full-stack developer who we're thrilled to have on the team. We hope one of you reading this post becomes our next hire. :)","time":1343844698,"type":"comment"}