{"by":"jobi","id":4324312,"parent":4323597,"text":"Boston MA, full-time<p>Test Automation Developer<p>litl is looking for a Test Automation Developer to join our growing Copley Square-based software team.  litl is the company that brought you the litl webbook, a computer that lets you enjoy the web without worrying about anything else and winner of numerous national and international awards. litl is currently bringing multiple consumer photography applications to market.<p>litl is searching for a motivated developer with testing experience to help the testing team identify automation opportunities in our existing test suites, develop automated test cases and maintain the testing environment. As a Test Automation Developer you will work as part of the larger development team that's building exciting mobile applications for iOS, Android and Windows mobile.<p>Skills &#38; Requirements<p>Solid proficiency in Python, Ruby or a similar scripting language (experience in Objective-C and/or Java would be a plus). Familiarity with UI test automation frameworks. Adaptable and flexible to changing priorities. Self-motivated and comfortable working in both team/solo environments. Excellent written, verbal, and organizational skills. Desire to work in a fast moving environment where code quality and system stability are a priority.<p>Potential Responsibilities<p>Develop, maintain and refine a suite of automated test cases (functional, smoke, load, regression). Extending the functionality of test frameworks to fit our evolving needs. Document and maintain testing environments. Executing automated and manual tests. Tracking results of automated tests and logging defects. Verification of bug fixes. Review technical design specs and provide recommendations on specific testing challenges and strategies.<p>About litl<p>We're a small computer company with big ideas. Located in Boston, we also have people in London, Brazil, the Greek Isles...you get the idea. Our 60 person team consists of software developers, hardware engineers, industrial designers, user experience experts, graphic designers, software testers, evangelists, logistics gurus, and top-notch customer support. An unlikely mix, perhaps, but what we have in common is passion for creating compelling user experiences. Our four-year pursuit has been continually fueled by enthusiasm and excitement about our diverse set of projects. The results are always simple, useful, and delightful.<p>jobs@litl.com","time":1343841970,"type":"comment"}