{"by":"DavidMcLaughlin","id":4324367,"parent":4323597,"text":"We're hiring at Twitter (San Francisco, CA - H1B welcome).<p>My team is working on monitoring and alerting for all of the different services at Twitter. Zipkin (<a href=\"https://github.com/twitter/zipkin/\" rel=\"nofollow\">https://github.com/twitter/zipkin/</a>) is an example of the kinds of tools our team is building right now. The two central components are a dashboard/charting monitoring service as well as our own alerting system.<p>Most of our infrastructure challenges stem from the sheer number of writes we need to deal with as well as the temporal nature of what we're doing - all of our writes need to happen within certain time periods and reads have to be consistent within certain time-frames to avoid engineers being woken up at 4am due to incorrect data from a dirty read. Given that we're the service which observes all the other critical components - our reliability requirements are also a huge challenge.<p>The product challenge on this team is making sense of a whole lot of data. So there is a lot of cutting-edge data visualisation work. You have certain services running on thousands of nodes and teams want to use our product to quickly find outliers and scan their dashboards with key metrics. This means you have potentially thousands of timeseries with thousands of data points on the screen at the same time. This is a JavaScript gig where you get to think about algorithms and performance on a daily basis. We're also an internal tool, so we have the option of targeting cutting edge, modern browser features. In reality it means 90% of your time is working on cool stuff and not on getting IE to work.<p>I think the biggest benefit of working on our product team is that you a level of autonomy which is hard to find on a user-facing product. So if you're the creative type who doesn't want to be micro-managed or told where to push those pixels, I think this is a really good gig.<p>Right now we're looking for experienced engineers for both infrastructure and product. Our infrastructure is JVM-based and written in Scala, with some Python. Our product is written in JavaScript and we have some Ruby to deal with. Knowledge of these platforms is beneficial, but solid experience and passion for this problem domain is even better.<p>A systems position: <a href=\"https://twitter.com/jobs/positions?jvi=ospeWfwL,Job\" rel=\"nofollow\">https://twitter.com/jobs/positions?jvi=ospeWfwL,Job</a>\nA dataviz position: <a href=\"https://twitter.com/jobs/positions?jvi=og12VfwY,Job\" rel=\"nofollow\">https://twitter.com/jobs/positions?jvi=og12VfwY,Job</a><p>The dataviz position doesn't accurately reflect the open rec we have for my team, so don't worry if you don't match the skills exactly.<p>I work on both infrastructure and product for the positions I described, so if you're interested you can send your resume to me directly at david @ dmclaughlin.com to speed up the process.<p>Also - we're hiring across the board at Twitter so also take a look at all open positions here: <a href=\"https://twitter.com/jobs\" rel=\"nofollow\">https://twitter.com/jobs</a>","time":1343842613,"type":"comment"}