{"by":"monstrado","id":4324919,"parent":4323597,"text":"Raleigh // Palo Alto // San Francisco<p>Cloudera<p>Cloudera Inc. is a Palo Alto-based enterprise software company which provides Apache Hadoop-based software and services. It contributes to Hadoop and related Apache projects and provides a distribution for Hadoop for the enterprise.[1] Cloudera has two products: Cloudera's Distribution including Apache Hadoop (CDH) and Cloudera Enterprise. CDH is a data management platform which incorporates HDFS, Hadoop MapReduce, Hive, Pig, HBase, Sqoop, Flume, Oozie, ZooKeeper and Hue and is available free under an Apache license. Cloudera Enterprise is a package which includes Cloudera's Distribution including Apache Hadoop, production support and tools designed to make it easier to run Hadoop in a production environment. Cloudera offers services including support, consulting services and training (both public and private).<p>- From Wikipedia: <a href=\"http://en.wikipedia.org/wiki/Cloudera\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Cloudera</a><p>Job Title: Customer Operations Engineer<p>Description:\nEver heard of Hadoop?<p>Cloudera is looking for a Customer Operations Engineer who has a passion for making customers successful. You will join a team of highly skilled engineers who are responsible for delivering Cloudera's support services including assistance during engineering and operations of distributed systems and mission critical response for production customers. Strong communications and troubleshooting skills are critical for success in this role.<p>At Cloudera, our goal is to make each individual feel valued for his or her contributions to the company’s mission. We are looking for smart people who want to do remarkable things. We strive to create an environment of casual intensity where people enjoy coming to work every day. Our senior management team meets regularly with the whole company to discuss strategy, successes and challenges.<p>Upon joining you will be given training in the Hadoop ecosystem, you will also pick an area that you plan to focus in...Such as databases NoSQL, RDBMS, Writing MapReduce, Machine Learning, etc.<p>What's it like to work at Cloudera?\n<a href=\"http://www.quora.com/Cloudera/What-is-it-like-to-work-at-Cloudera\" rel=\"nofollow\">http://www.quora.com/Cloudera/What-is-it-like-to-work-at-Clo...</a><p>Responsibilities:<p>* Ensure that critical customer issues are addressed  quickly and effectively<p>* Triage, diagnose and potentially escalate customer<p>inquiries during their engineering and operations efforts<p>* Investigate product related issues both for individual customers and for common trends that may arise<p>* Study and understand critical system components and large cluster operations<p>* Differentiate between issues that arise in operations, user code, third party libraries or product<p>* Manage the day to day interactions with our customers<p>* Identify requirements for additional focused services engagements<p>* Coordinate enhancement and feature requests with product management and Cloudera engineering<p>* Facilitate upgrades, patches and maintenance to customer systems<p>Qualifications:<p>* 1+ years deployment experience with a highly-scalable, distributed, multi-node environment (10+ nodes)<p>* 4+ years of Unix environment experience (Red Hat Linux) including shell scripting<p>* 2+ years software development experience in C++ or Java and Python<p>* Network monitoring and application instrumentation experience<p>* System performance debugging and kernel forensics experience<p>* Strong troubleshooting and performance tuning skills (TCP/IP, DNS, File system, Load balancing, etc)<p>* Understanding of Grid computing, MapReduce, advanced server clustering and distributed programming<p>* Systems monitoring and management for grid computing<p>* Provisioning and operating a large-scale compute/storage systems<p>* Excellent communication skills<p>Pluses:<p>* Active in the open source community<p>* In depth knowledge of Java<p>* Knowledge of file system, kernel and database internals – latency, throughput, reliability, availability, consistency, security, etc.<p>* Familiarity with the issues surrounding cross data center replication<p>* Strong knowledge of RDBMS concepts and SQL<p>* Concepts of KeyValue DB Stores<p>* Familiarity with virtual machine technologies<p>* Working knowledge of distributed file systems (development knowledge is a strong plus)<p>* Already familiar with the Hadoop ecosystem (HDFS, MapReduce, HBase, Hive, Pig, etc)<p>Apply:<p><a href=\"http://www.cloudera.com/company/careers/job/?jvi=oluMVfwg,job\" rel=\"nofollow\">http://www.cloudera.com/company/careers/job/?jvi=oluMVfwg,jo...</a><p>or<p><a href=\"http://www.cloudera.com/company/careers/\" rel=\"nofollow\">http://www.cloudera.com/company/careers/</a>","time":1343847780,"type":"comment"}