{"by":"zacwitte","id":4324856,"parent":4323597,"text":"=Real-Time Engine Software Developer=<p>Want to work on challenging, core technology with a smart team for a well-funded company in San Francisco?<p>We're PubNub, the real-time engine in the cloud that developers use to build massively scalable real-time apps. We've got hundreds of customers, and process billions of real-time messages each month. We develop software close to the bare iron and measure performance in microseconds. We are an all-star technical team who have been part of successful acquisitions in middleware, enterprise, and consumer software companies. We are looking for an exceptional developer to help lead our \"core\" engine development and future technology strategy.<p>Our ideal person is someone who lives and breathes code, and understands the difference between C, Python, and Javascript. You are someone who isn't a primadonna about a specific framework or tech. Someone cool to work with who's comfortable helping grow a business and works well with others.<p>=Responsibilities=<p>As a member of the PubNub \"Core\" team, you'll:<p>* Build enhancements to our platform that help prepare us for trillions of monthly transactions\n* Design migration strategies that provide zero downtime for users\n* Help build the architecture that meets the needs of our product roadmap beyond our core current feature set\n* Enhance our load testing methodologies to generate \"world-of-warcraft\" sized load on our system\n* Explore various hardware &#38; software strategies for milking the best performance out of various system configurations.<p>=Qualifications=<p>Great candidates will have:<p>5+ years of experience developing software on core technology frameworks in a high scale environment\nExpertise with C, Javascript, Python, Erlang, and other programming languages\nReal-time systems background, knowledge/experience with Node JS, Tornado, and other similar servers.\nB.S or M.S. in Computer Science<p>Learn More: www.pubnub.com/jobs","time":1343847159,"type":"comment"}