{"by":"dogas","id":4324397,"parent":4323597,"text":"Location: Philadelphia, PA, NYC, Washington, Seattle<p>PipelineDeals is seeking a Lead UI / UX Designer<p><a href=\"http://www.pipelinedeals.com\" rel=\"nofollow\">http://www.pipelinedeals.com</a><p>About PipelineDeals<p>Our team has been developing, delivering, and zealously supporting the PipelineDeals sales CRM solution for over six years. We’re passionate about creating software that people want to use and share. We love what we do, and we want our customers to love us for helping them close more deals.<p>We are looking to hire a lead UI/UX designer for our flagship product and future products. We’re interested in people who like to make a difference and will thrive in our culture, which revolves around our customers.<p>Responsibilities<p>* Actively think of creative solutions to complex user experience and design problems for new product features, as well as new products.<p>* Work collaboratively with business owners, development leads, and other stakeholders to take a design from concept to implementation.<p>* Produce design documentation (use cases, wireframes, flow diagrams, prototypes, etc.) required to implement design.<p>* Ensure implemented features match design and user interaction specifications.<p>* Standardize design elements and the user experience for our existing product and propose design improvements.<p>* Develop style guides, interaction pattern libraries and other design tools to provide structure, guidance and standards for new design projects.<p>* Use data, metrics and customer feedback to guide design-related direction and decisions.<p>Knowledge / Skills<p>* A good understanding of modern HTML and CSS (JS experience isn't required, but nice to have).<p>* Experience with information architecture, interaction models and user flows.<p>* Ability to work well individually, as well in a team\nWork with the product, project and business teams to create amazing user experiences.<p>* Balance creativity with consistency, while factoring in development efficiency and site performance when designing.<p>Education &#38; Experience<p>* A degree in either a design-related field or computer science preferred or equivalent work experience.<p>* A minimum of 3 years of professional work experience in the design and development of database-driven web products.<p>* A passion for transforming complex concepts and data sets into simple, intuitive, and aesthetically pleasing user interfaces and experiences.<p>Location<p>* Ideally, you will be based in the Philadelphia or surrounding areas.<p>* We will also consider candidates New York, or Washington D.C. or Seattle metro areas.<p>* Remote work will also be considered for the right candidate.","time":1343842823,"type":"comment"}