{"by":"zacwitte","id":4324864,"parent":4323597,"text":"=Full Stack Software Developer=<p>Interested in working on huge multiplayer real-time systems?<p>We're PubNub, the real-time engine in the cloud that developers use to build massively scalable real-time apps. We've got hundreds of customers, and process billions of real-time messages each month. We develop software close to the bare iron and measure performance in microseconds. We are an all-star technical team who have been part of successful acquisitions in middleware, enterprise, and consumer software companies. We are looking for an exceptional developer to use creative thinking and some raw innovation to drive the development of multiple aspects of the PubNub platform and tools.<p>Our ideal person is someone who can jump easily from a Javascript-based UI to the back-end server code that powers it. Someone that can build a clean interface that is quick and hides unneeded complexity, and is equally comfortable building the server-side code to support it. You are someone who isn't a primadonna about a specific framework or tech. Someone cool to work with who's comfortable helping grow a business and works well with others.<p>=Responsibilities=<p>As a PubNub full stack developer, you'll be driving the architecture and design of various next-gen elements of PubNub.<p>Come talk to us and we'll tell you more...<p>=Qualifications=<p>Great candidates will have:<p>* 3+ years of experience developing software that is end-user facing (enterprise or consumer)\n* Expertise with Javascript, Python, PHP, and other programming languages\n* Experience with web, mobile, and server-side development\n* B.S or M.S. in Computer Science...or just impress us by nailing our programming challenge below:<p>Learn More: www.pubnub.com/jobs<p>Apply by sending us some code that uses PubNub to create a creative \"Hello World\" real-time application. A resume would be nice too. We promise that everyone who applies and includes working code will get a response.","time":1343847239,"type":"comment"}