{"by":"gustaf","id":4324450,"kids":[4324562],"parent":4323597,"text":"Voxer<p>We launched Voxer in 2011 and have since become one of the fastest growing voice applications in the world. What we've built is already an important part of the daily lives of millions of people.<p>We're a surprisingly small team doing this. Only about a dozen engineers who previously worked at Danger, Android, Apple &#38; Twitter. We helped build things like redis for node.js and are contributors to the node.js community. Voxer is built using node.js, Riak and Redis.<p>- - - - - - - - - - - - - - - - - - - - - - - -<p>San Francisco, CA - Hadoop Engineer<p>We are solving really hard problems at massive scale with Node.js, Riak, Redis and run on Joyent Cloud.<p>We are generating a lot of data in the process - more than 25 billion events every day. We just jumped into the Hadoop ecosystem and are running our own cluster which processes terabyte. If you love working on these kinds of problems, get in touch and maybe we can figure them out together.<p>You'll get to work on:<p>* Help scale and develop our Hadoop cluster.<p>* Understand the patterns of groups, billions of messages with location data and social graph patterns.<p>Some of the things we look for are:<p>* Some formal education in Computer Science or equivalent, but the exact degree or number of years of professional experience you have isn't as important as your enthusiasm and ability.<p>* If half of your resume talk about animal-named systems you're probably the right person for the job<p>* You’re interested in how we can better understand what drives our user growth and user engagement and we can engineer the product to increase it.<p>* Hadoop experience We are starting to incorporate these technologies into our operations<p>* Experience working with Hive, Pig or Hbase<p>* Thorough understanding of statistical analysis.<p>Apply: <a href=\"http://voxer.com/jobs\" rel=\"nofollow\">http://voxer.com/jobs</a><p>- - - - - - - - - - - - - - - - - - - - - - - -<p>San Francisco, CA - Web/Integration Engineer<p>Lead Engineer for new business unit<p>Voxer is hiring a lead engineer for this new business unit. You will help to define the enhancements needed across the board to support enterprise use of Voxer. You will then lead the implementation of those enhancements.<p>You'll get to work on:\n* Building a new division from the ground up<p>* Cutting-edge command-and-control systems that will help IT managers keep track of thousands of devices and users e-commerce and billing platforms of Apple, Google, Amazon, eBay, and others<p>Some of the things we look for are:<p>* Formal education in Computer Science or equivalent, but the exact degree or number of years of professional experience you have isn't as important as your enthusiasm and ability<p>* You have probably worked on large enterprise systems and \nknow the pressure of delivering against tight SLAs<p>* Conversant and comfortable interacting with clients' engineers to understand market needs, train in using our systems, and provide general support<p>* Experience with Node.js, Riak, and Redis is helpful but not a requirement. These are the technologies we depend on every day.<p>Apply: <a href=\"http://voxer.com/jobs\" rel=\"nofollow\">http://voxer.com/jobs</a>","time":1343843197,"type":"comment"}