{"by":"mtoledo","id":4325070,"parent":4323597,"text":"REMOTE - <a href=\"https://jobs.github.com/positions/0689bd52-cd05-11e1-81ec-c98c46dd995d\" rel=\"nofollow\">https://jobs.github.com/positions/0689bd52-cd05-11e1-81ec-c9...</a><p>Replay Gaming is a UK based social gaming company looking for a full-time Senior Ruby/Rails developer to help us grow our play money poker site. We are a small team of highly technical and experienced developers geographically distributed working with Campfire, Pivotal Tracker and GitHub.<p>Replay Poker is an established play money poker site with big ambitions to grow substantially over the next 12 months.<p>About us<p>*  We’re incredibly small, so you’ll have a huge impact on the decisions and the work being done<p>*  We all work remotely, 100% of the time. Work from wherever you are most productive<p>*  We work both on a web application and on a ruby multi-threaded tcp (poker) server<p>You should<p>*  Have 3+ years of ruby web application development experience or comparable experience<p>*  Know database and concepts like transactions, locks, ACID, CAP and eventual consistency<p>*  Be familiar with ruby and rails internals, specially active record, threads and garbage collection<p>*  Know concurrency paradigms like threads, events and the actor model, and their tradeoffs<p>*  Be extremely comfortable with BDD and TDD<p>*  Contributed to open source projects<p>*  Be opinionated about object oriented design<p>*  Have excellent english language skills<p>Ideally you<p>*  Have professional experience working remotely<p>*  Know the differences between the multiple ruby interpreters and tradeoffs<p>*  Worked with non-web app servers<p>*  Know details about networking programming and TCP/IP<p>*  Scaled services horizontally<p>*  Know when to and when not to move relational data to non-relational counterparts for scalability purposes<p>*  Worked on social real-time games<p>*  Enjoy playing poker!<p>What we offer<p>*  Plenty of autonomy for you to work the way you think you’re most productive<p>*  A flexible process with the focus on efficiency of working with minimal bureaucracy<p>*  A mixture of a fun and challenging project working on a real-time game about to face scaling challenges<p>*  Competitive salary (negotiable and depending on experience/skills)<p>Send an email with the subject of Senior Ruby Developer to jobs[@]replaypoker.com. Please include your resume and hourly rate expectation.","time":1343849197,"type":"comment"}