{"by":"ryen","id":4326251,"parent":4323597,"text":"Coffee Meets Bagel - San Francisco, CA. Full time - Lead Python/Django web developer<p>Coffee Meets Bagel ( <a href=\"http://coffeemeetsbagel.com/jobs/\" rel=\"nofollow\">http://coffeemeetsbagel.com/jobs/</a> ) is a new innovative online dating startup making waves in New York and Boston and looking to expand to the west coast soon. We've recently been featured in TechCrunch, Glamour, BostInno, and several other major blogs and publications.<p>About the Job: We're looking for a lead Python/Django web developer to join our early stage team and lead our engineering team as we scale our service in terms of geography and users, apply machine learning techniques to our algorithms, refine our revenue model, and continue to keep our customers happy. You will have an opportunity to work with and learn from a highly experienced technical advisor and great engineers. This is a market with huge opportunity and we will look to you for best practices around architecture, deployment and scaling the service to millions of people.<p>Requirements: - 2+ Years of Python development experience with some knowledge of Django or similar web frameworks. You will be able to contribute to our Django code base from Day 1. - A strong knowledge of the fundamentals of networking, operating systems, and security. - A Bachelors Degree in Computer Science or Computer Engineering or related discipline from a 4-year program. - Agile. Intelligent. Creative. Problem-solver. Startup lover. You like finding and working with outstanding engineers and want to help us build an awesome engineering team.<p>Bonus: - Experience building back-end systems on a high-traffic, low-latency web site. - Knowledge in Machine Learning/Graph Theory/Large-scale Data Analysis is a plus - Experience working with, and contributing to open source software projects is a plus—show us your github account or other online projects if available.\n*Also looking for engineering interns, front-end developers, and marketing/PR intern. <a href=\"http://coffeemeetsbagel.com/jobs/\" rel=\"nofollow\">http://coffeemeetsbagel.com/jobs/</a>","time":1343862223,"type":"comment"}