{"by":"ca98am79","id":4330855,"parent":4323597,"text":"wizehive.com  - Philadelphia - full time/REMOTE<p><i>UX Designer / Front End Developer</i><p>WizeHive is looking for that ideal developer that loves design and is thoughtful about user experience. Applicants should be well rounded in frontend techniques such as HTML(5) and CSS(3), with an interest in multiple projects. The winning candidate will get excited about designing a great product and be able to ignite that enthusiasm in others.<p>Every member of our team balances vision, client requests and maintenance. As a startup, we listen to great ideas and implement those ideas quickly. We work under tight deadlines and stay focused on bringing a great product to market.<p>Required Skills<p><pre><code>    Strong HTML knowledge\n    Thorough understanding of CSS styling\n    Experience with version control systems, for example, Git\n    Comfortable in startup environments, wearing multiple hats\n    Self-directed, excellent communicator and proactive\n\n</code></pre>\n<i>Back End Developer</i><p>WizeHive is looking for all levels of PHP developers to join our team. The winning candidates will have proven experience developing data-driven web solutions on PHP frameworks (ideally CakePHP, but if you love to code, we’re interested, regardless).  The candidate will be comfortable working with and maintaining other people’s code, as well as developing projects from the ground up.<p>Required Skills<p><pre><code>    2-3 years experience developing websites with a combination of PHP/MySQL, HTML, CSS, JavaScript and JQuery.\n    Experience working with rapid development frameworks\n    Comfortable in a startup environment with strong problem solving skills\n    Comfortable working with Agile Method practices\n    Experience working with APIs\n    Flexibility to juggle multiple projects and deadlines with changing priorities\n    A communicating team player\n    Excellent attention to detail and ability to QA own work\n\n</code></pre>\nNice to have\nMobile website development\nServer management and load-balancing experience<p><i>QA Analyst</i><p>Quality assurance is vital to the happiness of our clients. As the QA Analyst, you will be responsible for auditing the quality of our newly created projects.The winning candidate will be able to perform Quality Assurance on projects and products, work with technical lead to define QA standards and assist with documentation of existing features via an internal &#38; external knowledgebase<p>Required Skills<p><pre><code>    Experience testing in an Agile environment\n    Experience writing and executing application test strategies, test plans, test cases, test scripts and test completion reports.\n    Bug tracking and reporting skills\n    Excellent written and oral communication skills\n    Relaxed team player who is comfortable in a startup environment</code></pre>","time":1343939765,"type":"comment"}