{"by":"GoPago","id":4331593,"kids":[4344366],"parent":4323597,"text":"San Francisco | GoPago | H1B OK<p>Who we are: GoPago is fighting the crime of long lines! Our service allows customers to browse, order from, and pay local restaurants and  businesses - all from their phone (with the added bonus of skipping any infernal line they come across!). We're working on a lot of challenging problems and trying to bring the simplicity of our service to the masses. Come help us revolutionize mobile payments!<p>We're looking to hire for three senior technical positions - all candidates should have a solid technical background with demonstrable experience in their area of focus. All candidates should have, at minimum, a bachelors degree in computer science or comparable experience. We're an Agile shop, so a passion for Scrum'ing it up is a plus. You, like our engineers, should take pride in writing quality code, learning from experts, and blazing a new path.<p><i>Senior Android Engineer</i><p>Responsibilities: As a leader in our Engineering team, you will be responsible for developing and enhancing\napplications for Android devices. Working with a team of mobile engineers, your expertise in\ndeveloping efficient and elegant applications that consumers enjoy using will be raised to its\nhighest level.<p>Requirements:\n* Hands-On (Good software engineering experience of 7+ years, Coding for more than 2+\nyears - knowing multiple versions/devices &#38; Android versions/devices and REST API’s)\n* Self managed and able to manage Jr/Mid-level engineering talent\n* Experience of working in teams &#38; communicate/report to Leads/Architects/\nManagement or Customers\n* Building mobile applications with heavy emphasis on user experience and ease of use\n* Collaborate with product management and to be able to explain internals in Business\nterms<p><i>Rails Technical Lead</i><p>Responsibilities: As the senior backend engineer, you will design and implement extremely high-volume, fault\ntolerant, scalable server systems. You will work closely with the team to design, implement and\niterate features quickly and efficiently.<p>Requirements:\n* Leadership experience in progressively complex Ruby On Rails development with working\nexposure to Rails 3.X\n* Expert level of experience in RoR-testing frameworks (Cucumber, RSpec, Selenium)\n* Strong knowledge of MySQL5\n* Experience with Amazon Web Services (EC2, RDS, S3) highly desired\n* Experience building large-scale server applications and reliable software\n* Five to ten years programming experience as a hands on Lead or Architect<p><i>Lead iOS Developer</i><p>Responsibilities: As the senior member or our iOS engineering team, you will review product requirement\ndocuments and help implement design products from inception. Your leadership skills for Apple\ndeployment processes, including credentials, adhoc builds and provisioning profiles will be\ncritical in this role. You will be the \"go to\" engineering lead for all development on iOS.<p>Requirements:\n* Implementation of specifications in Objective C/C++ for iOS\n* iOS mobile development using Cocoa\n* Write specifications and documentation for API's\n* A minimum of seven years as a software developer developing mobile applications\n* A minimum of three years iOS mobile applications development<p><i></i><i></i>*\nInterested? Send your resume to mitchell@gopago.com and we'll be in touch ASAP.","time":1343949548,"type":"comment"}