{"by":"JimiofEden","id":8681824,"parent":8681040,"text":"Nimblelight - Philadelphia, PA<p><a href=\"http://nimblelight.com/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;nimblelight.com&#x2F;jobs&#x2F;</a><p>BACK END DEVELOPER<p>We’re looking for a back end programmer with a solid foundation in web development. The ideal candidate is excited about technology, can control website functionality with PHP or .NET, wrangle servers into line with SQL, and communicate with the front end via AJAX. This is a full-time position.<p>QUALIFICATIONS<p>– An insatiable appetite for learning<p>– A show-off with PHP, C#, or any other major language<p>– Strong opinions on frameworks, file structures, and optimal solutions<p>– Fluency in system and server administration and troubleshooting<p>– Working knowledge of AJAX and back-end --&gt; front-end flow<p>– Familiar with cross platform testing, devices and browsers<p>– Experience with version&#x2F;source control (Subversion, SVN, Git, etc.)<p>– Working knowledge of programming best practices<p>------------------------------<p>DESIGNER &#x2F; FRONT END DEVELOPER<p>We&#x27;re looking for a designer and front-end developer with a strong desire to bridge the gap between art and code. The ideal candidate has experience creating clean, responsive mockups, is a show-off with HTML&#x2F;CSS, and understands how people use technology. Please include a link to your portfolio when applying. This is a full time or part time position.<p>QUALIFICATIONS<p>– An insatiable appetite for learning<p>– Strong visual aesthetic<p>– Awareness of contemporary design and UX trends<p>– Sharp problem-solving skills<p>– Ability to adapt and thrive in various roles<p>– Proficient in Photoshop CS5 or higher<p>– Experience coding websites with HTML, CSS, and Javascript&#x2F;JQuery<p>– Ability to identify what constitutes a brand<p>– Professional and confident<p>------------------------------<p>BENEFITS<p>- Competitive Salary<p>- Comprehensive Healthcare Plan<p>- Company lunch and happy hours<p>- Gorgeous working environment<p>- Paid time off for holidays<p>- Paid sick or personal days<p>- Every day is &quot;Casual Friday&quot;","time":1417450811,"type":"comment"}