{"by":"BWStearns","id":8681178,"parent":8681040,"text":"Human Condition Safety (NYC, no remote)<p>Human Condition Safety (HCS) seeks a developer to work on using embedded systems and data analysis to radically improve industrial safety. We’re bringing data driven decision making and analytics to an industry that’s been around about as long as human civilization.<p>Given the breadth of the system, &quot;Full Stack&quot; is probably an understatement so we’re calling it a Full Stack+ until we come up with something better. Our system involves wearable devices, field deployed base stations and radios, cloud servers, standard browser front ends. It could possibly end up with Unity native frontends, feedback through the wearables, more sensors for inanimate objects, radio analysis, etc. We will be looking into bringing in additional data from existing APIs around the web as well as some more interesting places, i.e. let’s make a crane talk to our servers.<p>You will have the opportunity to work with a variety of databases, embedded systems, web, native, and embedded user-interfaces, and more. Clearly one developer is not going to know every language and technology we end up using from day one. This means that there will be a lot of learning on the job and plenty of room for influencing architecture and technology choices.<p>About the Environment<p>We have one developer (the guy writing this) and one hardware engineer (the CEO) at the moment so you will be joining a very early team. Our customers are companies and there are a bunch of wonderful folks working on the business side getting us very impressive partners and interesting sites to beta test and develop the product with.\nWe will be handling very high volumes of data very early on and so the quality threshold of certain parts will be higher than that of most early stage systems. Even though are moving fast we will also be building our processes and culture and we’re looking for someone who is excited to help us do that.<p>Responsibilities<p>Building and expanding our distributed service-oriented&#x2F;API-driven architecture Coding the wearable tech and base stations Scaling our data collection capabilities Helping build and expand our analytics and event engine Many, many other things\nTechnical Skills&#x2F;Minimum Requirements\nThe ideal candidate must meet the following minimum requirements:<p>You are fluent in Python, Ruby, or another scripting language. Ideally you are a polyglot. We will be making web interfaces so of course JS&#x2F;HTML&#x2F;CSS skills are required. You know or are not afraid to get to know C&#x2F;other low level languages. You have used relational databases, and at least have looked into some non-relational database. Column oriented database experience a plus! You have used MVC frameworks before (Django&#x2F;Rails&#x2F;Laravel&#x2F;etc), and have used at least one Javascript framework. You enjoy writing clean readable code and don&#x27;t mind getting rid of old code when it&#x27;s the right thing to do. You haven&#x27;t used some_random_technology? Great! We&#x27;ll likely be using a lot of that. This means you don&#x27;t mind reading docs and source code and learning quickly. Version control is a must. We use Git.<p>Important Non-tech Factors<p>You live in NYC or would if the job is interesting enough. An experimental mindset and a curiosity for all tech interesting. Good communications skills and personal accountability are a must. When things go wrong, tell people and fix them. As the team expands we will do some light code-review to mitigate the bus-factor. Experience working in a startup is a plus.\nTechnical Nice-to-Haves (not required in any sense but might come in handy&#x2F;be interesting)<p>Working with&#x2F;messing around with Unity or other gaming&#x2F;3D engines. Prior experience with Arduino&#x2F;other hardware prototyping. Experience with hardware&#x2F;EE. Familiarity with Machine Learning.<p>Don&#x27;t hit all the bullet points? Apply anyways, it would be totally unreasonable to expect someone to have all of the above, we&#x27;re really more concerned about finding smart devs who think this sounds like a really interesting project. Please include any portfolio site&#x2F;github&#x2F;etc. and send info to brian@humanconditionglobal.com","time":1417444906,"type":"comment"}