{"by":"azth","id":8681333,"kids":[8681405],"parent":8681040,"text":"Exabeam (<a href=\"http://exabeam.com\" rel=\"nofollow\">http:&#x2F;&#x2F;exabeam.com</a>) -- SAN MATEO, CA, Fulltime<p>Web Front-End Developer<p>-----------------------<p>You will be responsible for designing and implementing the user interface for a brand new data processing system to detect advanced security threats using the latest stream processing and machine learning techniques.<p>You’ll be architecting and implementing the user interface and middle tier for the first generation of our service and you will be the foundation of our web engineering team. You will work with all parties in the company to define and provide a powerful yet simple and intuitive user interface that will be one of the key differentiators of the product.<p>You are a strong software engineer who is passionate about building elegant, simple, and stick user interfaces to delight customers. You care about producing clean, elegant, maintainable, robust, well-tested code; you enjoy collaborating with others to come up collectively with the best possible solution. You have experience with performance, scalability, and reliability issues of large 24x7 systems.<p>QUALIFICATIONS<p>--------------<p>* Solid programming experience designing and writing well organized, clean, and extensible code<p>* Experience with some modern front-end technologies that build Rich Internet Applications using JavaScript, CSS, HTML5<p>* Ideally experience using JQuery, backbone.js, underscore.js<p>* Appreciation for high quality user interfaces and interest in user interaction<p>* Self-motivated, detail-oriented and strong analytical &#x2F; problem solving skills<p>* Bachelor&#x27;s Degree in computer science or equivalent experience<p>About Exabeam<p>-------------<p>About Us: Exabeam is a big data security analytics company that is unlocking the potential of existing logs to fundamentally change the way cyberattacks are detected and greatly simplify security operations.<p>Our founding team consists of seasoned security and enterprise IT veterans from Imperva and Sumo Logic. We just recently completed a Series A round of $10M privately funded by Norwest Venture Partners, Aspect Ventures and Investor Shlomo Kramer (Founder of Check Point Software, Co-founder &amp; CEO of Imperva, Founding Investor of Palo Alto Networks &amp; Trusteer).<p>If you are interested, please send an email to ziad@exabeam.com","time":1417446091,"type":"comment"}