{"by":"theflyingkiwi42","id":8681600,"parent":8681040,"text":"Senior Dev&#x2F;Ops Engineer (REMOTE, FT)<p>We are looking for someone to join our team to help develop, build, and maintain our product, with just enough Ops work to keep everything running smoothly. If you’re passionate about performance and reliability, we&#x27;d love to chat!<p>17hats is an online service designed to help tame the chaos of running a small business by combining invoicing, customer quotes, contracts, to-do lists, client contacts, bookkeeping and more into one easy-to-use app. Rather than repeat all the stuff that makes 17hats so nifty, head on over to our website and check it out: <a href=\"http://www.17hats.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.17hats.com</a><p><pre><code>  Dev Skills:\n  - As much JS as possible (Knockout, Sammy, jQuery, etc)\n  - As much Perl as possible (Moose, DBIC, Plack, etc)\n  - HTML, REST, JSON, etc\n  - Excellent debugging skills\n\n  Ops Skills:\n  - EC2, OpsWorks\n  - Enough Chef to keep things running\n  - A bit of Ruby helps\n  - All the usual Linuxy things: bash, postfix, apache, proftpd, mysql, memcached, beanstalkd, perl, git\n\n  Other Skills:\n  - Jedi Mind Trick (naturally)\n  - Invisibility (just for fun)\n  - Vulcan Nerve Pinch (in case things get dicey)\n  - Cooking a perfect Beef Wellington (a man&#x27;s gotta eat!)\n  - Knows the airspeed velocity of an unladen swallow (if you have to Google it, it doesn&#x27;t count)\n\n  Personality:\n  - Simplicity enthusiast &#x2F; problem solver (find the simplest solution to a problem)\n  - Greater good &#x2F; no ego (what&#x27;s best for the team, not for personal gain)\n  - Sense of humor (the glue that keeps us working together harmoniously)\n  - Humble &amp; open minded (always open to new ideas and approaches)\n  - Customer-centric (loves to help customers and others)\n  - Positive &amp; friendly (shows kindly interest and goodwill)\n  - Self directed &amp; dependable (trusted to provide what is needed without being managed)\n  - Empathetic (ability to understand and share the feelings of others)\n</code></pre>\nAbout Us:\nWe are a small team of good-hearted folks with families, working really hard on a product that we&#x27;re very excited about. We&#x27;re committed to staying small and nimble, and we have this crazy belief that there are other good-hearted people out there willing to help us get a fair shot against the big corporate players. We hope that resonates with you.<p>Working at 17hats means you&#x27;re collaborating with other A-players, so you won&#x27;t have to waste time with incompetent nincompoops. You&#x27;ll have the autonomy to direct your own work without being micromanaged. You&#x27;ll have the opportunity to flex your technical muscularity while building on your already impressive skillset. And you&#x27;ll be instrumental in dramatically improving the lives of self-employed people everywhere -- if you&#x27;re like us, these people are your friends and family, and they need our help.<p>Everybody on our team works remotely (US, Canada, and Europe) so where you live doesn’t really matter. That being said, we do need someone who can work California business hours (9am-6pm PST) and who is available for emergencies at night. Our CTO resides in Europe and would like a good night’s sleep! Bonus points if you can curse in Dutch. Even more if you can do it in Canadian.<p>How to apply:\nDoes this sound interesting? If so, please send a short email to jobs@17hats.com telling us about yourself and attach a resumé. Let us know what you can contribute to the team. We&#x27;d love to hear from you.","time":1417448683,"type":"comment"}