{"by":"ashleyjohn","id":8681175,"parent":8681040,"text":"Academia.edu | SF | Product Designer<p>We&#x27;re building an Open Science platform to bring the world&#x27;s research online and available to all for free. We’re seeking intuitive Product Designers who can see beyond our current execution. Product Design will be instrumental in shaping the future of our product and company.<p>You’ll work directly with the CEO and VP of Product to create features from concept to execution. You’ll also with our talented team of 12 Engineers to build features for our community of 15,831,966 researchers.<p>Your Role as a Product Designer<p>-Conceptualize &amp; define product strategies with our CEO &amp; VP of Product<p>-Shape our Product Development process by developing and maintaining visual and experience design standards<p>-Elevate the existing product by creating interaction flows, beautiful interfaces, and our UI Kit<p>-Work on an exciting private beta feature that is changing the way academics discuss research<p>-Receive &amp; provide design criticism<p>-Qualitatively and quantitatively test features with our Engineering team<p>You Should Have<p>-An online portfolio that illustrates your professional experience designing web applications<p>-Visual &amp; experience design expertise<p>-A mastery of UI design tools such as Photoshop or Sketch<p>-The ability to apply your knowledge to solving extremely difficult UI challenges for millions of users<p>-A desire to take advantage of our unlimited budget for professional development by constantly learning and growing<p>It’d be Awesome to Have<p>-Front-end development experience. HTML &amp; CSS would be great for prototyping. JavaScript experience would be amazing. -<p>-Back-end experience would drop our jaws.<p>-Management or hiring experience. You’ll be one of our first designers so being able to grow and lead a team would make you the ultimate unicorn.<p>-Mobile design experience.<p>How to Apply<p>Email your Dribbble profile or portfolio along with your LinkedIn profile or resume to product@academia.edu","time":1417444891,"type":"comment"}