{"by":"kedargj","id":8681236,"parent":8681040,"text":"McKinsey Digital Labs (part of McKinsey &amp; Co) - San Francisco, New York City.<p><i>We’re looking for Architects, Full Stack Engineers and Front End Developers.</i><p>—————ABOUT MCKINSEY DIGITAL LABS————————<p>McKinsey Digital Labs is the in-house client focused digital delivery group of McKinsey &amp; Company. MDL combines user-centered design with unparalleled business knowledge and world-class agile development skills to deliver impactful digital experiences. We are a team of passionate designers, architects and developers solving tough problems for our clients.<p>We deliver service design concepts, experiential prototypes and production-ready apps to transform our client’s businesses. Despite being part of a large, multinational organization, MDL works more like a small startup company.<p>—————————<p>We’re looking for ARCHITECTS and FULL STACK ENGINEERS.<p>Role\nAs a Software Architect at McKinsey Digital Labs, you will be involved in leading agile implementation and transformation projects at Fortune 500 companies.  You will be a core member of the McKinsey consulting team with responsibilities that range from shaping and implementing strategic products to ensuring that McKinsey’s craft stays on the leading edge of technology.<p>Do you have a real passion for software development? You should have contributed to open source projects, have participated in some technical community or interest group or have written or spoken in public about their technical ideas. Despite having experience, you should continue to be an active learner - tinkering with new open source libraries, using unfamiliar technologies without a lot of supervision and learning new languages in your spare time, etc. Lastly, we’re looking for someone with a strong understanding of key Agile engineering practices to guide senior client IT leaders on improvement opportunities in their engineering practices.<p>Do you have the passion and experience to…?<p><pre><code>   -Build consumer quality products, enabling business capability and objectives through technology.\n   -Develop applications using any of the following technologies: XML, Javascript, Oracle, MySQL, Ruby on Rails, .Net, Java, UNIX, HTML, CSS, Perl, or PHP\n   -Infrastructure knowledge including Single Sign On, LDAP, LAMP, Search Technologies\n   -Experience of engineering practices such as code refactoring, design patterns, design driven development, continuous integration, building highly scalable applications, application security\n   -Knowledge of Agile software development process.\n   -Familiarity with performance metric tools\n\n</code></pre>\nIn your work do you…?<p><pre><code>   -Develop creative and efficient solutions for business problems.\n   -Enjoy and get energized by complex problem solving and are able to push for innovative solutions.\n   -Have excellent communication skills with the ability to influence senior client business and IT executives on technology decisions.\n   -Demonstrate excellent leadership skills and enjoy teaching&#x2F;mentoring others.\n   -Work under pressure, manage client expectations effectively and not get overwhelmed by client pressures on team.\n   -Have customer focus and a quality mindset.\n   -Manage your own learning and contribute to functional knowledge building of the team.\n   -Thrive independently and in various team settings.\n</code></pre>\nWe are committed to having a meritocratic and transparent hiring process.<p>In order to proceed to the next stage of the interview process, we want to make sure that you are genuinely excited about McKinsey Digital Labs and are able to solve the types of challenges we face.<p>If you are, please do apply by taking one of the below challenges so that the managers at McKinsey can evaluate your key competencies before the interview.<p><a href=\"https://www.gapjumpers.me/questions/mckinsey-digital-labs/qs-157/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gapjumpers.me&#x2F;questions&#x2F;mckinsey-digital-labs&#x2F;qs...</a><p><a href=\"https://www.gapjumpers.me/questions/mckinsey-digital-labs/qs-161/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gapjumpers.me&#x2F;questions&#x2F;mckinsey-digital-labs&#x2F;qs...</a>","time":1417445313,"type":"comment"}