{"by":"jason_dstillery","id":8681502,"parent":8681040,"text":"Dstillery - NYC, New York<p>Dstillery is hiring Back-end and Full-stack Engineers!<p>We&#x27;re on Crain&#x27;s Best Places to Work in NYC list and Forbes&#x27; America&#x27;s Most Promising Companies list. We play Ultimate or Soccer on Fridays, we have a company band, game nights, and regular lunch-and-learns and dev seminars where we talk tech and learn from each other. We prefer getting work done to punching a clock, so we keep sane hours and don&#x27;t track vacation.<p>Join us, and you&#x27;ll gain deep experience developing systems at scale, you&#x27;ll work with a world-class data science team (winners of multiple KDD Best Paper and other awards) that keeps us on the cutting edge of machine learning research, and you&#x27;ll gain direct exposure to the ins and outs of the rapidly growing and evolving adtech industry.  We&#x27;re still pretty small on the engineering team, and everyone gets their hands dirty and makes a real impact.<p>We write mostly Java, but we&#x27;ve got some C++, Python, and Clojure as well. Hadoop&#x2F;Yarn, Cassandra, Mongo, and Kafka are big parts of our stack, and we&#x27;re always looking for new tech that helps us work at scale.  Experience with these is a big plus, but if you&#x27;ve never used them before that&#x27;s fine too, if you&#x27;re eager to learn. If you write clean, tested, working code, think through problems, and deliver on time, we want to talk to you.<p>Contact me for more info, jason@dstillery.com, or apply:<p>Senior Software Engineer:  <a href=\"https://boards.greenhouse.io/dstillery/jobs/36447\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;dstillery&#x2F;jobs&#x2F;36447</a><p>Software Engineer:  <a href=\"https://boards.greenhouse.io/dstillery/jobs/11316\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;dstillery&#x2F;jobs&#x2F;11316</a><p>Unfortunately we are not hiring interns or remote at this time.","time":1417447755,"type":"comment"}