{"by":"Synergyse","id":8681160,"parent":8681040,"text":"Synergyse &#x2F;&#x2F; Software Engineer &#x2F;&#x2F; Toronto, Canada &#x2F;&#x2F; Local or Remote &#x2F;&#x2F; Fulltime &#x2F;&#x2F; <a href=\"http://synergyse.com\" rel=\"nofollow\">http:&#x2F;&#x2F;synergyse.com</a><p><a href=\"https://careers.stackoverflow.com/jobs/61050/software-engineer-synergyse\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;61050&#x2F;software-engine...</a><p>Synergyse creates highly interactive and measurable cloud training, adoption and productivity tools. We started by teaching everyone how to use Google Apps proficiently and it worked really well. We are working on hard problems in big data, HTML5, media delivery and real time technology. Our backend technology and web runs on the Google App Engine. Our frontend uses the Chrome Extension, jQuery, Google Closure. We use some of the latest technologies across the board!<p>Synergyse is based in Toronto and we managed to be profitable within a couple of months of starting it. Our clients tend to be in the enterprise and education world, but our technology is consumer facing and fun. It’s the best of both worlds. We are seeking a highly talented Software Engineer who&#x27;s able to take on and deliver important parts of the software to users.<p>Why you should join us<p>• Ability to define product and engineering as one of our first hires<p>• Work with a highly motivated and talented founding team Be a part of a business that has a good business model, good revenue stream, and makes flagship technology<p>• Flexible and casual work environment with opportunity to work remotely<p>• Competitive compensation ($100k-$200k), equity (0.5%-1.5%) and full benefits<p>What we’re looking for<p>• Software Engineer with a full-stack experience<p>• Experience with cloud technologies (GAE, AWS, or Azure)<p>• Experience with Javascript (experience with Chrome Extensions is a plus)<p>• Ability to solve difficult technical problems<p>• Ability to lead and run projects<p>• Degree in Computer Science or equivalent, or 4+ years of professional engineering experience<p>Synergyse is on a mission to help organizations improve productivity through the cloud, our interactive training system for Google Apps is deployed in over 2000 schools and businesses around the world, supporting over 2 million end-users. Join our team of ex-Google engineers and learn what it takes to run a B2B business focused on the enterprise and education markets.<p><a href=\"https://careers.stackoverflow.com/jobs/61050/software-engineer-synergyse\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;61050&#x2F;software-engine...</a>","time":1417444774,"type":"comment"}