{"by":"diggan","id":8681280,"parent":8681040,"text":"Typeform.com - Barcelona, Spain - Frontend&#x2F;Backend developer (also other positions, check out the link in the bottom)<p>Typeform is creating new ways to create forms on the web. We are heavily focused on great UX with the user in mind and we’re now looking for the best developers we can find us to help us build a scalable and maintainable front and backend.<p>As an engineer at Typeform, you should have a solid understanding of software architecture and design patterns. You should know OOP from the inside out and would be great if you have a strong desire to innovate, learn about new technologies and be ready to take a part in the building of the product.<p>As a front-end engineer at Typeform, you would be responsible for creating and innovating on every cornerstone in the front-end platform at Typeform.<p>As a back-end, you will need to be able to build and design large scale applications for our platform to support millions of form responses and provide realtime information analysis.<p>Read some stuff about what we done lately:<p>Online Survey And Form Builder Typeform Raises €1.2M - <a href=\"http://techcrunch.com/2014/09/23/typeform-raises/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2014&#x2F;09&#x2F;23&#x2F;typeform-raises&#x2F;</a><p>Getting real survey answers out of smart, busy people - <a href=\"https://medium.com/@mia/getting-real-survey-answers-out-of-smart-busy-people-778f5a98e4c6\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;@mia&#x2F;getting-real-survey-answers-out-of-s...</a><p>Typeform Makes Web Forms Interesting Again - <a href=\"http://techinch.com/blog/Typeform\" rel=\"nofollow\">http:&#x2F;&#x2F;techinch.com&#x2F;blog&#x2F;Typeform</a><p>Apply here: <a href=\"https://jobs.typeform.com/to/e7NNgU\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.typeform.com&#x2F;to&#x2F;e7NNgU</a><p>Or contact me directly at victor@typeform.com if you have any questions before applying.","time":1417445665,"type":"comment"}