{"by":"samuelbrin","id":8681566,"parent":8681040,"text":"Robinhood - <a href=\"https://www.robinhood.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.robinhood.com</a> - Palo Alto, CA<p>Robinhood is a mobile-first stock trading platform that opens up the markets to a new wave of investors.<p>We build our systems to scale to an unprecedented number of accounts. That means employing a wide range of distributed systems within a complex financial landscape.<p>Making Robinhood simple, focused, and immediately understandable is hard work. Our product engineers don&#x27;t just push code, they make product decisions that are held to the highest standards of usability and aesthetics.<p>* iOS Engineer - We’re looking for an experienced iOS engineer to help build the Robinhood iOS app, for both iPhone and iPad. This is truly a next-generation trading app that takes advantage of all the newest iOS 7 and 8 features, while featuring a highly custom UI. (Objective-C, UIKit, RestKit, Cocoapods, SQLite)<p>* Lead Android Engineer - We’re looking for an experienced Android engineer to lead development of the Robinhood Android app. You will build a highly custom user experience while staying consistent with Material Design. (Android SDK, Java, Retrofit&#x2F;Volley, SQLite<p>* Senior Web Engineer - We are seeking an experienced front-end web engineer to help build the Robinhood web app, for both desktop and mobile. The product features real-time, live-updating data and context-dependent interfaces, so you’ll be building a very rich client-side web application. (react.js&#x2F;angular.js, HTML, CSS, RESTful API communication)<p>* Backend Engineer - Robinhood is looking for an experienced engineer to help build our APIs and infrastructure. An ideal candidate would have previous experience designing RESTful APIs and the backend systems that implement them. (Python, Django Rest Framework, PostgreSQL, Redis, Celery, RabbitMQ)<p>Please send all inquiries&#x2F;resumes to careers@robinhood.com.\nRobinhood Markets, Inc and its affiliates are equal opportunity employers.","time":1417448317,"type":"comment"}