{"by":"interurban","id":8681500,"parent":8681040,"text":"Maxymiser - www.maxymiser.com - New York, NY<p>Javascript Support&#x2F;Solutions Engineers<p>We&#x27;re a small, tight-knit group within the company that handles a huge variety of tasks.  You&#x27;d be joining an influential team that provides huge value both internally and externally.  If you have any questions, feel free to contact me (email in my profile).<p>Here&#x27;s the description from our Stack Overflow posting:<p>ABOUT THE JOB<p>-       You will provide front-end development support to our internal and client teams.\n-       You will be the subject matter expert on the Maxymiser platform and coding best practices.\n-       You will manage client accounts, ensuring their long-term success using our technologies.\n-       Your code will be live on Fortune 100 companies’ websites.\n-       You will identify solutions to technical problems and communicate them to both technical and non-technical people.\n-       You will work with various internal teams to help advance our technology.<p>THE TEAM<p>You’ll join an awesome team of Solutions &amp; Support Engineers, and will wear many hats! Your primary responsibility will be to provide technical expertise and guidance to our clients and the Maxymiser Client Services team. Additionally, you will have the opportunity to collaborate with various teams across the organization and become an expert in our technology.<p>Skills &amp; Requirements<p>ABOUT Y­­OU<p>-       You think in code – you are well-versed in JavaScript, HTML and CSS.\n-       You are a problem-solver and you like to help people.\n-       You can explain how websites work to a 5 year old.\n-       Your browser bookmarks may contain StackOverflow and Reddit.\n-       Bonus: You are familiar with website user testing (A&#x2F;B and Multivariate testing).\n-       Bonus: You know a thing or two about analytics platforms and other 3rd party tools.\n-       Bonus: You have had some experience with (UAT) software development processes.<p>About Maxymiser<p>COMPANY<p>Maxymiser helps Fortune 100 companies optimize their websites through the use of A&#x2F;B testing, multivariate testing and personalization. Founded in London in 2006, Maxymiser has grown to be a market leader in our space, and we’ve moved our headquarters to NYC. We’re changing online business - and we’re excited about it!<p>LIFE at MAXYMISER<p>-       Casual work environment - wear what you want to work (within reason!)\n-       Ping pong, billiards and comfy work stations (beanbag chairs and treadmill desks) in our new office in Flatiron&#x2F;Gramercy.\n-       Catered lunches on Fridays\n-       Kitchen is always well stocked with snacks, drinks and caffeine.\n-       Regularly scheduled company happy hours and outings.\n-       Competitive compensation and benefits.<p><a href=\"http://www.jobs.net/jobs/maxymiser/en-gb/job/United-States/JavaScript-Support-Engineer/J3F8126HP2SR6Z7P3Q1/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jobs.net&#x2F;jobs&#x2F;maxymiser&#x2F;en-gb&#x2F;job&#x2F;United-States&#x2F;J...</a>","time":1417447749,"type":"comment"}