{"by":"jedanbik","id":8682560,"parent":8681040,"text":"We are in need of four developers whom we would like to hire preferably in the Raleigh&#x2F;Durham&#x2F;Chapel Hill, North Carolina area (but San Jose, California will work also).<p>-- \nJesse Bikman\nResearch Analyst\nScry Analytics (www.scryanalytics.com)\njesse.bikman@scryanalytics.com<p>------------------------------------------------------------<p>----Front-end web developer:<p>Responsibilities&#x2F;Necessary Skills: Develop an extensible web based UI from scratch that will run on Apache Tomcat with a Unix back-end. Must be able to produce design documents on UI elements with appropriate detail for all functions for the given UI. Must have strong UI&#x2F;UX design skills and be able to produce page mock-ups using graphics tools of their choice (Photoshop, Illustrator, Gimp, etc.) The web front end must be completely custom made and not a template from pre-existing copyright software (i.e. wordpress templates).<p>Must be proficient in: HTML, Javascript, CSS, <i>nix, Apache, Apache Tomcat, Java servlets, Event drive programming, MVC patterns, etc.<p>Nice to have experience in: Node.js, Angular.js, Talend, R, Java<p>4+ years as a web developer with at least 2 years focused on developing web GUIs.<p>----Back end developer:<p>Responsibilities: Write server-side scripts that connect Java, R, and Tableau (BI) reports with corresponding databases and data-marts. Create the interface between a web based (HTML&#x2F;Javascript&#x2F;CSS) GUI and back-end scripts. Create a file system to store all the scripts and automatically patch&#x2F;detect new scripts. Schedule scripts to run on a schedule and update the web GUI with new script outputs.<p>Must be proficient in: </i>nix, shell scripting, Java, Java Servlets, Apache, Apache Tomcat, Event driven programming, MVC patterns, etc.<p>Nice to have experience in: Node.js, Angular.js, Talend, R, cron daemon<p>Recommended 4-6+ years experience developing *nix scripts or server side scripting with a web front-end.","time":1417456928,"type":"comment"}