{"by":"hectorals","id":8682412,"parent":8681040,"text":"Integration Engineer | Ripple Labs | San Francisco, CA | careers@ripple.com<p>=======<p>Named one of the 50 Smartest Companies by MIT Technology Review, Ripple Labs is an 80 person startup backed by prominent investors, such as Google Ventures, Andreessen Horowitz, Lightspeed Venture Partners and IDG Capital Partners. The original developers of the Ripple protocol, we now support its growth by contributing code to the open-source software, as well as recruiting and developing tools for financial institutions and payment networks to use Ripple.<p>Ripple is an Internet protocol that interconnects the world’s financial systems to enable the real-time, secure transfer of funds in any currency. As settlement infrastructure, Ripple transforms and enhances today’s financial systems. Ripple unlocks assets and provides access to payment systems for everyone, empowering the world to move value like information moves today.<p>=======<p>You will:<p>Work with our project managers and clients to integrate the Ripple protocol with our clients systems<p>Be the technical lead from Ripple to support the technical efforts during the projects<p>Ensure that the Ripple protocol is integrated as per Ripple Labs and clients needs<p>If necessary, assist clients with sample code, installation&#x2F;configuration of the Ripple software, help clients debug integration code, prepare test cases, etc<p>Some travel may be necessary (~10%)<p>=======<p>What you might look like:<p>At least 3 years experience in web-based software development and software deployment processes<p>Hand on coding experience in web based technologies is a must<p>Web Services.<p>Experience with UNIX&#x2F;Linux, Javascript, C&#x2F;C++, Ruby or Python<p>Broad knowledge of enterprise level, commercially available hardware and software products, operating systems, networking systems, and methodologies and tools for integrating web bases products<p>You must have worked in externally facing engagements<p>Experience in financial services industry is a plus<p>=======<p>What we offer:<p>Competitive salary and equity\nFully paid medical and dental insurance for employees, 50% contribution for spouses and dependents\nFully paid Equinox gym membership\nTake time off when you need it - unlimited vacation policy\nIndustry-leading maternity and paternity leave policies\nWork with some of the best - early Bitcoin pioneers and cryptographers, ex-NASA engineers, ex-Fed regulators\nState-of-the-art penthouse facility in the heart of San Francisco’s Financial District\nRange of fresh, organic snacks, beverages and coffees\nThe opportunity to change the way we transact<p>=======<p>Please email careers@ripple.com for more details.","time":1417455723,"type":"comment"}