{"by":"jumby","id":8682662,"parent":8681040,"text":"RDN | www.recoverydatabase.net | jobs@recoverydatabase.net | Remote, USA<p>Recovery Database Network(RDN)is the leading web application for the repossession industry. We integrate with many of the largest lending institutions and repossession companies in the country to help facilitate their repossession workflow. Our company is profitable, growing and is looking for engineers to help design &amp; develop our next-generation web and mobile applications in a fast paced, agile environment. Our team is small, creative, and highly driven, and we intend to keep it that way.<p>We are looking for a US-based employee, but otherwise location doesn’t matter – we believe strongly in the value of a virtual team.<p>RDN is owned by a larger parent company, OPENLANE, an innovator in the online wholesale auto auction space, which is in turn owned by KAR Auction Services (NYSE: KAR) a publicly held auction services company.   What this means to you?  The support and benefits of a large, established company, with the culture and energy of a start-up.<p>You need to be able to work in a self-directed, remote environment. You should be able to understand loose guidelines, translate them into code &amp; design with minimal supervision to produce an excellent user experience for our customers. You should be comfortable talking directly to customers and our business partners, because you want to meet and exceed their expectations. We are a small team of hard-working engineers who enjoy the data sets we work with, enjoy challenges and thrive on cool design. You will be designing large elements of a very sophisticated web-application with a large amount of business logic. The ability to quickly come up to speed on repossession related terminology, workflow and concepts is highly desired.<p>Required Skills:<p>* Extremely self-directed. No one is looking over your shoulder - but can you handle the freedom?<p>* Expert level PHP 5.x development experience. OO only (yes, PHP! :-o)<p>* Expert level MySQL design. You should understand normalization, joins, query optimization, views, stored procedures and triggers and when and how to use them.<p>* Laravel, symfony, Zend or other MVC framework experience<p>* HTML&#x2F;CSS&#x2F;jQuery front-end design. We like things that look pretty.<p>* Extreme attention to detail. We hate bugs.<p>* Web application security<p>* Honesty and integrity<p>* Git<p>* Good communication skills -- Skype is your friend","time":1417457851,"type":"comment"}