{"by":"royrusso","id":8682257,"parent":8681040,"text":"Predikto Analytics is an Atlanta-based startup focused on delivering predictive analytics to the Fortune 500. We are heavy users of Python, Javascript, and PostgreSQL. We are looking for experience Python and full-stack engineers with startup DNA to join our growing company. Experience with data science, machine learning, and building scalable systems a big plus.<p>Apply Here: <a href=\"http://predikto.theresumator.com/apply/M1G8Mz/Full-Stack-Developer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;predikto.theresumator.com&#x2F;apply&#x2F;M1G8Mz&#x2F;Full-Stack-Dev...</a><p>As a full stack developer you will be responsible for designing, building and testing components for each tier of a custom web-based predictive analytics platform.  We are looking for a smart, energetic developer who understands how to build web applications from the ground up and loves writing clean, modular, and maintainable code.  The right candidate needs to be a quick learner and will be challenged to build solutions that will be deployed to our clients in days or weeks (not months).<p>Responsibilities<p>Build quick-turnaround proof-of-concept applications\nBuild longer-cycle, well-tested releases for the predictive analytics platform\nDesign, build, and test server-side Python components for a predictive analytics reporting platform\nDesign, build, and test Javascript components for the front end of a predictive analytics reporting platform\nDesign, build, and test SQL queries to populate front end data visualization components<p>Minimum Qualifications<p>Several years of web development experience (or an impressive code repository) using Python, Javascript, HTML, CSS, Git\nDemonstrated experience with modern web development frameworks like Django and Backbone\nSQL experience (preferably PostgreSQL)\nComfortable interacting with business and technical resources\nProblem solver, self starter, and strong communicator<p>Preferred Qualifications<p>Experience with testing frameworks for Python and Javascript\nAdvanced SQL\nUnderstanding of data warehouse concepts and best practices\nExperience developing ETL code manually or with data integration tools\nHigh-level knowledge of Cloud Services. We are using AWS and Heroku.\nGeneral knowledge and desire to learn and build Big Data Technologies and Predictive Analytics<p>Education<p>Engineering &#x2F; CS background would be a better fit, but we don&#x27;t care what you studied as long as you are passionate about what we are asking you to work on and learn<p>Apply Here: <a href=\"http://predikto.theresumator.com/apply/M1G8Mz/Full-Stack-Developer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;predikto.theresumator.com&#x2F;apply&#x2F;M1G8Mz&#x2F;Full-Stack-Dev...</a>","time":1417454246,"type":"comment"}