{"by":"brandicmt","id":8682742,"parent":8681040,"text":"Senior Software Engineers (Front End &amp; Backend) | San Francisco - Soma | brandi@symphonycommerce.com | Symphony Commerce - <a href=\"https://symphonycommerce.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;symphonycommerce.com&#x2F;</a><p>Fresh off a Series B funding round our engineering team is growing. Currently our engineering team is 25 people strong and looking to grow a bit more. We are currently looking for Senior Software Engineers for our front end and back end teams. Our senior engineers play a large role in our architecture, leading projects, mentoring other team members and of course shipping product.<p>Engineering is core to our culture, we are the largest team at Symphony Commerce. Our the team is bright, passionate, and driven. We are entrepreneurial and spend our time dreaming up projects that we could work on,  sometimes they become hackathons we do together. We’re a very social bunch - happy hours, bouldering, hikes, even a ski trip from time to time. We embody a strong sense of learning on the team as well. We keep our tech up to date, and have a solid mentorship model, learning a lot from each other!<p>Our Technical Challenges Include: \n- Managed e-commerce platform with exceptional APIs \n- Best shopping experience across web, tablet, and mobile\n- Commerce logistics, 3PL, and inventory management built from the ground up (watch out Amazon) \n- Scalability - intelligent cluster management, distributed system architecture, real-time system health monitoring and alerting\n- ML based engines for product recommendation and pricing and promotion strategies\n- Analytics framework to support big data analytics and business reports.<p>Things we love! \n- End-to-end experience with databases (RDBMS or NoSQL)\n- Experience with Spring or Hibernate\n- Linux&#x2F;Unix and scripting experience\n- Object-oriented CSS\n- Scala\n- Involvement in technology culture: Github, Blog, Hackathons and other open source contributions\n- Passion for ecommerce<p>Skills we look for: \n- Extensive experience any of the following: Javascript, HTML5 and CSS, Backbone, Angular, or similar frameworks\n- Solid background in object oriented programming (especially Java) \n- Expertise building large applications \n- Great communicator and team player\n- B.S. or M.A. in Computer Science or related discipline<p>Want to know more contact - Brandi Bergstrom (brandi@symphonycommerce.com)| More openings at: <a href=\"https://jobs.lever.co/symphonycommerce\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;symphonycommerce</a>","time":1417458667,"type":"comment"}