{"by":"vonnik","id":8682435,"parent":8681040,"text":"<a href=\"https://www.futureadvisor.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.futureadvisor.com</a> - <a href=\"http://nyti.ms/X3N7r2\" rel=\"nofollow\">http:&#x2F;&#x2F;nyti.ms&#x2F;X3N7r2</a><p>== Experienced infrastructure engineer, San Francisco ==<p>FutureAdvisor is an automated investment manager. We help our customers cut their investment fees, avoid excessive risks and save on taxes, so that they and their families will face better choices down the road.<p>We&#x27;re seeking an infrastructure engineer. Your job will be to keep FutureAdvisor running smoothly. It might be deploying and maintaining server clusters on EC2, building tools to automate our deployment pipelines or designing and implementing a new piece of the request pipeline. Your job will be to make FutureAdvisor as fast and reliable as possible.<p>You might be a good fit if you have experience writing production code, but you&#x27;d rather be building out the running systems. You&#x27;re security-conscious and detailed-oriented when it comes to provisioning servers and designing deployment processes. You have a strong desire to automate everything, but you know when introducing automation might be a bad idea. You&#x27;re comfortable in Bash and Ruby.<p>As a FutureAdvisor infrastructure engineer you might work on improving our Chef cookbooks to make it easier for others to deploy services. You&#x27;ll spend time identifying and eliminating likely reasons for FutureAdvisor to go down. You&#x27;ll also work on building out more tools to manage and track our server cluster using AWS technologies like EC2, S3, OpsWorks, and VPC.<p>Skills you&#x27;ll need:<p><pre><code>    Experience working with AWS\n    Experience provisioning and maintaining VPC instances on AWS\n    Knowledge of service oriented infrastructure\n    Knowledge of working with Linux and Bash scripts\n    Experience with infrastructure management tools like Chef or Puppet\n    Bonus Experience launching Ruby on Rails apps\n</code></pre>\n<a href=\"https://boards.greenhouse.io/futureadvisor/jobs/26313#.VHynlYeRlQg\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;futureadvisor&#x2F;jobs&#x2F;26313#.VHynl...</a><p>== <i></i>iOS developer<i></i>, San Francisco - INTERN possible ==<p>Engineers probably have more leverage now than at any other time in history. For very little effort, you can make great tools that empower large numbers of people.<p>At FutureAdvisor, you can deploy your abilities to help working- and middle-class families by giving them access to unbiased financial advice to build wealth. Until recently, only wealthy families could afford the neutral advice that made their investments grow safely. With software, we&#x27;re bringing those services to the rest of society.<p>As an iOS Engineer at FutureAdvisor, you&#x27;ll be working with our growing team of rigorous engineers, data nerds and finance geeks to deliver a beautiful and unique experience on mobile that changes the way people manage their investments.<p>Collectively, our team has spent decades building mission-critical systems such as Microsoft&#x27;s Azure, and we are bringing that same diligence to managing the life savings of our more than 100,000 customers.<p>What we&#x27;re looking for:<p><pre><code>    Experience developing awesome native iOS apps\n    2+ years of professional software development experience\n    Experience with web development technologies such as Ruby on Rails and CoffeeScript\n    Smart &amp; driven to work in a fast-growing startup\n    Team player: this is especially important in a small company, where you may be working with everyone from marketing to client services\n    Passionate about user experience &amp; design\n</code></pre>\n<a href=\"https://boards.greenhouse.io/futureadvisor/jobs/26316#.VHyoQYeRlQg\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;futureadvisor&#x2F;jobs&#x2F;26316#.VHyoQ...</a><p>== <i></i>interactive designer<i></i>, San Francisco ==<p>You&#x27;re seeking meaningful work solving problems in an organization that supports design. FutureAdvisor distills the complexity of finance into a simple interface so that our customers can understand and grow their life savings. We&#x27;re giving working- and middle-class households a powerful portfolio management tool that they never had access to, until now.<p>You&#x27;ve designed interactive apps for the web and mobile. We reach more than 150,000 users who depend on us to monitor their nest eggs. You&#x27;re used to reasoning about the scope of various features&#x27; functionality, and how to implement them. You like imagining how touch targets, palette, patterns, information architecture and microcopy can make UX smooth.<p>You know that UX is more than just product. Every touch point, from marketing and sales to onboarding and support, are all part of the total experience we want to improve. We&#x27;re looking for designers to work with our engineers and product managers to make sure that FutureAdvisor is delighting its customers from start to finish.\nWhat we&#x27;re looking for:<p><pre><code>    Background in interactive design\n    Portfolio of web and&#x2F;or mobile apps\n    Empathetic and practical individuals\n</code></pre>\n<a href=\"https://boards.greenhouse.io/futureadvisor/jobs/26309#.VHyouYeRlQg\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;futureadvisor&#x2F;jobs&#x2F;26309#.VHyou...</a>","time":1417455951,"type":"comment"}