{"by":"greattypo","id":8682993,"parent":8681040,"text":"Clever (YC S12) is looking for full-stack engineers - come help us change the classroom<p>Location: San Francisco<p>There’s a lot of great educational software out there - think Oregon Trail, Math Blasters, and Carmen Sandiego - but teachers can’t use it in schools.  Teachers would love to use programs like these, but synchronizing data between their school’s database and external software applications is a huge problem that results in wasted time at the start of class and frustrated, bored students… which leads to software being abandoned entirely.  80% of K-12 teachers would use more software in classes if getting students logged in weren’t such a hassle, and a quarter of all class time that’s supposed to be dedicated to software is wasted on logins alone.<p>Developers have a similar problem: they love clean APIs, but in the education industry, they haven’t had one.  Most K-12 schools house their student data in ancient legacy databases that make integrations a nightmare.  If you’re a five-person startup and you’ve built an app that revolutionizes the way third-graders learn fractions, there’s simply no way to get your product in front of students.<p>Clever is solving these problems by building a modern, developer-friendly API for schools… which we give them for free.  Developers love being able to plug into schools without having to write a complex integration for every single district they’re working with, so they pay us for access to the platform.  This business model has helped us grow quickly; we’re now in 1 in 5 schools in America (over 29,000 schools), and our product is used by millions of students every day.<p>Our goal is to become the education identity company.  The first step in that direction is our Instant Login single sign-on platform: a universal login that allows students to access all of their learning applications in one place.  (This is a big deal if you’ve ever seen a second-grader try to manage fifteen different usernames and passwords.)<p>Right now we’re a team of 40 people (19 engineers) based in downtown San Francisco (2nd and Mission).  We’re looking for full-stack engineers who can hack in Node, Go, and Python (or are willing to learn), but more importantly, we’re looking for people who share our passion for improving education.  If you’re interested, we’d love to hear from you.<p>Other stuff we like:\n-Tech talks.  Every other Tuesday, we do “Clever Talks” during lunch where one of us will give a presentation on anything he&#x2F;she’s interested in.  Recent talks have covered exoplanets, neuroscience, hacking big-company customer service interactions, and what’s wrong with American high school history education.\n-Bughouse chess.  We play pretty frequently, although not always with Magnus Carlsen: <a href=\"http://screencast.com/t/xD7umWfo\" rel=\"nofollow\">http:&#x2F;&#x2F;screencast.com&#x2F;t&#x2F;xD7umWfo</a>\n-Picking up new skills.  We offer unlimited Amazon credits for learning.<p>Check us out: <a href=\"https://clever.com/about/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;clever.com&#x2F;about&#x2F;jobs</a><p>At Clever, we want to work with the best people - applicants of all backgrounds and beliefs are welcome to come improve education with us. We&#x27;re committed to making our office a safe and comfortable environment for all employees.","time":1417460990,"type":"comment"}