{"by":"PJDK","id":8682367,"kids":[8688018],"parent":8681040,"text":"Experienced .Net&#x2F;Java Developer, London, UK<p>We are an established, growing technology consultancy who use technology in a smart, innovative way to solve business problems. Our core business is to deliver technology solutions so the company is run by and consists of technologists.<p>We have built two of our customers’ technology systems from scratch: one was a full back-end system written in C# controlling large data flows and providing front end reporting and management.  We have recently built an android solution for a mobile workforce, which is currently being expanded to 500+ users over the next few months.<p>The second was to build an online coupon management portal which links the point of sale to the digital world.<p>We are currently working with a third client to take a dynamic digital media outlet from being able to run up to 4 digital campaigns concurrently to over 80.<p>We pick projects that require and enable us to solve problems for clients – recent examples include:\n•<p>Based in London we have a relaxed, professional work environment in an open plan office alongside other start up companies, it is dress down and although we take delivery of our work seriously we don’t take ourselves too seriously.<p>We are seeking experienced developers who are:<p>Technically curious\nEnjoy researching and playing around with technologies to understand how they work, integrate and their limitations.  We run, or at least try to run, a technical book club, recommendations welcome.<p>Technologically agonostic - more or less\nWilling to collaborate and use the right technology for the job in hand. We won&#x27;t be asking you to learn Cobol but we do want people who are willing and able to pick up new technologies.<p>That being said we are, fundamentally, a .NET shop. All be it we just did an interesting project on Android, so C#&#x2F;Java would be a massive plus.<p>Experience in any of the following would be great: Java, JavaScript, DI&#x2F;IOC, ORM, Mocking, SQL Server, PostgreSQL, MVC, WPF, angular JS or knockout.<p>TDD \nWe are either looking for people who have experience of TDD approaches or have looked into them enough to know the tools involved and the benefits it gives - we&#x27;ll teach you the rest.<p>Able to &#x27;get it&#x27; \nAhh the elusive &#x27;it&#x27;. What do we mean by &#x27;it&#x27;? Covers a range of things - the classic description is problem solving which we hope you would want and be able to do but this goes beyond that. &#x27;It&#x27; is the ability to cut through the muddle to understand the real issue we need to solve for our clients. &#x27;It&#x27; is knowing how to stretch and bend technologies so that they deliver what we need, not what they say they do on the packet. &#x27;It&#x27; is thinking ahead and understanding the wider and long term impact of whatever you&#x27;re coding now - being structured and logical in your approach. &#x27;It&#x27; is knowing when your colleagues need a coffee to be made for them. There are tons of &#x27;getting it&#x27; needs which we&#x27;ll hope you add to.<p>The role will involve you in end to end development – requirements capturing to delivery<p>If this sounds interesting, please email me – Eleanor Martin on eleanor.martin@comade.co.uk (you can see a very lifelike picture of me on our website) or call 0207 112 4897.<p>For more information look at our website: www.comade.co.uk","time":1417455379,"type":"comment"}