{"by":"jyrani","id":8682870,"parent":8681040,"text":"Cotap - San Francisco, CA <a href=\"https://www.cotap.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cotap.com&#x2F;</a><p>Senior iOS Engineer<p>About Cotap<p>Cotap helps people work better together. We’re building mobile tools to help people communicate and collaborate at work, whether they’re knowledge workers or line workers. Mobile phones can mean more than photo-sharing or checkins. They can mean better day-to-day work and more opportunities for people who were left out in the past.<p>Cotap for iOS<p>We’re mobile first, and we’re always staying at the top of the design curve. We work directly with our design team to build delightful user experiences, responsive animations, and simple, beautiful user interfaces.<p>We’re keeping up with the times:<p>We support iOS 7 and 8.<p>We use CocoaPods and build our own libraries.<p>We’re already using Swift in production.<p>We don’t jump on every bandwagon, but we don’t hesitate to bring on tools that help us work better and faster.<p>Our next hire has<p>A deep knowledge and understanding of iOS&#x2F;UIKit standard libraries and frameworks, including:<p>UICollectionView, custom animations and transitions<p>NSURLSession and mobile networking best practices<p>CoreData<p>Threading (GCD, NSOperationQueue)<p>A nearly obsessive level of care for and attention to the tools you use, and keeping them up to date and working<p>Strong opinions, weakly held (<a href=\"http://www.saffo.com/02008/07/26/strong-opinions-weakly-held/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.saffo.com&#x2F;02008&#x2F;07&#x2F;26&#x2F;strong-opinions-weakly-held...</a>)<p>A passion for constantly improving both yourself and your fellow team members<p>A desire and ability to work across disciplines and communicate cross-functionally — everyone owns the product<p>What we care about<p>We’re driven by more than just a love of engineering. We build Cotap because it’s an opportunity to make something beautiful and usable that can make a meaningful difference in the daily lives of our users. People spend half or more of their waking hours working. We’re very lucky to be able to make those hours better.<p>We’re collaborative. The act of writing code may often be solitary, but the process of building a great app certainly is not. We advise, encourage, and challenge one another, and we know that every member of the team has unique knowledge and experiences that we can all learn from.<p>We’re adaptable and tenacious. Startups are hard. Some of the work it takes to make something great can be tedious and unglamorous. Sometimes we’ll have to adapt to changing circumstances or other things outside our control. To us, the opportunity’s worth the adversity.","time":1417459882,"type":"comment"}