{"by":"JimboOmega","id":8682611,"parent":8681040,"text":"Passare - San Francisco, CA, Software Engineer<p>Are you a thoughtful software engineer who enjoys working on agile, effective projects? Do you have an entrepreneurial streak coupled with a commitment to hitting your benchmarks? Do you want to work with a prolific team? If your mind set matches ours, we want to talk to you!<p>About Us<p>Passare is a funded early stage startup. We seek engineers to grow our software team on an exciting, green-field project to deliver an industry-changing B2B application, followed by a B2C ‘social’ component that will affect the legacy of peoples’ lives. Applying Agile development practices, coupled with Ruby-on-Rails, and using the best tools available, we are quickly building a great product and a great team.<p>About You<p>We’re interested in finding the right person. It’s better to find someone with the right attitude and aptitude; we’ll invest in your skills if it’s not a perfect match. We expect a positive attitude towards difficult challenges, whether code or schedule based. You must be self-motivated, enjoy working in a team environment, and love building something that will change things in a positive way.<p>Required Skills &#x2F; Experience<p>•\t2+ years professional experience, preferably at an early stage company \n• Enough experience with Ruby on Rails so you can hit the ground running \n• Experience with one or more applications in a production environment with real customers \n• Working knowledge of agile development practices \n• Understanding of the basics: OO software, Linux, SQL, NoSQL, and basic sysadmin skills \n• Experience with one or more cloud computing platforms \n• Excellent communication skills, both written and verbal \n•A computer science degree or equivalent experience<p>Bonus – One of the following<p>• Delivery of one or more mobile apps, for iOS or Android \n• Knowledge of database scaling \n• Web analytics experience<p>Benefits<p>• Competitive compensation plan including equity \n• Great location in San Francisco’s financial district with easy access to BART \n• Medical and dental benefits<p>This is a full time, salaried position. Contact Jonathan@passare.com","time":1417457362,"type":"comment"}