{"by":"millchristian","id":8682959,"parent":8681040,"text":"Location: NYC Engineer, Mobile Apps<p>Willing to Relocate: Yes<p>To Apply:<a href=\"http://soundcloud.com/jobs/2014-05-27-engineer-mobile-apps-new-york-city-ny-united-states\" rel=\"nofollow\">http:&#x2F;&#x2F;soundcloud.com&#x2F;jobs&#x2F;2014-05-27-engineer-mobile-apps-n...</a><p>SoundCloud, the world’s leading audio platform, is looking for an experienced engineer to help kick start its mobile engineering efforts in New York City. In this role as an experienced end-to-end engineer of mobile applications, you will work on multiple systems to help take our mobile applications to the next level.<p>Ideally you will have experience developing mobile applications alongside web applications and services and have a good understanding of good software engineering practices and concepts.<p>You’ll also be up for an international adventure: we’ll need you to spend some time in our Berlin HQ before you head to join the rest of our engineering team in New York. There you’ll work across the entire mobile suite in a challenging environment and help grow our mobile engineering efforts in the US as we grow.<p>Responsibilities:<p>Working on projects across the mobile space in an end-­to-­end development environment and on multiple platforms, both as part of the team and independently.\nAssuming responsibility for projects across the mobile space in NY, while still collaborating with our engineering teams in Berlin to ensure that our approaches and standards stay consistent.\nEvolving process and practices associated with software development, with a focus on continuous improvement.\nRequirements:<p>At least 3 years of experience working in an agile software development environment, applying the practices associated with building robust applications: unit&#x2F;functional automated testing, continuous integration, continuous delivery and software design&#x2F;architecture.\nAt least 3­-4 years of experience developing in mobile platforms, ideally with experience in applications that have native code in C&#x2F;C++.\nIn­-depth understanding of mobile platforms and their unique features with respect to technology and user experience.\nAt least 3 years of web services&#x2F;applications development experience with a focus on API design, preferably in Scala.\nBonus<p>Experience in implementation of ad products.<p>To Apply: <a href=\"http://soundcloud.com/jobs/2014-05-27-engineer-mobile-apps-new-york-city-ny-united-states\" rel=\"nofollow\">http:&#x2F;&#x2F;soundcloud.com&#x2F;jobs&#x2F;2014-05-27-engineer-mobile-apps-n...</a>","time":1417460684,"type":"comment"}