{"by":"zgm","id":8683245,"parent":8681040,"text":"TellApart - Burlingame, CA. New York City (Full-Time, Intern, Visa): Software Engineering<p>TellApart helps many of the world’s most successful retailers unlock the power of their customer data by applying the latest advances in cloud computing, predictive analytics, and machine learning.\nOur Customer Data Platform collects and analyzes massive amounts of data to power an integrated suite of marketing solutions that delivers personalized shopping experiences for 100s of millions of consumers in real time.<p>About Us:<p>- Profitable (<a href=\"http://techcrunch.com/2013/12/12/ad-tech-startup-tellapart-hits-100-million-revenue-run-rate/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2013&#x2F;12&#x2F;12&#x2F;ad-tech-startup-tellapart-h...</a>)<p>- Featured as one of Wealthfront’s Career Launching Companies for the 2nd year in a row (<a href=\"https://blog.wealthfront.com/107-career-launching-tech-companies/\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.wealthfront.com&#x2F;107-career-launching-tech-compa...</a>)<p>- Backed by Greylock Partners and Bain Capital Ventures<p>- Small, but growing team<p>Tech Stack:<p>- Apache Spark, Kafka, Hadoop, Hive, Parquet, Cascading, MySQL, Voldemort, Memcached, Zookeeper<p>- AWS, Aurora, Mesos<p>- d3.js, Ember.js<p>Problems we solve:<p>- Scale our existing data pipeline to handle 10x the data to match our current growth trajectory. (We are currently one of AWS’ biggest customers and only have a 50 person engineering team)!<p>- Research, design, and launch dual-homed, distributed storage systems that allow single digit millisecond access times to satisfy the stringent 40ms request time real-time bidding constraints.<p>- Migrate our legacy identity system used for audience targeting and real time bidding, to a new identity system built with concepts taken from the Lambda architecture<p>- Make performance optimizations to our real time bidding service to bring 99.9th percentile latency to within 30ms<p>We&#x27;re currently hiring for all engineering positions.\nApply via our careers page (<a href=\"http://www.tellapart.com/careers/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tellapart.com&#x2F;careers&#x2F;</a>)","time":1417463270,"type":"comment"}