{"by":"zaidos","id":8683353,"parent":8681040,"text":"Tastebud (<a href=\"http://www.tastebud.co\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tastebud.co</a>) -- Chicago, IL \niOS &#x2F; Android Mobile Software Engineers: Full-Time<p># About Us\nHere at Tastebud, we are obsessed with creating mobile experiences that personalize the world around you. Through a combination of sophisticated algorithms and meaningful data, we are one of the first companies to create a personalized brick and mortar shopping experience. Best of all, we are profitable with a live product that is providing real results.<p># About the Team\nWe are an smart and experienced group of software engineers and data scientists. Whether it is understanding the dynamic and complex relationships around large data sets, designing the greatest mobile experiences, or building the best recommendation engine on the planet, we are strongly focused and determined on solving the most challenging problems.<p>We are currently building the next generation of mobile applications, all powered by our extensive experience in personalization. We understand the value in stable, established frameworks and patterns, but we aren&#x27;t afraid to jump into new technologies when the opportunity rises. We enjoy great clean code, but understand that sometimes you need to hack something out. We are fans of open source and aim to contribute back when we can. We enjoy working with smart people who can get things done.<p># About You\nYou understand mobile. You have gone from idea to app store, quite possibly more than once. You know a great mobile-centric API when you see one, even better if you have designed one yourself. You understand the challenges that the app store brings and know how to work around them. You know how to iterate and build a product that delights our users. You enjoy the ability, freedom and encouragement to develop our mobile strategy.<p>We can offer a competitive salary, a great office in downtown Chicago, a flexible schedule, and a few cool office perks.<p>Interested? Send us a quick email about why you are the best person to lead our mobile products: jobs@tastebud.co","time":1417464014,"type":"comment"}