{"by":"mightybyte","id":8683170,"kids":[8685103],"parent":8681040,"text":"Soostone NYC - New York, NY - REMOTE or ON SITE<p><a href=\"http://www.soostone.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.soostone.com</a><p><pre><code>    ----------\n    What We Do\n    ----------\n</code></pre>\nSoostone is a specialized software technology and consulting company centered around predictive analytics in the enterprise space. We work with a prominent group of clients that are leaders in retail, hospitality and travel industries. We combine our cloud-based, SaaS technology platforms with an investigative approach to deploy predictive analytics into real-life optimization scenarios and produce unique results for our clients. Along the way, we tackle numerous interesting challenges including high volume APIs, high volume data processing, distributed computation systems, streaming data aggregation, real-time decision making, machine learning, data visualization, domain-specific languages, library design and highly dynamic (single-page) rich web applications. We also care deeply about contributing back to the OSS community and make an effort to release internal projects whenever appropriate.<p>You will find brief descriptions for our open positions below; please reach out to us at jobs@soostone.com if interested and would like to find out more.<p><pre><code>    ---------------------\n    Who We&#x27;re Looking For\n    ---------------------\n</code></pre>\nExperienced Application and UX Designer<p>We are looking for significant previous experience and a passion for crafting polished, highly dynamic web applications with an excellent sense of design and usability.  Should have operational capabilities in graphics design, Photoshop&#x2F;Illustrator&#x2F;GIMP and similar software and strong proficiency in HTML and CSS.  A formal background in design is considered a big plus.<p>Data Scientist<p>We are looking for a solid background in math, statistics, or numbers-heavy engineering with significant experience working with real world data to produce insightful analyses, sometimes employing machine learning and statistical algorithms.<p>Functional Programmer<p>Most of our software stack is written in Haskell, so experience with strongly typed functional programming languages is required.  The ability to deliver operational code is essential.  Ideal applicants would have a formal education in FP, type systems, etc and demonstrated open source contributions.","time":1417462699,"type":"comment"}