{"by":"jamalex","id":8683842,"parent":8681040,"text":"Learning Equality - Python&#x2F;Django&#x2F;Backbone developer - San Diego (full-time or intern) or remote (contractor)<p>## Highlights<p>High-impact nonprofit; open-source; international education; social justice; great working&#x2F;learning environment.<p>## About us<p>Learning Equality is a recently formed nonprofit that builds and supports open-source (<a href=\"https://github.com/learningequality/\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;learningequality&#x2F;</a>) educational software designed to increase learning opportunities for communities with limited or no access to the Internet. We do this work because we believe deeply in the transformative power that learning can have on people&#x27;s lives, and are passionate about social justice and breaking down the barriers that prevent many people from reaching their full potential and living empowered lives.<p>We started out as a group of students volunteering on the open-source KA Lite project (<a href=\"https://learningequality.org/ka-lite/\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;ka-lite&#x2F;</a>), an offline version of Khan Academy, which we first announced publicly in December of 2012. An enthusiastic global response led to a flood of requests for support, features, and partnerships, and we soon realized we needed to establish a solid foundation to support the project and the longer-term vision, so we incorporated as a nonprofit in April of 2013. We have been fortunate enough to raise some funding to support our continued work, and now have 3 full-time employees, as well as a number of contractors and interns, alongside a community of volunteers and open-source contributors. We are leasing offices in the Qualcomm Institute Innovation Space on the UC San Diego campus, and collaborate closely with researchers and students across the campus.<p>We&#x27;re now looking to grow our core team by hiring someone who will help us to drive our mission and projects forward, playing a strong collaborative and leadership role in both the development process and in the organization as a whole. We have a lot we want to accomplish, and want to continue building a positive, dynamic, and diverse team to help ensure our vision flourishes.<p>## Our plans<p>KA Lite has now been installed thousands of times in over 130 countries (<a href=\"https://learningequality.org/ka-lite/map/\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;ka-lite&#x2F;map&#x2F;</a>), in contexts as varied as low-income schools in India, orphanages in Cameroon, prisons across the United States, refugee programs in Lebanon, and First Nations community centers in northern Canada. We plan to continue developing KA Lite, adding features and improving the user experience, and supporting deployments around the world.<p>Next up, we are preparing for the development of a platform, building upon the KA Lite codebase, that will empower users to create, curate, share, and learn from diverse forms of openly licensed content, in both online and offline environments. This will involve building tools for authoring videos and exercises, an app ecosystem for embedding and distributing HTML5 educational bundles, features for discovering and communicating with other devices peer-to-peer over a local network, interfaces and web-based visualizations for exploring student data, and systems for motivating, engaging, and guiding learners.<p>## About you<p>* You care deeply about making the world a better place, believe in the power of learning, strive to promote equality, and resonate with our statement of core values (<a href=\"https://learningequality.org/about/values/\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;about&#x2F;values&#x2F;</a>).<p>* You are comfortable in a leadership role, e.g. taking responsibility for a core component of a project, and mentoring students, interns, and contractors.<p>* You love to build things, and like to think carefully about how best to serve user needs.<p>* You have skills and experience with web development&#x2F;design, hopefully using some subset of the following stack: Python, Django, HTML5, Javascript, Backbone.js, and CSS&#x2F;LESS (visual design tools also a plus).<p>* FLE is still a small startup, and we each wear many hats, and thus experience in any of the following areas would be valued (though in no way required): Education (e.g. teaching), Networking (protocols, APIs, etc), Databases (schemas, efficiency, replication, etc), Hardware sourcing (finding providers, bulk ordering, build-to-order processes), Quality Assurance (automated and&#x2F;or manual testing).<p>## About the job<p>* We&#x27;re looking to fill a full-time position (likely starting with a 3-month trial contract, as negotiated), with a modest salary, 401(k) matching, and health care options. If you feel you might not yet have enough experience for the full-time position, but are excited about what we&#x27;re doing, contact us anyway, as we have an internship program that could be a way to learn, and get your foot in the door!<p>* We offer flexible schedules and vacation time. We emphasize a healthy work-life balance, accomplishing as much as we can while also taking care of ourselves and our families, and having fun!<p>* Your exact title in the organization would be determined in collaboration with you, on the basis of the skills you bring to the table, and the focus of the role you&#x27;ll be playing on the team. See our team page for some examples of current and past titles (<a href=\"https://learningequality.org/about/team/\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;about&#x2F;team&#x2F;</a>).<p>* You&#x27;d be working in sunny San Diego, at our offices on the lively UCSD campus. We can help out with relocation costs, and in certain cases we may be able to look at options for remote contract work if you&#x27;re unable to move.<p>Apply online at <a href=\"https://learningequality.org/about/jobs/\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;about&#x2F;jobs&#x2F;</a>, or reach out to us with any questions at jobs@learningequality.org!","time":1417468425,"type":"comment"}