{"by":"calebelston","id":8684955,"parent":8681040,"text":"Delighted (<a href=\"https://delighted.com\" rel=\"nofollow\">https:&#x2F;&#x2F;delighted.com</a>) - Software Engineer - Palo Alto, CA<p><a href=\"https://delighted.com/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;delighted.com&#x2F;jobs</a><p>We are a design driven team of three founders, focused on impeccable customer experience. We value simplicity, quality, and care. We believe in a collaborative, feedback-rich design process. We feel that great experiences can only come from teams who care deeply. We are building the company we’ve always wanted to exist. We share what this all means to us on our blog.<p>The list of important and interesting projects we want to tackle is ever-increasing. Because the range of projects is diverse, we need a full-stack Rails engineer with experience working on a wide variety of projects.<p>You’ll work on projects like: improving our natural language date range search, implementing integrations with 3rd party services, or working to improve the responsiveness and reliability of our API. You’ll also work with the entire team in creating new customer-facing features, from idea, through prototype, to release and maintenance.<p>* Our backend runs on Rails with MySQL, Redis, and Elasticsearch on AWS. You should have experience building scalable and maintainable services with Rails.<p>* Our front-end is built with CoffeeScript, SASS and HAML. You should have a deep understanding of HTML, CSS and Javascript.<p>* The glue between our front-end and back-end is HTTP, so you should have a thorough understanding of this part of the stack including: cookies, caching, AJAX, cross-domain sharing, security issues, etc.<p>* We write automated tests for all of our code. You should be passionate about testing since you know it’s the only way to deliver high quality software.<p>We are looking for someone who can spend about 10 hours per week contracting with us, so we can both get a sense of what it’s like working together. We’d love for you to be in the Pacific timezone, but we’re open to the right person, anywhere.<p>While this is a contracting opportunity to start, we are always looking for the right person to join the team full-time. We believe working together on a contract basis initially is critically important before bringing someone on as a full-time member of the team.<p>If you’re interested, please send a link to your Github account and any projects you’ve worked on recently that you are particularly proud of. We prefer great work over resumes.<p>Email: jobs {at} delighted.com","time":1417479166,"type":"comment"}