{"by":"meric","id":8684754,"parent":8681040,"text":"Our company is hiring in Cape Town, South Africa.<p>Send me an email at eric@gradconnection.com!<p>================================================================================<p>Senior Django Developer - Team Lead<p>We&#x27;re a site for university graduates to find graduate positions.<p>GradConnection is expanding fast as a ambitious, profitable and easy-going\ncompany. In Australia, over 70% of graduates employed in graduate positions\nfound their graduate position from gradconnection.com.au.<p>We&#x27;re also busy expanding to South Africa, Singapore, Hong Kong.<p>At the same time we&#x27;ve been learning more about our clients, constantly\nperforming customer development work and are currently developing two new\nproducts that are independent of our GradConnection website.<p>We use Django, Django REST framework, AngularJS&#x2F;React, Socket.IO,\nGerrit&#x2F;Jenkins, Gulp&#x2F;Grunt, Postgres.<p>We value work-life balance and very strongly discourage working outside normal\nworking hours more than a couple of days a month.<p>-- What you&#x27;ll be doing with us --<p>Our company&#x27;s goal is to connect graduates with work opportunities with\ndifferent employers on a global basis. This is something that no other company\nin the world is currently doing in the online campus recruitment space.<p>We have been re-structuring our software development processes over the past\nyear, moving from the ad-hoc processes that helped this company achieve\nmarket dominance in Australia.<p>As a senior software engineer, you&#x27;ll be responsible for contributing to\nthe development of our upcoming projects such as the next generation of\nHR and recruitment products as well as improvements on our existing flagship\nwebsite.<p>You&#x27;ll be working with a company with a presence in South Africa, Asia, and\nAustralia.<p>-- What we expect from you --<p>- Excellent coding skills and a track record of getting stuff done.\n- Several years of full-stack web development, frontend, backend, database.\n- Previous experience in leading and mentoring less experienced developers.\n- Have strong opinions on projects you are developing.\n- Eager to influence the software development process as well as product design\n  and UX experience.<p>You will be a core pillar in our software development team, and you will be\nrequired to lead as we expand our South African office. You will advance our\nin-house software engineering processes and expertise.<p>-- How to apply --<p>Email your resume as well as URL to your personal website,\ngithub repository and&#x2F;or other projects you may have done before to\neric@gradconnection.com.<p>Optionally, also feed us our own dogfood and enter your application for this\nrole at<p><a href=\"http://pushapply.com/gradconnection/xyzbsyd\" rel=\"nofollow\">http:&#x2F;&#x2F;pushapply.com&#x2F;gradconnection&#x2F;xyzbsyd</a>, using an Application Tracking\nSystem we have currently in development.","time":1417476591,"type":"comment"}