{"by":"karenkuhn","id":8684682,"parent":8681040,"text":"Principal Software Engineer - Data Engineering<p>New York, NY<p>Have you taken a broken system or data warehouse and made it good? Have you taken a good data warehouse and made it great? Have you taken a great system and made it purr like a baby ocelot?<p>ZocDoc needs a Principal Data Engineer to drive our elite dev team toward an even brighter future! This role is for an experienced engineer with a tireless devotion to good system design across the entire stack.<p>---------------------------------<p>What you’ll do:<p>- Provide guidance on systems design, architecture, and analytics infrastructure to support big data technologies and distributed architectures.<p>- Analyze business requirements for database design, and implement changes to databases as necessary – including database design optimization for machine learning<p>- Mentor your peers and be a thought leader for the whole team<p>- Partner with our Data Science team on metrics and insight development<p>---------------------------------<p>What’s required:<p>- Curiosity: A passion for huge, scalable systems and databases (e.g. you read HighScalability and KDNuggets for fun)<p>- Strong understanding of core architectural principles such as modularity, restorability, parallelization and table driven business rules<p>- A good understanding of information delivery architecture, including creation of abstraction layers, SQL query paths and optimization, report level calculations, and end user reporting architecture<p>- 2+ years of data-specific engineering experience in addition to the 3+ years of general engineering experience<p>- Experience with SQL Server and Data Warehousing is a plus<p>- Experience designing and implementing fast and efficient data processing using &#x27;big data&#x27; processing techniques and tools (e.g. MapReduce)<p>- Experience implementing the latest technologies (Hadoop, NoSQL, Vertica, etc.), using scripting skills (Pig, Hive), and with virtualization across platforms like AWS<p>- Education: A Computer Science or related degree preferred<p>- Focus: Be able to follow a design through implementation and release<p>- Insatiable attention to detail: If something works and you don’t know why, you should be A) alarmed and B) driven to investigate!<p>---------------------------------<p>What you’ll get:<p>- A home at a Best Place to Work in NYC (Crain’s, five years running!)<p>- Stock options<p>- 100% employer-covered health insurance<p>- An energetic and fast-paced work environment in the heart of SoHo<p>- Free, daily catered lunches<p>- An arcade game, Ping Pong, snacks, TF2 parties every Friday…<p>- The opportunity to build a better healthcare experience for millions of patients!<p>---------------------------------<p>Apply here: <a href=\"https://www.zocdoc.com/careers/principal-software-engineer-data-engineering-558/apply?source=ycomb\" rel=\"nofollow\">https:&#x2F;&#x2F;www.zocdoc.com&#x2F;careers&#x2F;principal-software-engineer-d...</a>","time":1417475762,"type":"comment"}