{"by":"ellego","id":8685402,"parent":8681040,"text":"Polycom, Inc - <a href=\"https://www.polycom.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.polycom.com&#x2F;</a> - HQ in San Jose, CA\nPolycom is a leader in communications and collaboration, and you may know us by our conference phones. More info: <a href=\"http://careers.polycom.com/search.php\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.polycom.com&#x2F;search.php</a><p>* Software Engineer - Westminster, CO (Full Time)\nJoin Polycom&#x27;s RealPresence Platform software development team in building the next generation of its two key infrastructure products. The Distributed Media Application (DMA) serves as Polycom’s core Call Server and Video Conference Manager while the RealPresence Access Director (RPAD) is a state of the art firewall traversal application. This is a highly collaborative and iterative environment, with focus on continuous improvement and learning, both at a personal and team level. This team works with Java&#x2F;Linux environment with Subversion. BS in EE&#x2F;CS with 1+ years of experience.<p>* SCM Engineer - Westminster, CO (Full Time)\nAt an advanced technical level, perform assessment, preparation and implementation of software build environments and change control activities for software application. This team works with Subversion, Jenkins, Linux, Windows, and shell scripting. BS in EE&#x2F;CS&#x2F;Mathematics with 3+ years of experience.<p>* Staff UI Software Engineer - Austin, TX (Full Time)\nStrongly influence product design from both the UI and implementation point of view.  We have a really great team, easy group of people to work with. A great support network, a great technology, and a great product. This team works with JavaScript, Sencha, ExtJS&#x2F;Touch and REST API. BS in EE&#x2F;CS with 2+ years of experience.<p>* Software Release Engineer - Austin, TX (Full Time)\nDeploy and administer tools and infrastructure used to manage and build large software product source repositories. This team works with Linux&#x2F;Unix, Subversion, Perl, Python, Apache, CGI. BS in EE&#x2F;CS with 5+ years of experience.<p>* VoIP Sr. Staff Software Engineer - Austin, TX (Full Time)\nDevelop Polycom’s latest industry leading HD Video Conferencing Systems. Strong interest and&#x2F;or experience in Voice and Video over IP (VVoIP) would be good. This team works with C&#x2F;C++, Unix&#x2F;Linux, embedded development, networking H.323 and SIP. BS in EE&#x2F;CS with 12+ years of experience.","time":1417488415,"type":"comment"}