{"by":"rkpzero","id":8685184,"parent":8681040,"text":"DocNav (<a href=\"https://www.docnavapp.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.docnavapp.com</a>)\nFull Stack Engineer, New York, NY<p>Position Description: <a href=\"https://docsend.com/view/uidh4qs\" rel=\"nofollow\">https:&#x2F;&#x2F;docsend.com&#x2F;view&#x2F;uidh4qs</a><p>### The Company<p>DocNav, based in New York City, is looking for its first engineering hire. DocNav is launching a product that solves a unique problem in the legal technology space, but whose applications range well beyond law firms to include hedge funds, private equity funds, real estate firms, investment banks, and beyond. More broadly, the mission of the company is to bring technology to bear on problems that professionals in finance, investment, and law don’t even know they have.<p>### The Product<p>DocNav makes large, complex legal and financial documents interactive and easy to navigate and untangle. The product is simple to use and intuitive, but results in a very powerful user experience with a learning curve that is almost zero. The idea and design are based on my own 15-year career in the private equity and hedge fund business and the product is something I wanted but could not find.<p>The current product is in private beta and getting a strong response from the hedge fund community. It has so far been described as ‘magic’ and ‘legendary’ by guys who don’t often use the words ‘magic’ and ‘legendary’ for professional services. Applications of the product are far ranging and user segments include hedge funds, private equity funds, asset management firms, investment banks, in-house counsel’s offices, COO’s and CFO’s, and law firms ranging from top 20 “white-shoe” firms to small and medium size offices.<p>### The Position<p>This is a chance to build a unique product with far-ranging applications that could develop in numerous different directions. I want to work with someone who is excited to solve nerdy engineering and design problems, and who will proactively suggest solutions or new directions.<p>You will be on a lean team with lots of interesting things to work on, including developing and refining algorithms to make sense of unstructured documents, refining an elegant user experience, hacking growth to increase the user base, and helping turn a beta product into a truly enterprise-grade, scalable, secure application. Experience with or an interest in natural language processing and machine learning methods is a plus, but the most important thing is an ability to creatively solve technical problems.<p>No BS environment, let’s create a great product and see where it takes us, there are tons of directions this could go.<p>### About Me<p>I’m an electrical engineer by schooling but spent my entire career working for hedge funds and private equity firms doing everything from leverage buyouts and growth investments to trading structured credit bonds. I left the business because I was more interested in bringing technology to bear on all kinds of problems that exist at financial firms. I have built the product myself up to this point, but now I want to build a team and need a talented engineer and a teammate to take the product to the next level and push forward with product development, user growth, and revenue generation in the near term.<p>### Current Development Stack<p>- Python &#x2F; Django\n- AWS EC2, S3, RDS (Postgres)\n- HTML, CSS, SASS, JavaScript (though we will have outside development help on front end design and implementation, I need a real engineer to figure out deeper solutions for architecting and implementing new killer features)\n- Backbone.js<p>### Compensation<p>Competitive compensation package consisting of salary plus equity.<p>### Contact<p>Please send resumes to rishi@docnavlab.com, www.docnavapp.com","time":1417483503,"type":"comment"}