{"by":"radex","id":8686181,"kids":[8686306],"parent":8681040,"text":"JavaScript developer at Nozbe | Poland or anywhere (we&#x27;re remote!)<p>We&#x27;re looking for talented programmers who are passionate about building amazing applications and are great at front-end development (all Javascript-related). It is necessary that:<p><pre><code>  * You love programming and newest technologies\n  * JavaScript, CSS3, HTML5 are your best friends\n  * You have developed mobile web apps\n  * You want to work from home and can be very independent\n  * You know English very well so you can read and comment in this language\n  * You are willing to learn and develop all the time\n  * You have good communication skills\n  * You are open-minded, honest and friendly\n  * You can write clear and intelligible code documentation\n  * You must be Polish (our core team is Polish)\n</code></pre>\nWe will be even happier if you:<p><pre><code>  * Know server-side programming languages\n  * Have some experience in using Node-Webkit\n  * Have worked on mobile apps development using the PhoneGap technology\n  * Have already developed mobile apps for Windows Phone, Windows RT and Blackberry\n  * Have any experience with native app development for Android or Windows\n  * Have worked on the project managed according to agile SCRUM methodology\n  * Have used Git for code management\n  * Having read the book by David Allen &quot;Getting Things Done&quot; is a bonus, too :-)\n</code></pre>\nWhat we offer:<p><pre><code>  * No office - everybody works from home the way they want, at the time they want\n  * Great team - we all communicate over the internet and actually like each other :-)\n  * Regular &quot;Company wide meetings&quot; - we spend a few days in some cool place together having fun and getting to know each other in real life - and the company pays for everything :-)\n  * Competitive salary - you don&#x27;t need to move to a bigger city or another country to earn more, you can earn a good salary by working for a Polish-based global company\n  * Growth - Michael Sliwinski - our founder and CEO is focused on growth and he wants all of us to grow and be better and love what we do.\n</code></pre>\nYou will work on our native apps which are very advanced web-view based apps. You will work with a world-class designer and a team of very talented developers.<p>If you think you&#x27;re the candidate for the job, send us your CV along with your nickname on GitHub. Tell us what you did in the past and what you&#x27;re working on and what is your favorite part of being a programmer.<p>It&#x27;d be great having you on board!<p>More info: <a href=\"http://nozbe.com/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;nozbe.com&#x2F;jobs&#x2F;</a>","time":1417507666,"type":"comment"}