{"by":"daryn00","id":8687014,"parent":8681040,"text":"Devops Engineer - RetailMeNot, London, UK<p>The RetailMeNot, Inc. London office is looking for a talented devops engineer to join our growing engineering team working on one of the UK’s largest shopping websites.<p>Come help us build a state of the art infrastructure in a rapid deployment fail-fast environment. Using DevOps practices and infrastructure as code you will use your skills to build a modern infrastructure that others depend on. You will design and build rugged systems to improve availability and performance and ensure that new code rolls out the door with minimal effort and maximum impact.<p>This role is primarily based in our London office, but you will have the opportunity to work with our teams around the world, particularly in Austin TX where our global engineering team is based.<p>==== Responsibilities ====<p>- Design and build the infrastructure to support features used by millions of people<p>- Manage our various systems, databases and services ensuring they are secure, resilient and performant<p>- Responsible for monitoring and supporting our infrastructure from dev right through to production<p>- Research new technologies and incorporate them into new systems<p>- Take initiative in leading projects and collaborating with others<p>==== Qualities that set you apart ====<p>- You believe you can automate anything and everything with code<p>- You enjoy working in teams and helping the people around you succeed<p>- You have high standards in everything you do with a high attention to detail<p>- You enjoy working in a fast-paced agile environment<p>- You thrive on being on the front lines of an outage; you dive in, take ownership, and make a plan to fix the root cause<p>==== Requirements ====<p>- Professional experience managing high availability LAMP stack deployments<p>- Excellent AWS knowledge (e.g. Cloudformation, EC2, Route53 etc)<p>- Experience of config management systems (e.g. Puppet, Chef, Ansible, Salt)<p>- Experience of networks, security, load balancers, DNS and other infrastructure components<p>- Excellent verbal and written communication<p>- BASH scripting<p>==== Desirable ====<p>- BS or MS in Computer Science or relevant experience commensurate to a bachelor’s<p>- Working experience with Docker<p>- Any monitoring experience (e.g. Nagios&#x2F;Icinga, Sensu, Zabbix)<p>- Version control systems knowledge (Git &amp; Mercurial)<p>- Experience with PHP, particularly with frameworks such as Laravel or Symfony<p>- Contributions to open source software projects<p>If you think you&#x27;re the candidate for this position and you&#x27;re interested, send us your CV to jobs@vouchercodes.co.uk.","time":1417528261,"type":"comment"}