{"by":"sophiestrap","id":8687644,"kids":[8687822],"parent":8681040,"text":"LOCATION: Cincinnati, Ohio \nStrap - software and analytics for wearable technology\nstraphq.com\n@getsrap\n<a href=\"https://angel.co/strap/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;strap&#x2F;jobs</a><p>VP OF ENGINEERING<p>DESCRIPTION\nStrap is looking for a VP of Engineering to join our team in Cincinnati, Ohio&#x27;s historic Over-The-Rhine neighborhood. The VP of Engineering is an experienced software developer who has 10+ years of experience in building or leading teams to build scalable solutions. You have great technical chops, but prefer not to be in the code on a daily basis. Ideally, you&#x27;ve managed teams of 5 or more developers who respect your ability to get things done in a timely manner while also communicating advanced technical concepts efficiently. Our stack consists of iOS, Android, Node.js, MongoDB, and Meteor, along with multiple wearable frameworks. Experience hacking on any part of this stack is highly preferred.\nSound like something you might be interested in? Sweet! Let&#x27;s connect.\nThe following paragraph is borrowed from Mark Suster&#x27;s well written article about CTO vs VP Engineering. It effectively sums up what we are looking for. I highly recommend reading the whole article! <a href=\"http://www.bothsidesofthetable.com/want-to-know-difference-between-a-cto-and-a-vp-of-engineering/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bothsidesofthetable.com&#x2F;want-to-know-difference-b...</a>\nThe VP Engineering aspires to manage teams.  They feel comfortable with C++ but also have a black-belt in Excel.  They are sticklers about managing unit tests, system tests and regression tests. In fact, they are passionate about automating testing overall.  They know how to estimate work units, how to manage the agile development process and how to get the most out of their teams.  VP’s of Engineering are essential to making sure the trains run on time.  The VP of Engineering is also your primary interface to your head of product management and often the VP of Engineering is somebody you would drag in front of clients to win big deals.<p>SKILLS\nAndroid, MongoDB, Node.js, iOS Development, Leadership, Kanban, Git, SCRUM, Jira, Mobile Application Development, Agile, Bug Tracking, Tizen, Pebble, Android Wear<p>COMPENSATION\nFull Time\n$70K – $120K Salary\n2.0% – 4.0% Equity<p>--------------------------------------------------------------<p>MOBILE DEVELOPER<p>DESCRIPTION\nStrap is looking for a Lead Mobile Developer to join our growing team in Cincinnati, Ohio’s historic Over-The-Rhine neighborhood. The mobile developer has 5+ years of experience with native and hybrid development on both Android and iOS. You will be responsible for successful execution of all of the developer facing Strap SDKs for both mobile and wearable platforms. Day-to-day, you will work closely with the CTO to ensure that your team is on track to meet the goals of the sprint. A high degree of comfort with both Java and Objective-C is required. The expectation is that you are the resident expert in all things mobile related. Experience with one or more wearable platforms (Android Wear, Google Glass, Pebble, Tizen) is strongly preferred. Ideally, you&#x27;ve built and documented API&#x27;s and shipped products that are built for developers.\nAt Strap, we follow a fairly rigorous agile development process. You are expected to communicate your progress “stand-up” style daily while maintaining your work in feature branches with frequent commits. The goal is not to add meaningless processes to your plate; rather, we believe that communication and transparency are two extremely important factors in a successful development team.<p>SKILLS\nCommunity Evangelism, Android, iOS Development, Developer Tools, Google Glass, Tizen, SDK, Pebble, Android Wear<p>COMPENSATION\nFull Time\n$50K – $70K Salary\n0.25% – 1.5% Equity<p>--------------------------------------------------------------<p>FULL STACK DEVELOPER<p>DESCRIPTION\nStrap is looking for a Full Stack Developer to join our growing team in Cincinnati, Ohio’s historic Over-The-Rhine neighborhood. The Full Stack Developer has 2+ years of experience developing end to end web and mobile applications in some form. Day to day, you will work closely with the CTO, creative director, mobile developers, and back-end developers to build beautiful and highly scalable applications for a variety of platforms. Because you have a working understanding of all aspects of the architecture, you will be tasked with developing individual components of the product in different arenas as needed. For example, in one sprint you may be working on a new set of endpoints in a Node.js API, and the next may code a developer-facing component using accelerometer data in C. You are the “slash” on our team; you’re the unfair advantage, someone that likes to work on a lot of different things and is always up for a challenge. You take pride in being a jack-of-all-trades, and are up for mastering a few along the way. \nAt Strap, we follow a fairly rigorous agile development process. You are expected to communicate your progress “stand-up” style daily while maintaining your work in feature branches with frequent commits. The goal is not to add meaningless processes to your plate; rather, we believe that communication and transparency are two extremely important factors in a successful development team.<p>SKILLS\nPython, Javascript, Android, MongoDB, Node.js, iOS Development, Amazon Web Services, Meteor<p>COMPENSATION\nFull Time\n$50K – $70K Salary\n0.25% – 1.0% Equity<p>--------------------------------------------------------------<p>DATA SCIENTIST<p>DESCRIPTION\nStrap is looking for a Data Scientist to join our growing team in Cincinnati, Ohio’s historic Over-The-Rhine neighborhood. The Data Scientist has a minimum of 5 years experience with statistical analysis in a real-world setting. The focus of the position is to discover hidden insights from a variety of problems. These insights will be derived from the billions of data points streamed from fragmented wearable sensors on our platform. Given the nature of our data, experience with motion classification algorithms is strongly preferred. You are a very strong technologist, and this gives you the skills needed to answer a variety of questions about the data we have today. However, your business acumen and creative nature give you the ability to derive your own questions and insights about the data as you analyze it. You may develop ad-hoc reports, or create recurring batch jobs using tools like Python and MATLAB. Strong technical writing skills are a must, and you’ll have opportunities to publish your knowledge and findings via blogs, journals, and conferences.<p>SKILLS\nPython, Big Data, Statistics, MongoDB, Algorithms, Classification, Mathematical Algorithms&#x2F;Data Analysis, Accelerometer<p>COMPENSATION\nFull Time\n$70K – $90K Salary\n0.25% – 1.5% Equity<p>--------------------------------------------------------------<p>BACK END DEVELOPER<p>DESCRIPTION\nStrap is looking for a Backend Developer to join our growing team in Cincinnati, Ohio’s historic Over-The-Rhine neighborhood. The Backend Developer has 2+ years of experience developing scalable and secure solutions on the server side using Node.js and MongoDB. Experience with Python and MapReduce is a plus. You’ll be responsible for developing a wide variety of APIs to support all of our web and mobile-based products. Experience with OAuth workflows is strongly desired.  You’ll work closely with our CTO to ensure that your logic and architecture decisions support the wider mission of the Strap family of products.\nAt Strap, we follow a fairly rigorous agile development process. You are expected to communicate your progress “stand-up” style daily while maintaining your work in feature branches with frequent commits. The goal is not to add meaningless processes to your plate; rather, we believe that communication and transparency are two extremely important factors in a successful development team.<p>SKILLS\nPython, Javascript, MongoDB, Node.js, Mapreduce, Amazon Web Services, Security, OAuth<p>COMPENSATION\nFull Time\n$40K – $70K Salary\n0.25% – 1.5% Equity<p>--------------------------------------------------------------<p>All employees are expected to also be evangelists for Strap, so you’ll spend 10-15% of your week (NTE 6 hours) being extroverted in some form. Examples include blogging, spending time on Stack Overflow answering questions, or contributing to open source projects. These activities may or may not be directly related to content marketing, but being in the community as a representative of Strap helps our street cred tremendously.\nYou may be asked to travel periodically for conferences, hackathons, or other professional engagements. Travel is not expected to exceed 10% annually.","time":1417535107,"type":"comment"}