{"by":"Fr4ncis","id":8687140,"kids":[8690648],"parent":8681040,"text":"Senior iOS Dev - RetailMeNot, London, UK<p>We are looking for a Senior iOS Engineer to join our growing engineering team who are changing the way millions of people shop. You will be responsible for the development of our native iPhone apps across each of our European territories. This role is primarily based in our London office, but you will have the opportunity to work with our teams around the world, particularly in Vannes, France and Austin TX where our global engineering team is based.<p>Responsibilities:<p>* Develop and integrate new features in our apps across Europe: we have a product roadmap which you will shape with your expertise and contribute to with your code.\n* Take ownership of and pride in what you deliver: you will take care of one or multiple apps, the submission to Apple, crash reports and user feedback.\n* Communicating efficiently and transparently with the technical lead and the rest of the team: your capacity to estimate correctly and communicate promptly and honestly is essential.\n* Be a proactive problem solver: as a senior we expect you to deliver reliable code, always trying to avoid technical debt and embrace refactoring when needed.\n* Mentor less experienced software engineer: as a senior you have a lot of experience that you can share with the team.<p>Requirements:<p>* You have 3+ years of experience with Objective-C and probably you wrote a class or two in Swift.\n* You can talk about CoreData, sqlite, RESTful APIs, CoreLocation, AutoLayout, Cocoapods, AFNetworking, Jenkins,  and possibly you work daily with these technologies.\n* You have apps in the store that we can download and play with now, even better you can send us the source code of one of these apps.<p>Desirable:<p>* You have a github &#x2F; bitbucket account where you publish libraries, open-source apps or contributed to other projects.\n* BSc or MSc in Computer Science or relevant experience commensurate to a bachelor’s.\n* Vous parlez français<p>What to expect from us:<p>* A laid-back environment to put you in the best conditions to deliver.\n* Opportunities to attend conferences and get the training you need to grow.\n* All the hardware you may need to get your job done.\n* The opportunity to prototype with new exciting technologies and hardware (wearables, beacons, drones!?)\n* A friendly and fun company culture (see <a href=\"http://www.vouchercodes.co.uk/careers/life-at-vouchercodes/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.vouchercodes.co.uk&#x2F;careers&#x2F;life-at-vouchercodes&#x2F;</a>)<p>If you think you are a great fit for this role please send us the following:\n- complete the code test at <a href=\"http://hosted.vouchercodes.co.uk/recruitment/VCCodeTest.zip\" rel=\"nofollow\">http:&#x2F;&#x2F;hosted.vouchercodes.co.uk&#x2F;recruitment&#x2F;VCCodeTest.zip</a>, follow the instructions on the README file.\n- github &#x2F; bitbucket account or link to relevant source code, stackoverflow and other relevant links.\n- a brief explanation of what you could bring to the team and please tell us if there is any particular source code or app that you&#x27;re particularly proud of.\n- your cv<p>jobs@vouchercodes.co.uk","time":1417529495,"type":"comment"}