{"by":"adamdingle","id":8687361,"parent":8681040,"text":"Roundtown - Cambridge, MA - Software Engineer, UI&#x2F;UX Designer<p>Roundtown (<a href=\"http://roundtown.com\" rel=\"nofollow\">http:&#x2F;&#x2F;roundtown.com</a>) is a Web site that lists events (e.g. concerts, films, basketball games, classes) happening in cities and towns throughout the U.S. and Canada.  Our goal is to have the most comprehensive list of events available anywhere and to present it in a way that&#x27;s fast, slick and fun to use. We want to be be the first name people think of when they want to know what they can do tonight, this weekend or any time.<p>We launched our beta site in May 2014 and our traffic is growing steadily.  We have lots of cool features in the works including machine learning-based recommendations, social network integration and more.  Most of our server-side code is in Scala, a language we love.  We&#x27;re also using Play, Slick, Postgres, Angular and scikit-learn.<p>Currently we have a team of 5.  We&#x27;re looking to hire two more people now: a UI&#x2F;UX designer and a software engineer.  You must be able to work with us every day in our office in Cambridge, MA.  Here&#x27;s a bit more about each of those roles:<p>=== UI&#x2F;UX Design Lead ===<p>Are you creative and resourceful? Interested in joining a startup doing something truly unique as the Design Lead?  We’re gearing up for a major refresh of our user interface and would like you to hit the ground running!<p>= Opportunities Offered =<p>- Ownership of the look and feel of roundtown.com\n- Creative freedom and the opportunity to execute your point of view on what a modern web interface should look like\n- Potential to design something that shakes up our market space<p>= Experience Desired =<p>- Modern mobile and desktop web design skills\n- The usual HTML&#x2F;CSS&#x2F;etc.\n- Experience in interaction design, human factors, and visual&#x2F;graphic design\n- A portfolio of previous web work<p>=== Software Engineer ===<p>We&#x27;re using Scala, Play, Postgres, Angular and scikit-learn to build a very cool site. Do you know some or all of those technologies?  Want to help execute a big idea?  Then come join us at Roundtown and help.<p>= Opportunities Offered =<p>- Ownership of projects and tasks with low-key management\n- Develop using cool technologies on both mobile and web platforms\n- Be a part of a small, friendly, experienced team\n- Be a part of the solution to a large, unsolved problem<p>= Experience Desired =<p>- Scala, Play, Postgres, scikit-learn and&#x2F;or Angular\n- Machine learning experience is helpful but not required\n- Linux&#x2F;Unix software development environment<p>=====================<p>For both positions we offer early-stage stock options, health and dental insurance and 6 flexible weeks of vacation per year, plus a great culture of transparency, fun and weirdness.  Interested?  Drop us a line at jobs@roundtown.com.  We look forward to hearing from you!","time":1417532042,"type":"comment"}