{"by":"ncbk12","id":8690191,"parent":8681040,"text":"COLUMBUS, OHIO – Full Stack Engineer w&#x2F;Ruby on Rails Focus<p>====\nQUICK INTRO\n====<p>NextChapter (<a href=\"http://www.nextchapterbk.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nextchapterbk.com&#x2F;</a>) is seeking Ruby on Rails &#x2F; Angular.js developer to join the team and help us push the product to the finish-line! If you want to be part of a startup that&#x27;s right on the cusp of launching, without the risk associated with starting from scratch or working completely on your own, this might be just the right fit.<p>We have a working product with attorneys signed up and ready to start paying. With a clear path to revenue, pre-orders from current beta testers and a founding team full of ambition &amp; tenacity, NextChapter is ready to take this bootstrapping startup to cash flow positive within months, with your help.<p><i></i>* If interested, email janine(at)nextchapterbk(dot)com with an intro and resume. <i></i>*<p>====\nDESIRED SKILLS\n====<p>Our ideal candidates will have the following skills:<p><pre><code>  • Ruby 2.X\n\n  • Rails 4.X\n\n  • Postgresql\n\n  • Javascript\n\n  • Coffeescript\n\n  • Angular.js\n\n  • or other Javascript MVC frameworks\n\n</code></pre>\n====\nADDITIONAL EXPERTISE\n====<p><pre><code>  • GitHub experience working with others in a team to fork &amp; pull\n\n  • Experience with Balsamiq mockups and Trello for project management\n\n  • A firm grasp of object oriented analysis and design\n\n  • Startup experience a plus\n\n</code></pre>\n=====\nABOUT THE COMPANY\n=====<p>NextChapter is a legal startup helping attorneys prepare bankruptcy documents online. &quot;Turbotax for Lawyers&quot;<p>Bankruptcy is not a fun thing to go through but there are 1.5M bankruptcies filed each year. These individuals are paying attorneys a flat fee of $1,500 to do the work, but NextChapter is taking the pain away from both the debtor and the attorney. They do this by making the TurboTax of bankruptcy software, streamlining the process of filing a 75-page form to using an intuitive online system.<p>NextChapter saves the average attorney 50 hours &amp; $12,000 per month by offering per-case pricing, cloud-based access and most importantly, an intuitive navigation platform.<p>Check us out online:<p><pre><code>  • Website: http:&#x2F;&#x2F;www.nextchapterbk.com&#x2F; \n\n  • Twitter: https:&#x2F;&#x2F;twitter.com&#x2F;NextChapterBK \n\n  • AngelList: https:&#x2F;&#x2F;angel.co&#x2F;nextchapter&#x2F;jobs&#x2F; \n\n  • Facebook: https:&#x2F;&#x2F;www.facebook.com&#x2F;NextChapterBK\n\n</code></pre>\nRead an article written by founder, Janine Holsinger on the Legal Startup market and posted on popular legal blog, Lawyerist - <a href=\"http://lawyerist.com/74528/legal-startups/\" rel=\"nofollow\">http:&#x2F;&#x2F;lawyerist.com&#x2F;74528&#x2F;legal-startups&#x2F;</a>","time":1417557079,"type":"comment"}