{"by":"amazing15","id":8705687,"parent":8681040,"text":"SENIOR SOFTWARE ENGINEER<p>Amazing Academy is the leading online training organization for entrepreneurs. We work with top business experts around the world to create market-leading online courses that teach people how to build, operate, and scale successful companies.<p>With thousands of successful students from over 50 different countries, the team at Amazing Academy is helping people create freedom in their lives and is changing the world, one business at a time.<p>Amazing Academy is a highly-successful, fast-growth company looking for talented and dedicated people who want to contribute to our exciting, rapid expansion.<p>With above-average compensation, a fun environment, and participation in this high-growth company’s future through our stock option plan, this position will fill quickly.<p>Read through the role and the requirements below and use the apply button to send us your information. We look forward to hearing from you!<p>The Role<p>As a Senior Software Engineer, you will be entrusted with the design and development of cutting-edge, scalable web-based products using the LAMP stack that help customers grow their businesses.<p>Your responsibilities will include:<p>Write code in PHP, Javascript, and HTML&#x2F;CSS\nImplement new features and optimize existing ones for a Learning Management System (LMS)\nWork closely with and incorporate feedback from product management, experience designers, and other engineers\nRapidly fix bugs and solve problems\nProactively look for ways to get our customers better results<p>This role is based in Austin, TX.<p>Must Have<p>B.S. or higher in Computer Science (or equivalent work experience)\nMinimum 8 years experience in software development role, LAMP focus \nExperience with e-Learning solutions including an LMS (Moodle preferred)\nAbility to create an interface in HTML, CSS, and JavaScript\nStrong relational database knowledge in MySQL, SQL Server, or Oracle  \nDisciplined approach to testing and quality assurance\nProficiency in creating applications in one server side framework\nSolid understanding of the full web technology stack (e.g., HTTP, cookies, headers, asset loading &#x2F; caching)\nMobile and tablet responsive design implementation\nWrite code in Python, Perl, or Ruby\nExperience with revision control and project management\nVisual design skills\nData-informed product development: analytics, A&#x2F;B testing, etc.\nKnowledge of cross-browser quirks\nGreat written communication and documentation abilities\nInterest in mobile and touch-based web platform<p>APPLY at <a href=\"http://www.amazing.com/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.amazing.com&#x2F;careers</a>","time":1417801202,"type":"comment"}