{"by":"urlwolf","id":8709439,"parent":8681040,"text":"Business developer &#x2F; assistant director, Data Science Retreat\nBerlin, Germany.<p>Data Science Retreat is the only bootcamp in the world with Chief-Data-Scientists as mentors. We train pretty good people with technical backgrounds into fully-employable data scientists, probably the fastest growing profession right now. We are about to start our second batch, profitable, and growing. If you have an exceptional network of companies, in the Valley or in the EU, we need you. Bringing companies to our hiring day, and getting them to happily leave with their new data science hire will be your job.\nDoes your network include lots of companies hiring data scientists? We need you. You have lived and worked in the US, preferrably in the Valley, and are plugged in.\nThe director of DSR cofounded a startup with a Ycombinator alumn, so it&#x27;s not like we have zero network in the Valley, but this requires far more effort than we can allocate right now with the current team. If you are reading this from SF, and thinking about moving to Berlin, this is a good opportunity.\nThere are about 10x more data science jobs in the US than in EU, so our goal for the next batches is to serve the US market. We think the education we provide is top-notch, we just need to get noticed by companies hiring from the US.\nIf you are well-connected in EU, and know how to get to talk with exactly the right person at the right company: we need you. Even if you don&#x27;t have a good network on the other side of the ocean. Prior start-up experience a plus.\nThis is our pitch to prospective students:\n&quot;Data Science Retreat (DSR) is the only data science course in the world with chief-data-scientist-level mentors. DSR helps coders or people with significant quantitative training (e.g. science, engineering, or math graduates) ramp-up rapidly for a data science career – arguably the fastest-growing, highest-demand profession. DSR is a 3-month, in-person, rigorous, and full-time&#x2F;intensive course in the startup-capital of Europe: Berlin.\nYou’ll learn software engineering, data science, business analysis and communication faster and more deeply with mentors doing code reviews and pair-programming – all on real-world data and problems.\nYou will develop a portfolio project, demonstrating you can own a business problem, solve it, and communicate why your results are definitive.\nYou bring your training, tuition, and drive to master our curriculum alongside our world-class mentors and partners. Towards the end we provide a networking event with top-tier technology companies, where you will show off your new skills and portfolio project, likely leaving with a career-changing job.\nWe&#x27;re looking for someone to take charge of operations, accounting, and event coordination at Data Science Retreat.\nThis job will entail everything from managing our office space to handling inbound email to planning group alumni events to working with our lawyer and accountant. It will also entail working closely with the founder. Since we are a small team, everyone has significant responsibility and helps define and determine our future growth and success.\nYou will get to meet lots of interesting people and companies, and be at the center of the data science action in EU.&quot;\nFind out more about DSR and apply at <a href=\"http://datascienceretreat.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;datascienceretreat.com&#x2F;</a>\nWe are profitable from day one and growing.<p>What makes you a strong candidate in our eyes?\n•\tYou have a network with the type of companies who are looking for a data scientist right now.\n•\tYou can talk to anyone, get access to the decision maker, and get him on the phone\n•\tYou identify with data-driven companies, and can speak their language\n•\tYou have worked at a company that was data-driven, or whose main product was data\n•\tYou have been in teams that included a data scientist\n•\tIf you are applying for the EU position, you need good spoken German (native or close).\n•\tYou don&#x27;t need to live in Berlin, but it&#x27;d be a plus\nWhat we offer:\n•\tMeaningful work, with a huge effect on people&#x27;s lives. You will help people make a career change into arguably the fastest growing profession today.\n•\tMarket rate pay, sizeable commission per company you brought that hired from DSR\n•\tA friendly and intellectual atmosphere, and a tight-knit and supportive team.\n•\tA warm and welcoming office (near lots of good food and transit).\n•\tYou can sit on our classes when you are not busy; that is, you can start your path to become a data scientist yourself if you are interested\n•\tLots of interaction with famous data scientists who come to teach or give talks. Examples: Ted Dunning, Drew Conway, Adam Blake, Mikio Braun, etc\n•\tPotential for growth. If you get things done, you will be a permanent hire. If you generate exceptional value, you can be a cofounder. If you understand the business side of DSR, and help achieving objectives, you will be a crucial part of it\nWhat your day-to-day will look like:\n•\tContacting companies looking for data scientists, and introducing them to our program\n•\tAttending events, meetups, conferences\n•\tGiving talks\n•\tConnecting people\n•\tFollowing up with companies that expressed interest\n•\tMaking sure companies are happy with their hires<p>Community manager\n<a href=\"http://berlinstartupjobs.com/operations/community-manager-data-science-retreat/\" rel=\"nofollow\">http:&#x2F;&#x2F;berlinstartupjobs.com&#x2F;operations&#x2F;community-manager-da...</a><p>Data Science Retreat (DSR) is the only data science course in the world with chief-data-scientist-level mentors. You know all those Programming bootcamps that graduate people in three months to work as junior devs? This is not one of them. We take pretty advanced data scientists and make them better.\nThis is a no-BS job. Join a profitable-from-day-one company (and growing), and help us make EU companies more data-oriented.","time":1417882275,"type":"comment"}