{"by":"vininnz","id":8715291,"parent":8681040,"text":"UI&#x2F;UX Designer -- CareMessage (YC W14), San Francisco, CA<p>CareMessage is looking for a UI&#x2F;UX Designer, who will work closely with healthcare providers to learn more about their needs and the needs of their patient populations. The UI&#x2F;UX Designer will represent the end users at all product meetings, and bring the voices of clinic staff and patients to life in order to improve our product.<p>Our patients&#x2F;users come from all walks of life and various ethnic&#x2F;racial backgrounds. On a daily basis, they face barriers such as homelessness, unemployment, food insecurity, language barriers, and multiple chronic healthcare conditions. We are looking for someone who may already understands the populations we serve through personal or work experiences.<p>YOUR QUALITIES:<p>- You have a natural curiosity for people’s stories\n- You can turn stories into insights\n- You are not happy with delivering the minimum and continuously ask yourself, “How can we make this better?”\n- You understand human&#x2F;user-centered design principles\nSomething in your background already enables you to connect with our patients<p>ADDITIONAL RESPONSIBILITIES WILL INCLUDE:<p>- Make recommendations for new content based on community needs and trends.\n- Work with CareMessage leadership to identify the most appropriate methods for communicating specific health messages to targeted group.\n- Assist with product brochures, advertising materials, and provide editorial support on relevant documents.<p>CANDIDATES WITH THE FOLLOWING SKILLS ARE PREFERRED, AND STRONGLY ENCOURAGED TO APPLY:<p>- 2+ years of relevant experience as a UI&#x2F;UX designer\n- Knowledge of HTML&#x2F;CSS&#x2F;JavaScript\n- Degree in Product Design, HCI, CS or related fields\n- Strong communication and organizational skills\n- Work experience in start-ups, or start-up like environments is not necessary, but preferred<p>To apply, please send a resume and short cover letter to jobs@caremessage.org and include ‘UI&#x2F;UX Designer’ in the subject line.","time":1418021553,"type":"comment"}