{"by":"dcourtenay","id":8731767,"parent":8681040,"text":"Associate DevOps Engineer\nCommunispace\nBoston, MA, United States<p>Who You Are<p>You are a hard-working, self-motivated person who loves to fix problems and assist people. You have a passion for software and how it is built, deployed and maintained. You are patient and unfazed by pressure. You can multi-task in a fast-paced, team-oriented environment. Most importantly, you work best in a casual work environment that is focused on excellence and customer satisfaction. Achieving the impossible is not a challenge to you.<p>What You’ll Do<p><pre><code>    Define, implement and support build management and integration workflow processes\n    Work with teams and management to implement Build&#x2F;Release Engineering (DevOps) methodologies and standards\n    Assist the teams in supporting the application in Development, Staging and Production environments\n    Work with engineers to create and maintain our automated testing infrastructure\n    Keep abreast of the latest developments in Release Engineering, knowledge management software, and open source technologies; share knowledge with the team and propose adoption of new technology\n</code></pre>\nDesired Skills<p><pre><code>    BS in Computer Science or related field with 2+ years of experience supporting multi-tiered, high volume, critical production application\n    You are passionate about technology and about learning\n    An interest in problem solving and providing solutions\n    Understanding and experience with networking is a plus\n    Experience with SQL\n    Basic understanding of VMware vCenter 5.1\n    Must have excellent written and verbal communication skills\n    Collaborative, team focus\n    .Net experience strongly preferred\n    A strong technical foundation in build automation and release engineering\n    An eagerness to learn enough about whatever tools or tricks are needed to get the job done\n    Skilled with Jenkins continuous integration software tool\n    Experience with unit testing and automated testing tools. Ex: Selenium, Puppet\n    Comfort with frequent, incremental code testing and deployment\n    Comfort with collaboration, open communications and reaching across different engineering teams</code></pre>","time":1418246337,"type":"comment"}