{"by":"HeroHealth","id":8732032,"parent":8681040,"text":"Lead Software Engineer, HERO (NY, NY USA)<p>HERO (herohealth.com) is seeking a Lead Software Engineer to drive the development of a revolutionary online health platform that integrates with a novel electro-mechanical device. This lead engineer will have ownership of backend and frontend application design and implementation, including communication between device and cloud, and collaborate continuously with senior HERO members. We are looking for a rock star that’s a strong team player with a disciplined development style.<p>Responsibilities:<p>+ Serve as software leader in a top team of various engineering disciplines, working closely with firmware, electrical, industrial design, mechanical, and manufacturing engineering<p>+ Design and implement backend web API, device-to-cloud API, and frontend UI according to core specifications, including HIPAA compliance and hardware device functionality<p>+ Drive a robust, data-driven test-and-learn methodology of software development (including A&#x2F;B&#x2F;n testing and continual customer&#x2F;device input)<p>+ Scale up a full stack team of engineers through 2015<p>Job Qualifications:<p>+ 3+ years of experience with a high level of aptitude in PHP, MySQL, Javascript&#x2F;HTML&#x2F;CSS, frontend and backend MVC frameworks, with experience in AWS preferred<p>+ Examples of 1-2 production-level projects utilizing the above (able to provide links&#x2F;code on request)<p>+ Outstanding communication skills, self-starter with infectious enthusiasm, energy, and problem-solving abilities<p>+ Driven and motivated to grow with a top-tier team<p>+ BS in Computer Science, Computer Engineering or equivalent<p>HERO is redefining consumer health through smart design and proprietary technology with our first product, a revolutionary tabletop appliance and online health platform. This is a unique opportunity to join a young, talented team that’s already filed a dozen computing and electro-mechanical patents, and is making a substantial positive impact on healthcare in society. We operate in both a technical and creative environment in the heart of New York City and are selectively adding to our team to accelerate product development.<p>Please submit your resume and project examples to careers@herohealth.com and include “Lead Software Engineer” in the subject line.","time":1418249387,"type":"comment"}