{"by":"2bookjt","id":8736770,"parent":8681040,"text":"SR Software Engineer - Mount Pleasant, SC<p>What is 2Book?\n2Book is a rapidly growing, web-based software company that offers massage therapists and bodyworkers much-needed tools that help them succeed.  Our product (MassageBook) is created specifically for the massage and bodywork professional. We have a single purpose in mind - helping professional massage and bodywork providers, and the profession as a whole, grow and succeed. We offer powerful yet simple tools to increase new customer traffic and for them to manage their practices with a single, easy to use software platform.\nWhat you’ll do:\nAs a Senior Software Engineer, you’ll work closely with product development to design and implement new features of MassageBook. You’ll collaborate with our customer support team and quality assurance team to resolve defects in the MassageBook application.  \nResponsibilities include:\nArchitecting and implementing new features\nRegression testing during each release cycle\nIdentifying and researching new ways to improve performance, stability, and quality<p>You already have: \nA proven track record of designing and coding software in one or more languages (PHP is a bonus)\nExperience with Linux\nExperience with MySQL or similar RDBMS \nStrong knowledge of OOP principles\nExperience as a member of a Scrum team\nStrong written and verbal communication skills\nRespect for and positive attitude towards customers and team members\nSelf discipline, personal responsibility for and dedication to time management, ensuring effective completion of tasks in order to meet deadlines \nThe ability and willingness to communicate, share knowledge and collaborate across departments\nResourcefulness to find and use information to solve problems\nThe ability to problem solve in an independent and creative manner\nExcitement and drive to continuously improve professionally and personally<p>What 2Book offers you:\nChallenging work environment that allows for growth and the ability to lead change.\nCompany culture focusing on passion, collaboration and getting stuff done!\nAgile product management methodologies with minimal process overhead.\nIn-house gym and fitness classes.\nCasual dress code and a relaxed work atmosphere in the newest tech workspace, Innolabs - in Mt. Pleasant.<p>Email careers@2book.com to apply.","time":1418328224,"type":"comment"}