{"by":"Fleming_1","id":15149606,"parent":15148885,"text":"Everwise | New York, NY | Sr. Software Engineer | Full-Time| ONSITE | $140k - $170k + equity | \n<a href=\"https:&#x2F;&#x2F;www.geteverwise.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.geteverwise.com&#x2F;careers&#x2F;</a><p>We at Everwise, a Sequoia-backed company, are reinventing talent development by connecting professionals with the people and resources they need to be successful at every stage in their career. We work with some of the top companies in the world, including Salesforce, Lyft, GitHub, Virgin, and Apple.<p>We&#x27;re a diverse engineering team based in NYC, who come from all walks of life. We have successful start-up experience and embrace processes and technologies that amplify output. Day-to-day we leverage Ruby, React, Redux, AWS, and Postgres. We&#x27;re very adaptable and looking for someone who welcomes the opportunity to solve a broad range of problems using a wide array of technologies.<p>We are seeking a talented senior engineer who has experience developing web or mobile clients from the ground up and is passionate about doing work that matters. You&#x27;ll be working closely with a number of teams, including Product, to make a real impact here.\nWhat You&#x27;ll Do -Develop and maintain Everwise&#x27;s SaaS cloud-based web applications -Identify scaling bottlenecks and propose solutions -Research, test, and benchmark new technologies -Design and communicate coding standards and architectural plans -Lead design of front-end framework using React and application framework using Rails -Work closely with Product&#x2F;UX to deliver simple and intuitive desktop and mobile solutions\nWhat we are looking for: -5+ years of experience with large scale, high traffic&#x2F;performance web applications -Experience with Ruby on Rails or related MVC web frameworks (Python&#x2F;Node.js&#x2F;php etc.) -Experience with Javascript (familiarity with React is a plus) -Expert experience with object-oriented programming and design patterns -Significant experience building scalable, distributed systems -Significant experience with Sql&#x2F;NoSql and database technologies as they relate to application development. -Understanding of unit and functional testing best practices -Command of DevOps, CI, and deployment engineering (Docker, Ansible, Nginx, and Unicorn are bonuses) -Cloud experience including redundancy, security and scalability strategies<p>We are also seeking mid-level engineers with 3+ years of professional experience working in a full-stack developer role. We are continuing to grow our Engineering team and are also interested in speaking to Front-end Developers, Product Designers, and a number of other roles you can find on our careers page.  If you are interested in learning more about any of our open roles, please email me at stephen@geteverwise.com, or apply on our site <a href=\"https:&#x2F;&#x2F;www.geteverwise.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.geteverwise.com&#x2F;careers</a>","time":1504281485,"type":"comment"}