{"by":"rtfeldman","id":15149241,"parent":15148885,"text":"NoRedInk | Engineering Manager | San Francisco, CA | REMOTE Pacific Time (PST) to Central European Time (CET)<p>We’re an ed-tech company on a mission to help all students become strong writers! Our team may be small, but NoRedInk is used by 1 in 3 school districts in the US, and students have answered over 2 billion questions on our platform.<p>We’re a group of friendly people who listen to and learn from each other. We discuss past mistakes openly so we can adapt our processes to the challenges that come with progress. Puns flow freely across our San Francisco office as well as on Slack, and we have remote engineers spanning six different time zones.<p>Our engineering team [1] prides itself on code quality and innovation. We use the cutting-edge Elm programming language for all our new front-end code, and have been migrating legacy React code to Elm as well. Our back-end is primarily Ruby on Rails, although we are working to split off smaller services as we scale to keep up with our traffic. You can read about our experiences with these technologies on our team blog! [2]<p>In addition to spending work hours open-sourcing useful libraries we develop [3], we also invest financially in open source. We hired the creator of Elm, Evan Czaplicki, to develop Elm full time. [4] Evan discusses his plans for the language with the team every week, periodically pairs with other engineers on Elm, and cracks up members of the sales team with his lunchtime jokes.<p>We use Amazon AWS for our infrastructure and automate all of our deployments using Chef and OpsWorks. We write a lot of tests, and use Jenkins for continuous integration. Our process for new features begins with our product team and in-house visual designer, continues with a GitHub pull request from a feature branch into master, and ends with our in-house QA specialist trying to break it before it reaches production.<p>We’re looking for engineering managers who want to work on a mission that makes a difference and who are the type of collaborators that value kindness and open-mindedness, over convincing the group they’re right.<p>You can learn more about what to expect through blog posts about our interview process [5] and on-boarding experience [6].<p>If you’re interested, please apply through our jobs page! <a href=\"https:&#x2F;&#x2F;www.noredink.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.noredink.com&#x2F;jobs</a><p>[1] <a href=\"https:&#x2F;&#x2F;www.noredink.com&#x2F;about&#x2F;team\" rel=\"nofollow\">https:&#x2F;&#x2F;www.noredink.com&#x2F;about&#x2F;team</a><p>[2] <a href=\"http:&#x2F;&#x2F;tech.noredink.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;tech.noredink.com&#x2F;</a><p>[3] <a href=\"https:&#x2F;&#x2F;github.com&#x2F;NoRedInk&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;NoRedInk&#x2F;</a><p>[4] <a href=\"http:&#x2F;&#x2F;tech.noredink.com&#x2F;post&#x2F;136615783598&#x2F;welcome-evan\" rel=\"nofollow\">http:&#x2F;&#x2F;tech.noredink.com&#x2F;post&#x2F;136615783598&#x2F;welcome-evan</a><p>[5] <a href=\"http:&#x2F;&#x2F;tech.noredink.com&#x2F;post&#x2F;145260396603&#x2F;our-engineering-hiring-process\" rel=\"nofollow\">http:&#x2F;&#x2F;tech.noredink.com&#x2F;post&#x2F;145260396603&#x2F;our-engineering-h...</a><p>[6] <a href=\"http:&#x2F;&#x2F;tech.noredink.com&#x2F;post&#x2F;143787279069&#x2F;on-boarding-as-a-new-remote-engineer-think-about\" rel=\"nofollow\">http:&#x2F;&#x2F;tech.noredink.com&#x2F;post&#x2F;143787279069&#x2F;on-boarding-as-a-...</a>","time":1504279665,"type":"comment"}