{"by":"vldr","id":15149733,"kids":[15176104],"parent":15148885,"text":"GUTS Tickets | Junior .. Senior Full stack developer | Amsterdam, The Netherlands | ONSITE €35k-€60k p.a. depending on experience, part-time&#x2F;full-time, equity plan available.<p>Are you a developer who loves live music? And do you want to join the ticket revolution? At GUTS we’re not only building a product, but as a team we chasing a common goal: Stop disgraceful secondary ticket prices and ticket fraud. GUTS is a ticketing system which uses blockchain technology to register ownership of SMART-tickets. GUTS makes ticket fraud impossible. The ticket can only be (re)sold at a fixed price, so no more disgraceful prices for secondary tickets.<p>GUTS Tickets is looking for extra support for our frontend team. For this we are looking for a junior&#x2F;medior&#x2F;senior frontend developer, preferably with EmberJS experience or willingess to learn.<p>Our current stack consists of<p>- EmberJS (2.13)<p>- Python 3.5 &#x2F; Django &#x2F; Django Request Framework<p>- Ethereum &#x2F; solidity &#x2F; blockchain technology<p>- react native<p>To expand our team we&#x27;re hiring for different roles:<p>- junior..senior frontend developer. Experience with EmberJS (&gt;2.3) is preferred<p>Of course full stack frontend&#x2F;backend&#x2F;mobile developers that have experience with a mix of the above technologies are also very welcome to apply.<p>We prefer people who can be onsite so full remote working is not an option right now. We also cannot provide visa&#x27;s or relocation services at this time. We can support expats with applying for the 30% ruling.<p>We can however offer you: A competitive salary based on your experience. Part-time&#x2F;full-time options. Friday drinks and kroketten. Table tennis or Playstation matches: your choice! A desk in &amp; committed team-members.<p>If you&#x27;re interested in working with us, please send your CV to jobs@guts.tickets<p><a href=\"https:&#x2F;&#x2F;guts.tickets&#x2F;we-are-hiring\" rel=\"nofollow\">https:&#x2F;&#x2F;guts.tickets&#x2F;we-are-hiring</a>","time":1504282211,"type":"comment"}