{"by":"karim","id":15150804,"parent":15148885,"text":"Nylas | <a href=\"https:&#x2F;&#x2F;nylas.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;nylas.com&#x2F;</a> | Mostly Backend (Systems+Ops) | San Francisco, CA (SoMa) | ONSITE<p>Hi! We&#x27;re Nylas. We’re building an email platform to let our customers build apps integrating with email, contacts, and calendar. Under the hood, our simple APIs are powered by a large open source Python codebase that syncs data from providers like Gmail, Yahoo, Microsoft Exchange, and others. Thousands of developers depend on this platform for critical parts of their applications, so performance, reliability, uptime, and consistency are a must.<p>Most of our code is open source (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;nylas&#x2F;sync-engine\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;nylas&#x2F;sync-engine</a>) and we heavily use open source software. We take pride in the diverse culture we’ve built (we just reached 50% women!) and are looking for more than raw technical talent<p>== We&#x27;re particularly looking for folks who ==<p>* Take personal pride in their work and value autonomy and ownership<p>* Want the chance to step up and lead a team<p>* Put the work before ego. We&#x27;ve got each others&#x27; backs, and we want you to be with us on that<p>== A bit more about us ==<p>* Our backend is built on Python, Flask, gevent, nginx, MySQL, AWS, and Debian. We&#x27;ve been careful to keep our architecture componentized.<p>* Tons of our code is open source. Check it out: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;nylas\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;nylas</a><p>* We&#x27;re a small team<p>* We have a paid vacation policy &amp; value personal responsibility and ownership.\nBenefits include free Lyft to &amp; from the office, full health, dental, vision, and lunch every day. Some remote work &#x2F; work-from-home is OK too.<p>Apply at <a href=\"https:&#x2F;&#x2F;nylas.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;nylas.com&#x2F;jobs</a> or ping me directly (karim@nylas). We&#x27;re a diverse team, and encourage applications from all backgrounds.","time":1504288360,"type":"comment"}