{"by":"Penumbra_Sec","id":15153073,"parent":15148885,"text":"Penumbra Security, Inc | Information Security Engineer | Clackamas, OR (Onsite only) | Full-time | <a href=\"http:&#x2F;&#x2F;www.pensec.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.pensec.org&#x2F;</a><p>Penumbra Security is a National Institute of Standards and Technology (NIST) National Voluntary Laboratory Accreditation Program (NVLAP) accredited Cryptographic Security Testing Laboratory (CSTL). Penumbra specializes in various types of Information Security conformance testing to government standards and regulatory compliance.<p>We are seeking a full-time Information Security Engineer. Penumbra will provide training to the right individual to help them grow within the organization.<p>Duties&#x2F;Responsibilities:<p>The ISE will evaluate various IT products for conformance to various information security standards such as FIPS 140-2. This may involve technical documentation review, source code review, functional and operational testing, penetration testing, and report generation. The ISE works closely with Penumbra’s customers in order to gain an intimate knowledge of the product under evaluation. Other tasks may involve creating new testing procedures, testing tools, and report templates.<p>The position requires a moderate level of travel, both domestic and international.<p>Qualifications:<p><pre><code>    - A Bachelor&#x27;s degree in Computer Engineering, Mathematics, Computer Science, Electrical Engineering, Management Information Systems (MIS), or similar discipline. Equivalent experience may be acceptable.\n    - Application programming competency in either C, C++, Java, or other languages\n    - Strong IT background in PC, MAC, and networking, e.g. CCNA, CCNP, CCIE\n    - Knowledge of Operating Systems, Applications, Networking Appliances, and Peripheral Component technologies.\n    - Penetration Testing experience desirable\n    - Excellent written and verbal communication skills\n    - Strong project and time management skills required\n    - Knowledge and experience with cryptography preferred.\n    - Familiarity with FIPS 140-2 preferred\n    - Other recommended: CISSP, CISA, GPEN\n</code></pre>\nIf interested, please email with your resume and cover letter to careers@pensec.org.<p>We look forward to hearing from you. Thank you for your interest in this position.","time":1504308073,"type":"comment"}