{"by":"karatkier","id":15152784,"parent":15148885,"text":"KARAT\n-REMOTE-FREELANCE-PART-TIME<p>Hiring top talent is a critical activity for all companies, yet the way organizations interview candidates is broken. Interviewing is a time consuming process that is rarely data-driven. Here at Karat, we see a massive opportunity to transform the interviewing experience for every candidate and company.\nKarat is on a mission to assess the world&#x27;s talent. We are the first dedicated marketplace for technical interviewers. Karat&#x27;s network of seasoned engineers conduct the first rounds of technical interviews for elite engineering companies. Our robust platform saves teams thousands of valuable hours while allowing them to focus on the top performing candidates. Karat&#x27;s unique approach recognizes that people are central to the hiring process and that they can be supercharged by leveraging machine learning and our rich database of the world&#x27;s interviews.<p>We face incredible demand for our service and are delivering significant value to elite engineering companies like Interana, BuildZoom and Minted. We are funded by top VCs including Formation8 and Founder Collective, plus the founders of companies like Glassdoor, Mulesoft, Lookout, OPOWER, MediaLink and CAA. Karat is headquartered in the University District of Seattle, WA.<p>Flexible, high impact work that is compensated at highly competitive rates. As an Expert Interviewer, you will be compensated at highly competitive rates for your interviewing expertise. The time commitment is flexible---many of our interviews happen on nights and weekends. Some experts do 5 interviews&#x2F;week while others do over 20 interviews&#x2F;week. You can work from anywhere, anytime. You will sharpen your interviewing skills and transform the interviewing experience for every candidate and company.<p>Apply Here: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;karat&#x2F;d44ab283-c7c0-4bbd-b8c3-4dc0ced64c86?lever-origin=applied&amp;lever-source=HACKERNEWS\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;karat&#x2F;d44ab283-c7c0-4bbd-b8c3-4dc0ced6...</a>","time":1504304027,"type":"comment"}