{"by":"jaydestro","id":15152499,"parent":15148885,"text":"MongoDB is looking for Developer Advocate in the NYC and SV regions.<p><a href=\"https:&#x2F;&#x2F;www.mongodb.com&#x2F;careers&#x2F;job&#x2F;671278?gh_jid=671278\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mongodb.com&#x2F;careers&#x2F;job&#x2F;671278?gh_jid=671278</a><p>We’re a team of software experts who love teaching developers and celebrating their success. By joining our team, will also join our mission to enable developer innovation. Our best days are spent helping developers write and deploy secure, reliable, and fault-tolerant software. This role will report to the Senior Manager of Developer Advocacy.<p>Our ideal candidate for this role should have a background in engineering and software development, and have proven success in helping other developers to build reliable and scalable, fault-tolerant applications. You get excited about new technologies, and by the prospect of engaging with open source project maintainers and community members in person, on online forums, and on social media.<p>--<p>Personally, I&#x27;ve been able to take on creative projects rooted in technology. That&#x27;s the core of what the position is. This summer I did things like introduce utilization of nodejs apps with MongoDB, show back end as a service software, do developer live stream videos as well as tutorials. That was like in a single quarter all based on stuff I wanted to try to accomplish. It&#x27;s a fun job, it&#x27;s a chance to take the skills you have accumulated over time and assist others in using them to build apps and services with MongoDB.<p>We&#x27;re focused on software languages like Python, Go, JavaScript and building apps with the MEAN stack. We&#x27;re helping people do things like this, data science, IoT, games and more. We want to help people do this in Clouds like AWS, Google and Azure... but having datacenter and bare metal support helps!<p>What&#x27;s life like? You&#x27;ll get to write apps, blog, build videos and work with community members. You&#x27;ll help with the marketing team regarding how the technology of MongoDB and the products our engineering team can help developers. You will attend and speak at events. You&#x27;ll even get a chance to work on product launches when updates or brand new products are released. You&#x27;ll be able to create new apps with these products and features first, so you can then teach other devs how to implement them for their projects&#x2F;jobs.<p>apply at the link or find me on linkedin <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;jaygordon0042\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;jaygordon0042</a>","time":1504301120,"type":"comment"}