{"by":"jboyd","id":15150943,"parent":15148885,"text":"Booz Allen Hamilton | ONSITE | Cloud Engineer, Sr. | Washington, DC Area<p>Cloud Engineer, Senior\nKey Role:\nConduct systems analysis and programming activities related to the development, maintenance, and installation of computer programs to support internal business operations. Apply advanced principles, theories, and concepts to job assignments and contribute to the development of new ideas and principles. Solve uniquely complex problems and speak for the organization to internal and external clients. Work on long–range programs and objectives. Provide advice to the organization in the area of expertise. Play a role in overall functional strategic planning.<p>Basic Qualifications:\n-8+ years of experience in a professional work environment\n-5+ years of experience in a Cloud engineering role\n-Experience with administering Windows and Linux–based systems\n-Experience in BASH and Python scripting\n-Experience with Amazon Web services\n-Ability to troubleshoot in very complex distributed environments, including following stack traces back to code and coming up with a root cause\n-Ability to travel up to 50% of the time\n-BA or BS degree<p>Additional Qualifications:\n-Experience with Azure\n-Experience with multi–threaded, big data, distributive Cloud architectures and frameworks, including Hadoop, MapReduce, Cloudera, Hive, Spark, and Elastic Search for the purposes of conducting big data analytics\n-Experience with Extract, Transform, and Load (ETL) processes, including document parsing techniques and managing large data sets, such as multi–TB scale deployed environments while adhering to service level agreements\n-Experience with working in the financial industry\n-BS degree in CS, Computer Engineering, Mathematics, Statistics, or other technical engineering field\nIntegrating a full range of consulting capabilities, Booz Allen is the one firm that helps clients solve their toughest problems. by their side to help them achieve their missions.  Booz Allen is committed to delivering results that endure.\nWe are proud of our diverse environment, EOE, M&#x2F;F&#x2F;Disability&#x2F;Vet.<p>E-mail me to talk about this or other positions. Or apply directly to this position here: <a href=\"https:&#x2F;&#x2F;bah.wd1.myworkdayjobs.com&#x2F;BAH_Jobs&#x2F;job&#x2F;Term-Location-8283-Greensboro-Drive&#x2F;Cloud-Engineer--Senior_R0002026-1?shared_id=f60bc23f-ba32-407c-a552-025a28335b7d\" rel=\"nofollow\">https:&#x2F;&#x2F;bah.wd1.myworkdayjobs.com&#x2F;BAH_Jobs&#x2F;job&#x2F;Term-Location...</a>","time":1504289117,"type":"comment"}