{"by":"codeinthehole","id":15155032,"parent":15148885,"text":"Octopus Energy | Trading Analyst | Soho, London, UK | ONSITE, FULL TIME<p>About Octopus Energy:<p>Backed by Octopus Investments, we’re a new energy supplier for the UK. Through smart use of modern technology, we’re changing the way people consume and buy energy.<p>The Octopus Group has an investment portfolio worth over £7bn and with over £1.5bn invested in renewable energy generation assets. In total, Octopus owns about 40% of the UKs commercial solar generation capacity. Octopus Energy is an ambitious young business already making real change in the market, with the benefits of being a startup but with significant financial backing.<p>Responsibilities:<p>* Support with and where appropriate, own analytically complex activities such as bidding for Power Purchase Agreements for renewable generation and pricing of complex commercial supply deals<p>* Execute day to day energy procurement activity and develop tools to automate them – either directly (probably using Python, SQL, VBA or other appropriate methods) or by working with our Tech team. This includes:<p>* Using weather forecasts to produce forecasted output from renewable generation sites and forecasted customer usage<p>* Using forecast data and hedge position to produce trade proposals, minimising exposure to cash-out prices<p>* Validation of industry counterparty invoices (e.g. electricity transmission and distribution, imbalance costs, government schemes etc)<p>* Settlements analysis and risk reporting on meter read performance<p>* Produce financial position and information for use in discussion with senior management, month-end and other Group reporting.<p>* Assembling wholesale traded position to assist in production of month-end gross margins and forward looking financial statements<p>* Position exposure under different market scenarios and other risk management information<p>If you’re interested please drop your CV through to matt.bunney@octopus.energy","time":1504343034,"type":"comment"}