{"by":"s3nnyy","id":15153290,"parent":15148885,"text":"digitalasset.zone | NYC or Zurich | SALARY: 160k-200k CHF&#x2F;USD | ONSITE | For Zurich: EU-Passport holders only, For NYC: Only people eligible to work in the US<p>We disrupt the reconciliation industry with blockchain technology. We are probably one of the few companies world-wide that built a production-ready blockchain product and not only a POC. Our platform delivers flexible infrastructure for regulated financial institutions to share processes and data securely, on a need-to-know basis, without the need for reconciliation. We have solid funding, and our clients include stock exchanges.<p>If you want to move to the US, working for one year in a non-US location will get you a intercompany-transfer-visa (L1-visa are the best, as they can lead to a green card and your spouse can work, too.) We have around 100 employees Zurich, NYC, Budapest, Sydney, London and Hong-Kong.<p>We have these roles opened:<p>- Cryptography Engineer - Zürich or NYC: Secure multi-party computation (e.g. using zero-knowledge proofs), review cryptographical work with the team, groom and communicate the cryptographic aspects of our security roadmap, drive and manage vulnerability processes and third party cryptography audits.<p>- Lead Build Engineer - Zürich or NYC: Design, support and promote scalable practises for fast and seamless build, test and release engineering to adapt to growth and changes of the organisation.<p>- Security Engineer - Zürich or NYC: Reporting to the CSO and to our Head of Delivery, review software to ensure high level of confidentiality, integrity, availability. Swiftly Identify, track, classify, and manage vulnerabilities. Help secure infrastructure and services and, help identify and track outstanding risks. We&#x27;re using Java and Scala for backend development, Haskell for DSL tools and formal methods.<p>- Software Engineer - NYC or Zürich: Be involved in all aspects of the software development life-cycle. Primary focus on Financial Services Post Trade but other functional domains are being investigated, too. We value a healthy mindset and attitude towards formal specifications and verification, as well as testing and quality. We use Java, Scala, and Haskell for backend development of new technology concepts. We look for strong engineers. Regardless of which language you use or how you learned it, we’re looking for people who can write clean, effective code<p>- Test Engineer - NYC or Zürich: Testing software is the whole team’s responsibility. Your job is to make sure the right things are tested, in the right way, at the right time. Identify weaknesses in code, plan and execute tests which will flush them out. Be a developer: You’ll need to wrangle our APIs, think about execution paths and edge cases, and come up with creative ways to break our products.<p>Send us an email with the job-title you are interested in and your first- and lastname (please all in the subject line) to:<p>jobs_hn@digitalasset.zone","time":1504310632,"type":"comment"}