{"by":"moirareilly","id":15150235,"parent":15148885,"text":"Flexport&#x27;s mission is to fix the user experience in global trade and bring the world free trade through technology.  All of us at Flexport share a vision for a world where any two businesses can trade with each other without regard for geographic distance, logistical complexity, or regulatory challenges.<p>We are a licensed customs brokerage and freight forwarder built around an online dashboard. Our services include air freight, ocean freight, trucking, fulfillment, and cargo insurance. By automating these services and delivering them through an online dashboard, we’ve dramatically reduced costs and improved reliability.<p>Our services put clients back in control of their logistics and supply chain needs. We offer faster freight quotes, lower prices, improved visibility and notifications, and advanced analytics. Our team of logistics managers offer world-class customer support to ensure all shipments exceed our clients’ expectations.<p>Backed by Google Ventures, Bloomberg Beta, First Round Capital, Y Combinator and many more, Flexport is redefining how companies manage their global supply chain.<p>Flexport is hiring Full Stack Engineers in SF<p>Want to build software that connects people?  Flexport is a platform for global trade in an industry that comprises 12% of the global GDP. We are building products that are enabling anyone to participate in trade regardless of geographic, regulatory or logistical boundaries. By dramatically simplifying the process of importing goods from overseas, we aim to empower a new generation of entrepreneurs benefitting from the wonders of international trade.<p>To do this, we need a mix of brilliant technologists and logistics experts interested in solving challenges that result in reshaping a trillion dollar industry. We are growing our book of business by 20% every month &amp; expanding teams in out SF HQ &amp; internationally.<p>Started in 2013, we&#x27;ve raised $94M from investors that include Peter Thiel’s Founders Fund, Google Ventures, First Round Capital, Bloomberg Beta, Y Combinator, &amp; more.<p>Check us out if you: \n-Want to be part of a close-knit engineering team that releases new code every day\n-Take a product-first approach to building software\n-Care about the real world functionality of your programming\n-Desire to build scalable programs that standardize information flow and increase operational capacity\n-Have amazing coding skills and CS fundamentals; and\n-Know modern javascript frameworks.<p>Our stack:\nOur continuous releases are integrated with Travis and Github. On the frontend, we use React for the views, organize the data flow with Flux architecture, and test our application with Jest. On the backend, we&#x27;re a Rails shop riding on AWS and Postgres RDS.\nWant to learn more?  Email kristen.hayward@flexport.com or check us out at flexport.com.","time":1504284992,"type":"comment"}