{"by":"tedkimble","id":15151579,"parent":15148885,"text":"Outreach (<a href=\"https:&#x2F;&#x2F;www.outreach.io\" rel=\"nofollow\">https:&#x2F;&#x2F;www.outreach.io</a>) | Software Engineer | Seattle | ONSITE<p>I found Outreach last year on a &quot;Who is hiring?&quot; thread myself and joined the team shortly thereafter. I&#x27;m now the lead for one of our two platform teams and I&#x27;m looking to hire experienced software engineers to help us scale our backend systems.<p>Outreach is a sales engagement platform. We&#x27;ve got great customers (<a href=\"https:&#x2F;&#x2F;www.outreach.io&#x2F;customers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.outreach.io&#x2F;customers&#x2F;</a>) and have raised around $60M to date (through a series C round). We just moved into a new office in the Fremont&#x2F;Wallingford neighborhood of Seattle. We pay competitive market salaries and offer excellent benefits. For example, I just returned to work from four weeks of paternity leave and was welcomed with eight weeks of paid postpartum doula support; I can&#x27;t express how thankful my family was to have four well-rested nights of sleep each week.<p>Our team is working to scale our monolithic Ruby on Rails application as our customer list continues to grow. We own our core CRM, API platforms, background frameworks and our bidirectional syncing systems with Salesforce. In addition to Ruby&#x2F;Rails, we use MySQL, RabbitMQ, Elasticsearch and Redis.<p>For the backend role, I am particularly interested in individuals with strong software design&#x2F;architecture skill sets and those who excel at managing complexity.<p>Please reach out to ted.kimble@outreach.io if you are interested. We also have a number of other engineer opportunities available, including roles in front-end development (React), data science and machine learning. See our careers page for all job details: <a href=\"https:&#x2F;&#x2F;outreach.io&#x2F;company&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;outreach.io&#x2F;company&#x2F;careers&#x2F;</a>.","time":1504293155,"type":"comment"}