{"by":"ccompas","dead":true,"id":15157632,"parent":15148885,"text":"Bionic |Senior Front-End React Js Developers | Onsite | New York, NY<p>About Bionic:<p>Bionic is an army of entrepreneurs who have built and scaled companies. We know that large enterprises can grow like scaled startups when they leverage the methods and tools of lean entrepreneurship and the portfolio-mindset of venture investing. We serve Global 2000 enterprises, with whom we partner to install our proprietary startup&#x2F;venture solution called the Bionic Growth Operating System, which builds a permanent, always-on capability for growth.<p><a href=\"http:&#x2F;&#x2F;bionicsolution.com\" rel=\"nofollow\">http:&#x2F;&#x2F;bionicsolution.com</a><p>About This Role:<p>We are looking for a JavaScript developer proficient with React.js. Your primary focus will be on developing user interface components and implementing them following well-known React.js workflows. You will ensure that these components and the overall application are robust and easy to maintain in our flagship software platform. You will coordinate with the rest of the team working on different layers of the infrastructure.<p>About the Team:<p>The Bionic Development team is focused on the evolution of our flagship software platform. Still in its early stages, the goal of the platform is to encapsulate the professional knowledge of our amazing team of entrepreneurs, provide insights into a wealth of data, and refine and guide our process as we interface with our client partners. The platform consists of dashboards for reporting, project management tools, and a variety of other interfaces. The users of the system range from high level executives at some of the biggest companies in the world, to the internal teams at Bionic that guide innovation at these companies.<p>Interested? Please apply and provide link to Github here: <a href=\"https:&#x2F;&#x2F;bionic-solution.breezy.hr&#x2F;p&#x2F;977bcd976aa0-senior-front-end-react-js-developer\" rel=\"nofollow\">https:&#x2F;&#x2F;bionic-solution.breezy.hr&#x2F;p&#x2F;977bcd976aa0-senior-fron...</a>","time":1504378845,"type":"comment"}