{"by":"bkeroack","id":15151058,"kids":[15151899],"parent":15148885,"text":"Dollar Shave Club | DevOps&#x2F;SRE&#x2F;Infrastructure Engineer | Los Angeles, CA | Full-Time | Onsite | www.dollarshaveclub.com<p>ABOUT DSC: We’re on a mission to build a better bathroom. We started with razors way back in 2011, and now millions and millions of Members later, we’ve expanded into shave products, skin care, hair styling, with more to come. We’re always growing and reinventing, and we rely on killer talent to help us achieve our goal of owning the bathroom. If you’re a team-playing innovator, you’ll fit right in. A sense of humor helps, too.<p>ROLE SUMMARY:\nInterested in writing Go and contributing to OSS? Excited about Docker, Kubernetes, Mesos and the brave new world of containerized distributed applications? DSC is looking for a Software Development Engineer in Infrastructure (SDEI)! Help us make men’s lives better while building amazing tools to keep our systems humming and our member’s personal information safe and secure.<p>RESPONSIBILITIES:\nYou will work as a member of our Infrastructure Team, bringing an experienced and pragmatic security-focused point of view to all projects.\nYou will be the nucleus of a cross-functional team to evaluate DSC’s security posture and address any threats that may arise.\nYou will build systems and tools that help all of Engineering to write and deploy more secure code.\nYou will spend at least 50% of your working hours writing code for tools and systems that support DSC Engineering.\nYou will participate in all Infrastructure projects (not just security-related) as a well-rounded Infrastructure&#x2F;DevOps generalist.<p>QUALIFICATIONS: \nStrong in at least one programming language. Go (golang), Python or Ruby are great. Shell languages (or config management tools) do not count.\nFamiliarity with Go, or a willingness to learn (don’t worry -- it’s designed to be easy to pick up).\nPassion for security or crypto-related topics. If you like to pen-test in your spare time or you write crypto tools for fun we’d like to hear from you!\nFamiliarity with public cloud providers (AWS in particular) is a plus\nDesire to build tools and automation.\nAbility to think creatively and invent new solutions to tough cutting-edge problems.\nAbility to thrive in fast-paced cross-functional teams<p>Reach out to benjamen+hnjobs@dollarshaveclub.com if interested.","time":1504289812,"type":"comment"}