{"by":"amattn","id":15152209,"parent":15148885,"text":"Armory | San Mateo, CA | Full Time | ONSITE<p><a href=\"http:&#x2F;&#x2F;go.Armory.io&#x2F;YC-Apply\" rel=\"nofollow\">http:&#x2F;&#x2F;go.Armory.io&#x2F;YC-Apply</a><p>Armory is a YC W17 startup called based in San Mateo (very near Caltrain). We are working on making cloud software deployments, safe, trivial and ultimately boring.  Essentially we&#x27;re bringing the sophistication of a Netflix or Google style deployment to anyone.<p>Armory&#x27;s core product is wrapped around the open source project Spinnaker.  If open source is your thing, we might a good fit for you.<p>Today we are looking to double the size of our eng team. If you are interested in making deployments less painful, we should chat. If you are a polyglot engineer, we should definitely chat. If you are familiar with AWS or similar dynamic cloud-based configuration and architecture, we should absolutely chat.<p>We’re small and growing but we’ve got paying customers (including a Fortune 100 company) and a strong culture.<p>Diversity and collaboration are important parts of who we are. We value creativity, ability to prioritize and the importance of sharing knowledge.<p>Our CEO wrote a great post here about our long term vision you can find here:<p><a href=\"http:&#x2F;&#x2F;blog.armory.io&#x2F;the-armory-manifesto&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.armory.io&#x2F;the-armory-manifesto&#x2F;</a><p>Click on the link below to apply. Be aware of the confidence gap* and remember that you do not have to match all the listed requirements exactly to apply.<p><a href=\"http:&#x2F;&#x2F;go.Armory.io&#x2F;YC-Apply\" rel=\"nofollow\">http:&#x2F;&#x2F;go.Armory.io&#x2F;YC-Apply</a><p>* confidence gap: <a href=\"https:&#x2F;&#x2F;www.theatlantic.com&#x2F;magazine&#x2F;archive&#x2F;2014&#x2F;05&#x2F;the-confidence-gap&#x2F;359815&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theatlantic.com&#x2F;magazine&#x2F;archive&#x2F;2014&#x2F;05&#x2F;the-con...</a><p>VISA: It depends. We can usually transfer a work visa you already have.  We can only sponsor new visas on a case by case basis.","time":1504298385,"type":"comment"}