{"by":"newy","id":15152202,"parent":15148885,"text":"Spin | <a href=\"http:&#x2F;&#x2F;spin.pm\" rel=\"nofollow\">http:&#x2F;&#x2F;spin.pm</a> | Mobile (React Native) Engineer | San Francisco, CA | FULL-TIME,  ONSITE<p>[Note: I&#x27;m a 2x YC alum, one of the co-founders. It&#x27;s been a wild ride for us over the past few months since inception, and we&#x27;re looking to build out a great engineering team. All 3 co-founders have software engineer backgrounds. We&#x27;re focusing on recruiting on React Native and backend, but happy to connect with anyone interested. Ping me direct: euwyn@spin.pm]<p>Spin is the nation&#x27;s leading stationless bikeshare company. We help people move around in cities and campuses by offering an accessible, affordable, and environmentally-friendly mode of personal mobility. Our fleet of orange-colored smart-bikes, each equipped with GPS, cellular connectivity, solar panels, foam tires, and a dynamo front light, can be unlocked by scanning a QR code on the Spin app. At the end of a ride, users can park Spin bikes anywhere responsible.<p>With Spin, cities and campuses get affordable and equitable bikeshare with no public financing. Spin covers the cost of bikes and maintenance, and employs people from the local community for operations.<p>Founded in San Francisco in 2016, Spin has raised an $8M Series A to launch operations in dozens of US cities and campuses this year. The core team is comprised of engineers, designers, operators, lawyers, and public policy makers with experience from Y Combinator, Uber, Lyft and other technology companies.<p>Spin<p><a href=\"http:&#x2F;&#x2F;www.spin.pm&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.spin.pm&#x2F;</a>\n<a href=\"http:&#x2F;&#x2F;www.spin.pm&#x2F;press\" rel=\"nofollow\">http:&#x2F;&#x2F;www.spin.pm&#x2F;press</a>\n<a href=\"https:&#x2F;&#x2F;techcrunch.com&#x2F;2017&#x2F;05&#x2F;25&#x2F;spin-raises-8-million-as-bike-sharing-battle-heats-up-in-the-us&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;techcrunch.com&#x2F;2017&#x2F;05&#x2F;25&#x2F;spin-raises-8-million-as-b...</a>","time":1504298304,"type":"comment"}