{"by":"avdobb","id":15177264,"parent":15148885,"text":"VSCO | Platform Engineer | ONSITE | Full-time | $125k-$155k<p>VSCO® is an art and technology company empowering and inspiring people everywhere to create, discover, and connect. Founded in 2011, VSCO is based in Oakland, CA. We make high-end photo and video editing tools for mobile and desktop photography, and have a creative community of 45 million+.<p>Our Platform team is looking for a Full Stack engineer to help build the future of VSCO products. You will work with the newest technologies and have the autonomy to create work without being micromanaged. Your voice will be valued in both internal projects as well as in consumer-facing products. We are a tight-knit, collaborative team.<p>The day-to-day\n-Lead development of new features for the future of the VSCO Platform, including APIs and services\n-Collaborate with people across engineering&#x2F;creative to deliver and launch projects\n-Help the growth of the platform team by actively participating in code reviews, paired programming, training, and mentoring<p>Qualifications\n-BS in Computer Science, or equivalent experience\n-4+ years experience with shipping production code in Go, Node.js, and&#x2F;or PHP\n-Proficient with web languages and NoSQL databases, Go, MySql, Mongo, Redis and experience with OAuth and RESTful APIs\n-Passionate about beautiful design and strong desire to contribute to a small team with Lean methodologies\n-Ability to think of business concerns beyond engineering and experience working with cross-functional feature teams<p>Nice to have\n-Knowledge of service-oriented architecture (SOA)\n-Experience with ecommerce - preferably Braintree \n-A personal connection to photography<p>If you are interested send me your CV (andie@vsco.co) and let&#x27;s chat about it! You can also apply directly and learn more about the role here: <a href=\"http:&#x2F;&#x2F;vsco.co&#x2F;about&#x2F;careers&#x2F;senior-software-engineer-platform-oakland\" rel=\"nofollow\">http:&#x2F;&#x2F;vsco.co&#x2F;about&#x2F;careers&#x2F;senior-software-engineer-platfo...</a>","time":1504632373,"type":"comment"}