{"by":"markstanislav","id":15176398,"parent":15148885,"text":"Duo Security | Senior Application Security Engineer | Ann Arbor, MI or Austin, TX | ONSITE | <a href=\"https:&#x2F;&#x2F;duo.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;duo.com&#x2F;</a><p>We are Duo, and we’re here to democratize security for everyone. Our mission is to protect the mission of our customers like Facebook, Twitter, and Etsy by making security simple. We’re a diverse crew of makers and builders, skaters and coders, filmmakers and DJ’s, teachers and students brought together by a shared belief in adding value to the world. This diversity allows us to bring an empathetic approach to solve some of the most complex global business and security challenges we face today.<p>What you’ll do…<p>-Perform security activities, including security design reviews, threat modeling, code auditing, and security assessments on internally &amp; externally developed software.<p>-Support product security issue triage, help coordinate 3rd-party security assessments, provide ad-hoc technical security expertise to product, sales, &amp; engineering teammates.<p>-Create and maintain application security development policies, procedures &amp; standards.<p>Skills you have…<p>- You have a strong understanding of many vulnerability classes impacting a variety of languages, with an expertise towards Python, Javascript, Java, C, C#, and Objective-C.<p>- You’re comfortable manually auditing code for vulnerabilities, using static &amp; dynamic code analysis tools, building custom security tools, and bootstrapping test environments.<p>- You understand security engineering principles, and how to seriously consider when a “best practice” may not be, in fact, the best choice or positively impact actual security.<p>Interested? Apply at <a href=\"https:&#x2F;&#x2F;duo.com&#x2F;about&#x2F;careers&#x2F;job&#x2F;804997\" rel=\"nofollow\">https:&#x2F;&#x2F;duo.com&#x2F;about&#x2F;careers&#x2F;job&#x2F;804997</a> today!","time":1504626747,"type":"comment"}