{"by":"lilystamenova","id":15219530,"parent":15148885,"text":"FeedbackFruits <a href=\"https:&#x2F;&#x2F;beta.feedbackfruits.com\" rel=\"nofollow\">https:&#x2F;&#x2F;beta.feedbackfruits.com</a> | FULLSTACK WEB DEV | Remote | Ruby on Rails &amp; Ember.js<p>Up for the ultimate remote dev role in a high impact scale-up team? We are the team to join.<p>To join our team you need to tick the following boxes:<p>▢ You have got the skill!\nYou have to be an exceptionally smart and skillful RoR and JS (+ frontend frameworks) developer, quick and hungry to learn - these are not optional and this is not a role for a starting out dev! We expect a min of 3 years experience in more than just building static websites. You need to be comfortable in working with complex platforms and a codebase with high code quality standards. The specific tech we use is RoR, Node.js + Ember.js (for the full list see our bento box here: <a href=\"https:&#x2F;&#x2F;imgur.com&#x2F;a&#x2F;7QYKu\" rel=\"nofollow\">https:&#x2F;&#x2F;imgur.com&#x2F;a&#x2F;7QYKu</a>). While we do not expect you to have experience with all these technologies, we do expect you to be able to pick them up quickly. If you hesitate to learn new technologies, this role is probably not the best fit for you.<p>▢ You have got the mind!  \nYou are highly driven, focused and make plannings your b<i></i><i></i>. Able to assess tech demands, create realistic plannings and to keep up with short delivery cycles and high release pace. You need to be analytical, with the talent to understand and foresee user needs and readiness to take ownership of the success of the products you are building.\nYou enjoy being proactive both in engaging with the team, the company mission. You are awesome at communicating technical challenges with stakeholders (from team to users) and managing their expectations (in excellent English).\nYou are the king&#x2F;queen of remote! You will be included in all the team activities from sprint plannings to Tuesday eve updates and demos. We also have office stream always on, so that you get to experience the team vibe to the fullest, however the remote can still present challenges, e.g. time differences. Need to make sure that remote work fits with your situation and personality and that you enjoy this style of work.<p>▢ You have got the heart!\nYou have your vision and code values figured out. \nYou are honest and upfront, able to address challenges, stand for hard decisions and to communicate them with humility.\nYou can prioritize user experience while delivering exceptional code quality and building scalable and easily maintainable solutions.<p>If this role ticks all your boxes drop me (Lily) a line via people@feedbackfruits.com for the next step.<p>Full description here: <a href=\"https:&#x2F;&#x2F;magnet.me&#x2F;a&#x2F;company&#x2F;feedbackfruits&#x2F;opportunity&#x2F;23383&#x2F;full-stack-developer--remote\" rel=\"nofollow\">https:&#x2F;&#x2F;magnet.me&#x2F;a&#x2F;company&#x2F;feedbackfruits&#x2F;opportunity&#x2F;23383...</a>","time":1505145925,"type":"comment"}