{"by":"sahn44","id":15227256,"parent":15148885,"text":"BlackRock | New York, NY | Full-time ONSITE, VISA | Front-end Web Developer | React<p>We have a position available immediately to work on my team building a specific, revenue-generating product. We&#x27;re applying BlackRock&#x27;s sophisticated risk analytics, which are used to manage over $20 trillion of institutional money, to millions of individual investors&#x27; portfolios to help them and their Financial Advisors create better portfolios. This role will be focused immediately on our front-end web apps building out new features and better user experience in React framework. We&#x27;re looking for someone who is really proficient in React and wants to work with and leverage modern tools and techniques to the fullest.<p>Direct link: <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;409018504&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;409018504&#x2F;</a><p>Reach out to me directly if interested. I lead the team that is hiring this role: msahn@blackrock.com<p>Job Description and Responsibilities:<p>* Work beside Analytics and Product experts to build innovative analytics tools for users both inside and outside our firm.<p>* Architecting and developing web apps, prototypes, and proofs of concepts<p>* Demonstrate a passion for developing well architected, elegant web applications that delight users<p>* Help continually improve our application reliability, performance, and software infrastructure<p>* Beyond coding, a successful candidate will strive to learn the business context of their projects and users’ needs to quickly play a leading role in solving problems and driving decisions<p>Qualifications:<p>* Experience with React.js in building applications a must<p>* Very strong front-end web programming skills in JavaScript&#x2F;ES6&#x2F;HTML5&#x2F;CSS<p>* Experience in at least one server-side language - Java, C++, Python, Ruby, Node.js<p>* Passion for agile, test-driven development, and automated testing<p>* Passion for user experience and a strong interest&#x2F;demonstrated experience in design, across all devices<p>* Experience with Angular 2.0, AngularJS a plus<p>* Involvement&#x2F;authoring of open source software a plus","time":1505224496,"type":"comment"}