{"by":"claytonm","id":3060555,"parent":3060221,"text":"Seattle, WA - Software Development Engineer<p>AWS ElastiCache <a href=\"http://aws.amazon.com/elasticache/\" rel=\"nofollow\">http://aws.amazon.com/elasticache/</a> - My team is looking for software engineers who are passionate about enabling high performance applications in the AWS cloud.  If you’re interested in building high performance distributed systems and having your work used by thousands of other developers, come join the ElastiCache team and influence the direction of the leading cloud provider.  If you love the service memcached provides and have ideas on how to make it more scalable, available, and performant, ElastiCache is the place to be.  We have several positions for a range of experience levels. If you’re not in Seattle but are up for a change of scenery, Amazon has a great relocation program that makes it extremely easy to join AWS.<p>To apply, send your resume to aws-jobs-elasticache-yc@amazon.com.<p>I’m a founding member of the ElastiCache team and I’ve learned an amazing amount taking an AWS service from concept to launch.  It’s a uniquely exhilarating experience to launch a new AWS service - seeing the system that you’ve worked on for so long available to everyone, watching it grow each day, and learning from your customers.  Knowing that other people’s websites, workflows, systems and components rely on your service working properly pushes you to do the best work you can.  I’m proud of the work we’ve done and I’m very excited about the innovation still ahead of us.<p>Detailed job descriptions :<p><a href=\"http://www.amazon.com/gp/jobs/ref=j_sq_btn?keywords=137677&#38;category=*&#38;location=*&#38;x=44&#38;y=9\" rel=\"nofollow\">http://www.amazon.com/gp/jobs/ref=j_sq_btn?keywords=137677&#...</a><p><a href=\"http://www.amazon.com/gp/jobs/ref=j_sq_btn?keywords=137679&#38;category=*&#38;location=*&#38;x=44&#38;y=9\" rel=\"nofollow\">http://www.amazon.com/gp/jobs/ref=j_sq_btn?keywords=137679&#...</a><p><a href=\"http://www.amazon.com/gp/jobs/ref=j_sq_btn?keywords=133388&#38;category=*&#38;location=*&#38;x=44&#38;y=9\" rel=\"nofollow\">http://www.amazon.com/gp/jobs/ref=j_sq_btn?keywords=133388&#...</a>","time":1317490688,"type":"comment"}