{"by":"leftnode","id":3060799,"parent":3060221,"text":"Dallas, TX - SpeedFC (<a href=\"http://www.speedfc.com\" rel=\"nofollow\">http://www.speedfc.com</a>)<p>The company I work for, SpeedFC, is looking for some excellent PHP developers to build our ever growing team. We're currently a team of 11 developers with 4 team leads and 7 developers (I'm a team lead but do plenty of development too).<p>We do end to end e-commerce. We handle the websites of our clients (you may touch on this, but not often), the backend warehouse software (what you'll be working on), customer service, and fulfillment. We own 100% of our code, it's all written in house so you'll definitely have a chance to work on new products with fresh code. Now, you will also have to work on old projects with old code. Comes with the territory.<p>Our stack is full Linux, Apache, Postgres, and PHP. Even if you're not familiar with Postgres, but have a good PHP and SQL database background, still apply.<p>Why you would want to work here<p>We work with a tremendous amount of data and ensuring it's correct at all times is a difficult job. So, if you're in for a challenge, working here is great. Now, there are some downsides. We have an old codebase, largely untested and undocumented. You'll have to work on some stuff that will want to make you tear your hair out.<p>That is now changing! All code developed on my team is unit tested, documented through tests, and fresh PHP5.3+. We do code reviews, demo days, and have an official QA department. Also, right now my team is about to start working on a difficult and far reaching data synchronization problem. Thus, if you want to be a member on a project building code from scratch and \"doing it the right way\", now would be a great time to join my team.<p>Another nice aspect of the job: if you think something needs to be done, write up a short document explaining why and the benefits it will have, submit it to the bosses and get it approved. The executives are more than willing to let you work on fresh projects that will help the company.<p>Mix the good with the bad, and overall it's a good place to work. They just built us our own custom private office for developers only so other employees can't come bug you easily.<p>We won't help you relocate, unfortunately.<p>Availability - Now<p>Benefits<p>Health, Dental, and Vision. You don't start off with an incredible amount of PTO, and Christmas time is pretty nuts around here, but they say they're working on it, so we'll see what happens.<p>I will be your team lead. I won't be your boss. I won't know your salary, for example. I like working closely with my team members and bouncing ideas off them. I'm more than open to using different technologies where they fit and moving away from PHP where necessary.<p>Email me vcherubini@speedfc.com with your resume attached. I'll be doing the interviews, and I keep them very much functional and not theoretical. You won't have to bust out your college text books to remember what a red/black tree is, I want to know your past and current projects, and have a good discussion about you as a software developer, not an algorithm memorizer.","time":1317495519,"type":"comment"}