{"by":"craigfollett","id":3060971,"parent":3060221,"text":"Toronto, Ontario, Canada<p>Senior Ruby on Rails Developer<p><a href=\"http://www.uniiverse.com/jobs\" rel=\"nofollow\">http://www.uniiverse.com/jobs</a><p>ABOUT UNIIVERSE\nEver wonder what it was like to work at Facebook or Google when it was just five people? Imagine building a web platform that will change the way people think and improve live their lives.<p>Uniiverse is an exciting startup building a person-to-person marketplace for services and activities – the ‘eBay for Time’. Our primary dimensions are: temporal, local and social. We have developed a revolutionary concept that leverages the existing social graphs to allow people to save time, share and discover passions and build the world’s ‘trust graph’.<p>Uniiverse is seeking a talented Ruby Developer to lead the development of core elements of our platform.<p>TIMEFRAME\n• You will join us full time during Fall 2011 – we are quite flexible on timelines<p>RESPONSIBILITIES\nOwn product sprints for front and back-end build-out of Uniiverse's technology platform, e.g.:\n• Thought partner and shape design and functionality of our product\n• Drive development of back-end technology (e.g. billing systems, proprietary recommendation algorithms)\n• Lead development of key front-end functionality (e.g. calendarization, jQuery widgets, etc.)\n• Implement analytics, tools, and admin panels\n• Build test cases in parallel to development, design and implement A/B testing environments<p>TECHNOLOGIES WE LOVE\n• Ruby on Rails + MongoDB\n• JavaScript / jQuery; AJAX / JSON\n• HTML5 / CSS3 + HAML / SASS<p>REQUIREMENTS\n• Proficient in Ruby on Rails 3\n• Familiar with MongoDB, Linux, Amazon Web Services (AWS), OAuth, Facebook Graph API\n• Experienced in JavaScript, jQuery, HTML and CSS (HAML and SASS)\n• Excited about BDD, automated deployment, fixing bugs, and shipping code\n• Keen eye for clean, simple design aesthetics, and usability\n• An independent, fast-learning, self starter who takes ownership over solving ambiguous problems\n• Energetic, passionate (does not matter about what!), and driven\n• Believes strongly in The Joel Test<p>BONUS IF YOU ARE…\n• Proficient in mobile development (iOS / Objective-C)\n• Savvy with machine learning / natural language processing / recommendation algorithms\n• Experienced in developing accounting and billing systems<p>APPLICATION\nPlease email jobs@uniiverse.com with your CV, links to your GitHub, LinkedIn, Twitter, and technical blog<p>BENEFITS\nLearn how to build a massively scalable social web application in a sexy technology stack. Get paid to work in a fast-paced, fun, start-up environment. Build valuable references.<p>ABOUT US \nOur team is comprised of experienced, talented and passionate people with deep expertise in strategy, technology and web and app development. We'd be excited to tell you more about us and our vision during an initial conversation.<p>REFERRAL BONUS\n$1,000* if the person you recommend is hired.<p>* Payable for full time employee hires (i.e. contractors and freelancers excluded), for this particular dev position, after the completion of any probationary period, if applicable. Does not apply to candidates with whom Uniiverse was already in contact.","time":1317499657,"type":"comment"}