{"by":"calbear81","id":3060405,"parent":3060221,"text":"Mountain View, CA<p>Room 77 (room77.com) - REMOTE / H1B Welcome<p>We're building the next generation of hotel search and we're looking for a few good engineers.  We're attacking a $50B online industry that hasn't seen a lot of innovation in the last several years.  We're funded and backed by travel rockstars including the founder of Expedia.<p>Software Engineer - 5 Positions Open - <a href=\"http://www.room77.com/jobs/software_engineer.html?s=HackerNews\" rel=\"nofollow\">http://www.room77.com/jobs/software_engineer.html?s=HackerNe...</a><p>We're looking for software engineers who are smart and can roll up their sleeves to get things done. We don't care what programming language you've used before or what operating system you're familiar with, but we need people with demonstrated passion for programming and problem solving, as well as a hands-on attitude and hacker mentality. Our technology stack is primarily C++ / Javascript / Python / PHP / MySQL, on top of Ubuntu Linux and AWS.<p>iOS/Android Mobile Developer - 2 Positions Open - <a href=\"http://www.room77.com/jobs/mobile.html?s=HackerNews\" rel=\"nofollow\">http://www.room77.com/jobs/mobile.html?s=HackerNews</a><p>UI/UX Designer - 1 Position Open - Help lead the design of a next gen travel search product - \n<a href=\"http://www.room77.com/jobs/ui_ux_designer.html?s=HackerNews\" rel=\"nofollow\">http://www.room77.com/jobs/ui_ux_designer.html?s=HackerNews</a><p>Hacker in Residence - 3 Spots Available - This is an exciting new program to get FREE office space, FREE food, and FREE mentoring from our team of advisors/investors and engineers.  We've got some free space in the new office so we want to bring in some folks who are interested in working on their own projects while spending a few hours a week working on open source projects we are sponsoring.  Our engineering team is happy to help flesh out your project as well and you can always talk to the rest of the team, all of which have built, run, and sold startups. - <a href=\"http://www.room77.com/jobs/hacker.html?s=HackerNews\" rel=\"nofollow\">http://www.room77.com/jobs/hacker.html?s=HackerNews</a>","time":1317488081,"type":"comment"}