{"by":"borski","id":3060879,"parent":3060221,"text":"INTERN, H1B acceptable<p>Generalist or Backend Engineer<p>Palo Alto - Tinfoil Security (<a href=\"http://www.tinfoilsecurity.com\" rel=\"nofollow\">http://www.tinfoilsecurity.com</a>) - 500startups company<p>About Tinfoil Security:<p>Tinfoil Security is the simplest way to secure your website. To the user, we provide an easy-to-use reporting interface that tells you where we found vulnerabilities, what they are, and provides a step-by-step wizard of how to fix them. Behind the scenes, we're crawling the site looking for every potential input vector and attempting to infiltrate, just like any external hacker would. The catch is we do this non-maliciously and without leaving a trace. Sound interesting?<p>We're looking for incredibly smart guys (or girls) who like to get their hands dirty. If you don't know the answer, find it. If you can't find it, build it; but don't reinvent the wheel. If all the wheels suck though, build a better one.<p>We're revolutionizing the stale and boring security industry, and making website and mobile security accessible to the world, so no business has to continue being the \"low hanging fruit.\" It's absurd that security is only understood by so few developers and business owners in the world, when so much of it is actually pretty simple to understand. We want to change that. Join us.<p>About you:<p>You'll be employee #1.<p>Our entire stack is Ruby at the moment, but we have a strong affinity for Python, Scala, and C, in no particular order. We're of the mindset that you pick the best tool for the job, much as you wouldn't hammer in a nail with a wrench (unless you didn't have a hammer and really needed to get it done fast).<p>You'll be in charge of a large project, and will be given the ability to take charge of it and make it your own. On the flipside, you should be willing to take on that challenge.<p>More than anything else, I can guarantee you'll have a boatload of fun, learn a ton, and produce software people really care about; lots of people.<p>We offer significant equity, market salary, benefits, your choice of equipment, etc. We're based in Mountain View and are looking for people that can hack in the office with us.<p>Please get in touch -- borski@tinfoilsecurity.com -- we'd love to chat. :)","time":1317497337,"type":"comment"}