{"by":"earthaid","id":3063028,"parent":3060221,"text":"Earth Aid - Boston, MA - Full-time Data &#38; Rails Engineers<p>Earth Aid ( <a href=\"http://earthaid.net\" rel=\"nofollow\">http://earthaid.net</a> ) was recently named to Fast Company's Top 10 Most Innovative Companies in Energy. We're newly venture-backed by Point Judith Capital as well as strategic and angel investors who have built and scaled some of the most successful businesses today. We've been called \"the killer app for energy efficiency\" ( <a href=\"http://bit.ly/dZBy7q\" rel=\"nofollow\">http://bit.ly/dZBy7q</a> ) and our work has been featured in publications such as Mashable ( <a href=\"http://on.mash.to/hqyZqF\" rel=\"nofollow\">http://on.mash.to/hqyZqF</a> ), TechCrunch, The New York Times ( <a href=\"http://nyti.ms/ayzLHb\" rel=\"nofollow\">http://nyti.ms/ayzLHb</a> ), The Washington Post, and The Philadelphia Inquirer. We have offices in San Francisco and DC, and we're now consolidating our dev team and HQ into an awesome brand new headquarters in Boston.<p>We empower households to track &#38; contextualize their electric, natural gas, and water utility usage. We value data, clarity, focus and beauty. We are looking for people who do too --- people who want to work on incredibly complex problems and come up with solutions that will change the world. We want the best and the brightest. People who work hard and play hard. People who want to make an impact. This is an opportunity to not only work with a dynamic group of people, but also the opportunity to build a platform that's revolutionizing the way we look at energy consumption.<p>To learn more about our very competitive salaries, excellent benefits, fun company culture, and small arsenal of office helicopter drones, check out: <a href=\"http://www.earthaidjobs.com\" rel=\"nofollow\">http://www.earthaidjobs.com</a>, and send us an e-mail at jobs at earthaid dot net<p>---<p>Two Highlighted Opportunities in the Boston Office -&#62;<p>Data Engineer: Problems You'll Tackle<p>Energy Efficiency: Build a product that can have an impact on climate change &#38; the future of energy. Analytics: Use tools like mapreduce, hadoop, and AWS to drive insight into energy usage. Performance: Store the world's energy data in a way that makes it easy for web engineers to create experiences on top of it. Maintainability: Take what's useful from XP and agile to make sure that we're writing awesome code using practices like BDD, pair programming, and daily standups. Reliability: Build tools that make it easy to know what is happening throughout the system and that allow Earth Aid to be constantly available for our users. Security: Create an infrastructure that both allows us to be certain that our user data is safe while at the same time allow the flexibility to perform analytics and quickly iterate.<p>Ruby on Rails Engineer: Problems You'll Tackle<p>Energy Efficiency: Build a product that can have an impact on climate change and the future of energy. User Growth: Create a clear and impactful experience that drives us toward many millions of users. Maintainability: Take what's useful from XP and agile to make sure that we're writing awesome code using practices like BDD, pair programming, and daily standups. Product design: Envision and execution on product features and entirely new products. Visualization: Create beautiful and meaningful visualizations that impact consumer energy usage.","time":1317568820,"type":"comment"}