{"by":"kkgupta","id":3105230,"parent":3060221,"text":"Software Development Engineer – Developer Platforms<p>Amazon Web Services (AWS) is looking for a rock-star frontend developer to build world-class user interfaces for our customers. If you’re a web developer, application engineer, and you have the skills to create highly interactive and well-designed web interfaces, then Amazon Web Services is looking for you.\nAmazon is on the forefront of developing cutting-edge cloud technologies for use by individuals and businesses of all sizes. We want someone who can explore challenging new areas and come back with new best practices for web application development that other developers should be following. You should be fanatical about delivering designs and components that create a great developer experience making developers wildly more productive than they were before. You should be able to deconstruct complicated application and prototype designs to come back with how to deliver a solution faster, cheaper, and more predictably.<p>Responsibilities\nOur engineers own their work from beginning to end. You will be responsible for a myriad of steps from design and implementation, to launch and support. This position will require interaction between several stakeholders including members of our engineering team, application designers, managers, and engineers on other teams. You will review the UI and API designs of your peers, as well as fix bugs and troubleshoot operational issues as they occur.<p>Basic Qualifications:\n•\tStrong OO design and coding skills in Java and Javascript. \n•\tDemonstrated passion for user experience design and improving usability\n•\tExperience translating design mockups and prototypes into working application designs\n•\tExperience building large-scale web applications using JavaScript and Ajax\n• 3-5 years of software development experience.\n• Bachelor’s degree – preferably in computer science or a similar degree.\n• Should be genuinely excited about technology, have a strong interest in learning about and playing with the \nlatest technologies. Must be a self-starter and motivated.<p>Preferred Qualifications:\n•\tExperience with asynchronous web frameworks like GWT\n•\tHave developed or supported an operationally critical web service\n•\tFamiliarity with scripting languages such as Perl, PHP, Ruby, or Unix shell scripting<p>To apply, send your resume to aws-jobs-db-console[At]amazon.com<p>I'm one of the core member of the Database services console team and have learned an amazing amount by taking an UI design to launch. It’s a uniquely exhilarating experience to launch new web interfaces - seeing that interfaces you’ve worked on has such a profound effect on thousands of businesses, watching it grow each day, and learning from your customer. Knowing that millions of people rely on it pushes you to do the best work you can. I’m proud of the work we’ve done and I’m very excited about the milestones still ahead of us.<p>For more information on Amazon Web Services, please visit <a href=\"http://aws.amazon.com\" rel=\"nofollow\">http://aws.amazon.com</a>","time":1318463050,"type":"comment"}